[
    {
        "content": "OSLO  Nov 17 Norway's Statoil will ramp up its search for oil and gas deposits on the Norwegian continental shelf next year  the company said on Friday.",
        "date": "11172017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil to step up exploration off Norway's coast in 2018 "
    },
    {
        "content": "WASHINGTON Statoil ASA will pay $4 million to settle U.S. charges that the energy company tried to manipulate a key propane benchmark to benefit its NYMEX-cleared swaps position  the Commodity Futures Trading Commission (CFTC) said on Tuesday.",
        "date": "11142017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Norway's Statoil to pay $4 million U.S. fine over swaps manipulation "
    },
    {
        "content": "WASHINGTON  Nov 14 Statoil ASA will pay $4 million to settle U.S. charges that the energy company tried to manipulate a key propane benchmark in order to benefit its NYMEX-cleared swaps position  the Commodity Futures Trading Commission (CFTC) said on Tuesday.",
        "date": "11142017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "U.S. says Norway's Statoil to pay a $4 mln fine over swaps manipulation "
    },
    {
        "content": "* Partners in Fram licence have decided to invest in a new project to increase production from Fram field​",
        "date": "11062017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Norway's Fram field partners approve 1 bln crown project "
    },
    {
        "content": "OSLO  Oct 31 Norway's Statoil aims to sign a power purchase agreement with a U.S. utility to develop an offshore wind power project off New York  a senior company official said on Tuesday.",
        "date": "10312017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil aims to sign power purchase agreement in New York by end-2018 "
    },
    {
        "content": "* Reg-Statoil asa: statoil shapes and strengthens its position in the carcará oil discovery in brazil",
        "date": "10272017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil  ExxonMobil in Brazil asset trade after auction win "
    },
    {
        "content": "* Q3 adjusted operating profit $2.3 billion vs f'cast $2.45 bln",
        "date": "10262017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "CORRECTED-UPDATE 2-Statoil earnings lag forecasts as North American output weakens "
    },
    {
        "content": "Oct 27 Tullow Oil Plc said it had plugged and abandoned an exploration well in offshore Suriname  after not making a commercial discovery.",
        "date": "10272017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Tullow's wildcat exploration fails to strike oil in Suriname "
    },
    {
        "content": "OSLO Norway's Petroleum Safety Authority (PSA) will investigate a naphtha leak that halted output from Statoil's Mongstad refinery  the watchdog said on Wednesday.",
        "date": "10252017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Safety watchdog to investigate Statoil refinery leak "
    },
    {
        "content": "OSLO/LONDON Norway's Statoil expects floating wind power costs to fall to 40-60 euros per megawatt-hour (MWh) by 2030  the company said on Wednesday after launching the first floating wind farm off Scotland.",
        "date": "10182017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil launches world's first floating wind farm  aims to cut costs "
    },
    {
        "content": "* Valeura announces Yamalik-1 testing program and operational update",
        "date": "10172017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Valeura Energy updates on Yamalik-1 testing program "
    },
    {
        "content": "* Teekay Offshore Partners announces contract start-up for the Randgrid FSO on the Gina Krog Field with Statoil",
        "date": "10062017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Teekay Offshore announces contract start-up for the Randgrid FSO with Statoil ASA "
    },
    {
        "content": "LONDON Total   Eni  and Statoil  are seeking buyers for their stake in the Teesside oil terminal in northern England  which receives crude from the Norwegian Ekofisk fields  part of the global Brent benchmark  banking sources said.",
        "date": "10092017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Total  Eni  Statoil seek buyers for North Sea Teesside terminal: sources "
    },
    {
        "content": "LONDON  Oct 9 Total  Eni and Statoil are seeking buyers for their stake in the Teesside oil terminal in northern England  which receives crude from the Norwegian Ekofisk fields  part of the global Brent benchmark  banking sources said.",
        "date": "10092017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Total  Eni  Statoil seek buyers for N. Sea Teesside terminal -sources "
    },
    {
        "content": "OSLO Norway's Statoil  is taking its first step into the solar sector on Wednesday  partnering up with Oslo-listed renewable energy firm Scatec Solar  in a joint venture aiming to build several large-scale solar plants in Brazil.",
        "date": "10042017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil takes first bite of solar market with Brazilian joint venture "
    },
    {
        "content": "OSLO Statoil's exploration campaign off Britain yielded one discovery  one dry well and one non-commercial discovery this year  the company said on Monday.",
        "date": "10092017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil says two UK exploration wells disappoint  makes one discovery "
    },
    {
        "content": "OSLO Statoil's exploration campaign in the Barents Sea was disappointing this year  but the company has firm plans to drill another five wells there in 2018  a spokesman said on Monday.",
        "date": "10092017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil to continue Arctic exploration in 2018 despite disappointing campaign "
    },
    {
        "content": "SAO PAULO Petróleo Brasileiro SA and Norway's Statoil signed a new agreement which complements a partnership they already have in Brazil  looking to boost natural gas operations  according to a securities filing on Friday.",
        "date": "09292017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Petrobras  Statoil sign new cooperation agreement: filing "
    },
    {
        "content": "SINGAPORE Norway's Statoil ASA has chartered the last remaining Ultra-Large Crude Carrier (ULCC)  the world's largest oil tankers  to store oil off of Malaysia for distribution in smaller parcels to its clients in Asia  company executives said.",
        "date": "09282017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil charters last of the world's largest oil tankers to hold crude for Asia buyers "
    },
    {
        "content": "* PRESS RELEASE TECHNIPFMC AWARDED EPCI CONTRACT FOR THE STATOIL PEREGRINO PHASE II PROJECT IN BRAZIL Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "09282017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-TechnipFMC awarded EPCI contract for the Statoil Peregrino Phase II project in Brazil "
    },
    {
        "content": "OSLO  Sept 26 Norway's Statoil and partners are working to increase the output capacity of Troll  the country's largest gas field  a move traders say would enable the firms to produce more flexibly and cover production shortages at other fields due to outages.",
        "date": "09262017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil and partners plan output capacity expansion at Norway's Troll gas field "
    },
    {
        "content": "* Statoil and Eni have awarded bristow contract for one SAR helicopter  and one transport helicopter in Hammerfest",
        "date": "09182017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil and Eni award Hammerfest helicopter contract to Bristow "
    },
    {
        "content": "OSLO  Sept 13 Norwegian oil firm Aker BP plans to drill between six and eight exploration wells off Norway next year  including four in the Barents Sea  the company's chief executive told Reuters.",
        "date": "09132017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Aker BP plans to drill 6-8 exploration wells in 2018 "
    },
    {
        "content": "HOUSTON  Sept 7 Norway's state-run oil company Statoil began making preparations on Thursday to shut its South Riding Point storage and transshipment terminal in the Bahamas ahead of Hurricane Irma  traders close to the facility told Reuters.",
        "date": "09072017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil's Bahamas oil terminal to shut on Thursday ahead of Irma -traders "
    },
    {
        "content": "* Has acquired participating interests in two additional offshore frontier blocks  including one operatorship",
        "date": "09072017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Norway's Statoil expands South Africa exploration portfolio "
    },
    {
        "content": "OSLO Norway's hope of discovering a large oilfield in the Barents Sea has suffered a major setback after the far north Arctic's most promising reservoir turned out to contain only small amounts of natural gas.",
        "date": "08292017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Norway's Arctic oil ambitions suffer setback as most promising well yields none "
    },
    {
        "content": "* Govt wants to expand Arctic oil exploration (Recasts  adds analysts  detail  background)",
        "date": "08292017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Norway's Arctic oil ambitions suffer setback as most promising well yields none "
    },
    {
        "content": "OSLO  Aug 29 Oil major Statoil's highly anticipated Korpfjell prospect in the Arctic Barents Sea contained only non-commercial quantities of natural gas  and no oil  the company announced on Tuesday.",
        "date": "08292017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil failed to find oil at its northernmost Arctic well "
    },
    {
        "content": "* Norway petroleum directorate: minor gas discovery in the barents sea 7435/12-1 Korpfjell well",
        "date": "08292017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Statoil makes non-commercial gas discovery in the Arctic "
    },
    {
        "content": "OSLO Norway's Statoil has signed a deal with Argentina's leading energy company YPF to jointly explore for onshore shale oil and gas resources in the Vaca Muerta formation  the company said on Friday.",
        "date": "08252017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil  YPF to explore shale oil  gas in Argentina "
    },
    {
        "content": "OSLO  Aug 25 Norway's Statoil has signed a deal with Argentina's leading energy company YPF to jointly explore for onshore shale oil and gas resources in the Vaca Muerta formation  the company said on Friday.",
        "date": "08252017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil  YPF to explore shale oil  gas in Argentina "
    },
    {
        "content": "OSLO  Aug 25 Norway's Statoil has signed a deal with Argentina's leading energy company YPF to jointly explore for onshore shale oil and gas resources in the Vaca Muerta formation  the company said on Friday.",
        "date": "08252017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil to explore for shale oil  gas in Argentina "
    },
    {
        "content": "* minor gas discovery northeast of the heidrun field in the norwegian sea - 6507/8-9",
        "date": "08242017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil makes minor gas discovery in Norway -NPD "
    },
    {
        "content": "OSLO  Aug 17 Norwegian coast guards stopped Greenpeace from protesting at a site of the country's northernmost exploration well drilled by Statoil  the environmentalist group said on Thursday.",
        "date": "08172017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Norway authorities stop Greenpeace protests at Arctic well "
    },
    {
        "content": "OSLO  Aug 7 Norway's Statoil will soon start drilling this season's most promising Arctic prospect  Korpfjell  after several disappointing wells in the Barents Sea  the company said on Monday.",
        "date": "08072017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "After a few disappointments  Statoil to drill biggest Arctic hope "
    },
    {
        "content": "PRETORIA  Aug 7 South Africa's unemployment rate stayed at a 14-year high in the second quarter  with the statistics agency saying on Monday the country was in a \"precarious position\" of not creating enough jobs to make a dent in poverty.",
        "date": "08072017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-S.Africa's unemployment steady at 14-year high  economy in \"precarious\" position "
    },
    {
        "content": "LONDON/PARIS  July 27 Europe's major oil and gas companies have turned a corner after a three-year slump  reporting strong growth in profits as cost cutting paid off and vowing to press on with saving more money amid a fragile recovery in oil prices.",
        "date": "07272017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "WRAPUP-Europe's oil giants recover from three-year slump "
    },
    {
        "content": "PARAMARIBO  July 13 Suriname's state oil company Staatsolie said on Thursday it signed production sharing contracts involving Exxon Mobil Corp  Hess Corp and Statoil ASA for two blocks off the coast of the South American nation.",
        "date": "07132017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Suriname signs offshore oil deals with ﻿Exxon  Hess and Statoil "
    },
    {
        "content": "* Shell shares up 1.3 pct (Adds details  background  updates shares)",
        "date": "07122017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Shell to sell stake in Corrib gas field in Ireland for $1.23 bln "
    },
    {
        "content": "OSLO  July 10 Norway's Statoil and Canada's Husky Energy have hit dry wells in a prospect off Newfoundland for which they had high hopes  Statoil said on Monday.",
        "date": "07102017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil drills dry wells off Canada's Newfoundland "
    },
    {
        "content": "OSLO/CALGARY  Alberta  July 10 Norway's Statoil and Canada's Husky Energy have hit dry wells in a prospect in the Atlantic offshore Newfoundland for which they had high hopes  Statoil said on Monday.",
        "date": "07102017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 3-Statoil drills dry wells off Canada's Newfoundland "
    },
    {
        "content": "* Will soon commence a three-well exploration drilling campaign on UK continental shelf  using the Transocean Spitsbergen semi-submersible rig",
        "date": "07032017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil to kick off 2-3 months UK drilling campaign "
    },
    {
        "content": "OSLO Statoil will look at building a carbon storage facility offshore Norway  in what the energy company said on Friday could be the world's first storage site to receive carbon dioxide from several industrial sources.",
        "date": "06302017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil to look at building world's first CO2 injection storage "
    },
    {
        "content": "OSLO  June 30 Statoil said on Friday it would move its critical information technology (IT) tasks from Indian provider HCL Technologies back to Norway to improve security.",
        "date": "06302017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil moves key IT tasks from India back to Norway "
    },
    {
        "content": "OSLO A Norwegian appeals court ruled in favour of the government in a lawsuit brought by investors who argued Norway's cut in gas pipeline tariffs was unlawful and would cost them 15 billion Norwegian crowns ($1.8 billion) in lost earnings through 2028.",
        "date": "06302017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Norway government wins ruling over lowered gas pipeline tariffs "
    },
    {
        "content": "* Norway's government cut pipeline tariffs shortly afterwards",
        "date": "06302017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 3-Norway govt wins ruling over lowered gas pipeline tariffs "
    },
    {
        "content": "OSLO  June 22 A ban on Norway's Statoil using a pioneering drilling technology in the Barents Sea was lifted after a plaintiff failed to post security in a patent dispute  a lawyer said on Thursday.",
        "date": "06222017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil cleared to use disputed technology in the Arctic for now "
    },
    {
        "content": "* Statoil awards contract on new shuttle tankers - statoil.com",
        "date": "06222017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Statoil awards Malaysia's AET contract for two new shuttle tankers to be built at Samsung "
    },
    {
        "content": "* TECHNIPFMC AWARDED INTEGRATED EPCI CONTRACT FOR THE STATOIL VISUND NORD IOR PROJECT",
        "date": "06132017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-TECHNIPFMC AWARDED INTEGRATED EPCI CONTRACT FOR THE STATOIL VISUND NORD IOR PROJECT "
    },
    {
        "content": "Norway's Statoil said on Monday it would keep drilling exploration wells in the Barents Sea using what it called \"regular equipment\" after a court upheld an injunction in a patent dispute over specialised drilling technology.",
        "date": "06122017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil denies patent infringement  keeps drilling in the Barents Sea "
    },
    {
        "content": "* Says aims to become operator for unitised Carcara discovery (Adds quotes  background)",
        "date": "06122017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil aims to more than triple Brazil output "
    },
    {
        "content": "OSLO  June 12 Norwegian oil and gas firm Statoil aims to more than triple its production in Brazil and will seek to become operator for the entire Carcara discovery  among the world's biggest in recent years  the firm's country manager said.",
        "date": "06122017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil aims to more than triple Brazil output "
    },
    {
        "content": "OSLO About 150 oil platform workers would go on strike  potentially disrupting output from several Norwegian fields  if they fail to get a pay deal by midnight on Friday  their union said on Tuesday.",
        "date": "06062017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Norwegian union threatens strike at Statoil  Shell  Eni platforms "
    },
    {
        "content": "* On 6 June 2017 Jon Erik Reinhardsen was elected as new chair of Statoil's board of directors​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "06062017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Statoil says Jon Erik Reinhardsen elected as chair of co's board "
    },
    {
        "content": "LONDON  June 6 Norwegian oil company Statoil is targeting Japan and the U.S. states of California and Hawaii to expand its floating offshore wind turbine business  the head of its New Energy Solutions business told Reuters.",
        "date": "06062017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil eyes Japan  U.S. for floating wind expansion "
    },
    {
        "content": "OSLO Statoil has interrupted drilling in the Barents Sea in the Arctic region after a court issued a temporary injunction in a technology dispute with a small Norwegian firm  a Statoil spokesman said on Monday.",
        "date": "05292017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Technology dispute interrupts Statoil's Arctic drilling campaign "
    },
    {
        "content": "* Statoil - will issue up to 160 000 000 dividend shares  each with a nominal value of NOK 2.50 per share  for subscription by existing shareholders Source text for Eikon: Further company coverage:",
        "date": "05292017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Statoil to issue up to 160 mln dividend shares with nominal value of NOK 2.50 per share "
    },
    {
        "content": "* Statoil sells common shares of international petroleum corporation",
        "date": "05252017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil sells common shares of International Petroleum Corp "
    },
    {
        "content": "** Statoil CEO Eldar Saetre told Reuters on Monday about the prospect that OPEC and non-OPEC countries would extend the output cuts they agreed late last year:",
        "date": "05222017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BUZZ-Statoil CEO eyes tighter oil market if OPEC cuts extended "
    },
    {
        "content": "* Says establishing a digital centre of excellence and launching a roadmap with seven specific programmes for digitalisation in the company towards 2020",
        "date": "05222017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil to invest up to $240 mln in digital technology by 2020 "
    },
    {
        "content": "* Oceaneering secures a three-year extension of operational inspection frame agreement with Statoil Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Oceaneering extends operational inspection frame agreement with Statoil "
    },
    {
        "content": "OSLO  May 4 Statoil reported a far bigger jump in first-quarter operating profit than expected on Thursday  helped by the first profit from the Norwegian company's international operations since 2014 and higher oil prices.",
        "date": "05042017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil profit jumps with overseas operations back in the black "
    },
    {
        "content": "OSLO Norway's Statoil  posted significantly better-than-expected quarterly results on Thursday  helped by a rise in output and higher crude prices  year-on-year.",
        "date": "05042017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil first-quarter results handily beat estimates "
    },
    {
        "content": "OSLO  April 24 Norway's Statoil on Monday played down concerns that drilling in the Arctic is risky  days before it kickstarts its drilling campaign in the Barents Sea  where the country believes around half of its remaining resources could be located.",
        "date": "04242017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Norway's Statoil plays down risks ahead of Arctic drilling "
    },
    {
        "content": "SAO PAULO A Brazilian court has ordered state-controlled oil company Petróleo Brasileiro SA  to suspend the sale of its stake in an exploratory block to Norway's Statoil ASA  after a union argued there should have been an open bidding process.",
        "date": "04182017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Brazil court suspends Petrobras oilfield sale to Statoil "
    },
    {
        "content": "SAO PAULO  April 17 A Brazilian court has ordered state-controlled oil company Petróleo Brasileiro SA to suspend the sale of its stake in an exploratory block to Norway's Statoil ASA after a union argued there should have been an open bidding process.",
        "date": "04182017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-Brazil court suspends Petrobras oilfield sale to Statoil "
    },
    {
        "content": "SAO PAULO  April 17 A Brazilian court has ordered state-controlled oil company Petróleo Brasileiro SA to suspend the sale of its stake in an exploratory block to Norway's Statoil ASA.",
        "date": "04172017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Brazil court suspends sale of Petrobras stake in oilfield to Statoil "
    },
    {
        "content": "* Statoil: Statoil awards Transocean two rig contracts - statoil.com",
        "date": "04042017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil awards Transocean two rig contracts at around $113 mln offshore UK and Norway "
    },
    {
        "content": "OSLO Statoil confirmed on Tuesday its cost estimate for developing Norway's Johan Sverdrup oilfield  the largest North Sea discovery in decades  and announced contract awards for the second and final construction phase.",
        "date": "03212017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil confirms Sverdrup oilfield cost estimate "
    },
    {
        "content": "OSLO  March 21 Statoil confirmed on Tuesday its cost estimate for developing Norway's Johan Sverdrup oilfield  the largest North Sea discovery in decades  and announced contract awards for the second and final construction phase.",
        "date": "03212017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "CORRECTED-Statoil confirms Sverdrup oilfield cost estimate "
    },
    {
        "content": "OSLO Norway's Statoil was the second top bidder for 13 oil exploration leases in the U.S. Gulf of Mexico and won six licenses offshore Britain  it said on Thursday  in a sign it may be looking to boost reserves after slashing costs.",
        "date": "03232017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil wins licenses off UK  \"resets\" exploration off U.S "
    },
    {
        "content": "* Wins six licences  including five operated  in UK   (Combines British  U.S. strands)",
        "date": "03232017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil wins licences off UK  \"resets\" exploration off U.S. "
    },
    {
        "content": "OSLO  March 23 Norway's Statoil has \"reset\" its exploration campaign in the U.S. Gulf of Mexico by placing top bids for 13 offshore deepwater oil and gas leases there in the latest auction  the company said Thursday.",
        "date": "03232017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil \"resets\" exploration in U.S. Gulf of Mexico "
    },
    {
        "content": "HOUSTON  March 22 Royal Dutch Shell plc  Chevron Corp and Exxon Mobil Corp signaled the oil industry's return to the Gulf of Mexico's deep waters with high bids in a government auction up 76 percent over a year ago.",
        "date": "03232017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Major oil companies open their wallets in Gulf of Mexico bidding "
    },
    {
        "content": "OSLO  March 10 Norway's Statoil has ditched plans to build a futuristic-looking head office in Stavanger after cutting the size of its workforce by almost 3 000 in recent years  a spokesman for the oil and gas firm said on Friday.",
        "date": "03102017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil scraps plan to build new head office after job cuts "
    },
    {
        "content": "OSLO  March 8 Norway's Statoil plans to extend production at its oldest oil platform still in operation  the Statfjord A  until 2022  two years longer than previously planned  the company said in a letter to the country's Ministry of Petroleum and Energy.",
        "date": "03082017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil plans to extend Statfjord A output until 2022 "
    },
    {
        "content": "HOUSTON Norwegian oil producer Statoil ASA expects its U.S. shale operations to be profitable within two years at crude prices of $50 per barrel  an improvement helped by simplifying operations  technological improvements and cost cuts.",
        "date": "03062017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil sees U.S. shale profitable within two years at $50 oil "
    },
    {
        "content": "HOUSTON  March 6 Norwegian oil producer Statoil ASA expects its U.S. shale operations to be profitable within two years at crude prices of $50 per barrel  an improvement helped by simplifying operations  technological improvements and cost cuts.",
        "date": "03062017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "CERAWEEK-Statoil sees U.S. shale profitable within two years at $50 oil "
    },
    {
        "content": "* Says the board of directors proposes election of Kasim Kutay and Helge Lund as new members of the board of directors at the annual general meeting",
        "date": "02242017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Novo Nordisk proposes Novo A/S CEO and former BG chief as board members "
    },
    {
        "content": "OSLO  Feb 22 The cost of developing Aker BP's  Snadd gas discovery in the Norwegian Sea will probably ammount to 10 billion crowns ($1.19 billion)  a preliminary estimate by the company showed on Wednesday.",
        "date": "02222017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Norway's Aker BP estimates Snadd development cost at $1.2 billion "
    },
    {
        "content": "* Statoil's share of production used for benchmark to grow   (Adds details on Statoil share  Statoil comment  from paragraph  9)",
        "date": "02202017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 3-Platts revamps Brent oil benchmark for first time in a decade "
    },
    {
        "content": "LONDON  Feb 7 Norway's Statoil will become more cautious in its exploration spending offshore the United States  but does not plan to leave the region  the company's exploration chief told Reuters on Tuesday.",
        "date": "02072017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil's offshore U.S. exploration spending to be more cautious "
    },
    {
        "content": "* Shares down 1.2 percent  off earlier lows   (Adds detail on output  analysts)",
        "date": "02072017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil takes hit as cuts long-term oil price view "
    },
    {
        "content": "* Current estimates for the first phase is estimated to NOK 97 billion ($11.71 billion) (capex numbers in nominal terms based on project currency)  from 123 billion kroner since the plan for development and operation (PDO)",
        "date": "02072017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Aker BP says development costs cut on giant Johan Sverdup oilfield "
    },
    {
        "content": "* Aibel and Aker Solutions have  on behalf of the licence partners  been awarded contracts for hook-up and commissioning assistance for the Johan Sverdrup field centre  phase 1  off Norway",
        "date": "01312017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil awards $156 mln work to Aibel  Aker Solutions  Kvaerner "
    },
    {
        "content": "OSLO Operational mistakes and a lack of maintenance led to near-fatal accidents at Norway's Troll field and at the Mongstad refinery  operator Statoil said on Friday.",
        "date": "01202017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil says mistakes  lack of maintenance led to Troll  Mongstad accidents "
    },
    {
        "content": "LONDON Royal Dutch Shell has been shortlisted by the U.S. government to make a bid for an offshore wind project license in the waters off North Carolina  as it comes under pressure from shareholders to diversify into green energy.",
        "date": "01182017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Shell bolsters offshore wind interests with bid in U.S. tender "
    },
    {
        "content": "* Statoil says bad risk assessment the main cause   (Adds reaction by oil workers' union)",
        "date": "01202017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil says mistakes  lack of maintenance led to Troll  Mongstad accidents "
    },
    {
        "content": "* Has been awarded a firm one well extension plus one optional well from Statoil",
        "date": "01202017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-North Atlantic Drilling announces $10 mln Statoil rig extension "
    },
    {
        "content": "* Baker Hughes and Schlumberger will be awarded contracts for integrated drilling and well services on Cat J rigs Askepott and Askeladden",
        "date": "01182017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Statoil awards service contracts to Baker Hughes  Schlumberger "
    },
    {
        "content": "OSLO/LONDON  Jan 10 Norway's Statoil  said on Tuesday it expected to gradually resume flights of Sikorsky S-92 helicopters it uses to transport offshore workers  after all flights were stopped earlier in the day for safety checks.",
        "date": "01102017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil to gradually resume Sikorsky S-92 helicopter flights "
    },
    {
        "content": "OSLO  Jan 10 Statoil would resume gradually its Sikorsky S-92 helicopter flights offshore Norway after urgent safety checks on Tuesday  a spokesman said.",
        "date": "01102017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil to resume Sikorsky S-92 helicopter flights gradually "
    },
    {
        "content": "OSLO  Jan 10 Norway's Statoil said oil production was not impacted after the firm grounded all its Sikorsky S-92 helicopters used to transport offshore workers after an alert note from Sikorsky Aircraft Corp  a unit of Lockheed Martin Corp  was issued on Tuesday.",
        "date": "01102017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil grounds Sikorsky S-92 helicopters for inspection in Norway "
    },
    {
        "content": "OSLO Norway's Statoil is considering whether to end its costly search for oil and gas in the U.S. Gulf of Mexico  the company's exploration chief told financial daily Dagens Naeringsliv (DN) on Friday.",
        "date": "01062017",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil may stop drilling in U.S. Gulf of Mexico: report "
    },
    {
        "content": "OSLO  Jan 6 Norway's Statoil is considering whether to end its costly search for oil and gas in the U.S. Gulf of Mexico  the company's exploration chief told financial daily Dagens Naeringsliv (DN) on Friday.",
        "date": "01062017",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil may stop drilling in U.S. Gulf of Mexico -report "
    },
    {
        "content": "OSLO Norwegian state-controlled oil company Statoil  will not resume using Airbus's  H225 Super Puma helicopters even if Norway's Civil Aviation Authority decides to lift a ban imposed after a fatal crash off Norway in April  the company said on Tuesday.",
        "date": "12062016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil drops Airbus Super Puma helicopters for good "
    },
    {
        "content": "OSLO The balance between demand and supply in the oil market will shift earlier than previously expected due to OPEC's output cuts  with prices heading towards $60 a barrel next year  Statoil's chief executive said on Tuesday.",
        "date": "12062016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil CEO sees oil market rebalancing sooner  price heading towards $60 "
    },
    {
        "content": "OSLO Norwegian oil major Statoil  has made its first investment in solar power technology  stepping up efforts to gradually complement its petroleum portfolio with renewable assets  the company said on Tuesday.",
        "date": "12062016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Oil firm Statoil makes first investment in solar tech "
    },
    {
        "content": "OSLO Statoil could drill its first well in the Salina Basin offshore Mexico in 2018 at the earliest  its exploration chief told Reuters on Tuesday.",
        "date": "12062016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil to drill offshore Mexico in 2018 at earliest "
    },
    {
        "content": "OSLO  Nov 22 A fire broke out in an engine room on Saipem's Scarabeo 5 drilling rig in the Norwegian Sea on Tuesday  Norwegian oil company Statoil said in a statement.",
        "date": "11222016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Saipem rig catches fire off Norway  no injuries reported -Statoil "
    },
    {
        "content": "Nov 16 Norway state oil firm Petoro's CEO  Grethe Moen  told an industry conference in Stavanger  Norway  on Wednesday:",
        "date": "11162016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Norway's Petoro expects concept for Troll phase 3 development in 2017 "
    },
    {
        "content": "* FMC Technologies and Technip alliance received a  integrated engineering  procurement  construction  and installation (EPCI) contract from Statoil for its Trestakk field in Norwegian Sea  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "11042016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-FMC Technologies and Technip alliance receives EPCI contract from Statoil for its Trestakk field in Norwegian Sea "
    },
    {
        "content": "BODOE  Norway  Nov 1 Statoil and partners will invest 5.5 billion Norwegian crowns ($665.51 million) in the development of the Trestakk oil and gas field off Norway  down from a January estimate of 7 billion crowns  the company said on Tuesday.",
        "date": "11012016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil gives go-ahead to Norway's Trestakk field after slashing cost "
    },
    {
        "content": "* Its ProntoTV unit has signed its largest agreement so far for deliveries to Statoil ASA",
        "date": "10252016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-ZetaDisplay's ProntoTV signs agreement for deliveries to Statoil "
    },
    {
        "content": "BUENOS AIRES  Oct 28 Argentina's state-controlled energy company YPF said on Friday it signed a deal with Norway's Statoil to study potential offshore drilling sites off Argentina's Atlantic coast.",
        "date": "10282016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Argentina's YPF says to study offshore drilling with Statoil "
    },
    {
        "content": "RIO DE JANEIRO  Oct 26 Norwegian oil company Statoil ASA hopes to have 10 to 15 percent of Brazil's natural gas market in coming years  Pal Eitrheim  the company's most senior executive in the country  told journalists on Wednesday.",
        "date": "10262016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil aims for at least 10 pct of coming Brazil gas market "
    },
    {
        "content": "* Oil producer Statoil Brazil CEO Pal Eitrheim says company has cut break even point on Peregrino offshore oil project to $45 a barrel from $70/bbl in 2 years",
        "date": "10262016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Statoil says encouraged by regulatory changes in Brazil "
    },
    {
        "content": "OSLO Norway's Petroleum Safety Authority (PSA) asked Statoil on Wednesday to investigate whether a number of recent incidents at the oil company's facilities might be related and linked to cost cuts  a spokesman for the watchdog said.",
        "date": "10262016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Norway's oil safety watchdog asks Statoil to investigate recent incidents "
    },
    {
        "content": "* A final investment decision for the Trestakk oil and gas field in the Norwegian Sea is coming soon  Statoil's head of technology  Margareth Oevrum  told an energy conference in Oslo on Tuesday",
        "date": "10182016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil sees investment decision for Trestakk field soon "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Monday:",
        "date": "10172016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "NORDIC STOCKS - Factors to watch on Oct 17 "
    },
    {
        "content": "* Valeura Energy announces execution of transformational transaction agreements in Turkey and underwritten private placement of subscription receipts",
        "date": "10132016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Valeura announces execution of transformational transaction agreements in Turkey "
    },
    {
        "content": "* Other oil companies also hold exploration permits   (Adds analyst  share price  background)",
        "date": "10112016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-BP scraps plan to drill off Australia's south coast "
    },
    {
        "content": "OSLO  Oct 6 Statoil's Melkoeya liquefied natural gas (LNG) plant and Shell's Nyhamna gas processing plant would have to shut if Thursday's wage talks fail and workers go on strike  the country's oil and gas industry association said on Thursday.",
        "date": "10062016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Norway strike could shut two gas plants if wage talks fail-industry "
    },
    {
        "content": "RIO DE JANEIRO  Oct. 4 Petróleo Brasileiro SA and Norway's Statoil ASA are expanding a partnership to help the Brazilian state-controlled company arrest declining production at aging wells in the offshore Campos Basin  two people with direct knowledge of the plan said.",
        "date": "10042016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Petrobras  Statoil extend partnership to aging wells -sources "
    },
    {
        "content": "RIO DE JANEIRO  Oct. 4 Petróleo Brasileiro SA and Norway's Statoil ASA are expanding an existing partnership to help the Brazilian state-controlled company arrest declining production at aging wells in the offshore Campos Basin  two people with direct knowledge of the plan said.",
        "date": "10042016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Petrobras  Statoil extend partnership for old wells - sources "
    },
    {
        "content": "* Says has received notice of early contract cancellation for the West Epsilon rig from Statoil",
        "date": "09272016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-North Atlantic Drilling says Statoil cancels West Epsilon contract "
    },
    {
        "content": "SAO PAULO  Sept 28 The President of Statoil  in Brazil said on Wednesday that the Norwegian oil producer is looking at opportunities in Brazil's offshore oil region known as the Subsalt Polygon.",
        "date": "09282016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil Brazil chief says looking at Brazil subsalt opportunities "
    },
    {
        "content": "NYHAMNA  Norway  Sept 27 Royal Dutch Shell  plans to raise the output capacity at its giant Ormen Lange field offshore Norway by installing two new compressors  the operator said on Tuesday.",
        "date": "09272016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Shell to increase Norway's Ormen Lange output capacity with new compressors "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Wednesday:",
        "date": "09212016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "NORDIC STOCKS - Factors to watch on Sept 21 "
    },
    {
        "content": "BRASILIA Norway's Statoil sees changes to Brazil's oil industry laws  including the end of mandatory participation by Petrobras in all subsalt blocs  as key for attracting foreign investment  Chief Executive Officer Eldar Saetre said on Thursday.",
        "date": "09082016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Brazil oil law change key to attracting investment: Statoil "
    },
    {
        "content": "BRASILIA  Sept 8 Norway's Statoil sees changes to Brazil's oil industry laws  including the end of mandatory participation by Petrobras in all subsalt blocs  as key for attracting foreign investment  Chief Executive Officer Eldar Saetre said on Thursday.",
        "date": "09082016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-Brazil oil law change key to attracting investment -Statoil "
    },
    {
        "content": "BRASILIA  Sept 8 Norway's oil company Statoil  believes modifications to Brazil's oil sector legislation  including the removal of a mandatory participation of Petrobras in all subsalt blocs  is very important for attracting foreign investment  Statoil Chief Executive Officer Eldar Saetre said on Thursday.",
        "date": "09082016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil says Brazil oil law change key to attract investment - CEO "
    },
    {
        "content": "STAVANGER  Norway  Aug 30 The sale of a stake in Carcara  the giant Brazilian offshore oil prospect  to Norway's Statoil ASA will gain Brazil's state-led oil company Petrobras as much as $11 billion to pay debt or invest in other projects that promise to generate cash more quickly  Petrobras' chief executive said on Tuesday.",
        "date": "08302016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Petrobras to gain $11 bln on sale of Brazil oil rights to Statoil -CEO "
    },
    {
        "content": "RIO DE JANEIRO Petrobras' sale of offshore oil rights in Brazil to Norway's Statoil ASA  will free up about $11 billion that Brazil's cash-strapped state-run oil company can use to pay debt or develop areas that promise a quicker return  the company's chief executive said on Tuesday.",
        "date": "08312016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Petrobras oil-rights sale to Statoil to free up about $11 billion: CEO "
    },
    {
        "content": "STAVANGER  Norway  Aug 30 Oil firm Statoil  will drill Norway's northernmost oil well next year in the Barents Sea  where it believes a significant oil discovery can be made  an executive said on Tuesday.",
        "date": "08302016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil to drill Norway's northernmost oil well next year "
    },
    {
        "content": "STAVANGER  Norway John Knight  Statoil's  executive vice-president for global strategy and business development  told Reuters on the sidelines of the ONS oil conference in Stavanger  Norway on Monday:",
        "date": "08292016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil expects 'loads of' M&A deals coming up  strategy chief says "
    },
    {
        "content": "RIO DE JANEIRO  Aug 30 Petrobras' sale of offshore oil rights in Brazil to Norway's Statoil ASA  will free up about $11 billion that Brazil's cash-strapped state-run oil company can use to pay debt or develop areas that promise a quicker return  the company's chief executive said on Tuesday.",
        "date": "08312016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-Petrobras oil-rights sale to Statoil to free up about $11 bln - CEO "
    },
    {
        "content": "STAVANGER  Norway  Aug 29 John Knight  Statoil's  executive vice-president for global strategy and business development  told the ONS oil conference in Stavanger on Monday:",
        "date": "08292016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil sees more Aker-BP type-deals in Norway oil sector "
    },
    {
        "content": "* Valeura announces execution of definitive agreements for Statoil farm-in on Banarli licences in Turkey",
        "date": "08192016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Valeura Energy - Execution of definitive agreements for Statoil farm-in on Banarli licences in Turkey "
    },
    {
        "content": "* Brazil's oil company Queiroz Galvão Exploração e Produção (QGEP) says not exercising first rights on Carcara field sale  satisfied with Statoil as new partner after sale of asset by Brazil's state-run oil company Petrobras  Further company coverage:    (Writing by Reese Ewing)",
        "date": "08112016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Brazil QGEP says satisfied with Statoil as partner in Carcara field "
    },
    {
        "content": "* Has agreed a further sale of non-core assets in its U.S. onshore portfolio  third in Southern Marcellus in last two years",
        "date": "08012016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil plans $96 million sale of U.S. onshore assets "
    },
    {
        "content": "* Maintains dividend at $0.2201 per share   (Adds analysts  updates shares)",
        "date": "07272016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 3-Statoil second quarter lags forecasts  cuts 2016 capex outlook "
    },
    {
        "content": "ATHENS  July 27 Cyprus received expressions of interest from ENI  Total  Statoil  Exxon Mobil  Qatar Petroleum  and Cairn in a licensing round for offshore hydrocarbon blocks which lapsed last week  its energy ministry said on Wednesday.",
        "date": "07272016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Cyprus says Statoil  Exxon  ENI  Total interested in offshore gas "
    },
    {
        "content": "RIO DE JANEIRO/OSLO Brazil's Petrobras on Friday agreed to sell one of its largest oil and gas prospects to Norway's Statoil for $2.5 billion  the boldest step yet by the state-led energy company to advance its stagnant asset-sale plan and repair its battered finances.",
        "date": "07292016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Petrobras sells oilfield asset to Statoil for $2.5 billion "
    },
    {
        "content": "* Says area has as much as 1.3 bln boe of recoverable resources",
        "date": "07292016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 4-Petrobras sells oilfield asset to Statoil for $2.5 bln "
    },
    {
        "content": "RIO DE JANEIRO  July 29 Brazil's Barra Energia do Brasil Petróleo e Gás  which owns 10 percent of the giant Carcara offshore oil prospect  will study invoking its right of first refusal over Petrobras' sale of its 66 percent stake in the area to Norway's Statoil  a source with direct knowledge of the situation told Reuters on Friday.",
        "date": "07292016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Brazil's Barra to study buying Petrobras asset sold to Statoil "
    },
    {
        "content": "July 29 Petroleo Brasilerio SA  or Petrobras  Chief Financial Officer Ivan Monteiro and Exploration and Production chief Solange Guedes spoke to reporters in Sao Paulo about the company's agreement to sell its 66 percent stake in the BM-S-8 offshore block  home to the giant Carcara field  to Norway's Statoil ASA.",
        "date": "07292016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Petrobras working hard to meet $15.1 bln asset-sale goal "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Monday:",
        "date": "07042016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "NORDIC STOCKS - Factors to watch on July 4 "
    },
    {
        "content": "WARSAW  June 27 Polish state-run gas distributor PGNiG said on Monday it had received its first spot liquefied natural gas (LNG) delivery from Norway's Statoil  via Poland's newly launched terminal at the Baltic coast.",
        "date": "06272016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Poland receives first spot gas cargo from Statoil "
    },
    {
        "content": "LONDON Norway's Statoil has claimed 10 percent of the highly coveted oil trade route between west Africa and China's small 'teapot' refineries  its head of trading said  suggesting its gamble to offer directly to China's newest importers has paid off.",
        "date": "06302016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil nabs 10 percent of WAfrican oil route to China's teapots "
    },
    {
        "content": "OSLO  June 29 Statoil will initially keep oil fields operating even if negotiations set for June 30 to July 1 fail to avert a strike that would halt output at others  the Norwegian Oil and Gas Association (NOG) said on Wednesday.",
        "date": "06292016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil to keep fields operating even if Norway oil workers strike "
    },
    {
        "content": "OSLO  June 28 Norwegian oil major Statoil  must halt attempts to scale back existing labour agreements if it wants to prevent a strike that would hit output from July 2  a trade union said on Tuesday.",
        "date": "06282016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Union warns Statoil not to scale back agreements "
    },
    {
        "content": "OSLO  June 20 Norwegian oil firm Statoil  and its partners are studying the possibilities of expanding gas production at Norway's biggest field  Troll  after 2020  the company said on Monday.",
        "date": "06202016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil  partners study Troll post-2020 output expansion "
    },
    {
        "content": "* Norway's oil ministry says Oseberg Vestflanken 2 field approved for development",
        "date": "06142016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Norway approves Statoil's $981 million Oseberg expansion "
    },
    {
        "content": "* Statoil  along with its partners  has finalized a 19-month exploration Month exploration drilling program offshore Newfoundland",
        "date": "06102016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil finalizes a 19-month exploration program offshore Newfoundland  confirms volumes "
    },
    {
        "content": "OSLO/LONDON  June 10 Oil companies BP and Det norske have agreed to merge their Norwegian businesses in a $1.3 billion share deal to cut costs  increase profitability and challenge Statoil's Norwegian offshore dominance.",
        "date": "06102016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "REFILE-UPDATE 1-BP and Det norske agree $1.3 bln Norwegian oil merger "
    },
    {
        "content": "* Schlumberger appoints former BG  Statoil boss Helge Lund to board - WSJ  Source text: (http://on.wsj.com/1XHWJp4) Further company coverage:",
        "date": "06092016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Schlumberger appoints former BG  Statoil boss Helge Lund to board - WSJ "
    },
    {
        "content": "* Schlumberger picks former BG  Statoil boss Helge Lund as new CEO - WSJ  Source text - (http://on.wsj.com/1RYe6ZZ) Further company coverage:    (Bengaluru Newsroom)",
        "date": "06092016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Schlumberger picks former BG  Statoil boss Helge Lund as new CEO - WSJ "
    },
    {
        "content": "* Technip awarded umbilical supply contract by Statoil  in Norway",
        "date": "05252016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Technip awarded umbilical supply contract by Statoil in Norway "
    },
    {
        "content": "WARSAW  May 24 Poland's state-run gas firm PGNiG  said on Tuesday it will receive its first spot delivery of liquefied natural gas (LNG) from Norway's Statoil on June 25.",
        "date": "05242016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Poland's PGNiG to receive first spot LNG cargo from Statoil on June 25 "
    },
    {
        "content": "* Valeura Announces Binding Letter Agreement With Statoil For Farm Out on Banarli licences in Turkey",
        "date": "05152016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Valeura announces deal with Statoil in Turkey "
    },
    {
        "content": "OSLO  May 9 Norwegian oil company Statoil  will face only muted criticism of its environmental record at an annual general meeting (AGM) on Wednesday  in a rare respite caused by a small shift towards green energy.",
        "date": "05092016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil to get rare respite from green criticisms at AGM "
    },
    {
        "content": "* CEO sees rebalancing of oil market   (Adds analysts  CEO comments  share price reaction  BP  Total results)",
        "date": "04272016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil sees better days ahead after beating quarterly earnings forecast "
    },
    {
        "content": "HAMMERFEST  Norway  April 20 Oil firm Statoil  is looking to a rebound in exploration activity offshore Norway in the next few years with a focus on the Arctic  having curbed activity due to the oil price slump  the firm's exploration chief for Norway told Reuters.",
        "date": "04202016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil looks to the Arctic to increase exploration off Norway "
    },
    {
        "content": "April 14 - The following stocks may be affected by newspaper reports and other factors on Thursday:",
        "date": "04142016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "NORDIC STOCKS-Factors to watch on April 14 "
    },
    {
        "content": "* Says board of directors asks annual general meeting to authorise repurchase of up to 75 million shares in the market  equal to previous year's request",
        "date": "04142016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Statoil seeks to renew permission for share buyback "
    },
    {
        "content": "* At least 15 large tankers wait to offload -shiptracking data",
        "date": "04072016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "China teapot refiner oil buying spree creates tanker jam at Qingdao "
    },
    {
        "content": "BRUSSELS  March 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03232016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "EU mergers and takeovers (March 23) "
    },
    {
        "content": "BRUSSELS  March 23 Statoil Fuel and Retail gained European Union antitrust approval on Wednesday for its acquisition of Shell's Danish retail and wholesale fuels business after agreeing to sell some businesses to allay competition concerns.",
        "date": "03232016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil Fuels and Retails wins EU okay for Shell deal "
    },
    {
        "content": "ALGIERS Al Qaeda's North Africa branch has claimed responsibility for Friday's rocket-propelled grenade attack on an Algerian gas plant operated by Norway's Statoil and BP as part of its \"war on the Crusader interests everywhere\".",
        "date": "03192016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Al-Qaeda's North Africa branch claims attack on Algerian gas plant "
    },
    {
        "content": "OSLO/ALGIERS Militants attacked an Algerian gas plant operated by Norway's Statoil and BP with rocket-propelled grenades on Friday  causing no casualties or damage but forcing the facility to be closed as a precaution.",
        "date": "03182016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Militants fire rockets at Algerian BP/Statoil gas plant  no casualties "
    },
    {
        "content": "OSLO/ALGIERS March 18 Militants attacked an Algerian gas plant operated by Norway's Statoil and BP  with rocket-propelled grenades on Friday  causing no casualties or damage but forcing the facility to be closed as a precaution.",
        "date": "03182016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Militants fire rockets at Algerian BP/Statoil gas plant  no casualties "
    },
    {
        "content": "OSLO  March 18 An Algerian gas plant owned by Norway's Statoil  BP and state firm Sonatrach was attacked on Friday  the company said.",
        "date": "03182016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil says \u007fAlgeria gas plant has been attacked "
    },
    {
        "content": "OSLO  March 2 Oil majors Statoil and ExxonMobil have been awarded six options to search for oil and gas offshore Ireland in the country's latest licensing round  Statoil said on Wednesday.",
        "date": "03022016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil and ExxonMobil win Irish oil licenses "
    },
    {
        "content": "HOUSTON  Feb 23 Norwegian oil producer Statoil ASA sees the crude price downturn as a chance to slash costs and become more efficient  with a senior executive calling it a \"great opportunity\" to improve operations.",
        "date": "02242016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil sees oil price drop as 'great opportunity' to improve "
    },
    {
        "content": "OSLO  Feb 25 Statoil has made a small gas discovery in the North Sea  with reserves seen at between one million and two million standard cubic metres  the Norwegian Petroleum Directorate said on Thursday.",
        "date": "02252016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil makes small gas discovery off Norway "
    },
    {
        "content": "(Corrects to make clear Lundbeck's drug Brintellix is already approved in the United States) The following stocks may be affected by newspaper reports and other factors on Thursday:",
        "date": "02042016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "CORRECTED-NORDIC STOCKS - Factors to watch on Feb 4 "
    },
    {
        "content": "* Plans $13 bln capex  down from $14.7 bln spent last year   (Recasts  adds comments  cost-cutting details  shares)",
        "date": "02042016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 4-Statoil shares jump on earnings  progress on costs "
    },
    {
        "content": "* Awards new helicopter contracts for Bergen and Floroe to Bristow Norway",
        "date": "02012016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil awards NOK 1 bln helicopter contract to Bristow "
    },
    {
        "content": "* Suncor Energy Norge AS  operator of production licence 571  has concluded the drilling of wildcat well 25/10-14 S.",
        "date": "01182016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Suncor/Statoil: Dry well west of the Balder Field in the North Sea\u007f\u007f "
    },
    {
        "content": "OSLO  Jan 13 Energy major Statoil and its partners have agreed on a development concept for their Trestakk oil and gas discovery off the coast of Norway after cutting the cost of the project by several hundred million dollars  the company said on Wednesday.",
        "date": "01132016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil picks subsea plan for Norway project after 30 pct cost cut "
    },
    {
        "content": "* Two members of ruling party called for Statoil dividend cut",
        "date": "01112016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Norwegian oil minister steers clear of Statoil dividend debate "
    },
    {
        "content": "Information provider IHS Inc has agreed to buy U.S. oil pricing agency OPIS as deal making in the oil pricing industry heats up after regulators' scrutiny cools.",
        "date": "01112016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Dealmaking heats up for oil pricing agencies as IHS buys OPIS "
    },
    {
        "content": "Jan 11 Information provider IHS Inc has agreed to buy U.S. oil pricing agency OPIS as deal making in the oil pricing industry heats up after regulators' scrutiny cools.",
        "date": "01112016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Dealmaking heats up for oil pricing agencies as IHS buys OPIS "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Monday:",
        "date": "01112016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "NORDIC STOCKS - Factors to watch on Jan 11 "
    },
    {
        "content": "OSLO The price of crude oil is likely to rise over time despite the recent fall to levels last seen in 2004  Statoil Chief Executive Eldar Saetre told Reuters on Thursday.",
        "date": "01072016",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil CEO says expects oil price to rise over time "
    },
    {
        "content": "LONDON  Jan 3 With crude prices at 11-year lows  the world's biggest oil and gas producers are facing their longest period of investment cuts in decades  but are expected to borrow more to preserve the dividends demanded by investors.",
        "date": "01032016",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Big oil to cut investment again in 2016 "
    },
    {
        "content": "OSLO One person died and two were injured on Wednesday when a big wave hit a rig belonging to China's Chinese Oilfield Services Ltd that had been drilling at the Statoil-operated Troll field offshore Norway  the Norwegian company said.",
        "date": "12302015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "One dead  two injured after wave hits North Sea drilling rig "
    },
    {
        "content": "OSLO Commodities trader Gunvor and the oil trading desks of Statoil and other energy firms are considering joining a global initiative aimed at shedding light on companies' dealing with governments of resource-rich countries.",
        "date": "12222015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Gunvor  Statoil consider joining latest resources transparency drive "
    },
    {
        "content": "OSLO Commodities trader Gunvor and the oil trading desks of Statoil and other energy firms are considering joining a global initiative aimed at shedding light on companies' dealing with governments of resource-rich countries.",
        "date": "12212015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Gunvor  Statoil consider joining latest resources transparency drive "
    },
    {
        "content": "OSLO  Dec 18 Statoil would have to reconsider its Norwegian oil and gas field development plans if current low oil prices persist well into next year  the energy company said on Friday.",
        "date": "12182015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil may have to rethink plans if low oil prices persist "
    },
    {
        "content": "OSLO  Dec 18 Statoil and partners expect to invest some 8.2 billion Norwegian crowns ($933.87 million) in the development of the Oseberg Vestflanken 2 project off Norway  the firm said on Friday.",
        "date": "12182015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil  partners to invest $933 mln in N.Sea Oseberg expansion "
    },
    {
        "content": "OSLO  Dec 17 Norwegian oil firm Statoil  said on Thursday it would present its development plan for its Oseberg Vestflanken 2 project offshore Norway on Friday.",
        "date": "12172015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil to present Oseberg Vestflanken 2 plan on Friday "
    },
    {
        "content": "* Says Aibel was today granted a new framework agreement for the supply of maintenance and modification services to Statoil",
        "date": "12152015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Ratos says portfolio company Aibel inks deal worth NOK 7.5 mln with Statoil "
    },
    {
        "content": "Dec 8 Britain's FTSE 100 index is seen opening up 12 by points  or 0.2 percent higher  according to financial bookmakers  with futures  also up 0.2 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "12082015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Tuesday Dec 8 "
    },
    {
        "content": "LONDON  Dec 8 European shares headed for a steady open on Tuesday  with a slight recovery in crude oil prices and some positive company updates seen underpinning the market.",
        "date": "12082015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "European Factors to Watch-Shares head for steady open "
    },
    {
        "content": "Dec 8 Britain's FTSE 100 index is seen opening up 12 by points  or 0.2 percent higher  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed 0.2 percent lower at 6 223.52 points on Monday  as commodity shares came under severe pressure after prices of crude oil and metals slipped.     * OIL MAJORS: EU antitrust regulators have dropped Shell  BP   and Statoil from an investigation into suspected ",
        "date": "12082015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UK Stocks-Factors to watch on Tuesday Dec 8 "
    },
    {
        "content": "STAVANGER  Norway  Nov 18 Norway's Statoil  will decide next autumn on how to upgrade the Snorre oil and gas field in the North Sea  a company executive said on Wednesday.",
        "date": "11182015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil to decide on Snorre 2040 development concept next autumn "
    },
    {
        "content": "OSLO  Nov 13 Norwegian oil firm Statoil  and partners have won eight licenses to explore for oil and gas off the coast of Canada  the firm said late on Thursday.",
        "date": "11132015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil wins eight oil exploration licenses off Canada "
    },
    {
        "content": "* Statoil asa: Reduced equity share at Agbami following redetermination",
        "date": "11062015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "RPT-BRIEF-Statoil: Reduced ownership in Agbami Field in Nigeria after expert ruling "
    },
    {
        "content": "* Floating wind farms seen as energy growth area   (Adds head of Statoil's New Energy Solutions  detail  releads)",
        "date": "11032015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil to invest $236 mln in floating wind farm off Scotland "
    },
    {
        "content": "* has completed a farm-in transaction with ExxonMobil  Exploration and Production South Africa Limited  acquiring a 35 percent interest in the ER 12/3/154 Tugela South Exploration Right.",
        "date": "10292015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Oil firm Statoil to explore off coast of South Africa "
    },
    {
        "content": "OSLO Norway's Statoil posted a third-quarter operating profit below market forecasts on Wednesday and said it has cut its capital spending for this year by another $1 billion as the oil industry struggles with low crude prices.",
        "date": "10282015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil posts worse than expected profit  cuts spending "
    },
    {
        "content": "* Proposes Q3 dividend of $0.2201/shr as expected   (Adds detail on cost cuts and delays  comment from analysts)",
        "date": "10282015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil posts worse than expected profit  cuts spending "
    },
    {
        "content": "OSLO Oil spilled into the North Sea during the loading of a tanker at Norway's Statfjord field on Thursday  operator Statoil said.",
        "date": "10082015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Oil spills into North Sea at Statfjord field: Statoil "
    },
    {
        "content": "* Statoil says has \"flexibility\" to export oil   (Adds volume of oil spill  quotes  detail)",
        "date": "10082015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Oil spills into North Sea at Statfjord field - Statoil "
    },
    {
        "content": "* Announces frame agreement with Johan Sverdrup  one of the five largest oil fields on the Norwegian continental shelf",
        "date": "10082015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "BRIEF-Zenitel awarded Statoil frame agreements for Johan Sverdrup "
    },
    {
        "content": "* Statoil has concluded the drilling of wildcat well 25/11-28. The well is dry",
        "date": "10012015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil drills dry well in the North Sea "
    },
    {
        "content": "OSLO Norwegian oil and gas firm Statoil plans to have 20 percent fewer employees by end-2016 compared to 2013  its chief executive said on Monday.",
        "date": "09212015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil to have 20 percent fewer employees by end-2016 vs 2013: CEO "
    },
    {
        "content": "* Project is one of Norway's largest industrial projects   (Adds detail  background)",
        "date": "09252015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil cuts cost of Norway's J.Sverdrup oilfield -partner "
    },
    {
        "content": "* The contract involves establishment of a new and cost efficient standard for subsea equipment",
        "date": "09182015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-FMC Technologies wins $160 mln Statoil contract "
    },
    {
        "content": "* Awarded a contract to ABB in Sweden for fabrication and installation of two high-voltage cables supplying power from shore to the Johan Sverdrup field",
        "date": "09162015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-ABB wins power cable contract for Statoil oil field "
    },
    {
        "content": "* Drills dry well near the Sleipner Øst field on the in the North Sea",
        "date": "08312015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil drills dry well in North Sea "
    },
    {
        "content": "* Fails to break even in international operations   (Adds Statoil's clarification on Q4 dividend)",
        "date": "07282015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 4-Statoil profit beats forecast; reassures on dividend "
    },
    {
        "content": "LONDON  July 28 European shares bounced back on Tuesday  lifted by strong company results and news of acquisitions after falling in the previous five sessions on concerns over China's growth.",
        "date": "07282015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "CORRECTED-European shares up after recent losses; earnings and M&A support "
    },
    {
        "content": "HELSINKI  July 28 The following stocks may be affected by newspaper reports and other factors on Tuesday:",
        "date": "07282015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "NORDIC STOCKS - Factors to watch on July 28 "
    },
    {
        "content": "BAKU Norway's Statoil is to sell its 20-percent stake in the  Trans Adriatic Gas Pipeline (TAP) project that will carry gas from Azerbaijan to Europe  the president of Azeri state energy firm SOCAR said.",
        "date": "07202015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil to leave TAP gas pipeline project - Azerbaijan's SOCAR "
    },
    {
        "content": "BAKU  July 20 Norway's Statoil is to sell its 20-percent stake in the  Trans Adriatic Gas Pipeline (TAP) project that will carry gas from Azerbaijan to Europe  the president of Azeri state energy firm SOCAR said.",
        "date": "07202015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil to leave TAP gas pipeline project - Azerbaijan's SOCAR "
    },
    {
        "content": "* Appeals ministry decision over ownership of giant Sverdrup field   (Adds detail  bullets)",
        "date": "07152015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 1-Det norske to appeal Sverdrup oilfield ownership  Q2 earnings lag "
    },
    {
        "content": "OSLO  July 7 Norway's oil and gas firm Statoil  plans to take the final investment decision in September on building a floating wind farm off the coast of Scotland  set to be the first of its kind in the world  a spokesman for the company said on Tuesday.",
        "date": "07072015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil to decide on Scottish floating wind farm in September "
    },
    {
        "content": "OSLO  July 6 Norway's oil and gas firm Statoil  said on Monday it has awarded Baker Hughes a 1.5 billion Norwegian crown  ($187.20 million) contract for integrated drilling services at Johan Sverdrup field.",
        "date": "07062015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil awards 1.5 bln crown drilling contract to Baker Hughes "
    },
    {
        "content": "OSLO  June 30 Norwegian oil major Statoil  has awarded Samsung Heavy industries an $888 million contract for two platform decks on the giant Johan Sverdrup field in the North Sea  it said on Tuesday.",
        "date": "06302015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil awards $890 mln North Sea contract to Samsung "
    },
    {
        "content": "OSLO  June 30 Norwegian oil major Statoil  has awarded Samsung Heavy industries a contract worth 7 billion Norwegian crowns ($887.78 million) on the giant Johan Sverdrup field in the North Sea  it said on Tuesday.",
        "date": "06302015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil awards $890 mln contract to Samsung "
    },
    {
        "content": "CALGARY  Alberta Statoil ASA  said on Wednesday it is still working with the government of Canada's Newfoundland to come up with terms for developing the Bay du Nord discovery in the North Atlantic off the province's coast.",
        "date": "06172015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil says still working on terms to develop Bay du Nord field "
    },
    {
        "content": "June 16 Norway's Statoil ASA is \"weeks away\" from reaching a deal with the government of Newfoundland and Labrador to develop the company's 600 million-barrel Bay du Nord oil discovery off the Canadian province's Atlantic coast  the province's premier said on Tuesday.",
        "date": "06162015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil  Newfoundland near deal on offshore oil drilling project "
    },
    {
        "content": "OSLO Norway's Statoil will cut up to 7 percent of its workforce and a third of its consultants by the end of 2016  it said on Tuesday  adding to staff cuts already implemented as it battles low oil prices and shrinking margins.",
        "date": "06162015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Norway's Statoil to cut up to 1 500 jobs by end of 2016 "
    },
    {
        "content": "OSLO  June 8 Norway's Kvaerner has won a key platform construction contract from Statoil  securing another deal for a Norwegian oil services sector that has struggled for years with high costs and cheaper competition from Asian rivals.",
        "date": "06082015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Kvaerner and KBR win $840 million Statoil rig construction deal "
    },
    {
        "content": "* Says has entered into an agreement with Colony Capital  for sale of its head office building at Forus in Stavanger",
        "date": "06092015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil sells headquarters to Colony Capital for NOK 2.6 bln "
    },
    {
        "content": "* Norway needs predictable gas demand in Europe   (Adds further details)",
        "date": "06022015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil CEO sees signs of gas demand recovery in Europe "
    },
    {
        "content": "* Statoil has awarded evry mission to deploy document management system for global exploration activity  Source text: http://bit.ly/1LWz4aD",
        "date": "06012015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil awards EVRY mission to deploy document management system "
    },
    {
        "content": "WILLISTON  N.D.  June 3 North Dakota oil regulators ordered small  privately held Zavanna LLC to shut in oil wells near the confluence of the Missouri and Yellowstone rivers on Wednesday after more than 1.5 inches (3.8 cm) of rain raised flooding concerns.",
        "date": "06032015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 3-North Dakota orders oil wells shut in over flooding concerns "
    },
    {
        "content": "OSLO  May 29 Norway's Kvaerner is a favourite to win a key Statoil platform deck contract  while three Korean yards were vying for two other platform deals on the giant Johan Sverdrup field in the North Sea  trade weekly Upstream said on Friday.",
        "date": "05292015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Kvaerner  Korean yards in running for Statoil contracts - paper "
    },
    {
        "content": "CALGARY  Alberta Statoil ASA  MEG Energy Corp and Cenovus Energy Inc evacuated hundreds of workers from three oil sands projects in northeastern Alberta on Tuesday as wildfires raged through the key crude-producing region.",
        "date": "05272015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Hundreds more oil sands staff evacuated on Alberta fire threat "
    },
    {
        "content": "CALGARY  Alberta  May 26 Statoil ASA  MEG Energy Corp and Cenovus Energy Inc  evacuated hundreds of workers from three oil sands projects in northeastern Alberta on Tuesday as wildfires raged through the key crude-producing region.",
        "date": "05262015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 4-Hundreds more oil sands staff evacuated on Alberta fire threat "
    },
    {
        "content": "OSLO  May 29 Norway's Kvaerner is a favourite to win a key Statoil platform deck contract  while three Korean yards were vying for two other platform deals on the giant Johan Sverdrup field in the North Sea  trade weekly Upstream said on Friday.",
        "date": "05292015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Kvaerner  Korean yards in running for Statoil contracts - paper "
    },
    {
        "content": "* Downgrades oil sector outlook to 'cautious' from 'neutral'   (Recasts  adds detail  comment)",
        "date": "05182015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Goldman cuts crude outlook and oil company forecasts "
    },
    {
        "content": "WILLISTON  N.D. At least five senior Statoil executives and engineers have left the Norwegian oil giant's North Dakota unit to form their own U.S. exploration and production company backed by $500 million in private equity.",
        "date": "05072015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Exclusive: Statoil U.S. execs leave for private-equity backed oil startup "
    },
    {
        "content": "OSLO  May 12 Norwegian oil firm Statoil  replaced several top executives including its chief financial officer on Tuesday  continuing a shake-up since its chief executive was poached by rival BG Group last October.",
        "date": "05122015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil shakes up management with new CFO  U.S. chief "
    },
    {
        "content": "YANGON  May 3 Myanmar has awarded contracts to international oil majors Statoil and ConocoPhillips  for oil and gas exploration in a deepwater offshore block  the official Kyemon Daily said on Sunday.",
        "date": "05032015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Myanmar awards Statoil  Conoco Phillips deepsea exploration contract- paper "
    },
    {
        "content": "* Maintains dividend  shares rise   (Adds shale writedown detail  analysts)",
        "date": "04302015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 3-Shale writedown pushes Statoil into red  dividend maintained "
    },
    {
        "content": "OSLO Oil major Statoil swung to a surprise first quarter net loss on a writedown in the value of its U.S. shale business but its operating figures beat forecasts and the firm pleased investors by maintaining its dividend.",
        "date": "04302015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Writedown pushes Statoil into red  dividend maintained "
    },
    {
        "content": "OSLO  April 27 Norway's Statoil must move ahead with the delayed upgrade of the Snorre oil and gas field in the North Sea because it is a time-critical investment  energy minister Tord Lien said on Monday.",
        "date": "04272015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil must move ahead with Snorre field expansion - govt "
    },
    {
        "content": "OSLO  April 23 Norway's Statoil is cutting investments less than any other oil major this year  positioning for a crude price recovery but taking a risk should the slump be protracted.",
        "date": "04232015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Betting on oil price recovery  Statoil snips where rivals slash "
    },
    {
        "content": "HOUSTON  April 22 Norwegian oil and natural gas producer Statoil ASA has no plans to add North American drilling rigs this year  an executive told Reuters on Wednesday.",
        "date": "04222015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "CERAWEEK-Statoil won't add North American drilling rigs this year "
    },
    {
        "content": "HOUSTON  April 21 The oil and natural gas industry cannot ignore climate change and must support work to help curb its effects through a carbon tax  increased natural gas production and other means  Statoil ASA Chief Executive Eldar Sætre said on Tuesday.",
        "date": "04212015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "CERAWEEK-Statoil pushes oil industry to take bold climate steps "
    },
    {
        "content": "HOUSTON The oil and natural gas industry cannot ignore climate change and must work to help curb its effects  Statoil ASA Chief Executive Eldar Sætre said in an interview on Tuesday.",
        "date": "04212015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil CEO says energy sector should help fix climate "
    },
    {
        "content": "HOUSTON  April 21 The oil and natural gas industry cannot ignore climate change and must work to help curb its effects  Statoil ASA Chief Executive Eldar Sætre said in an interview on Tuesday.",
        "date": "04212015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "CERAWEEK-Statoil CEO says energy sector should help fix climate "
    },
    {
        "content": "OSLO  April 21 Norway will ask European competition authorities whether it can provide state support to energy firm Statoil to bring oil and gas to the shore from its Johan Castberg field in the Arctic  the oil minister said on Tuesday.",
        "date": "04212015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Norway considers support for Statoil project "
    },
    {
        "content": "AMSTERDAM  April 16 Norwegian gas is likely to be price competitive enough to weather an influx of cheaper Russian gas expected into its  European market this summer  a senior Statoil official said.",
        "date": "04162015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "INTERVIEW-Cheaper Russian gas this summer no threat-Statoil "
    },
    {
        "content": "OSLO  April 9 Norwegian oil and gas firm Statoil  made an oil discovery in the Yeti prospect in the U.S. Gulf of Mexico  about 15 kilometres south of the Big Foot field and 11 kilometres from the Cascade field  it said on Thursday.",
        "date": "04092015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil makes Gulf of Mexico oil discovery "
    },
    {
        "content": "LONDON  March 30 BG Group's new boss Helge Lund has poached two officials from his former company Statoil for key management positions  sending a clear sign he intends to act quickly to try to turn around the British firm amid a sharp oil price drop.",
        "date": "03302015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "New BG boss hires M&A specialist from Statoil weeks after taking helm - memo "
    },
    {
        "content": "OSLO  March 19 Norwegian energy firm Statoil  released unprecedented detail about its payments to governments around the world on Thursday  even as some of its rivals are fighting new rules that will require increased disclosure.",
        "date": "03192015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Norway's Statoil sets precedent with government payment disclosure "
    },
    {
        "content": "* Statoil successfully bid on 14 leases in the U.S. Department of the Interior's central region Gulf of Mexico lease sale 235",
        "date": "03182015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "BRIEF-Statoil adds acreage in the Gulf of Mexico "
    },
    {
        "content": "OSLO  March 18 Norwegian energy firm Statoil  has made a gas discovery near the Aasta Hansteen field in the northern part of the Norwegian Sea  the company said on Tuesday.",
        "date": "03182015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil makes Norwegian sea gas discovery "
    },
    {
        "content": "OSLO  March 6 Norwegian energy firm Statoil  postponed two of its biggest offshore developments on Friday as low oil prices spur cost cuts  it said.",
        "date": "03062015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 1-Statoil delays Castberg  Snorre projects to cut costs "
    },
    {
        "content": "LONDON  Feb 27 Crude oil futures rebounded on Friday and Brent headed for its first monthly gain since June  helped by strong investor inflows  an improving demand outlook and supply outages.",
        "date": "02272015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "CORRECTED-UPDATE 5-Brent rises above $61  set for first monthly gain since June "
    },
    {
        "content": "* Libyan oil supply increases to 100 000 bpd   (Adds China oil demand and quote  updates prices)",
        "date": "02272015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Brent rises above $61  set for biggest monthly gain since 2009 "
    },
    {
        "content": "OSLO  Feb 24 Norwegian engineering firm Aibel has won a contract worth 8 billion crowns ($1.05 billion) from Statoil to build a drilling platform for the Johan Sverdrup field  one of the biggest deals for the giant North Sea field.",
        "date": "02242015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Norway's Aibel wins $1.05 bln Statoil contract for Sverdrup platform "
    },
    {
        "content": "OSLO Norway's Statoil is moving ahead with plans to develop a giant $29 billion oil field  Europe's costliest offshore energy project  expecting to produce some of the world's cheapest oil that will be profitable even after the recent price crash.",
        "date": "02132015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil gives go ahead for $29 billion oil project "
    },
    {
        "content": "* Shareholders bicker over stake sizes   (Adds shares  analyst  North Sea context  detail)",
        "date": "02132015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil gives go ahead for $29 bln oil project "
    },
    {
        "content": "* Also hope he can copy asset sale success of Statoil   (Rewrites throughout  adds background  analyst views  share price)",
        "date": "02092015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 2-BG parachutes turnaround CEO in early after $6 bln writedown "
    },
    {
        "content": "OSLO  Feb 9 Norwegian oil and gas firm Statoil  has chosen an unmanned wellhead platform as the concept for the Oseberg Future development phase I project offshore Norway  it said on Monday.",
        "date": "02092015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Statoil picks unmanned platform concept for Oseberg new development "
    },
    {
        "content": "LONDON Norwegian oil company Statoil  vowed to protect dividend payments and said it was braced for a long period of depressed crude prices as it set out plans on Friday to slash costs and cut investment.",
        "date": "02062015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "Statoil slashes costs and investment as low oil prices weigh "
    },
    {
        "content": "* Takes net $2.4 billion of charges on low oil prices   (Adds global context  writes through)",
        "date": "02062015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "UPDATE 3-Statoil slashes costs and investment as low oil prices weigh "
    },
    {
        "content": "* Could retire in three years   (Adds analyst  quotes  details)",
        "date": "02042015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 2-Statoil persuades group veteran Saetre to become permanent CEO "
    },
    {
        "content": "PARIS  Feb 6 European stocks dipped on Friday  with regional indexes pausing just below recent multi-year highs as investors looked to the January U.S. non-farm payrolls report due later in the session.",
        "date": "02062015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Europe shares dip; Sunrise climbs in market debut "
    },
    {
        "content": "WILLISTON  N.D.  Feb 4 Halliburton  Statoil ASA  Hess Corp and other North Dakota energy companies have decided  for now  not to lay off staff in the No. 2 U.S. oil producing state  hoping to be prepared for any prolonged rebound in crude prices.",
        "date": "02042015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "Many oil firms plan no North Dakota layoffs despite cheap oil "
    },
    {
        "content": "STOCKHOLM  Feb 6 The following stocks may be affected by newspaper reports and other factors on Friday:",
        "date": "02062015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "NORDIC STOCKS - Factors to watch on Feb 6 "
    },
    {
        "content": "HELSINKI  Feb 4 The following stocks may be affected by newspaper reports and other factors on Wednesday:",
        "date": "02042015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "NORDIC STOCKS - Factors to watch on Feb 4 "
    },
    {
        "content": "DAVOS  Switzerland  Jan 22 Ukraine plans to cover up to 60 percent of its gas import needs this year from Europe  leaving its once-dominant supplier Russia delivering the rest  the head of the state energy firm told Reuters on Thursday.",
        "date": "01222015",
        "name": "Statoil ASA",
        "news_type": "normal",
        "symbol": "STO",
        "title": "INTERVIEW-Ukraine sees imports of European gas overtaking Russian gas this year "
    },
    {
        "content": "* Awards 54 blocks in mature areas to 43 firms   (Adds oil minister  Statoil CEO  licensing round)",
        "date": "01202015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "UPDATE 2-Norway moves Arctic ice edge north  invites oil industry bids "
    },
    {
        "content": "OSLO  Jan 14 Norway's Statoil has handed back three out of its four Greenland offshore oil and gas exploration licences  it said on Wednesday  in another sign of cost cutting by energy firms following a plunge in oil prices.",
        "date": "01142015",
        "name": "Statoil ASA",
        "news_type": "topStory",
        "symbol": "STO",
        "title": "RPT-Statoil hands back three Greenland exploration licences "
    }
]