[
    {
        "content": "* ‍ANNOUNCED LAUNCH OF ESGX(SM) AND AGREEMENTS WITH NEW DATA PROVIDERS  INCLUDING ARABESQUE​ Source text for Eikon: Further company coverage:",
        "date": "11152017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-STATE STREET ‍ANNOUNCES AGREEMENTS WITH NEW DATA PROVIDERS "
    },
    {
        "content": "NEW YORK  Nov 15 A shareholder proposal calling for Twenty-First Century Fox Inc to do away with its dual-class share structure may inflict a symbolic black eye on the media company's founder Rupert Murdoch and his family at its annual meeting on Wednesday.",
        "date": "11152017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Shareholders take aim at Murdochs with Fox voting rights push "
    },
    {
        "content": "Nov 7 U.S. regional lender State Street Corp said on Tuesday its Chief Executive Jay Hooley would retire by the end of next year.",
        "date": "11072017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street CEO Jay Hooley to retire by 2018-end "
    },
    {
        "content": "* State Street Corp says ‍assets under custody and administration of approximately $32 trillion as of September 30  2017​ - presentation slides Source text: (http://bit.ly/2izsAaF) Further company coverage:",
        "date": "11062017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State street - ‍assets under custody and administration of about $32 trillion "
    },
    {
        "content": "ROSELAND  N.J.  Nov 7 William Ackman got what Automatic Data Processing Inc's chief executive called an \"ass-whipping\" on Tuesday as the activist hedge fund manager lost an acrimonious fight to win seats on the payroll company's board.",
        "date": "11072017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 3-Billionaire investor Ackman loses bitter ADP proxy battle "
    },
    {
        "content": "* State Street Corp - ‍Jay Hooley to retire as CEO by end of 2018; vice-chairman Ron O'Hanley to succeed Hooley as CEO and is appointed president & COO​",
        "date": "11072017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street says ‍Jay Hooley to retire as CEO  Ron O'Hanley to succeed Hooley "
    },
    {
        "content": "* State Street Corp - files for mixed shelf offering of up to $6 billion - SEC filing‍​ Source text: (http://bit.ly/2yoNeFw) Further company coverage:",
        "date": "11022017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street files mixed shelf offering of up to $6 bln "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 23 (Fitch) State Street Corporation's third-quarter 2017 (3Q17) net income of $685 million was 22% higher year-over-year due to growth in net interest income (NII) and strong fee growth as well as some restructuring charges incurred in the prior year period. Fitch Ratings notes that NII benefited from higher short-term interest rates  and fee growth was driven by higher equity markets on a yoy basis. This quarter's resu",
        "date": "10232017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch: Higher Interest Rates Boost State Street's 3Q17 Earnings "
    },
    {
        "content": "State Street Corp's  adjusted expenses rose 4 percent in the third quarter  overshadowing a better-than-expected profit and sending the bank's shares down 4 percent on Monday.",
        "date": "10232017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street's higher expenses cloud profit beat  shares fall "
    },
    {
        "content": "Oct 23 State Street Corp's adjusted expenses rose 4 percent in the third quarter  overshadowing a better-than-expected profit and sending the bank's shares down 4 percent on Monday.",
        "date": "10232017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 2-State Street's higher expenses cloud profit beat  shares fall "
    },
    {
        "content": "* State Street Corp sees FY 2017 total fee revenue growth on operating basis up 6 percent to 7 percent- SEC Filing‍​",
        "date": "10232017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp sees FY 2017 total fee revenue growth on operating basis up 6 pct to 7 pct "
    },
    {
        "content": "* State street reports third-quarter 2017 gaap-basis eps of $1.66  up 29% compared to 3q16  and roe of 13.0%  up 2.4% points",
        "date": "10232017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street reports Q3 Operating EPS Of $1.71 "
    },
    {
        "content": "Oct 23 State Street Corp's profit rose 24 percent in the third quarter  as the bank benefited from higher interest rates.",
        "date": "10232017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street's profit rises 24 pct in 3rd quarter "
    },
    {
        "content": "BOSTON  Oct 16 State Street Corp has drawn praise for its efforts to put more women on corporate boards  notably the \"Fearless Girl\" statue it placed near Wall Street. But new records show the company did not throw its full weigh behind boardroom diversity initiatives this year - complicating activists' plans for 2018.",
        "date": "10162017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Light backing from State Street weighs on U.S. diversity drives "
    },
    {
        "content": "State Street Corp has agreed to pay $5 million to settle U.S. Labor Department allegations that the bank underpaid its female and black executives compared to male and white employees in the same positions.",
        "date": "10052017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street to pay $5 mln to settle Labor Dept pay-bias allegations "
    },
    {
        "content": "WASHINGTON/BOSTON State Street Corp  will pay more than $35 million to settle U.S. charges that it fraudulently charged secret mark-ups for transition management services and hid details from clients about the trading of U.S. Treasury securities  the U.S. Securities and Exchange Commission said on Thursday.",
        "date": "09072017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street to pay more than $35 mln to settle U.S. charges: SEC "
    },
    {
        "content": "WASHINGTON/BOSTON  Sept 7 State Street Corp will pay more than $35 million to settle U.S. charges that it fraudulently charged secret mark-ups for transition management services and hid details from clients about the trading of U.S. Treasury securities  the U.S. Securities and Exchange Commission said on Thursday.",
        "date": "09072017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 1-State Street to pay more than $35 mln to settle U.S. charges -SEC "
    },
    {
        "content": "WASHINGTON  Sept 7 State Street Corp will pay more than $35 million to settle U.S. charges that it \"fraudulently charged secret mark-ups for transition management services \" the U.S. Securities and Exchange Commission said in a statement on Thursday.",
        "date": "09072017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street to pay more than $35 mln to settle U.S. charges -SEC "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 22 (Fitch) Fitch Ratings has affirmed State Street Corporation's (State Street) Long-Term Issuer-Default Rating (IDR) at 'AA-'. The Rating Outlook remains Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS IDRs  VRs AND SENIOR DEBT The affirmation of State Street's ratings reflects its strong franchise in asset custody  growing position in asset management  stable operating perfo",
        "date": "08222017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch Affirms State Street Corporation's IDR at 'AA-'; Outlook Stable "
    },
    {
        "content": "Aug 8 State Street Global Advisors  the asset management arm of State Street Corp  said on Tuesday it appointed Jacqueline Lommen as senior defined contribution pensions strategist position for its Northern Europe division.",
        "date": "08082017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-State Street names Jacqueline Lommen as N. Europe pensions strategist "
    },
    {
        "content": "* State Street- In July 2017  shareholder filed derivative complaint against co \"demanding\" that co take legal action against past  present officers  directors",
        "date": "08042017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street's shareholders file derivative complaint against co \"demanding\" that co take legal action against past  present officers  directors "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 26 (Fitch) State Street Corporation's (State Street) second quarter 2017 (2Q17) net income of $620 million was essentially unchanged from the prior year quarter  but up 24% from the sequential quarter due to growth in net interest income (NII) from higher short-term interest rates. This quarter's results equated to a strong 12.6% return on average common equity (ROAE) in 2Q17  up slightly from 12.4% in the year-ago quarter",
        "date": "07262017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch: Higher Markets and Interest Rates Drive State Street's 2Q17 Earnings "
    },
    {
        "content": "* State Street Corp sees fy 2017 net interest income $2.43 billion to $2.45 billion or up 12 percent to 13 percent",
        "date": "07262017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp sees FY17 net interest income $2.43 billion to $2.45 billion "
    },
    {
        "content": "* State street reports second-quarter 2017 GAAP-basis EPS of $1.53 and roe of 12.6%",
        "date": "07262017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street reports Q2 earnings per share of $1.53 "
    },
    {
        "content": "July 10 Financial services provider State Street Corp said on Monday it appointed Melissa Ballenger chief financial officer  Europe  the Middle East and Africa (EMEA).",
        "date": "07102017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-State Street hires new CFO for EMEA "
    },
    {
        "content": "BOSTON  July 12 A former State Street Corp executive on Wednesday became the second person to plead guilty to participating in what U.S. prosecutors say was a scheme to defraud six clients through secret commissions on billions of dollars of trades.",
        "date": "07122017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Second ex-State Street executive admits guilt in U.S. fraud case "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 12 (Fitch) Fitch Ratings has affirmed State Street Corporation's (State Street) Long-Term Issuer-Default Rating (IDR) at 'AA-'. The Rating Outlook remains Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS IDRs  VRs AND SENIOR DEBT The affirmation of State Street's ratings reflects its strong franchise in asset custody  growing position in asset management  stable operating perform",
        "date": "07122017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Fitch Affirms State Street Corporation's IDR at 'AA-'; Outlook Stable "
    },
    {
        "content": "* State Street Corporation announces planned increase to its quarterly common stock dividend to $0.42 per share and an authorization to purchase up to $1.4 billion of its common stock",
        "date": "06282017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street announces planned increase to its qtrly common stock dividend to $0.42/share "
    },
    {
        "content": "June 28 A former State Street Corp executive pleaded guilty on Wednesday in connection with what U.S. prosecutors said was a scheme to defraud six clients through secret commissions on billions of dollars worth of trades.",
        "date": "06282017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Ex-State Street executive pleads guilty in U.S. fraud case "
    },
    {
        "content": "Financial services provider State Street Corp said on Friday it appointed Steve Cook as senior vice president within its U.S. investment services business.",
        "date": "06232017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street appoints Steve Cook senior vice president of U.S. investor services "
    },
    {
        "content": "June 23 Financial services provider State Street Corp said on Friday it appointed Steve Cook as senior vice president within its U.S. investment services business.",
        "date": "06232017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "MOVES-State Street appoints Steve Cook senior vice president of US investor services "
    },
    {
        "content": "State Street Global Advisors  the asset management business of State Street Corp  said on Wednesday it appointed Kathryn Sweeney as head of its SPDR Americas institutional sales.",
        "date": "06142017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street Global names new institutional sales head for SPDR business "
    },
    {
        "content": "* State Street-on june 12  co notified U.S. Bank National Association it intends to exercise its option under terms of indenture  dated Dec 15  1996",
        "date": "06122017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street notifies U.S. Bank National Association it intends to exercise its option under terms of indenture  dated Dec 15  1996 "
    },
    {
        "content": "June 14 State Street Global Advisors  the asset management business of State Street Corp  said on Wednesday it appointed Kathryn Sweeney as head of its SPDR Americas institutional sales.",
        "date": "06142017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "MOVES-State Street Global names new institutional sales head for SPDR business "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  June 12 (Fitch) Fitch Ratings has assigned State Street US Treasury Liquidity Fund  a short-term money market fund managed by State Street Global Advisors Limited a Money Market Fund Rating of 'AAAmmf'. The fund is a sub-fund of the Irish-domiciled umbrella fund  State Street Global Advisors Liquidity PLC. KEY RATING DRIVERS The 'AAAmmf' rating reflects: -The fund's overall credit quality and diversification; -Low exposures to i",
        "date": "06122017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Fitch Rates State Street US Treasury Liquidity Fund 'AAAmmf' "
    },
    {
        "content": "June 5 Financial services provider State Street Corp named David Pagliaro as the head of State Street Global Exchange for Europe  the Middle East and Africa (EMEA) region.",
        "date": "06052017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-State Street names new head of EMEA global exchange unit "
    },
    {
        "content": "BOSTON  June 8 A second former State Street Corp executive is expected to plead guilty in connection with what U.S. prosecutors say was a scheme to defraud six clients through secret illicit commissions on billions of dollars of trades.",
        "date": "06082017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Second ex-State Street exec to plead guilty in U.S. fraud probe "
    },
    {
        "content": "BOSTON  June 6 A former State Street Corp executive has agreed to plead guilty in connection with a scheme to defraud six clients through secret commissions on billions of dollars of trades  according to court papers filed on Tuesday.",
        "date": "06062017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Ex-State Street exec to plead guilty in U.S. to fraud scheme "
    },
    {
        "content": "BOSTON A former State Street Corp executive has agreed to plead guilty in connection with a scheme to defraud six clients through secret commissions on billions of dollars of trades  according to court papers filed on Tuesday.",
        "date": "06062017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Ex-State Street executive to plead guilty in U.S. to fraud scheme "
    },
    {
        "content": "BOSTON  June 6 A former State Street Corp executive has agreed to plead guilty in connection with a scheme to defraud six clients through secret commissions on billions of dollars of trades  according to court papers filed on Tuesday.",
        "date": "06062017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 1-Ex-State Street exec to plead guilty in U.S. to fraud scheme "
    },
    {
        "content": "* State Street Corp files for offering of fixed-to-floating rate notes  size undisclosed - SEC filing Source text for Eikon: (http://bit.ly/2q2kRHo) Further company coverage:",
        "date": "05102017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp files for offering of fixed-to-floating rate notes  size undisclosed "
    },
    {
        "content": "May 8 State Street Global Advisors (SSGA)  the asset management arm of State Street Corp  named Dave Ireland global head of defined contribution.",
        "date": "05082017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-State Street Global names new global head of defined contribution "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 28 (Fitch) State Street Corporation's (STT) first quarter 2017 (1Q17) net income was $502 million down 15.3% from the sequential quarter which included a $248 million tax benefit  but up 36.4% from the year-ago quarter  according to Fitch Ratings.  The year-over-year increase was due to higher management fees as a result of the July 2016 closing of the acquisition of GE's Asset Management (GEAM) business as well as market",
        "date": "04282017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch: Higher Markets Help Boost State Street's 1Q17 Earnings "
    },
    {
        "content": "* State street reports first-quarter 2017 gaap-basis eps of $1.15  and roe of 9.9%  as both increased compared to the first-quarter of 2016",
        "date": "04262017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street Q1 earnings per share $1.21 "
    },
    {
        "content": "* State Street Global Advisors says received a payment as authorized claimant from a class action settlement related to Weatherford International Ltd Source text for Eikon: Further company coverage:",
        "date": "04212017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street Global Advisors says received a paymentfrom class action settlement "
    },
    {
        "content": "BOSTON A high-stakes shareholder vote at Wells Fargo & Co  next week will determine whether the bank has done enough to retain investor confidence after its phony-account scandal  and whether a leading proxy adviser wields enough clout to help oust most of its board.",
        "date": "04212017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "High-stakes vote on Wells Fargo board also tests proxy adviser ISS "
    },
    {
        "content": "* CEO Joseph L. Hooley's 2016 total compensation was $14.7 million versus $11.3 million in 2015 – sec filing Source text: [http://bit.ly/2oFJ6M0] Further company coverage:",
        "date": "04062017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp says CEO Joseph Hooley's 2016 total compensation was $14.7 mln "
    },
    {
        "content": "April 3 State Street Global Advisors  the asset management arm of State Street Corp  appointed Andrew Benton as head of its UK institutional business.",
        "date": "04032017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-State Street Global Advisors names head of U.K. institutional business "
    },
    {
        "content": "* DST to acquire remaining interest in joint ventures  BFDS and IFDS U.K.  from State Street",
        "date": "03272017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-Dst to acquire remaining interest in Joint Ventures  BFDS and IFDS U.K.  from State Street "
    },
    {
        "content": "* State street appoints john lehner to head of investment manager services business  Source text for Eikon:  Further company coverage:",
        "date": "03142017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street appoints John Lehner to head of investment manager services business "
    },
    {
        "content": "    By Ross Kerber     BOSTON  March 8 FTSE Russell will consult with big investors on whether to include companies like Snap Inc          in its widely followed  stock indexes even if their shares lack voting rights  an executive said.      The issue will be studied at meetings with asset managers and other clients this month  Joti Rana  Americas head of governance and policy for FTSE Russell  said in an interview on Tuesday. FTSE Russell offers popular indexes like Britain's blue-c",
        "date": "03082017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "FTSE Russell turns to investors on Snap voting rights quandary "
    },
    {
        "content": "BOSTON  March 1 State Street Corp.  one of the world's biggest players in the business of restructuring investment portfolios  is shutting its transition management operations in London and Hong Kong and eliminating 20 jobs.",
        "date": "03012017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street to shut transition management ops in London  Hong Kong "
    },
    {
        "content": "* State Street Corporation reports 16.6 percent passive stake in Lockheed Martin Corp  as of Dec. 31  2016  - SEC filing  Source text: (http://bit.ly/2lGXQc2) Further company coverage:",
        "date": "02142017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street reports 16.6 percent passive stake in Lockheed Martin  as of Dec. 31  2016 "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.38per share  Source text for Eikon:  Further company coverage:",
        "date": "02162017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street sets quarterly cash dividend of $0.38per share "
    },
    {
        "content": "* State Street Corp reports 7.1 percent passive stake in J C Penney Company Inc as of December 31 -sec filing  Source text : http://bit.ly/2lM2Nwb Further company coverage:",
        "date": "02142017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street reports 7.1 pct passive stake in J C Penney Company "
    },
    {
        "content": "* State Street reports 9.34 percent passive stake in Ford Motor Co as of December 31 - sec filing  Source text : http://bit.ly/2lGywmj Further company coverage:",
        "date": "02142017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street reports 9.34 pct passive stake in Ford Motor "
    },
    {
        "content": "* State Street Corporation reports a 10.40 percent passive stake in Boeing as of Dec 31  2016-SEC filing  Source text : [ID:http://bit.ly/2lLMCzP] Further company coverage:",
        "date": "02142017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street Corporation reports 10.40 percent passive stake in Boeing as of Dec 31  2016 "
    },
    {
        "content": "* State Street Corp reports 7.62 percent passive stake in 3M co as of Dec 31  2016-SEC filing  Source text : [ID:http://bit.ly/2lGuBG1] Further company coverage:",
        "date": "02142017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp reports 7.62 percent passive stake in 3M CO as of Dec 31  2016 "
    },
    {
        "content": "* State Street Corp reports a 6.30 percent passive stake in Berkshire Hathaway Inc as of Dec 31  2016 - SEC filing  Source text : [ID:http://bit.ly/2k7Kdxi] Further company coverage:",
        "date": "02092017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp reports 6.30 percent passive stake in Berkshire Hathaway Inc as of Dec 31  2016 "
    },
    {
        "content": "* State Street Corporation reports a 8.51 percent passive stake in Leggett & Platt Inc as of Dec 31  2016 - SEC filing  Source text: (http://bit.ly/2kmVwVw) Further company coverage:",
        "date": "02072017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp reports a 8.51 pct passive stake in Leggett & Platt Inc as of Dec 31 - SEC filing "
    },
    {
        "content": "* State Street Corporation reports 6.23 percent passive stake in Chevron Corp as of Dec 31  2016 - SEC filing  Source: (http://bit.ly/2kS9T5n) Further company coverage:",
        "date": "02092017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street reports 6.23 pct passive stake in Chevron "
    },
    {
        "content": "* State Street Corp reports a 5.65 percent passive stake in Johnson & Johnson  as of dec. 31  2016  Source text: (http://bit.ly/2kD1FeM) Further company coverage:",
        "date": "02072017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp reports a 5.65 pct passive stake in Johnson & Johnson  as of Dec. 31 "
    },
    {
        "content": "* State Street Corporation reports 5.03 percent passive stake in halliburton co as of dec. 31  2016 - SEC filing  Source text: (http://bit.ly/2kmZfCH) Further company coverage:",
        "date": "02072017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp reports 5.03 pct passive stake in Halliburton as of Dec. 31 - SEC filing "
    },
    {
        "content": "Boston-based State Street Corp has been hit with a securities fraud lawsuit accusing it of misleading shareholders by failing to disclose improper trading commissions that led to a $64.6 million government penalty earlier this month.",
        "date": "01302017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street hit with securities lawsuit over trading charges "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 26 (Fitch) State Street Corporation's (STT) fourth quarter 2016  (4Q16) earnings improved from the prior quarter and year ago  influenced  principally by tax benefits from its overseas business  and partially offset by  an acceleration of deferred compensation expenses  according to Fitch Ratings.  STT's overall return on average equity (ROE) was 12.1% in 4Q16  up from 10.6% in  the sequential quarter and 11.6% in the y",
        "date": "01262017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch: State Street Continues to Progress Towards Operating Target "
    },
    {
        "content": "BOSTON State Street Corp  on Wednesday reported a 3.4 percent drop in fourth-quarter revenue and said it lost more than $1 trillion in custody assets to JPMorgan Chase & Co Inc   sending State Street stock tumbling as much as 7.5 percent.",
        "date": "01252017",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BlackRock jilts State Street  moves $1 trillion in custody assets to JPMorgan "
    },
    {
        "content": "BOSTON State Street Corp  executives on Wednesday moved to soften the blow of losing $1 trillion in BlackRock assets to a rival by saying the move was not part of a broader trend.",
        "date": "01252017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BlackRock jilts State Street by moving $1 trillion assets to JPMorgan "
    },
    {
        "content": "BOSTON  Jan 25 State Street Corp  executives on Wednesday moved to soften the blow of losing $1 trillion in BlackRock assets to a rival by saying the move was not part of a broader trend.",
        "date": "01252017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BlackRock jilts State Street by moving $1 trln assets to JPMorgan "
    },
    {
        "content": "* State Street Corp- has been appointed by Allianz Global investors to provide a \"wide range of investment services\"  Source text for Eikon:  Further company coverage:",
        "date": "01252017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State street has been appointed by Allianz Global Investors to provide \"wide range of investment services\" "
    },
    {
        "content": "BOSTON  Jan 25 State Street Corp shares on Wednesday tumbled as much as 7.5 percent on a double dose of bad news: the bank reported a 3.4 percent drop in fourth quarter revenue and rival JPMorgan Chase & Co Inc announced poaching more than $1 trillion in custody assets.",
        "date": "01252017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street loses $1 trillion in custody assets to JPMorgan "
    },
    {
        "content": "* State Street Corp says  in first full twelve-month period ending June 30  2017  fee revenue from Geam transaction is expected to exceed $270 million",
        "date": "01252017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street sees FY17 total fee revenue growth of 4-6 pct "
    },
    {
        "content": "State Street Corp  will pay $64.6 million to resolve U.S. investigations into what prosecutors said was a scheme to defraud six clients through secret commissions on billions of dollars of trades  authorities said on Wednesday.",
        "date": "01182017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street to pay $64.6 million to resolve U.S. fraud probes "
    },
    {
        "content": "Jan 18 State Street Corp will pay $64.6 million to resolve U.S. investigations into what prosecutors said was a scheme to defraud six clients through secret commissions on billions of dollars of trades  authorities said on Wednesday.",
        "date": "01182017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 1-State Street to pay $64.6 million to resolve U.S. fraud probes "
    },
    {
        "content": "Jan 18 State Street Corp will pay more than $64 million to resolve U.S. investigations into what prosecutors said was a scheme to defraud six clients through secret commissions on billions of dollars of trades  authorities said on Wednesday.",
        "date": "01182017",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street to pay $64 million to resolve U.S. fraud probe "
    },
    {
        "content": "NEW YORK State Street Corp  has tested a blockchain system that it hopes can be used to streamline the securities lending process as the financial industry accelerates efforts to adopt the emerging technology.",
        "date": "12212016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street tests blockchain system for securities lending "
    },
    {
        "content": "SINGAPORE Asian bond investors must brace for more volatility at least through the first quarter of 2017 when they are likely get more clarity on whether U.S. President-elect Donald Trump's policies will reflect his anti-globalisation campaign rhetoric  according to State Street Global Advisors.",
        "date": "11182016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Asian bond markets to stay volatile through first quarter  says State Street GA "
    },
    {
        "content": "* Says introducing proprietary indices that will replace two Russell indexes that are being terminated",
        "date": "11182016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street Global says announces changes to indices of two SPDR ETFs "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 26 (Fitch) State Street Corporation's (STT) third quarter 2016  (3Q16) earnings were satisfactory  and adversely impacted by the closing of the  company's acquisition of General Electric's asset management (GEAM) business   according to Fitch Ratings. STT's overall return on average equity (ROE) was 10.6% in 3Q16  down 12.4% in  the sequential quarter and down from 11.3% in the year-ago quarter. The decline  was due to ",
        "date": "10262016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch: State Street Corp.'s 3Q16 Earnings Satisfactory "
    },
    {
        "content": "* State Street reports third-quarter 2016 GAAP-basis EPS of $1.29 on revenue of $2.62 billion",
        "date": "10262016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street Q3 GAAP earnings per share $1.29 "
    },
    {
        "content": "Oct 17 Financial services firm State Street Corp  appointed Aisling Keane head of alternative investment solutions  APAC.",
        "date": "10172016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-State Street names new head of alternative investment solutions "
    },
    {
        "content": "* State Street Corporation submits supplementary resolution plan to the Federal Reserve and Federal Deposit Insurance Corporation  Source text for Eikon:  Further company coverage:",
        "date": "10042016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp submits plan to the Federal Reserve "
    },
    {
        "content": "(The following statement was released by the rating agency) PARIS  September 29 (Fitch) Fitch Ratings has downgraded State Street Flexible  Asset Allocation Plus Fund's Fund Quality Rating to 'Good' from 'Strong'. The  fund is managed by State Street Global Advisors (SSGA). KEY RATING DRIVERS The downgrade reflects difficulties experienced by the fund in time asset  allocation adjustments and portfolio construction decisions  leading to  disappointing performance in 2015 and so far in 2016 relat",
        "date": "09292016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch Downgrades State Street Flexible Asset Allocation Plus Fund to 'Good' "
    },
    {
        "content": "Sept 28 Citizens Financial Group Inc  said Chief Financial Officer Eric Aboaf will leave the bank to take on the same role at State Street Corp.",
        "date": "09282016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-Citizens Financial CFO Eric Aboaf to join State Street "
    },
    {
        "content": "* State Street to appoint Eric Aboaf as chief financial officer",
        "date": "09282016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street to appoint Eric Aboaf as CFO "
    },
    {
        "content": "LONDON  Sept 21 ICAP-owned EBS Brokertec  said on Thursday it was on the verge of launching its \"Ultra\" data service  a high-speed feed that will further strengthen the hand of the large banks and computer-driven trading firms that dominate the currency world's biggest venues.",
        "date": "09222016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "EBS set to launch EBS Live Ultra faster data service "
    },
    {
        "content": "Sept 15 State Street Corp : Source text for Eikon:  Further company coverage: ",
        "date": "09152016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street sets cash dividend of $0.38 per share "
    },
    {
        "content": "BOSTON State Street Corp funds backed a majority of shareholder resolutions on climate-change issues this year  a swing from past proxy positions that a company executive said reflects a growing appreciation of environmental risks facing companies whose shares it owns.",
        "date": "09062016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street funds ramp up support for climate-change measures "
    },
    {
        "content": "BOSTON  Sept 6 State Street Corp funds backed a majority of shareholder resolutions on climate-change issues this year  a swing from past proxy positions that a company executive said reflects a growing appreciation of environmental risks facing companies whose shares it owns.",
        "date": "09062016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "CORRECTED-State Street funds ramp up support for climate-change measures "
    },
    {
        "content": "A former State Street Corp executive has waived his right to UK extradition proceedings and has pleaded not guilty to U.S. charges that he engaged in a scheme to defraud six clients through secret commissions on billions of dollars of trades.",
        "date": "08172016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Ex-State Street executive waives extradition to face U.S. charges "
    },
    {
        "content": "* GIC Private Limited reports 5.04 pct passive stake in State Street Corp as of Aug 5 - SEC filing  Source text - (http://bit.ly/2b4rTTN) Further company coverage:",
        "date": "08122016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-GIC Private reports 5.04 pct passive stake in State Street "
    },
    {
        "content": "A former State Street Corp executive has waived his right to UK extradition proceedings and has pleaded not guilty to U.S. charges that he engaged in a scheme to defraud six clients through secret commissions on billions of dollars of trades.",
        "date": "08162016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Ex-State Street executive waives extradition to face U.S. charges "
    },
    {
        "content": "* State street corp says in q1 of 2016  gx private equity index saw an overall return of 0.65 percent  Source text for Eikon:  Further company coverage:",
        "date": "08102016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street says in Q1 GX Private Equity Index saw overall return of 0.65 pct "
    },
    {
        "content": "Aug 16 A former State Street Corp  executive has waived his right to UK extradition proceedings and has pleaded not guilty to U.S. charges that he engaged in a scheme to defraud six clients through secret commissions on billions of dollars of trades.",
        "date": "08172016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "CORRECTED-UPDATE 1-Ex-State Street executive waives extradition to face U.S. charges "
    },
    {
        "content": "* Q2 total revenue on operating basis $2 675 million versus. $2 727 million last year",
        "date": "07272016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp reports Q2 GAAP EPS of $1.47 "
    },
    {
        "content": "* State Street Bank and Trust Company to pay $382.4 million in global settlement for \"misleading mutual funds and other custody clients\"",
        "date": "07262016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-SEC says State Street misled custody clients about prices for foreign exchange trades "
    },
    {
        "content": "Custody bank State Street Corp  said it has agreed to resolve all pending litigation and regulatory matters in the United States related to its indirect foreign exchange business.",
        "date": "07272016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street to pay $530 million to resolve forex fraud claims "
    },
    {
        "content": "July 26 Custody bank State Street Corp  said it has agreed to resolve all pending litigation and regulatory matters in the United States related to its indirect foreign exchange business.",
        "date": "07272016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street to pay $530 mln to resolve forex fraud claims "
    },
    {
        "content": "* Says previously established reserve will be sufficient to cover all costs associated with these agreements",
        "date": "07262016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street announces foreign exchange settlement "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 12 (Fitch) Fitch Ratings has affirmed State Street Corporation's  (STT) Long-Term Issuer-Default Ratings (IDR) at 'AA-'. The Rating Outlook  remains Stable. A full list of rating actions follows at the end of this  release. These rating actions were taken in conjunction with Fitch's U.S. trust and  processing bank peer review. A full list of rating actions is at the end of this  release. KEY RATING DRIVERS  IDRs  VRs AND S",
        "date": "07122016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch Affirms State Street Corporation's IDR at 'AA-'; Outlook Stable "
    },
    {
        "content": "* State Street Corporation announces an intention to increase its quarterly common stock dividend to $0.38 per share and an authorization to purchase up to $1.4 billion of its common stock",
        "date": "06292016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street to repurchase up to $1.4 bln of its common stock "
    },
    {
        "content": "HONG KONG  June 15 The Hong Kong Securities and Futures Commission (SFC) said on Wednesday it had reprimanded and fined State Street Global Advisors Asia Ltd (SSGA) HK$4 million ($515 477) for alleged failures relating to the investment firm's tracker fund.",
        "date": "06152016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "HK securities regulator fines State Street arm for tracker fund failures "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.34 per share    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05192016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street sets quarterly cash dividend of $0.34 per share "
    },
    {
        "content": "* Offering Of $750 Million Principal Amount Of 1.950% Senior Notes Due 2021  $750 Million Principal Amount Of 2.650% Senior Notes Due 2026  Source (http://bit.ly/23XuH74) Further company coverage:",
        "date": "05182016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street files for offering of $1.5 bln senior notes "
    },
    {
        "content": "* On operating basis  sees long-term targets of revenue growth of 8-12 percent  EPS growth of 10-15 percent  ROE growth of 12-15 percent  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05182016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street sees long-term target of EPS growth of 10-15 pct on operating basis "
    },
    {
        "content": "State Street Corp is nearing a deal to pay more than $500 million to end long-running investigations over allegations that the custody bank dishonestly overcharged clients on currency transactions  the Wall Street Journal reported.",
        "date": "05162016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street likely to pay over $500 million to settle lawsuits: WSJ "
    },
    {
        "content": "May 11 State Street Global Advisors (SSGA)  the asset management business of State Street Corp  promoted Jim Ross as chairman for Global SPDR and SSGA funds management.",
        "date": "05112016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-SSGA names Jim Ross as chairman of funds management unit "
    },
    {
        "content": "May 16 State Street Corp is nearing a deal to pay more than $500 million to end long-running investigations over allegations that the custody bank dishonestly overcharged clients on currency transactions  the Wall Street Journal reported.",
        "date": "05162016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street likely to pay over $500 mln to settle lawsuits-WSJ "
    },
    {
        "content": "* State Street Corp nearing deal to pay more than $500 million to end probes into alleged overcharges - WSJ  citing sources",
        "date": "05162016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street nearing deal to end probes into alleged overcharges - WSJ "
    },
    {
        "content": "* Files for potential notes offering; size not disclosed - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05162016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street files for potential notes offering "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 27 (Fitch) State Street Corporation's (STT) first quarter 2016  (1Q16) earnings were impacted by a weaker global market environment  according  to Fitch Ratings. On a GAAP basis this dropped the company's return on average  equity (ROE) to 6.8% in 1Q16  down from 11.6% in the sequential quarter and 7.9%  in the year-ago quarter. This quarter's results included a $62 million net after  tax restructuring charge ($97 million",
        "date": "04272016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch: Weaker Markets Weigh on State Street's 1Q16 Results "
    },
    {
        "content": "* Quarter 2016 GAAP-basis EPS of $0.79 on revenue of $2.5 billion",
        "date": "04272016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street reports Q1 earnings $0.79/shr "
    },
    {
        "content": "BOSTON Massachusetts' top securities regulator on Wednesday alleged a unit of custody bank State Street Corp  routinely overbilled customers for items such as messaging services  even as an executive worried one client might \"discover that we are taking them to the cleaners.\"",
        "date": "04202016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Massachusetts regulator says State Street unit overcharged clients "
    },
    {
        "content": "BOSTON  April 20 Massachusetts' top securities regulator on Wednesday alleged a unit of custody bank State Street Corp routinely overbilled customers for items such as messaging services  even as an executive worried one client might \"discover that we are taking them to the cleaners.\"",
        "date": "04202016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 2-Massachusetts regulator says State Street unit overcharged clients "
    },
    {
        "content": "BOSTON  April 20 Massachusetts' top securities regulator on Wednesday charged that a unit of custody bank State Street Corp. overcharged custodial clients  including pension  mutual and hedge funds.",
        "date": "04202016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Massachusetts says State Street unit overcharged clients "
    },
    {
        "content": "* On april 11  co  issued and sold 20 million depositary shares",
        "date": "04112016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street says issued and sold 20 mln depositary shares "
    },
    {
        "content": "* Says CEO Joseph L. Hooley FY 2015 total compensation $11.3 million versus $14.1 million in FY 2014 - SEC Filing",
        "date": "04072016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street CEO's 2015 total compensation $11.3 mln vs $14.1 mln in 2014 - SEC Filing "
    },
    {
        "content": "April 5 U.S. prosecutors announced charges on Tuesday against two former State Street Corp executives for engaging in a scheme to defraud six clients through secret commissions applied to billions of dollars of trades.",
        "date": "04052016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Ex-State Street executives charged in U.S. for defrauding clients "
    },
    {
        "content": "April 5 U.S. prosecutors announced charges on Tuesday against two former State Street Corp executives for scheming to defraud six clients  including Irish and British government pension funds  through secret commissions on billions of dollars of trades.",
        "date": "04052016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 2-Ex-State Street executives charged in U.S. for defrauding clients "
    },
    {
        "content": "March 31 Northern Trust Corp said it appointed Joseph Gillingwater as head of fixed income securities lending trading for Europe  Middle East and Africa (EMEA) region and Asia-Pacific (APAC) region.",
        "date": "03312016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-Northern Trust hires State Street's Joseph Gillingwater "
    },
    {
        "content": "March 30 State Street Corp said it would buy General Electric Co's asset management business for up to $485 million as the industrial conglomerate winds down its financing arm to reduce regulatory burden.",
        "date": "03302016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "UPDATE 1-State Street to buy GE Asset Management for up to $485 mln "
    },
    {
        "content": "March 31 State Street Global Advisors  the asset management business of State Street Corp  said it appointed Julian Harding as managing director and global head of core beta research.",
        "date": "03312016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "MOVES-State Street Global Advisors names global head of core beta research "
    },
    {
        "content": "* Deal to buy ge asset management includes $50 million tied to incremental opportunities with ge  in addition to purchase price of $435 million  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "03302016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street to buy GE Asset Management "
    },
    {
        "content": "* Transaction expected to be accretive to operating-basis eps for the first full 12-month period following the close of the transaction",
        "date": "03302016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BRIEF-State Street to buy GE Asset Management for up to $485 mln "
    },
    {
        "content": "March 30 State Street Corp said it would buy General Electric Co's asset management business for up to $485 million.",
        "date": "03302016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street to buy GE Asset Management for up to $485 mln "
    },
    {
        "content": "* \u007festimate charges will include approximately $250 million to $300 million in severance  benefits costs associated with targeted staff reductions\u007f",
        "date": "03152016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "BRIEF-State Street Corp updates on restructuring charges "
    },
    {
        "content": "Feb 8 State Street Global Advisors (SSGA)  the asset management business of State Street Corp appointed Bernhard Wenger as head of SPDR ETFs in Switzerland.",
        "date": "02082016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-State Street Global Advisors names SPDR ETFs head in Switzerland "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 28 (Fitch) State Street Corporation's (STT) fourth quarter 2015  earnings were satisfactory in Fitch Ratings' opinion. On a stated basis  STT's  return on average common equity (ROE) was 11.6% in 4Q15 up from 11.3% in the  sequential quarter and 9.45 in the year-ago quarter. These results were impacted  by an $81 million gain related to the final payoff from a commercial real estate  loan acquired as a result of the Leh",
        "date": "01282016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch: Satisfactory 4Q15 Results for State Street "
    },
    {
        "content": "BOSTON Shares of State Street Corp fell about 5 percent on Wednesday after the custody bank reported a decline in fourth-quarter revenue and heavy withdrawals by large institutional clients.",
        "date": "01272016",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Institutional clients hit State Street with large withdrawals "
    },
    {
        "content": "NEW YORK  Jan 26 The ETF boom may be leaving its architect behind.",
        "date": "01262016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "As ETFs explode in popularity  industry pioneer State Street lags "
    },
    {
        "content": "BOSTON  Jan 27 Shares of State Street Corp  fell about 5 percent on Wednesday after the custody bank reported a decline in fourth-quarter revenue and heavy withdrawals by large institutional clients.",
        "date": "01272016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 2-Institutional clients hit State Street with large withdrawals "
    },
    {
        "content": "BOSTON  Jan 27 A key institutional client at State Street is expected to withdraw a large amount of money in 2016  Chief Executive Jay Hooley said on Wedesday.",
        "date": "01272016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Big client hits State Street with large withdrawals "
    },
    {
        "content": "NEW YORK  Jan 26 The ETF boom may be leaving its architect behind.",
        "date": "01262016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 1-As ETFs explode in popularity  industry pioneer State Street lags "
    },
    {
        "content": "WASHINGTON  Jan 14 State Street Corp. will pay $12 million to settle allegations that it conducted a pay-to-play scheme to win Ohio pension fund contracts  U.S. regulators said Thursday.",
        "date": "01142016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street to pay $12 mln to settle pay-to-play scheme in Ohio "
    },
    {
        "content": "WASHINGTON State Street Corp will pay $12 million to settle allegations that it conducted a pay-to-play scheme to win Ohio pension fund contracts  U.S. regulators said Thursday.",
        "date": "01142016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street to pay $12 million to settle pay-to-play scheme in Ohio "
    },
    {
        "content": "WASHINGTON  Jan 14 State Street Corp  will pay $12 million to settle allegations that it conducted a pay-to-play scheme to win Ohio pension fund contracts  U.S. regulators said Thursday.",
        "date": "01142016",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 2-State Street to pay $12 mln to settle pay-to-play scheme in Ohio "
    },
    {
        "content": "Dec 8 A federal appeals court on Tuesday overturned a U.S. Securities and Exchange Commission decision to hold two former State Street Corp executives liable for misleading investors about a seemingly low-risk mutual fund's exposure to subprime bonds.",
        "date": "12082015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "U.S. appeals court overturns SEC commissioners in State Street case "
    },
    {
        "content": "BOSTON  Dec 2 State Street Corp's asset management arm on Wednesday launched its first fossil-fuel free exchange-traded fund  citing investors' concerns over climate change.",
        "date": "12022015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street launches fossil fuel-free ETF  cites climate worries "
    },
    {
        "content": "Nov 11 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11112015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-Lloyds Banking  Hercules Technology  State Street Global "
    },
    {
        "content": "Nov 11 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11112015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "MOVES- Lloyds Banking  State Street Global  Barnett Waddingham "
    },
    {
        "content": "NEW YORK/BOSTON Nov 6 Three top U.S. asset managers shied away from supporting dissident directors in recent proxy contests  according to voting data  showing how corporate management teams can still depend on key players in the fund industry for backing in the face of an activist fight.",
        "date": "11062015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Top fund firms stay conservative in support for activists-report "
    },
    {
        "content": "NEW YORK  Oct 30 A rule proposed by the U.S. Department of Labor that would set new standards for financial advisers serving retirement accounts could send $1 trillion in new assets to passive investment products  analysts at Morningstar Inc said Friday.",
        "date": "10302015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "$1 trillion could move to index funds if rule on financial advice passes -analyst "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 23 (Fitch) State Street Corporation's (STT) third quarter 2015  (3Q15) earnings were impacted by weaknesses in global markets which weighed on  the company's assets under custody and administration (AUCA) and assets under  management (AUM) levels  according to Fitch Ratings.   Overall return on average equity (ROAE) was 11.3% in 3Q15  up from 8.3% in the  sequential quarter which was marred by litigation accruals regard",
        "date": "10232015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch: Challenging Global Markets Weigh on State Street's Earnings "
    },
    {
        "content": "BOSTON  Oct 23 State Street Corp said on Friday third-quarter net income was little changed as low equity values and interest rates hurt revenue  and said it plans staff cuts.",
        "date": "10232015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street net income flat  plans job cuts "
    },
    {
        "content": "BOSTON  Oct 23 State Street Corp said on Friday third-quarter net income was little changed as low equity values and interest rates hurt revenue  and said it plans to cut 600 jobs worldwide.",
        "date": "10232015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 1-State Street net income flat  plans job cuts "
    },
    {
        "content": "* Graphic of Russian valuations: http://link.reuters.com/xyh55w",
        "date": "09252015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "As Russian oil profits hold up  Goldman says \"buy\"; taxman says \"tax\" "
    },
    {
        "content": "BOSTON  Sept 22 An executive for State Street Global Advisors said it voted to let Bank of America  Chief Executive Brian Moynihan keep his additional title of chairman  votes that helped him retain the role at the bank's shareholder meeting held earlier on Tuesday.",
        "date": "09222015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street  a top B of A shareholder  says supported Moynihan in vote "
    },
    {
        "content": "The Canada Pension Plan Investment Board said on Tuesday it has voted to strip Bank of America Corp Chief Executive Officer Brian Moynihan of his chairman's title  the biggest shareholder so far to declare its intentions in a closely watched corporate governance contest.",
        "date": "09222015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Canada pension fund votes to separate Bank of America roles "
    },
    {
        "content": "Sept 22 The Canada Pension Plan Investment Board said on Tuesday it has voted to strip Bank of America Corp  Chief Executive Officer Brian Moynihan of his chairman's title  the biggest shareholder so far to declare its intentions in a closely watched corporate governance contest.",
        "date": "09222015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 1-Canada pension fund votes to separate Bank of America roles "
    },
    {
        "content": "BOSTON/NEW YORK  Sept 11 Big mutual funds are likely to vote later this month to allow Bank of America Corp  Chief Executive Brian Moynihan to retain his chairman title  based on their voting history  governance experts said.",
        "date": "09112015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Top funds likely to back dual role for BofA's Moynihan -experts "
    },
    {
        "content": "LONDON  Sept 15 Nine of the world's biggest banks including Goldman Sachs and Barclays have joined forces with New York-based financial tech firm R3 to create a framework for using blockchain technology in the markets  the firm said on Tuesday.",
        "date": "09152015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "Nine of world's biggest banks join to form blockchain partnership "
    },
    {
        "content": "BNY Mellon Corp was scrambling to fix a computer glitch on Wednesday that has delayed how billions of dollars of assets are valued  throwing the U.S. funds industry into disarray and damaging the reputation of the world's largest custody bank.",
        "date": "08262015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BNY Mellon pricing glitch affects billions of dollars of funds "
    },
    {
        "content": "Aug 26 BNY Mellon Corp was scrambling to fix a computer glitch on Wednesday that has delayed how billions of dollars of assets are valued  throwing the U.S. funds industry into disarray and damaging the reputation of the world's largest custody bank.",
        "date": "08262015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 2-BNY Mellon pricing glitch affects billions of dollars of funds "
    },
    {
        "content": "BOSTON State Street Corp's stock fell as much as 5 percent on Friday after the U.S. custody bank said its second-quarter expenses grew faster than revenue.",
        "date": "07242015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street shares drop 5 percent as expenses outpace revenue growth "
    },
    {
        "content": "BOSTON  July 24 State Street Corp's stock fell as much as 5 percent on Friday after the U.S. custody bank said its second-quarter expenses grew faster than revenue.",
        "date": "07242015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "UPDATE 1-State Street shares drop 5 pct as expenses outpace revenue growth "
    },
    {
        "content": "BOSTON  July 24 State Street Corp's stock fell 5 percent on Friday after the U.S. custody bank said its second-quarter profit fell from year-earlier levels and expenses grew faster than revenue.",
        "date": "07242015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street shares drop 5 pct as expenses grow faster than revenue "
    },
    {
        "content": "June 18 State Street Corp said it may face enforcement action by the U.S. Securities and Exchange Commission following investigations related to solicitation of asset servicing business for public retirement plans.",
        "date": "06182015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street says SEC may file charges "
    },
    {
        "content": "June 15 State Street Global Advisors  the investment management arm of State Street Corp  named Elliot Hentov head of policy and research of its official institutions group (OIG).",
        "date": "06152015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-State Street Global Advisors hires Elliot Hentov "
    },
    {
        "content": "June 1 Financial services provider State Street Corp appointed Effie Datson global head of product for alternative investment solutions.",
        "date": "06012015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES-Effie Datson joins State Street from Deutsche Bank "
    },
    {
        "content": "NEW YORK  May 13 The biggest providers of exchange-traded funds  which have been funneling billions of investor dollars into some little-traded corners of the bond market  are bolstering bank credit lines for cash to tap in the event of a market meltdown.",
        "date": "05132015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "INSIGHT-ETF companies boost bank credit lines amid liquidity concern "
    },
    {
        "content": "May 6 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05062015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES- Credit Suisse  Research Affiliates  State Street Corp  Morgan Stanley "
    },
    {
        "content": "May 6 Financial services provider State Street Corp appointed Pieter De Jong head of State Street Global Services in the Netherlands.",
        "date": "05062015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "MOVES-Pieter Jong to head State Street Global Services in Netherlands "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 24 (Fitch) State Street Corporation's (STT) first quarter 2015  earnings of $377 million were down relative to the sequential quarter due in  part to litigation accrual of $150 million due to issues surrounding foreign  exchange (FX) practices. These earnings equated to a 7.9% return on average  common equity  which according to Fitch Ratings  is below long-term  expectations. Relative to the year-ago quarter earnings inc",
        "date": "04242015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch: Litigation Accrual Impacts State Street's 1Q15 Earnings "
    },
    {
        "content": "BOSTON State Street  which sold the first exchange-traded fund in 1993  is falling flat in its bid to win back market share in the ETF industry by wooing advisers to retail investors  with many advisers saying the bank doesn't do enough to support them.",
        "date": "04222015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "State Street lags with financial advisers as market share slips "
    },
    {
        "content": "April 14 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04142015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES- Credit Suisse  State Street  Citi  Standard Chartered "
    },
    {
        "content": "April 14 State Street Corp has appointed Alex Lawton senior managing director and head of securities finance for State Street Global Markets in Europe  the Middle-East and Africa.",
        "date": "04142015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "MOVES-State Street names Alex Lawton senior managing director "
    },
    {
        "content": "BOSTON  April 6 Ron O'Hanley  the new leader of State Street's $2.45 trillion asset management division  says he will look closely at expanding the bank's stable of bond-related products as exchange-traded funds run by rivals Vanguard and BlackRock have been more dominant in attracting investor money.",
        "date": "04062015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street may roll out more ETFs linked to star managers "
    },
    {
        "content": "March 31 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03312015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "MOVES- State Street  Barclays  Investec Wealth  Columbia Threadneedle "
    },
    {
        "content": "NEW YORK  Feb 3 State Street Corp said on Tuesday it has slashed management fees on 41 of its SPDR exchange-traded funds  joining major ETF providers BlackRock Inc  and Vanguard in their efforts to lower fees as price competition heats up.",
        "date": "02032015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "State Street cuts fees on 41 ETFs as price competition heats up "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 26 (Fitch) On a stated basis  State Street Corporation's (STT)  fourth quarter 2014 (4Q14) earnings performance was down modestly relative to  both the sequential and year-ago quarters.  STT's return on average equity (ROE)  was 10.4% in 4Q14  down modestly from 10.6% in 3Q14)  and down from 10.9% in  4Q13. On an operating basis  which excludes a few expenses related to litigation and  restructuring  to name a few  the",
        "date": "01262015",
        "name": "State Street Corporation",
        "news_type": "topStory",
        "symbol": "STT",
        "title": "Fitch:  Higher Market-Based Revenue Helps Support State Street's 4Q14 Earnings "
    },
    {
        "content": "Jan 23 BNY Mellon Corp and State Street Corp  the world's two largest custody banks  said on Friday their fourth-quarter profits got a boost from a surge in volume and volatility in foreign currency markets.",
        "date": "01232015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BNY Mellon  State Street get profit boost from forex trading "
    },
    {
        "content": "NEW YORK  Jan 5 Investors poured $102.8 billion in new money into BlackRock Inc's exchange-traded funds in 2014  setting a record in global flows for its iShares ETF business  the company said on Monday.",
        "date": "01052015",
        "name": "State Street Corporation",
        "news_type": "normal",
        "symbol": "STT",
        "title": "BlackRock grabs $102.8 bln in ETF flows in 2014  setting record "
    }
]