[
    {
        "content": "TOKYO/SAN FRANCISCO Seagate Technology PLC   a member of the group taking over Toshiba Corp's  chip unit  pledged not to buy any stake in the unit for 10 years as part of the $18 billion deal  showed a document from group leader Bain Capital LP reviewed by Reuters.",
        "date": "10262017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "Seagate pledges not to buy stake in Toshiba chip unit for 10 years: Bain document "
    },
    {
        "content": "TOKYO/SAN FRANCISCO  Oct 26 Seagate Technology PLC  a member of the group taking over Toshiba Corp's chip unit  pledged not to buy any stake in the unit for 10 years as part of the $18 billion deal  showed a document from group leader Bain Capital LP reviewed by Reuters.",
        "date": "10262017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "Seagate pledges not to buy stake in Toshiba chip unit for 10 years -Bain document "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 02 (Fitch) Fitch Ratings has affirmed Seagate Technology Plc's (Seagate) ratings at 'BBB-' following the company's announcement it will participate in the consortium buying Toshiba's memory chip business. The Rating Outlook is Negative. Fitch's actions affect $6 billion of total debt  including the undrawn $700 million senior secured revolving credit facility (RCF). A full list of rating actions follows at the end of th",
        "date": "10022017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "Fitch Affirms Seagate Technologies at 'BBB-'; Outlook Negative "
    },
    {
        "content": "Seagate Technology PLC said on Thursday it would contribute up to $1.25 billion toward the purchase of Toshiba Corp's chip unit by a consortium led by Bain Capital LP.",
        "date": "09282017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "Seagate to give $1.25 billion of $18 billion deal to buy Toshiba chip unit "
    },
    {
        "content": "* Seagate to participate in consortium led by Bain Capital Private Equity to acquire Toshiba Memory Corporation",
        "date": "09282017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "BRIEF-Seagate to participate in consortium led by Bain Capital to acquire Toshiba Memory Corp "
    },
    {
        "content": "Sept 28 Seagate Technology PLC said on Thursday it would contribute up to $1.25 billion towards the purchase of Toshiba Corp's chip unit by a consortium led by Bain Capital LP.",
        "date": "09282017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "Seagate to give $1.25 bln of $18 bln deal to buy Toshiba chip unit "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 27 (Fitch) Fitch Ratings has affirmed the ratings for Seagate Technology Plc (Seagate)  including the Long-Term Issuer Default Rating (IDR) at 'BBB-'. The Rating Outlook remains Negative. Fitch's actions affect $6 billion of total debt  including the undrawn $700 million senior secured revolving credit facility (RCF). A full list of ratings follows at the end of this release. KEY RATING DRIVERS --Long-Term Growth Head",
        "date": "09272017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "Fitch Affirms Seagate Technology at 'BBB-'; Outlook Remains Negative "
    },
    {
        "content": "SEOUL/TOKYO South Korea's SK Hynix Inc  said on Wednesday its board had approved its participation in a Bain Capital-led consortium that plans to purchase Toshiba Corp's  memory chip unit for 2 trillion yen ($17.7 billion).",
        "date": "09272017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "SK Hynix set to invest in Toshiba chip unit  details consortium's plans "
    },
    {
        "content": "* May take stake of no more than 15 pct of chip unit in future",
        "date": "09272017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "UPDATE 3-SK Hynix set to invest in Toshiba chip unit  details consortium's plans "
    },
    {
        "content": "* Seagate and Tencent establish strategic partner relationship and commence all-round cooperation",
        "date": "09192017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate  Tencent establish strategic partner relationship "
    },
    {
        "content": "* Seagate and Baidu sign strategic cooperation agreement for big data analysis and advanced storage implementation",
        "date": "09182017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate  Baidu sign strategic cooperation agreement "
    },
    {
        "content": "* ValueAct Capital Master Fund says on Aug 31  entered into a stock purchase agreement with Morgan Stanley related to Seagate Technology ‍",
        "date": "09012017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-ValueAct Capital Master Fund says on Aug 31  entered into a stock purchase agreement with Morgan Stanley related to Seagate Technology ‍ "
    },
    {
        "content": "* Valueact Capital Master Fund L.P reports 7.2 percent stake in Seagate Technology PLC  as of  July 31  2017‍​",
        "date": "08112017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Valueact Capital Master Fund reports 7.2 percent stake in Seagate Technology ‍​ "
    },
    {
        "content": "* Cray to expand storage portfolio through strategic transaction and partnership with Seagate",
        "date": "07262017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Cray to expand storage portfolio through strategic transaction and partnership with Seagate "
    },
    {
        "content": "* Seagate Technology Plc -  on July 25  2017  company committed to an additional restructuring plan to reduce its cost structure",
        "date": "07252017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology Plc says company committed to an additional restructuring plan to reduce its cost structure "
    },
    {
        "content": "* Seagate Technology Plc says has unanimously voted to appoint Dave Mosley  co's president and chief operating officer  as CEO effective October 1",
        "date": "07252017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology appoints Dave Mosley as CEO effective October 1 "
    },
    {
        "content": "* Seagate Technology reports fiscal fourth quarter and fiscal year 2017 financial results",
        "date": "07252017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology Q4 revenue $2.4 billion "
    },
    {
        "content": "* Seagate appoints Kate Schuelke SVP  chief legal officer and corporate secretary Source text for Eikon: Further company coverage:",
        "date": "06292017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate appoints Kate Schuelke SVP  chief legal officer and corporate secretary "
    },
    {
        "content": "* On Feb 3  2017  Seagate HDD Cayman $750 million in aggregate principal amount of 4.250% Senior Notes due 2022 - SEC filing",
        "date": "02032017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology plc's unit issues principal amounts of Senior Notes due 2022 and 2024 "
    },
    {
        "content": "* Seagate Technology announces pricing of $1.25 billion of senior unsecured notes offering  Source text for Eikon: (http://bit.ly/2jSgGup) Further company coverage:",
        "date": "01312017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology announces pricing of $1.25 bln of senior unsecured notes offering "
    },
    {
        "content": "* Seagate technology - expects a u.s. Dollar-Denominated offering of notes in a private placement after planned meeting with investors on or about jan 30  Source text:(http://bit.ly/2kAQ7aX) Further company coverage:",
        "date": "01272017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate expects a U.S. Dollar-Denominated offering of notes in a private placement "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 31 (Fitch) Fitch Ratings has rated Seagate Technology Plc's  (Seagate) $1.25 billion senior notes offering 'BBB-'. The Long-Term Issuer  Default Rating (IDR) is 'BBB-' and the Rating Outlook remains Negative. A full  list of current ratings follows at the end of this release. Fitch expects the company will use net proceeds from the senior notes offering  for general corporate purposes  including to pre-fund the repaymen",
        "date": "01312017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "Fitch Rates Seagate's Senior Notes Offering 'BBB-' "
    },
    {
        "content": "* Seagate Technology announces offering of senior unsecured notes  Source text for Eikon:  Further company coverage:    (Bangalore.newsroom@thomsonreuters.com)",
        "date": "01312017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology says offering senior unsecured notes "
    },
    {
        "content": "* Announces offering of senior unsecured notes in private placement  Source text: http://bit.ly/2jPX75Y Further company coverage:",
        "date": "01312017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "BRIEF-Seagate announces offering of senior unsecured notes "
    },
    {
        "content": "Hard-disk drive maker Seagate Technology Plc forecast current-quarter revenue above estimates  buoyed by strong demand for its cloud-based storage products.",
        "date": "01242017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "Seagate forecasts third-quarter revenue above estimates "
    },
    {
        "content": "Jan 24 Hard-disk drive maker Seagate Technology Plc forecast current-quarter revenue above estimates  buoyed by strong demand for its cloud-based storage products.",
        "date": "01242017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "UPDATE 2-Seagate forecasts 3rd-qtr revenue above estimates "
    },
    {
        "content": "* Seagate technology reports fiscal second quarter 2017 financial results",
        "date": "01242017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology reports Q2 adj. earnings per share of $1.38 "
    },
    {
        "content": "Jan 24 Hard-disk drive maker Seagate Technology Plc reported a 3.1 percent drop in quarterly revenue  hurt by a fall in prices and slowing demand.",
        "date": "01242017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "Hard-drive maker Seagate's revenue slips 3.1 pct "
    },
    {
        "content": "* Seagate - made decision to shut down its suzhou factory on January 10th  2017  and dismiss relevant employees there.",
        "date": "01112017",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate made decision to shut down its Suzhou Factory "
    },
    {
        "content": "Jan 11 Hard-disk drive maker Seagate Technology Plc said it would cut more than 2 000 jobs as it shuts down its Suzhou factory in China.",
        "date": "01112017",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "Seagate to cut more than 2 000 jobs in China "
    },
    {
        "content": "* Says expects to report revenue of about $2.8 billion  and GAAP and non-GAAP gross margin of about 29 percent in Q1",
        "date": "10112016",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate says expects to report revenue of about $2.8 bln in Q1 "
    },
    {
        "content": "Seagate Technology Plc has invited ValueAct Capital in as an investor  selling a roughly 4 percent stake to the activist hedge fund  which will also get a front-row view of its board meetings  the hard-drive maker said on Friday.",
        "date": "09092016",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "Seagate Tech invites ValueAct in as major shareholder "
    },
    {
        "content": "Sept 9 Seagate Technology Plc has invited ValueAct Capital in as an investor  selling a roughly 4 percent stake to the activist hedge fund  which will also get a front-row view of its board meetings  the hard-drive maker said on Friday.",
        "date": "09092016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "UPDATE 2-Seagate Tech invites ValueAct in as major shareholder "
    },
    {
        "content": "* Seagate technology executes secondary block trade transaction with valueact capital",
        "date": "09092016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology says ValueAct Capital buys stake in co "
    },
    {
        "content": "Sept 9 Seagate Technology Plc has sold a stake in itself to ValueAct Capital in a deal that also provides the activist hedge fund with a front-row view of its board meetings  the hard-drive maker said on Friday.",
        "date": "09092016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "ValueAct buys stake in Seagate Technology "
    },
    {
        "content": "* Seagate technology reports fiscal fourth quarter and fiscal year 2016 financial results",
        "date": "08022016",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology Q4 earnings per share $0.23 "
    },
    {
        "content": "Seagate Technology Plc  estimated fourth-quarter revenue higher than Wall Street expectations  helped by strong demand for hard-disk drives.",
        "date": "07112016",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "Seagate's fourth-quarter revenue estimate beats Street view "
    },
    {
        "content": "July 11 Seagate Technology Plc estimated fourth-quarter revenue higher than Wall Street expectations  helped by strong demand for hard-disk drives.",
        "date": "07112016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "UPDATE 1-Seagate's fourth-quarter revenue estimate beats Street view "
    },
    {
        "content": "July 11 Hard-disk drive maker Seagate Technology Plc estimated revenue of about $2.65 billion for the fourth quarter ended July 1  lower than a year earlier.",
        "date": "07112016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "Seagate expects lower fourth-quarter revenue "
    },
    {
        "content": "June 29 Hard-disk drive maker Seagate Technology Plc said it was cutting about 1 600 jobs  or 3 percent of its workforce  as part of a restructuring plan to reduce costs.",
        "date": "06292016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "Seagate to cut 1 600 jobs in restructuring plan "
    },
    {
        "content": "June 29 Hard-disk drive maker Seagate Technology Plc said it would cut about 1 600 jobs  or 3 percent of its workforce  as the company looks to rein in costs amid waning demand.",
        "date": "06292016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "UPDATE 1-Seagate to cut 1 600 jobs in restructuring plan "
    },
    {
        "content": "* Announced restructuring plan to reduce co's global headcount by approximately 1 600 employees or 3% of its global headcount",
        "date": "06292016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology to cut 1 600 jobs in restructuring plan "
    },
    {
        "content": "* Appointed William Mosley to position of president and chief operating officer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06272016",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology appointed William Mosley as COO "
    },
    {
        "content": "* Seagate Technology reports fiscal third quarter 2016 financial results",
        "date": "04292016",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "BRIEF-Seagate Technology posts Q3 adj. earnings per share $0.22 "
    },
    {
        "content": "April 13 Hard-disk drive maker Seagate Technology Plc estimated third-quarter revenue and adjusted gross margin below its forecast due to reduced demand for its products  primarily in China.",
        "date": "04132016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "Seagate estimates disappointing rev as demand falls in China "
    },
    {
        "content": "April 13 Seagate Technology Plc  estimated third-quarter revenue and adjusted gross margin below its forecast due to reduced demand for its storage devices  primarily in China.",
        "date": "04132016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "UPDATE 1-Seagate estimates disappointing rev as demand falls in China "
    },
    {
        "content": "* Sees non-gaap gross margin of approximately 23% for fiscal q3 2016",
        "date": "04132016",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "BRIEF-Seagate technology sees Q3 non-gaap gross margin of about 23% "
    },
    {
        "content": "Hard-disk maker Seagate Technology Plc said it planned to cut 1 050 jobs  or 2 percent of its workforce  as part of a restructuring program.",
        "date": "09102015",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "Hard-disk maker Seagate to cut 1 050 jobs worldwide "
    },
    {
        "content": "Sept 10 Hard-disk maker Seagate Technology Plc  said it planned to cut 1 050 jobs  or 2 percent of its workforce  as part of a restructuring program.",
        "date": "09102015",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "UPDATE 1-Hard-disk maker Seagate to cut 1 050 jobs worldwide "
    },
    {
        "content": "Sept 10 Hard-disk maker Seagate Technology Plc  said it plans to cut 1 050 jobs  or 2 percent of its workforce  as part of a restructuring plan.",
        "date": "09102015",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "Seagate to cut 1 050 jobs "
    },
    {
        "content": "Hard-drive maker Seagate Technology Plc's  revenue forecast for the current quarter fell well short of analyst estimates  largely due to weakness in Europe  sending the company's shares down as much as 12 percent.",
        "date": "01262015",
        "name": "Seagate Technology PLC",
        "news_type": "topStory",
        "symbol": "STX",
        "title": "Weak retail business in Europe hits Seagate revenue "
    },
    {
        "content": "* Shares fall almost 12 pct   (Adds analyst comments  updates share movement)",
        "date": "01262015",
        "name": "Seagate Technology PLC",
        "news_type": "normal",
        "symbol": "STX",
        "title": "UPDATE 3-Weak retail business in Europe hits Seagate revenue "
    }
]