[
    {
        "content": "NEW YORK (Reuters Breakingviews) - Ever since Colorado  Washington and other states legalized marijuana  the conventional wisdom has been that the U.S. weed business would in a matter of years move from a cottage industry into the arms of Big Tobacco. But Constellation Brands  maker of Svedka vodka and Corona beer  just dropped something into that punchbowl. It's taking the legit ganja party up a notch.",
        "date": "10302017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Breakingviews - Constellation Brands takes the party up a notch "
    },
    {
        "content": "Oct 30 Constellation Brands Inc has bought a nearly 10 percent stake in Canadian cannabis maker Canopy Growth Corp for about C$245 million ($191 million)  the first major wine  beer and spirits producer to invest in legal cannabis.",
        "date": "10302017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 4-Constellation hedges bets on pot boom with Canopy stake "
    },
    {
        "content": "* Constellation Brands to acquire minority stake in Canopy Growth Corporation",
        "date": "10302017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands takes 9.9% stake in Canopy Growth Corp "
    },
    {
        "content": "* Canopy Growth establishes groundbreaking strategic relationship with Constellation Brands",
        "date": "10302017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Canopy Growth gets C$245 mln investment from Constellation Brands "
    },
    {
        "content": "Oct 30 Constellation Brands Inc said on Monday it took a 9.9 percent stake in cannabis maker Canopy Growth Corp for about C$245 million ($191.06 million)  becoming the first major beer and spirits company to invest in legal cannabis.",
        "date": "10302017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands takes stake in marijuana maker Canopy Growth "
    },
    {
        "content": "* Earthquakes in Mexico did not have an impact on production operations there - CEO on Conf call",
        "date": "10052017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands plans to nationally launch Corona Premier beginning in fiscal 2019 "
    },
    {
        "content": "Constellation Brands Inc  posted a quarterly profit that beat Wall Street estimates for a ninth straight time and raised its profit outlook  as margins rose on the sale of more premium beers and breweries ran at peak levels in the summer.",
        "date": "10052017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation brews higher profit  lifts forecast on margin growth "
    },
    {
        "content": "* Lifts adj. EPS forecast to $8.25-$8.40 from previous $7.90-$8.10",
        "date": "10052017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 2-Constellation brews higher profit  lifts forecast on margin growth "
    },
    {
        "content": "* Constellation Brands Inc - ‍its purchase of Florida-based Funky Buddha Brewery​",
        "date": "08102017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Craft Brewer Funky Buddha joins Constellation Brands "
    },
    {
        "content": "* Constellation Brands elects Susan Somersille Johnson of Suntrust Banks Inc to its board of directors",
        "date": "07202017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands elects Susan Johnson to board of directors "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 02 (Fitch) Fitch Ratings plans to withdraw the ratings on Constellation Brands  Inc. (Constellation) on or about July 3  2017  which is approximately 30 days from the date of this NRAC  for commercial reasons. Fitch currently rates Constellation as follows: -- IDR at 'BBB-'; Outlook Stable; -- Senior secured revolver at 'BBB-'; -- Senior secured term loan A at 'BBB-'; -- Senior secured term loan A-1 at 'BBB-'; -- European ",
        "date": "06022017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Fitch Plans to Withdraw Ratings of Constellation Brands  Inc. "
    },
    {
        "content": "* CEO Robert Sands' FY 2017 total compensation was $9.6 million versus $9.3 million in FY 2016 - sec filing",
        "date": "06022017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands CEO Robert Sands' FY 2017 total compensation was $9.6 mln vs $9.3 mln in FY 2016 "
    },
    {
        "content": "May 24 Brown-Forman Corp  the maker of Jack Daniel's whiskey  said on Wednesday it was not for sale  following a media report that Corona beer maker Constellation Brands had offered to buy the company.",
        "date": "05242017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Jack Daniel's owner Brown-Forman says it is not for sale "
    },
    {
        "content": "Constellation Brands Inc   maker of Corona and Modelo beers  has offered to buy Jack Daniel's owner Brown-Forman Corp   CNBC reported on Tuesday  citing people with knowledge of the matter.",
        "date": "05232017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation Brands offers to buy Jack Daniel's owner: CNBC "
    },
    {
        "content": "May 23 Constellation Brands Inc  maker of Corona and Modelo beers  has offered to buy Jack Daniel's owner Brown-Forman Corp  CNBC reported on Tuesday  citing people with knowledge of the matter.",
        "date": "05232017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 1-Constellation Brands offers to buy Jack Daniel's owner - CNBC "
    },
    {
        "content": "May 23 Constellation Brands Inc  which makes Corona and Modelo beers  has offered to buy Jack Daniel's owner Brown-Forman Corp  CNBC reported on Tuesday  citing people with knowledge of the matter.",
        "date": "05232017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands offers to buy Jack Daniel's owner - CNBC "
    },
    {
        "content": "* Constellation Brands Inc files for potential mixed shelf; size  not disclosed Source text: (http://bit.ly/2prKiSm) Further company coverage:",
        "date": "05022017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands Inc files for potential mixed shelf size "
    },
    {
        "content": "Corona and Modelo brewer Constellation Brands Inc  gave a strong profit forecast for the current fiscal year  buoyed by its success of focusing on premium beers and spirits.",
        "date": "04062017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Corona maker Constellation gives 'premium' profit forecast "
    },
    {
        "content": "* Forecasts FY18 adj. profit of $7.70-$8.00/shr vs. est. $7.51/shr",
        "date": "04062017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 3-Corona maker Constellation gives 'premium' profit forecast "
    },
    {
        "content": "* Constellation brands reports fiscal 2017 results and fiscal 2018 outlook",
        "date": "04062017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands qtrly reported EPS $2.26 "
    },
    {
        "content": "April 6 Constellation Brands Inc  the no. 3 U.S. beer company   reported a 5.5 percent rise in quarterly sales on Thursday  helped by strong demand for its beers such as Ballast Point and Corona.",
        "date": "04062017",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Corona maker Constellation's quarterly revenue rises 5.5 pct "
    },
    {
        "content": "* Constellation Brands Inc - in his new role  Newlands will oversee beer division  wine & spirits division and growth organization",
        "date": "01252017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands names Bill Newlands as chief operating officer "
    },
    {
        "content": "Constellation Brands Inc   which makes most of its beer in Mexico  reported a higher-than-expected quarterly profit  but investors remained jittery about President-elect Donald Trump's proposals to tighten cross-border trade.",
        "date": "01052017",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation profit beat clouded by Trump tax proposals "
    },
    {
        "content": "* Constellation Brands Inc - new program is in addition to company's current $1 billion share repurchase program",
        "date": "11212016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-REG-Constellation Brands' board of directors authorizes new $1 billion share repurchase program "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 16 (Fitch) Fitch Ratings has upgraded the ratings of  Constellation Brands  Inc. (Constellation)  including the company's Issuer  Default Rating (IDR) to 'BBB-' from 'BB+'. A complete list of rating actions  follows at the end of this release. The Rating Outlook is Stable. The ratings upgrade for Constellation reflects the expected continuation of  strong operating momentum and Fitch's expectation that leverage will be",
        "date": "11162016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Fitch Upgrades Constellation's IDR to 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Sees fiscal 2016 U.S. GAAP diluted earnings per share $0.70 to $0.75",
        "date": "10282016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Bloomin' Brands reports Q3 earnings per share $0.18 "
    },
    {
        "content": "Oct 31 Constellation Brands Inc  owner of Corona and Modelo beer  said on Monday it would buy Obregon Brewery from Grupo Modelo  a subsidiary of Anheuser Busch InBev SA NV  for $600 million.",
        "date": "10312016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands to buy Obregon Brewery from Grupo Modelo "
    },
    {
        "content": "Oct 31 Constellation Brands Inc  owner of Corona and Modelo beer  said on Monday it would buy a brewery in Mexico from Grupo Modelo  a subsidiary of Anheuser Busch InBev SA NV  for $600 million.",
        "date": "10312016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 1-Constellation Brands to buy Obregon Brewery from Grupo Modelo "
    },
    {
        "content": "* Constellation Brands announces agreement to purchase brewery in obregon  mexico",
        "date": "10312016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands to purchase brewery in Obregon  Mexico "
    },
    {
        "content": "Oct 17 Constellation Brands Inc said it will sell its Canadian wine business to Ontario Teachers' Pension Plan in a deal valued at about C$1.03 billion ($775.02 million).",
        "date": "10172016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation to sell Canada wine business for C$1.03 billion "
    },
    {
        "content": "Oct 17 Constellation Brands Inc said on Monday it would sell its Canadian wine business to Ontario Teachers' Pension Plan for about C$1.03 billion ($775 million).",
        "date": "10172016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 1-Constellation to sell Canada wine business for C$1.03 billion "
    },
    {
        "content": "* Constellation has reached an agreement to sell its Canadian wine business to Ontario teachers' pension plan",
        "date": "10172016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands reaches an agreement to sell its Canadian wine business "
    },
    {
        "content": "* Constellation Brands Inc says agreement with Charles Smith Wines LLC to acquire Charles Smith Wines collection of five super and ultra premium wines  Source text for Eikon:  Further company coverage:",
        "date": "10172016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands to acquire Charles Smith Wines "
    },
    {
        "content": "Constellation Brands Inc  reported a better-than-expected 16.6 percent jump in quarterly sales  primarily driven by robust demand for its beers such as Corona and Modelo  and the company raised its full-year adjusted profit forecast. | Video ",
        "date": "10052016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation shares hit record high on strong results "
    },
    {
        "content": "* Exploring all options for Canadian wine business - CEO   (Adds CEO comments)",
        "date": "10052016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 3-Constellation shares hit record high on strong results "
    },
    {
        "content": "* Constellation Brands Executive Says Now Targeting EBIT Growth For Beer Business In High Teens Range For Fiscal 2017 - Conf Call",
        "date": "10052016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands Exec says Still evaluating IPO for Canadian Wine Business "
    },
    {
        "content": "Oct 5 Constellation Brands Inc reported a better-than-expected 16.6 percent jump in quarterly sales  primarily driven by robust demand for its beers such as Corona and Modelo  and the company raised its full-year profit forecast.",
        "date": "10052016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "CORRECTED-UPDATE 1-Constellation sales beat as beer demand surges; stock tracks new high "
    },
    {
        "content": "* Qtrly reported net sales $2 021 million versus $1 733 million last year",
        "date": "10052016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-REG-Constellation Brands reports second quarter fiscal 2017 results "
    },
    {
        "content": "Oct 5 Constellation Brands Inc reported a 16.6 percent jump in quarterly sales as the company benefited from strong demand for its beer brands  including Corona and Modelo.",
        "date": "10052016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands net sales jump 16.6 pct "
    },
    {
        "content": "* REG-Award-winning High West Distillery joins Constellation Brands",
        "date": "10052016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-REG-Award-winning High West Distillery joins Constellation Brands "
    },
    {
        "content": "* Constellation Brands eyes $1 billion sale of Canadian wine business - WSJ  citing sources",
        "date": "09302016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands eyes $1 billion sale of Canadian wine business - WSJ  citing sources "
    },
    {
        "content": "Sept 16 Cefour Wine & Beverage Partihandel Publ AB :",
        "date": "09162016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Cefour: Agreement with Constellation terminated by Dec. 31 "
    },
    {
        "content": "* CrossAmerica Partners LP: owner of CrossAmerica Partners LP's general partner  CST Brands Inc  enters into merger agreement with Alimentation Couche-Tard Inc.",
        "date": "08222016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Couche-Tard to buy CST's interest in CrossAmerica as part of merger with CST "
    },
    {
        "content": "* Announces merger agreement with Alimentation Couche-Tard Inc in a $4.4 billion cash merger transaction",
        "date": "08222016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-CST Brands says to merge with Alimentation Couche-Tard Inc "
    },
    {
        "content": "* Says it now expects will record pre-tax charge of about $38-$42 million during 13 weeks ended June 26  2016 related to sale of South Korean business",
        "date": "07252016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Bloomin' brands expects to record pre-tax charge related to sale of South Korean business "
    },
    {
        "content": "* Board of directors increased size of board from 10 to 11 members",
        "date": "07222016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands elects Frederic Cumenal of Tiffany & Co to its board "
    },
    {
        "content": "* Says updates fiscal 2017 reported basis EPS outlook to $5.98 - $6.28",
        "date": "06302016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands reports Q1 fiscal 2017 results "
    },
    {
        "content": "Constellation Brands Inc  reported a bigger-than-expected 15 percent jump in quarterly net sales  helped by higher demand for its Corona and Modelo beers during the Memorial Day weekend.",
        "date": "06302016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Memorial Day beer sales drive Constellation's results "
    },
    {
        "content": "June 30 Constellation Brands Inc  reported a bigger-than-expected 15 percent jump in quarterly net sales  helped by higher demand for its Corona and Modelo beers during the Memorial Day weekend.",
        "date": "06302016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 1-Memorial Day beer sales drive Constellation's results "
    },
    {
        "content": "June 30 Constellation Brands Inc  reported a 15 percent jump in quarterly net sales  helped by higher demand for its Corona and Modelo beer brands during the Memorial Day weekend  the second largest beer sales period in the United States.",
        "date": "06302016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands net sales jump 15 pct "
    },
    {
        "content": "June 3 Constellation Brands Inc is seeking a valuation of about C$1 billion ($772.02 million) for a possible initial public offering of its Canadian wine business this year  Bloomberg reported on Friday.",
        "date": "06032016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation seeks C$1 bln valuation for Canadian wine unit - Bbg "
    },
    {
        "content": "* CEO Robert Sands' 2016 total compensation was $9.3 million versus $8.6 million in 2015- SEC filing",
        "date": "06032016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands CEO Sands' 2016 compensation $9.3 mln - SEC filing "
    },
    {
        "content": "Constellation Brands Inc  said on Wednesday it was considering taking a part of its Canadian wine business public and reported better-than-expected quarterly net sales  helped by strong demand for its premium Corona and Modelo beers.",
        "date": "04062016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation considers IPO for part of Canadian wine business "
    },
    {
        "content": "* Shares rise as much as 4.88  touch record high   (Adds analyst comment; updates shares)",
        "date": "04062016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 3-Constellation considers IPO for part of Canadian wine business "
    },
    {
        "content": "* Agreed to acquire Prisoner Wine Company's portfolio of brands from Huneeus Vintners",
        "date": "04062016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "BRIEF-Constellation Brands agrees to buy Prisoner Wine Company's portfolio of brands from Huneeus Vintners "
    },
    {
        "content": "Jan 21 Dunkin' Brands Inc has signed a master franchise agreement with Grand Parade Investments Ltd to open its first Dunkin' Donuts and Baskin-Robbins restaurants in South Africa.",
        "date": "01212016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Dunkin' Brands to expand into South Africa "
    },
    {
        "content": "Alcoholic beverage maker Constellation Brands Inc reported better-than-expected quarterly net sales and profit  and said it plans to spend $1.5 billion to build a brewery in Mexico to meet growing demand for its Mexican beer brands.",
        "date": "01072016",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation shares soar on strong sales  new brewery plan "
    },
    {
        "content": "* Shares rise as much as 7.6 pct to record high   (Adds details on new plant  expansions; updates shares)",
        "date": "01072016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 2-Constellation shares soar on strong sales  new brewery plan "
    },
    {
        "content": "Jan 7 Constellation Brands Inc reported a 6.4 percent rise in third-quarter net sales  helped by higher demand for its Corona and Modelo beer brands.",
        "date": "01072016",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands' sales rise 6.4 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 17 (Fitch) Fitch Ratings has affirmed all of the ratings for  Constellation Brands Inc. (Constellation) and its subsidiary  CIH International  S.a.r.l.  including the Issuer Default Ratings (IDR) at 'BB+'. The rating  affirmation follows the announcement by Constellation that it has entered into a  definitive agreement to acquire Home Brew Mart which includes craft beer brand   Ballast Point  for a total consideration ",
        "date": "11172015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Fitch Affirms Constellation Brands' IDR at 'BB+' "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 19 (Fitch) Fitch Ratings has assigned a 'BB+/RR4' rating to  Constellation Brands  Inc.'s proposed $400 million senior unsecured notes  offering due 2025. The Rating Outlook is Stable. The company intends to use the net proceeds from this offering to fund a portion  of the consideration for Constellation's pending acquisition of Ballast Point   which is expected to close before Dec. 31  2015. Constellation expects to u",
        "date": "11192015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Fitch Rates Constellation's $400MM Sr. Notes 'BB+'; Outlook Stable "
    },
    {
        "content": "Constellation Brands Inc  said it will buy Sculpin IPA-owner Ballast Point Brewing & Spirits for about $1 billion to enter the fast-growing craft beer market  in what will be its biggest acquisition since 2012.",
        "date": "11162015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation Brands to buy craft beer brewer Ballast Point "
    },
    {
        "content": "* Constellation shares up 1.5 pct in afternoon trading   (Adds Constellation CEO comments  details  shares)",
        "date": "11162015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 2-Constellation Brands to buy craft beer brewer Ballast Point "
    },
    {
        "content": "Nov 16 Brewer Constellation Brands Inc  said it will buy San Diego-based craft beer maker Ballast Point Brewing & Spirits for about $1 billion to compete in the fast-growing craft beer market.",
        "date": "11162015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands to buy brewer Ballast Point for $1 bln "
    },
    {
        "content": "Constellation Brands Inc's  quarterly profit blew past Street estimates as sales of beers under its Corona and Modelo brands rose and a strong dollar helped cut production costs.",
        "date": "10072015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Corona  Modelo beers power Constellation's profit beat "
    },
    {
        "content": "* Shares rise 3 pct to a record high of $135.30   (Adds analyst comments  details  updates shares)",
        "date": "10072015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 3-Corona  Modelo beers power Constellation's profit beat "
    },
    {
        "content": "Oct 7 Constellation Brands Inc reported an 8.1 percent rise in quarterly net sales  helped by higher demand for beer under its Corona and Modelo brands.",
        "date": "10072015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands revenue rises 8 pct as beer sales jump "
    },
    {
        "content": "Constellation Brands Inc  reported a better-than-expected quarterly profit  helped by higher sales of its Corona and Modelo beers  and said it would buy the Meiomi wine brand for about $315 million.",
        "date": "07012015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation's profit beats Street; buys Meiomi wine brand "
    },
    {
        "content": "July 1 Constellation Brands Inc reported a better-than-expected quarterly profit  helped by higher sales of its Corona and Modelo beers  and said it would buy the Meiomi wine brand for about $315 million.",
        "date": "07012015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 1-Constellation's profit beats Street; buys Meiomi wine brand "
    },
    {
        "content": "July 1 Constellation Brands Inc reported a 15.4 percent rise in quarterly profit  helped by higher sales of its Corona and Modelo beers  and said it would buy the Meiomi wine brand for about $315 million.",
        "date": "07012015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands to buy Meiomi wine brand  profit rises 15 pct "
    },
    {
        "content": "MEXICO CITY Alcoholic beverage maker Constellation Brands Inc  said on Tuesday it is in the process of investing more than $2 billion in its Mexican operation.",
        "date": "06162015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation Brands to invest over $2 billion in Mexico beer plant expansion "
    },
    {
        "content": "MEXICO CITY  June 16 Alcoholic beverage maker Constellation Brands Inc said on Tuesday it is in the process of investing more than $2 billion in its Mexican operation.",
        "date": "06162015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 1-Constellation Brands to invest over $2 bln in Mexico beer plant expansion "
    },
    {
        "content": "MEXICO CITY  June 16 Alcoholic beverage maker Constellation Brands Inc said on Tuesday it is in the process of investing more than $2 billion in its Mexican installations.",
        "date": "06162015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands investing over $2 bln in Mexico "
    },
    {
        "content": " ((This April 9 story  corrects paragraph 1 and headline to say forecast was in line with estimates  not below expectations. Changes EPS forecast in paragraph 6 to \"$4.70-$4.90\" from\"$4.55-$4.75\"))",
        "date": "04102015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation Brands' full-year profit forecast in line with estimates "
    },
    {
        "content": "April 9 Alcoholic beverage maker Constellation Brands Inc forecast a profit for the fiscal year ending February that was largely in line with analysts' estimates and said it would spend more than $1 billion this year to expand its beer business.",
        "date": "04102015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "CORRECTED-UPDATE 1-Constellation Brands' full-year profit forecast in line with estimates (April 9) "
    },
    {
        "content": "April 9 Alcoholic beverage maker Constellation Brands Inc forecast a profit for the fiscal year ending February that fell short of analysts' estimates and said it would spend more than $1 billion this year to expand its beer business.",
        "date": "04092015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "UPDATE 1-Constellation Brands full-year profit forecast misses estimates "
    },
    {
        "content": "April 9 Alcoholic beverage maker Constellation Brands Inc reported a 36.5 percent rise in quarterly profit  helped by strong demand for its beer brands such as Corona and Modelo  and said it would initiate a cash dividend.",
        "date": "04092015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands profit jumps 36.5 pct on strong beer sales "
    },
    {
        "content": "NEW YORK  Jan 14 Constellation Brands Inc  said Wednesday it appointed Bill Newlands  a former Beam Suntory Inc executive  as chief growth officer as the company tries to expand its share of the market for import beers in the United States.",
        "date": "01142015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation Brands appoints chief growth officer "
    },
    {
        "content": "Alcoholic beverage maker Constellation Brands Inc  raised its full-year earnings forecast after reporting higher-than-expected quarterly sales and profit  helped by increased sales of its beer brands such as Corona and Modelo.",
        "date": "01082015",
        "name": "Constellation Brands Inc",
        "news_type": "topStory",
        "symbol": "STZ",
        "title": "Constellation Brands raises profit forecast as beer sales rise "
    },
    {
        "content": "Jan 8 Alcoholic beverage maker Constellation Brands Inc raised its full-year earnings forecast after reporting higher-than-expected quarterly sales and profit  helped by increased sales of its beer brands such as Corona and Modelo.",
        "date": "01082015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "UPDATE 1-Constellation Brands raises profit forecast as beer sales rise "
    },
    {
        "content": "Jan 8 Alcoholic beverage maker Constellation Brands Inc reported a 7 percent rise in quarterly revenue  helped by higher sales of its beer brands such as Corona and Modelo.",
        "date": "01082015",
        "name": "Constellation Brands Inc",
        "news_type": "normal",
        "symbol": "STZ",
        "title": "Constellation Brands revenue rises on higher beer sales "
    }
]