[
    {
        "content": "* Suncor Energy announces 2018 capital program and production outlook",
        "date": "11152017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy announces 2018 capital program and production outlook "
    },
    {
        "content": "* Suncor Energy announces pricing of US$750 million notes offering",
        "date": "11082017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy announces pricing of $750 mln notes offering "
    },
    {
        "content": "* Suncor Energy and Petronor announce agreement for equity partnership",
        "date": "11022017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy  Petronor announce agreement for equity partnership "
    },
    {
        "content": "CALGARY  Alberta  Oct 26 Suncor Energy  Canada's second-largest energy producer  said on Thursday it has made progress in resolving a commercial dispute with joint venture partner Total SA over funding for the new Fort Hills oil sands mining project.",
        "date": "10262017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor says makes progress in oil sands project dispute with Total "
    },
    {
        "content": "* Says Montreal refinery shut after power failure  will try restart over next hours Source text for Eikon: Further company coverage: (Reporting by Ethan Lou)",
        "date": "10242017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy says Montreal refinery shut after power failure "
    },
    {
        "content": "CALGARY  Alberta  Oct 26 Suncor Energy  Canada's second-largest energy producer  said on Thursday it has made progress in resolving a commercial dispute with joint venture partner Total SA over funding for the new Fort Hills oil sands mining project.",
        "date": "10262017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor says makes progress in oil sands project dispute with Total "
    },
    {
        "content": "* CEO says company has made progress towards resolving commercial dispute with Fort Hills partner Total SA",
        "date": "10262017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor expects Fort Hills project to operate at 90 pct capacity by Q4 2018 "
    },
    {
        "content": "CALGARY  Alberta Suncor Energy Inc  Canada's second-largest energy producer  reported a higher-than-expected third-quarter profit on Wednesday due to record production and strong refinery output.",
        "date": "10262017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor reports better-than-expected third-quarter profit "
    },
    {
        "content": "CALGARY  Alberta  Oct 25 Suncor Energy Inc   Canada's second-largest energy producer  reported a higher-than-expected third-quarter profit on Wednesday due to record production and strong refinery output.",
        "date": "10262017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor reports better-than-expected third-quarter profit "
    },
    {
        "content": "CALGARY  Alberta  Oct 25 Suncor Energy Inc   Canada's second-largest energy producer  reported a higher-than-expected third-quarter profit on Wednesday due to record oil sands production and strong refinery output.",
        "date": "10262017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor reports better-than-expected third quarter profit "
    },
    {
        "content": "* Syncrude achieved ‍production of 159 100 barrels per day (bbls/d) in q3",
        "date": "10262017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy says Q3 operating earnings of C$0.52 per common share​ "
    },
    {
        "content": "CALGARY  Alberta  Oct 20 A contractor was killed in an incident at Suncor Energy's Millennium oil sands mine near Fort McMurray  northern Alberta  on Friday morning  a Suncor spokeswoman said.",
        "date": "10202017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "UPDATE 1-Worker killed at Suncor's Millennium oil sands mine "
    },
    {
        "content": "CALGARY  Alberta  Oct 20 A contractor was killed in an incident at Suncor Energy's Millennium oil sands mine near Fort McMurray  northern Alberta  on Friday morning  a Suncor spokeswoman said.",
        "date": "10202017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Worker killed at Suncor's Millennium oil sands mine "
    },
    {
        "content": "CALGARY  Alberta  Sept 19 More than 120 birds in Canada's oil heartland of Alberta were killed after getting caught in a pond of oil sands byproducts operated by the country's largest producer Suncor Energy Inc  the local regulator said on Tuesday.",
        "date": "09192017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "More than 120 birds dead at Suncor-owned Canada oil sands mine "
    },
    {
        "content": "CALGARY  Alberta  Sept 19 More than 120 birds in Canada's oil heartland of Alberta were killed after getting caught in a pond of oil sands byproducts operated by the country's largest producer  Suncor Energy Inc  the local regulator said on Tuesday.",
        "date": "09192017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-More than 120 birds dead at Suncor-owned Canada oil sands mine "
    },
    {
        "content": "* Says has approved a quarterly dividend of $0.32 per share on its common shares  payable September 25  2017 Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy declares dividend "
    },
    {
        "content": "CALGARY  Alberta/PARIS Canada's Suncor Energy Inc is in a dispute with Total SA after the French company said it would not provide any more funding for the Fort Hills oil sands project in northern Alberta  the two companies said on Thursday.",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor  Total SA argue over cost of Fort Hills project "
    },
    {
        "content": "CALGARY  Alberta/PARIS  July 27 Canada's Suncor Energy Inc is in a dispute with Total SA after the French company said it would not provide any more funding for the Fort Hills oil sands project in northern Alberta  the two companies said on Thursday.",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 2-Suncor  Total SA argue over cost of Fort Hills project "
    },
    {
        "content": "PARIS  July 27 French oil and gas company Total said on Thursday that it was not ready to accept substantial cost increases in the Fort Hills oils sands project in Canada  which has led to a commercial dispute with Suncor .",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Total says not ready to accept cost increases in Fort Hills project "
    },
    {
        "content": "CALGARY  Alberta  July 27 Canada's Suncor Energy Inc is in the early stages of a commercial dispute with France's Total SA over funding for the Fort Hills oil sands project in northern Alberta  Suncor said on Thursday.",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor Energy in commercial dispute with Total SA over Fort Hills project "
    },
    {
        "content": "* Says in early stages of commercial dispute with Fort Hills project partner Total SA over project funding.",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy in commercial dispute with Total SA over Fort Hills project "
    },
    {
        "content": "CALGARY  Alberta Suncor Energy Inc   Canada's second-largest oil and gas producer  reported a second-quarter profit on Wednesday due to stronger crude oil prices and increased production from some upstream assets and refining operations.",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor Energy reports second-quarter profit  ups capital budget "
    },
    {
        "content": "CALGARY  Alberta  July 26 Suncor Energy Inc   Canada's second-largest oil and gas producer  reported a second-quarter profit on Wednesday due to stronger crude oil prices and increased production from some upstream assets and refining operations.",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor Energy reports second-quarter profit  ups capital budget "
    },
    {
        "content": "CALGARY  Alberta  July 26 Suncor Energy Inc   Canada's second-largest oil and gas producer  reported a second-quarter profit on Wednesday as a result of stronger crude oil prices and increased production from its upstream assets and refining operations.",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor Energy reports second-quarter profit "
    },
    {
        "content": "* Qtrly refining and marketing (R&M) crude throughput improved to 435 500 bbls/d from 400 200 bbls/d in prior year quarter",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy reports Q2 FFO per share C$0.98 "
    },
    {
        "content": "* Sets quarterly dividend of C$0.32 per share Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy sets quarterly dividend of C$0.32 per share "
    },
    {
        "content": "* Suncor Energy provides update on Syncrude Mildred Lake Oil sands facility",
        "date": "06142017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy provides update on Syncrude Mildred Lake Oil Sands facility "
    },
    {
        "content": "CALGARY  Alberta  May 11 Even as the world's largest energy companies exit Canada's high-cost oil sands the country's top producer Suncor Energy is lining up its next phase of growth in the world's third largest crude reserves.",
        "date": "05112017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canada's Suncor prepares oil sands growth as global majors exit "
    },
    {
        "content": "CALGARY  Alberta  May 8 Suncor Energy Inc   Canada's largest oil and gas producer  said on Monday it plans to submit an application to regulators for a new thermal oil sands project later this year  which could eventually produce up 160 000 barrels per day.",
        "date": "05082017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor to apply to build new oil sands project in northern Alberta "
    },
    {
        "content": "* Says approves Centrica's 5.4 billion crowns ($46.55 million) plan for Oda oilfield development",
        "date": "05112017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Norway oil ministry approves Oda oilfield development plan "
    },
    {
        "content": "CALGARY  Alberta  May 8 Suncor Energy Inc   Canada's largest oil and gas producer  said on Monday it plans to submit an application to regulators for a new thermal oil sands project later this year  which could eventually produce up 160 000 barrels per day.",
        "date": "05082017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor to apply to build new oil sands project in northern Alberta "
    },
    {
        "content": "* Plans to repurchase up to $2 billion of company's shares over next twelve months through a normal course issuer bid Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy says plans to repurchase up to $2 bln shares over next 12 months "
    },
    {
        "content": "* Suncor Energy Inc sets quarterly dividend of C$0.32per share Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy sets quarterly dividend of C$0.32 per share "
    },
    {
        "content": "CALGARY  Alberta  May 1 The Syncrude Canada oil sands project has started shipping crude from its Mildred Lake upgrader again after cutting production as a result of a fire at the plant in mid-March  majority-owner Suncor said on Monday.",
        "date": "05012017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Syncrude resumes shipments from Mildred Lake oil sands upgrader "
    },
    {
        "content": "CALGARY  Alberta  April 27 Suncor Energy   Canada's largest energy producer  is still evaluating opportunities for oil sands acquisitions in northern Alberta as foreign oil majors exit the high-cost region  Chief Executive Steve Williams said on Thursday.",
        "date": "04272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor evaluates potential oil-sand deals as global majors exit "
    },
    {
        "content": "CALGARY  Alberta  April 27 Suncor Energy Inc   Canada's largest energy producer  is still evaluating opportunities for oil sands acquisitions in northern Alberta as foreign oil majors exit the high-cost region  Chief Executive Steve Williams said on Thursday.",
        "date": "04272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor evaluates potential oil-sand deals as global majors exit "
    },
    {
        "content": "* Suncor Energy provides update on syncrude return to service plan",
        "date": "04192017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy provides update on Syncrude return to service plan "
    },
    {
        "content": "* CEO says continues to evaluate opportunities to consolidate in oil sands  but bar for acquisitions is high.",
        "date": "04272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor looking at more opportunities for oil sands consolidation "
    },
    {
        "content": "CALGARY  Alberta Northern Alberta's oil sands producers and communities are stepping up preparations for wildfire season to avoid a repeat of last year's devastating blaze that shut in more than a quarter of Canadian crude output and left thousands homeless.",
        "date": "04192017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canada oil sands beefing up defenses as wildfire season looms "
    },
    {
        "content": "CALGARY  Alberta  April 19 Northern Alberta's oil sands producers and communities are stepping up preparations for wildfire season to avoid a repeat of last year's devastating blaze that shut in more than a quarter of Canadian crude output and left thousands homeless.",
        "date": "04192017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CORRECTED-Canada oil sands beefing up defences as wildfire season looms "
    },
    {
        "content": "CALGARY  Alberta Suncor Energy   Canada's largest oil and gas company  reported a better-than-expected first-quarter profit on Wednesday as a result of higher crude prices  foreign exchange gains and the sale of assets.",
        "date": "04272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canada's Suncor posts better-than-expected first-quarter profit "
    },
    {
        "content": "CALGARY  Alberta  April 26 Suncor Energy   Canada's largest oil and gas company  reported a better-than-expected first-quarter profit on Wednesday as a result of higher crude prices  foreign exchange gains and the sale of assets.",
        "date": "04272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Canada's Suncor posts better-than-expected first-quarter profit "
    },
    {
        "content": "* Qtrly oil sands operations production of 448 500 barrels per day",
        "date": "04272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy reports Q1 net earnings were $1.35 bln "
    },
    {
        "content": "April 26 Suncor Energy Inc  Canada's largest oil and gas company  posts quarterly operating profit compared with a year-ago loss  helped by higher global crude prices.",
        "date": "04272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canada's Suncor posts Q1 profit on higher crude prices "
    },
    {
        "content": "CALGARY  Alberta  March 27 Syncrude Canada has brought forward an eight-week turnaround at its oil sands plant in northern Alberta after a fire two weeks ago damaged the facility and forced a cut in crude production  majority-owner Suncor Energy said on Monday.",
        "date": "03272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Syncrude brings forward maintenance at oil sands plant after fire "
    },
    {
        "content": "TORONTO  March 27 Law firm Norton Rose Fulbright has named well-known shareholder activism and mergers and acquisitions lawyer Walied Soliman chair of its Canadian division.",
        "date": "03272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Norton Rose Fulbright names Soliman chair of Canadian division "
    },
    {
        "content": "* Suncor Energy Inc - planned maintenance advanced to minimize outage impact",
        "date": "03272017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy provides update on Syncrude recovery plan "
    },
    {
        "content": "* Suncor energy inc - received notice from alberta energy regulator that it has denied suncor base plant tailings management framework application",
        "date": "03172017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy receives notice from Alberta Energy Regulator "
    },
    {
        "content": "* Says Syncrude facility in Canada's Alberta running at minimum rates after fire  Source text for Eikon:  Further company coverage:   (Reporting by Ethan Lou; Editing by David Gregorio)",
        "date": "03152017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor says Syncrude Canada site at minimum rates after fire "
    },
    {
        "content": "CALGARY  Alberta  March 15 Suncor Energy has sold a cargo of offshore Canadian crude from its Hibernia field to Indian Oil Corp  a Suncor spokeswoman said on Wednesday.",
        "date": "03152017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor sells cargo of offshore Canadian crude to Indian Oil Corp "
    },
    {
        "content": "CALGARY  Alberta  March 15 The \"vast majority\" of workers at Syncrude's oil sands plant in northern Alberta had returned to work on Wednesday after a fire the previous day  said a company spokesman who declined to say whether production at the facility had been affected.",
        "date": "03152017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Workers return to Syncrude's Alberta oil sands plant after fire "
    },
    {
        "content": "* Says Syncrude utilization rates above 90 percent and cash costs of C$30 a barrel or less are reasonable goals",
        "date": "02092017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy looking at share buybacks for later in 2017 "
    },
    {
        "content": "* Teck Resources- Suncor provided an update regarding its recently completed review of schedule  project costs and throughput",
        "date": "02092017",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Teck updates Fort Hills guidance "
    },
    {
        "content": "* Fiera Capital- Fiera Infra LP has acquired Suncor Energy's 50 percent interest in Cedar Point II limited partnership  Source text for Eikon:  Further company coverage:",
        "date": "01252017",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Fiera Infra acquires Suncor Energy's 50 pct interest in Cedar Point II "
    },
    {
        "content": "Suncor Energy  Canada's largest oil and gas company  said on Monday that it had resolved a dispute with the Canada Revenue Agency (CRA) over its income tax treatment from 2007.",
        "date": "12062016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor resolves tax dispute with Canada Revenue Agency "
    },
    {
        "content": "Nov 17 Canadian oil and gas producer Suncor Energy  said it expects its production to grow by more than 13 percent next year and forecasts its spending to fall by more than C$1 billion  ($746.21 million).",
        "date": "11172016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor Energy expects higher production  lower spending in 2017 "
    },
    {
        "content": "* Hollyfrontier to acquire Suncor Energy's petro-Canada lubricants business",
        "date": "10312016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Hollyfrontier to acquire Suncor Energy's petro-Canada lubricants business "
    },
    {
        "content": "* Reached multi-year agreement as primary provider for Suncor Energy to fly employees and contractors to and from its oil sands operations in Northern Alberta  Source text for Eikon:  Further company coverage:",
        "date": "09202016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Westjet signs multi-year contract with suncor "
    },
    {
        "content": "* Unifor says tentative deal was reached on august 9 and ratified by local Unifor leaders this week  Source text for Eikon:",
        "date": "08182016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Energy union ratifies deal with Suncor "
    },
    {
        "content": "CALGARY  Alberta  Aug 9 Suncor Energy  Canada's largest oil and gas producer  said on Tuesday it is buying a 30 percent stake in the UK North Sea Rosebank project from OMV Limited for an initial payment of $50 million.",
        "date": "08092016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor to acquire 30 pct stake in OMV's UK North Sea Rosebank project "
    },
    {
        "content": "* CEO Steve Williams says does not think company will approve any big organic growth projects for next couple of years",
        "date": "07282016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor unlikely to approve big growth projects for next couple of years - CEO "
    },
    {
        "content": "CALGARY  Alberta  July 25 A pipeline at Suncor Energy's oil sands base plant remained offline on Monday  the Alberta Energy Regulator said  following a leak last week that spilt around 125 barrels of diluent.",
        "date": "07252016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor diluent pipeline remains shut after leak -regulator "
    },
    {
        "content": "* Agreement to sell 71.5 million common shares from treasury  on a bought deal basis  at a price of $35.00 per share",
        "date": "06072016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor energy announces $2.5 bln bought-deal common share financing "
    },
    {
        "content": "CALGARY  Alberta Oil companies are restarting operations in the region around Fort McMurray  Alberta  following a huge wildfire last month that forced many sites to evacuate as a precaution.",
        "date": "06072016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Oil operations restart following northern Alberta wildfire "
    },
    {
        "content": "NEW YORK Suncor Energy  has bought a rare cargo of North Sea crude  Reuters data shows  sparking talk among traders that the Canadian company has been forced to import oil to feed its nearby refinery as fires across Alberta disrupt supplies.",
        "date": "05172016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor buys rare North Sea crude as Canadian fire roils supplies "
    },
    {
        "content": "May 13 Suncor Energy said on Friday that the recent restart of a cogeneration plant at its Firebag site is \"part of preparing to get our operations back online \" a company spokeswoman said in an email.",
        "date": "05132016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor says power-plant restart is preparation for getting online "
    },
    {
        "content": "* Alberta Premier Rachel Notley says oil industry and province agree oil sands operations will only restart as soon as it is safe to do so",
        "date": "05102016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Alberta Premier sees some oil production restarting in days "
    },
    {
        "content": "* Says reducing production in Fort McMurray region because of wildfire",
        "date": "05042016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor says cutting production due to Fort Mac wildfire "
    },
    {
        "content": "CALGARY  Alberta  April 28 Suncor Energy   Canada's largest oil and gas producer  said on Thursday it will focus on improving efficiency but not seek operatorship at Syncrude oil sands project in northern Alberta  in which it is acquiring a majority stake.",
        "date": "04282016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor says will not seek operatorship of Syncrude oil sands plant "
    },
    {
        "content": "April 18 Suncor Energy  Canada's largest oil and gas company  said it would disclose more details on its plans to compete in a lower-carbon future and on its lobbying activities.",
        "date": "04182016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor to disclose more information on carbon risk  lobbying "
    },
    {
        "content": "CALGARY  Alberta  Feb 8 Canadian synthetic crude prices strengthened on Monday ahead of a major turnaround at one of Suncor Energy's two oil sands upgraders in northern Alberta  due to start towards the end of the first quarter.",
        "date": "02092016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA CRUDE-Synthetic strengthens ahead of maintenance "
    },
    {
        "content": "CALGARY  Alberta Suncor Energy Inc   Canada's largest oil and gas company  reported a fourth-quarter operating loss and cut 2016 capital spending plans on Wednesday because of the collapse in global crude prices.",
        "date": "02042016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor reports fourth-quarter loss  slashes 2016 capital budget "
    },
    {
        "content": "CALGARY  Alberta  Feb 3 Suncor Energy Inc   Canada's largest oil and gas company  reported a fourth-quarter operating loss and cut 2016 capital spending plans on Wednesday because of the collapse in global crude prices.",
        "date": "02042016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor reports Q4 loss  slashes 2016 capital budget "
    },
    {
        "content": "CALGARY  Alberta  Feb 3 Suncor Energy Inc   Canada's largest oil and gas company  reported a fourth-quarter loss of C$2 billion ($1.46 billion) on Wednesday due to asset writedowns as a result of weak global crude prices and unrealized foreign exchange losses.",
        "date": "02042016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor reports Q4 loss of C$2 bln on writedowns  unrealized FX loss "
    },
    {
        "content": "Canada's largest oil producer Suncor Energy Inc  has reached a deal to acquire rival Canadian Oil Sands Ltd  on Monday by raising its all-stock offer  a move seen marking the end of a months-long battle for the synthetic crude asset.",
        "date": "01182016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor reaches deal to buy Canadian Oil Sands with sweetened offer "
    },
    {
        "content": "Jan 18 Canada's largest oil producer Suncor Energy Inc has reached a deal to acquire rival Canadian Oil Sands Ltd on Monday by raising its all-stock offer  a move seen marking the end of a months-long battle for the synthetic crude asset.",
        "date": "01182016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 5-Suncor reaches deal to buy Canadian Oil Sands with sweetened offer "
    },
    {
        "content": "TORONTO  Jan 18 Canada's main stock index fell on Monday as energy shares exerted further pressure on the overall index after crude oil prices hit 2003 lows  while Suncor Energy Inc slipped after upping its offer for Canadian Oil Sands Ltd.",
        "date": "01182016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX falls as energy stocks weigh "
    },
    {
        "content": "TORONTO  Jan 18 Canada's main stock index slipped in early trade on Monday  with the energy group weighing after oil hit 2003 lows while Canadian Oil Sands surged on Suncor Energy Inc's revised bid.",
        "date": "01182016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX falls  energy sector drags "
    },
    {
        "content": "Jan 18 Canadian oil and gas producer Suncor Energy Inc said it reached an agreement to buy Canadian Oil Sands Ltd  after raising the all-stock offer  valuing the deal at about C$6.6 billion ($4.55 billion)  including debt.",
        "date": "01182016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor agrees to buy Canadian Oil Sands in sweetened deal "
    },
    {
        "content": "* Suncor Energy Norge AS  operator of production licence 571  has concluded the drilling of wildcat well 25/10-14 S.",
        "date": "01182016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor/Statoil: Dry well west of the Balder Field in the North Sea\u007f\u007f "
    },
    {
        "content": "TORONTO  Jan 17 Suncor Energy Inc  which recently extended its hostile bid for Canadian Oil Sands Ltd   is now in talks with its target and a friendly deal could be clinched as early as Monday  according to a source familiar with the matter.",
        "date": "01182016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor  Canadian Oil in talks aimed at clinching friendly deal-source "
    },
    {
        "content": "NEW YORK  Jan 17 Suncor Energy Inc is working to raise its all-stock offer for rival Canadian Oil Sands Ltd and a deal could be announced as early as Monday  the Wall Street Journal said  citing a source familiar with the situation.",
        "date": "01182016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor hopes to raise bid for Canadian Oil Sands -WSJ "
    },
    {
        "content": "TORONTO Suncor Energy Inc has received more than 40 percent of the votes in favor of its bid for Canadian Oil Sands Ltd  a source familiar with the situation said on Monday.",
        "date": "01112016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor gets more than 40 percent of votes in favor of COS bid: source "
    },
    {
        "content": "* Many Alberta oil sands producers struggling with weak prices   (Clarifies and elaborates on background to the bid and requirements for success in paragraphs 2-3; adds response from Canadian Oil Sands in paragraph 4)",
        "date": "01092016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "UPDATE 2-Suncor extends bid for Canadian Oil Sands until Jan. 27 "
    },
    {
        "content": "TORONTO  Jan 8 Suncor Energy Inc said on Friday it has extended its hostile bid for Canadian Oil Sands Ltd until Jan. 27.",
        "date": "01092016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor extends bid for Canadian Oil Sands until Jan. 27 "
    },
    {
        "content": "Jan 5 The following bids  mergers  acquisitions and disposals were reported by 2115 GMT on Tuesday:",
        "date": "01052016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "CALGARY  Alberta  Jan 5 A major Canadian Oil Sands Ltd investor sent an open letter to fellow shareholders on Tuesday urging them to reject a C$4.3 billion ($3.1 billion) hostile takeover bid by Suncor Energy Inc  that expires this Friday.",
        "date": "01052016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canadian Oil Sands investor urges shareholders reject Suncor bid "
    },
    {
        "content": "Jan 4 The following bids  mergers  acquisitions and disposals were reported by 2115 GMT on Monday:",
        "date": "01042016",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Chief Executive says indication this week is that majority of Canadian Oil Sands shareholders are going to support Suncor offer  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "01052016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor sees indication that most COS shareholders support bid "
    },
    {
        "content": "* Says Syncrude oil sands project operational issues reported on Dec. 8 will result in at least 40 days of reduced production  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "01052016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "BRIEF-Suncor says Syncrude output reduced at least 40 days from Dec. 8 "
    },
    {
        "content": "CALGARY  Alberta  Jan 4 Suncor Energy Inc's  top executive said on Monday it was \"conceivable but highly improbable\" that Suncor will extend a C$4.3 billion ($3.08 billion) hostile takeover bid for Canadian Oil Sands Ltd  beyond this week's deadline.",
        "date": "01042016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 3-Suncor says Canadian Oil bid extension highly improbable "
    },
    {
        "content": "Canadian Oil Sands Ltd on Monday urged shareholders again to reject Suncor Energy Inc's hostile C$4.3 billion bid  which is set to lapse later this week.",
        "date": "01042016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canadian Oil Sands urges shareholders to reject Suncor bid "
    },
    {
        "content": "Jan 4 Stock futures pointed to a lower opening for Canada's main stock index on Monday after Chinese data rekindled global growth worries.",
        "date": "01042016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-Futures indicate poor start to 2016 "
    },
    {
        "content": "Jan 4 Canadian Oil Sands Ltd urged its shareholders to let Suncor Energy Inc's unsolicited bid lapse  emphasizing that the company could remain independent.",
        "date": "01042016",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canadian Oil Sands urges shareholders to decline Suncor bid "
    },
    {
        "content": "Dec 15 Canada's largest oil and gas company Suncor Energy Inc urged shareholders of Canadian Oil Sands Ltd to tender their shares to its offer for the company.",
        "date": "12152015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor urges Canadian Oil Sands shareholders to tender shares to its offer "
    },
    {
        "content": "* Lawyer says commission 'met everyone halfway'   (Adds comment from Suncor and COS)",
        "date": "11302015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "UPDATE 2-COS investors given extra month to assess Suncor bid "
    },
    {
        "content": "TORONTO  Nov 30 Canada's main stock index rallied on Monday  led by strength in resource stocks and as financials rose ahead of bank earnings reports this week but the index lost 0.4 percent in November.",
        "date": "11302015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX rises on gains for resource stocks  financials "
    },
    {
        "content": "CALGARY  Alberta  Nov 30 Canadian Oil Sands  shareholders should have until Jan. 4  2016 to consider a hostile takeover bid from Suncor Energy Inc  the Alberta Securities Commission said on Monday.",
        "date": "11302015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Regulator says COS shareholders have until Jan. 4 to consider Suncor bid "
    },
    {
        "content": "TORONTO  Nov 25 Canadian Oil Sands  which is trying to attract a white knight after a hostile bid from Suncor Energy  needs more time to review its options as more than two dozen parties have expressed an interest in the company  according to a regulatory filing.",
        "date": "11252015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Canadian Oil Sands in early-stage talks with potential bidders "
    },
    {
        "content": "CALGARY  Alberta Canada's largest oil and gas producer Suncor Energy Inc said on Tuesday 2016 capital spending will increase by around 15 percent from this year but production will drop slightly as a result of major turnarounds on oil sands facilities.",
        "date": "11182015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor cuts 2016 oil sands production due to major maintenance "
    },
    {
        "content": "TORONTO  Nov 18 Canada's main stock index rose on Wednesday  led by railway and pipeline stocks in a broad-based but relatively shallow recovery from Tuesday's slip.",
        "date": "11182015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX rises as railways  pipelines gain "
    },
    {
        "content": "CALGARY  Alberta  Nov 17 Canada's largest oil and gas producer Suncor Energy Inc said on Tuesday 2016 capital spending will increase by around 15 percent from this year but production will drop slightly as a result of major turnarounds on oil sands facilities.",
        "date": "11172015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor cuts 2016 oil sands production due to major maintenance "
    },
    {
        "content": "* CEO Steve Williams says clearly \"disappointed\" in U.S. decision to reject Keystone XL  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "11062015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor CEO says disappointed in Keystone XL rejection "
    },
    {
        "content": "CALGARY  Alberta  Oct 29 Canadian Oil Sands Ltd   the biggest shareholder in the Syncrude project  has not received a rival offer to a hostile takeover bid by Suncor Energy  but it is \"getting interest\" as it explores alternatives  Chief Executive Ryan Kubic said on Thursday.",
        "date": "10292015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "UPDATE 1-Canadian Oil Sands CEO says company 'getting interest' after Suncor bid "
    },
    {
        "content": "CALGARY  Alberta  Oct 29 Canadian Oil Sands   the largest-interest owner in the Syncrude oil sands project  has not received any offers to rival Suncor Energy's  hostile takeover bid but is \"getting interest\"  chief executive Ryan Kubik said on Thursday.",
        "date": "10292015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canadian Oil Sands has interest from rival offers to Suncor bid -CEO "
    },
    {
        "content": "CALGARY  Alberta  Oct 29 The Syncrude oil sands project is experiencing \"operational challenges\" that could be resolved if Suncor is successful in its hostile takeover bid for Canadian Oil Sands  Suncor Energy Chief Executive Steve Williams said on Thursday.",
        "date": "10292015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Canada's Syncrude project faces operational challenges -Suncor "
    },
    {
        "content": "CALGARY  Alberta  Oct 29 Suncor Energy  is planning a major six to eight week turnaround at one of its two oil sands upgraders in northern Alberta next year  chief executive Steve Williams said on Thursday.",
        "date": "10292015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor plans 6-8 week turnaround on U2 oil sands upgrader next year "
    },
    {
        "content": "CALGARY  Alberta  Oct 29 Suncor Energy  commenced linefill on Enbridge Inc's Line 9 pipeline earlier this month and the first inland crude volumes will reach the company's Montreal refinery by year-end  Suncor Chief Executive Steve Williams said on a third-quarter earnings call on Thursday.",
        "date": "10292015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor says Line 9 to deliver inland crude to Montreal by year-end "
    },
    {
        "content": "CALGARY  Alberta  Oct 29 The Syncrude oil sands project in northern Alberta is experiencing challenges and has been operating at approximately 60 percent of capacity in October  Suncor Energy Chief Executive Steve Williams said on Thursday.",
        "date": "10292015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor says Syncrude operating at 60 pct of capacity in October "
    },
    {
        "content": "CALGARY  Alberta  Oct 28 Suncor Energy Inc   Canada's largest oil and gas company  on Wednesday reported a third-quarter loss due to an unrealized after-tax foreign exchange loss of C$786 million ($595.91 million) on the revaluation of U.S. dollar denominated debt.",
        "date": "10292015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor posts net loss in third quarter on unrealized FX loss "
    },
    {
        "content": "TORONTO Canadian Oil Sands Ltd  expects strong interest from a wide range of buyers  its chief executive said on Monday  as the company asked shareholders to reject a hostile takeover offer by Suncor Energy Inc .",
        "date": "10192015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Canadian Oil Sands CEO says buyer interest extends beyond Suncor "
    },
    {
        "content": "TORONTO  Oct 19 Canadian Oil Sands Ltd  expects strong interest from a wide range of buyers  its chief executive said on Monday  as the company asked shareholders to reject a hostile takeover offer by Suncor Energy Inc.",
        "date": "10192015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 3-Canadian Oil Sands CEO says buyer interest extends beyond Suncor "
    },
    {
        "content": "TORONTO Canadian Oil Sands Ltd  expects strong interest from other suitors following its rejection of a hostile takeover bid from Suncor Energy Inc   said Chief Executive Ryan Kubik on Monday.",
        "date": "10192015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canadian Oil Sands expects interest from wide range of buyers: CEO "
    },
    {
        "content": "Oct 19 Canadian Oil Sands Ltd asked its shareholders to reject Suncor Energy Inc's offer  saying it \"substantially undervalued\" the company's ownership in Syncrude and was \"entirely opportunistic\".",
        "date": "10192015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Canadian Oil Sands asks shareholders to reject Suncor's bid "
    },
    {
        "content": "Oct 19 Canadian Oil Sands Ltd  recommended its shareholders reject Suncor Energy Inc's  hostile takeover bid.",
        "date": "10192015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canadian Oil Sands says shareholders should reject Suncor's bid "
    },
    {
        "content": "CALGARY Canadian Oil Sands Ltd on Wednesday announced a new poison pill to try to thwart Suncor Energy Inc's hostile takeover bid  setting the stage for a drawn-out battle that could reshape Alberta's high-cost oil sands industry.",
        "date": "10072015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Canadian Oil Sands adopts poison pill to fend off Suncor "
    },
    {
        "content": "CALGARY  Oct 7 Canadian Oil Sands Ltd  on Wednesday announced a new poison pill to try to thwart Suncor Energy Inc's hostile takeover bid  setting the stage for a drawn-out battle that could reshape Alberta's high-cost oil sands industry.",
        "date": "10072015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 2-Canadian Oil Sands adopts poison pill to fend off Suncor "
    },
    {
        "content": "Oct 7 Canadian Oil Sands Ltd said it adopted a poison pill in response to Suncor Energy Inc's  hostile takeover bid.",
        "date": "10072015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canadian Oil Sands adopts poison pill after Suncor's hostile bid "
    },
    {
        "content": "CALGARY  Alberta  Sept 21 French oil company Total  which is trimming exposure to Canada's oil sands amid a slump in crude prices  said on Monday it had sold a tenth of the Fort Hills oil sands project in northern Alberta to Canada's Suncor Energy.",
        "date": "09212015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "UPDATE 3-Total sells stake in Alberta oil sands project to Canada's Suncor "
    },
    {
        "content": "PARIS  Sept 21 French oil and gas company Total  said on Monday that it has sold 10 percent of its the planned 180 000 barrels-per-day capacity Fort Hills project to Suncor Energy for around $230 million.",
        "date": "09212015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Total sells 10 pct holding in Fort Hills to Suncor Energy "
    },
    {
        "content": "CALGARY  Alberta  Sept 21 A coalition of First Nations  environmentalists and companies including Canada's largest oil producer Suncor Energy called on Monday for industry and government to adopt a principle of free  prior and informed consent (FPIC) when working with indigenous groups.",
        "date": "09212015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Report urges Canada to seek aboriginal consent for land development "
    },
    {
        "content": "LONDON  Sept 8 The North Sea Buzzard oilfield  which plays a role in pricing global crude exports  is pumping more oil this year and operating more reliably  industry sources said  boosting supply of crude that helps underpin the Brent benchmark.",
        "date": "09082015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Britain's benchmark oilfield  Buzzard  becomes more reliable "
    },
    {
        "content": "CALGARY  Alberta  Aug 31 Canadian light synthetic crude prices spiked higher on Monday after a weekend explosion and fire at the Syncrude oil sands project in northern Alberta halted production and regulators ordered pipeline shutdowns at a separate Nexen Energy site.",
        "date": "08312015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 2-Canada synthetic crude spikes on Syncrude fire  Nexen pipelines "
    },
    {
        "content": "Aug 31 Canadian Oil Sands Ltd  the biggest shareholder in the Syncrude oil sands project  said it has halted crude oil production after a fire damaged equipment at its processing facility in northern Alberta on Saturday.",
        "date": "08312015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canadian Oil Sands halts crude production at Syncrude after fire "
    },
    {
        "content": "VANCOUVER  July 29 Suncor Energy Inc  Canada's largest oil and gas company  reported a drop in second-quarter operating earnings on Wednesday  as lower crude prices outweighed increased production.",
        "date": "07302015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "UPDATE 2-Suncor 2nd-qtr operating profit falls as lower crude price bites "
    },
    {
        "content": "VANCOUVER  July 29 Suncor Energy Inc  Canada's largest oil and gas company  reported a drop in second-quarter operating earnings on Wednesday  as lower crude prices outweighed increased production.",
        "date": "07302015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor 2nd-qtr operating profit falls as lower crude price bites "
    },
    {
        "content": "CALGARY  Alberta  July 14 Suncor Energy Inc  has launched a pilot project to replace the high-pressure steam used to extract bitumen from oil sands with radio frequency technology developed by U.S. defence contractor Harris Corporation.",
        "date": "07142015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor oil sands project aims to replace steam with radio waves "
    },
    {
        "content": "OSLO  June 24 Canada's oil and gas explorer Suncor Energy drilled a dry well in the central part of the North Sea about 5 kilometres west of the Balder field  the Norwegian Petroleum Directorate said on Wednesday.",
        "date": "06242015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canada's Suncor Energy drills dry well offshore Norway "
    },
    {
        "content": "* Suncor Energy  operator of production licence 375  has completed drilling of appraisal well 34/4-14 S in the oil discovery 34/4-11  the Norwegian Petroleum Directorate says",
        "date": "05152015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "BRIEF-Suncor Energy finishes dry appraisal well in the North Sea "
    },
    {
        "content": "Suncor Energy Inc launched a hostile bid for Canadian Oil Sands Ltd on Monday  aimed at boosting its stake in the country's biggest synthetic crude project and cementing its position as the country's largest oil producer.",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor Energy launches $4.3 bln hostile bid for Canadian Oil Sands "
    },
    {
        "content": "Suncor Energy Inc launched a hostile bid for Canadian Oil Sands Ltd on Monday  aimed at boosting its stake in the country's biggest synthetic crude project and cementing its position as the country's largest oil producer.",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor Energy launches $4.3 billion hostile bid for Canadian Oil Sands "
    },
    {
        "content": "* Suncor's all-stock offer valued at about C$4.3 billion   (Adds investment banker  investor comment  additional comment from Suncor CEO)",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 6-Suncor Energy launches $4.3 bln hostile bid for Canadian Oil Sands "
    },
    {
        "content": "TORONTO  Oct 5 Canada's main stock index jumped on Monday  as shares of Canadian Oil Sands surged 55 percent on a hostile bid by Suncor Energy Inc  its rival and co-producer in the country's oil sands industry.",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX bounces higher on Suncor bid for Canadian Oil Sands "
    },
    {
        "content": "TORONTO  Oct 5 Canada's main stock index gained 1.6 percent on Monday  with the energy sector invigorated by heavyweight Suncor Energy Inc's  hostile bid for Canadian Oil Sands Ltd  a rival and co-producer.",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX ends up as Suncor bid for oil sands rival boosts energy shares "
    },
    {
        "content": "TORONTO  Oct 5 Canadian Oil Sands is set to reject a hostile takeover bid from rival Suncor Energy   according to a source who is familiar with the situation.",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canadian Oil Sands set to reject Suncor takeover bid -source "
    },
    {
        "content": "TORONTO  Oct 5 Canada's main stock index jumped on Monday  with Canadian Oil Sands catapulting 47 percent higher on Suncor Energy Inc's hostile C$4.3 billion ($3.3 billion) bid for its rival and co-producer in the country's oil sands industry.",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-Oil sands takeover bid helps TSX bounce higher "
    },
    {
        "content": "CALGARY  Alberta  Oct 5 Suncor Energy  chief executive Steve Williams said on Monday he expected Imperial Oil would continue to run the Syncrude joint venture oil sands project even if Suncor's hostile bid for Canadian Oil Sands Ltd is successful.",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor expects Imperial Oil to continue to run Syncrude project "
    },
    {
        "content": "TORONTO  Oct 5 Canada's main stock index jumped at the open on Monday  with Canadian Oil Sands  catapulting 46 percent higher on Suncor Energy Inc's  hostile bid for its rival and co-producer in the country's oil sands industry.",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX jumps on Suncor bid for Canadian Oil Sands "
    },
    {
        "content": "Oct 5 Suncor Energy Inc launched an unsolicited tender offer to buy Canadian Oil Sands Ltd  in an all-stock deal valued at about C$4.3 billion ($3.29 billion).",
        "date": "10052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor launches unsolicited offer to buy Canadian Oil Sands for C$4.3 bln "
    },
    {
        "content": "CALGARY  Alberta  April 30 Suncor Energy Inc   Canada's largest oil and gas company and the dominant producer from the country's oil sands  no longer considers itself to be a high-cost producer after slashing costs to cope with low oil prices.",
        "date": "04302015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CORRECTED-Suncor CEO touts oil sands costs  says not a marginal producer "
    },
    {
        "content": "April 29 Suncor Energy Inc  Canada's largest oil and gas company  reported a loss on Wednesday as oil prices tumbled by half and a foreign exchange loss outweighed higher production.",
        "date": "04302015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor turns to loss on low oil price  foreign exchange loss "
    },
    {
        "content": "April 29 Suncor Energy Inc  Canada's largest oil and gas company  reported a loss on Wednesday  as oil prices tumbled by half and a foreign exchange loss cut into profits.",
        "date": "04302015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor turns to loss on low oil  foreign exchange loss "
    },
    {
        "content": "TORONTO  April 2 Canada's main stock index rose on Thursday as shares of energy producers held on to gains despite falling oil prices  while most other major sectors were lifted by positive U.S. economic data.",
        "date": "04022015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX rises as U.S. data  energy shares offer support "
    },
    {
        "content": "April 1 Canada's largest oil and gas company Suncor Energy Inc said on Wednesday that it expected to largely implement operating budget cuts of C$600 million ($476 million) to C$800 million in 2015  ahead of the previously projected two-year period.",
        "date": "04022015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Canada's Suncor Energy says to implement operating budget cuts in 2015 "
    },
    {
        "content": "* Canadian Natural  Suncor are among most influential gainers",
        "date": "03252015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX falls 1 pct  energy is only rising sector "
    },
    {
        "content": "* Canadian Natural  Suncor are among most influential gainers",
        "date": "03252015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX rises with resource stocks as commodity prices gain "
    },
    {
        "content": "TORONTO  March 23 Canada's main stock index advanced on Monday with shares of energy companies climbing on higher oil prices and miners getting a lift from stronger copper prices.",
        "date": "03232015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-Energy  mining shares push TSX higher "
    },
    {
        "content": "TORONTO  Feb 18 Canada's main stock index slipped on Wednesday  its first decline in six sessions  as shares of oil and gas companies were weighed down by the stalling momentum of a recent rally in the price of oil.",
        "date": "02182015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-Oil price fall leads to first TSX slip in 6 sessions "
    },
    {
        "content": "TORONTO  Feb 18 Canada's main stock index slipped on Wednesday as a recent rally in the price of oil began showing signs of losing momentum  weighing on energy producers' shares.",
        "date": "02182015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX declines as oil prices pull energy shares lower "
    },
    {
        "content": "TORONTO  Feb 11 Canada's main stock index was little changed on Wednesday as the market braced for the outcome of a euro zone finance ministers meeting where a debt deal for Greece will be discussed  while oil company shares dropped as crude prices were again pressured.",
        "date": "02112015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX steady as market awaits word on Greek talks "
    },
    {
        "content": "TORONTO  Feb 9 Canada's main stock index was little changed on Monday as a gain in energy shares on climbing oil prices helped offset weak economic data from China.",
        "date": "02092015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX little changed as energy rises  China data drags "
    },
    {
        "content": "TORONTO  Feb 9 Canada's main stock index advanced on Monday as a gain in energy shares on climbing oil prices helped offset sluggish economic data from China.",
        "date": "02092015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX rises as energy shares gain with oil price "
    },
    {
        "content": "TORONTO  Feb 6 Canada's main stock index fell on Friday as strong U.S. jobs data increased investor worries that the U.S. Federal Reserve will raise interest rates  sending the bullion price and shares of gold miners sharply lower.",
        "date": "02062015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX falls as U.S. rate hike fears hit gold shares "
    },
    {
        "content": "TORONTO  Feb 6 Canada's main stock index advanced to its highest in more than four months on Friday as strong U.S. jobs data boosted investor sentiment and higher oil prices lifted shares of energy producers.",
        "date": "02062015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX hits four-month high on U.S. data  oil prices "
    },
    {
        "content": "CALGARY  Alberta  Feb 5 Suncor Energy is no longer shipping crude by rail to the U.S. Gulf Coast because it is not economic to do so at current prices  Chief Executive Steve Williams said on Thursday.",
        "date": "02052015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Suncor no longer shipping crude by rail to U.S. Gulf Coast "
    },
    {
        "content": "TORONTO  Feb 4 Canada's main stock index fell on Wednesday  pulled down by a drop in oil and gas shares after a report showing a jump in U.S. crude inventories weighed on oil prices.",
        "date": "02042015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX weakens as rally in oil shares stalls "
    },
    {
        "content": "CALGARY  Alberta  Feb 4 Suncor Energy Inc   Canada's largest oil and gas company  said on Wednesday its fourth-quarter profit tumbled more than 80 percent  hit by the rapid slide in oil prices and weaker output from its Alberta oil sands operations.",
        "date": "02052015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor Q4 profit plunges on oil price slide  weaker oil sand output "
    },
    {
        "content": "TORONTO  Feb 4 Canada's main stock index fell on Wednesday as signs of increasing U.S. crude inventories put pressure on the price of oil and shares of energy companies.",
        "date": "02042015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX declines as energy sector eases after rally "
    },
    {
        "content": "Jan 21 Suncor Energy expects Enbridge Inc's reversed Line 9B crude pipeline to start up towards the end of the second quarter of 2015  the company's chief financial officer Alister Cowan said on Wednesday.",
        "date": "01212015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "UPDATE 1-Suncor expects Enbridge Line 9B to start up towards end of Q2 2015 "
    },
    {
        "content": "Jan 21 Suncor Energy expects Enbridge Inc's Line 9B crude pipeline to start up towards the end of the second quarter of 2015  Suncor chief financial officer Alister Cowan said on Wednesday.",
        "date": "01212015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "Suncor expects Enbridge Line 9B to start up towards end of Q2 2015 "
    },
    {
        "content": "TORONTO  Jan 21 Canada's main stock index rallied on Wednesday after the central bank cut its benchmark rate in a shock move  helping boost shares of energy companies as well as interest-sensitive banks and other financial issues.",
        "date": "01212015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-Shock Bank of Canada rate cut boosts TSX  banks climb "
    },
    {
        "content": "TORONTO  Jan 21 Canada's main stock index hit a two-week high on Wednesday after the Bank of Canada cut its benchmark rate in a surprise move to minimize the impact of lower oil prices on economic growth  sending most major sectors  including the energy group  higher.",
        "date": "01212015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX jumps as Bank of Canada startles market with rate cut "
    },
    {
        "content": "TORONTO  Jan 19 Canada's main stock index was little changed on Monday as a decline in oil and gas stocks  fueled by lower crude prices  offset gains in other sectors.",
        "date": "01192015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX steady as energy shares drop  other sectors gain "
    },
    {
        "content": "TORONTO  Jan 19 Canada's main stock index eased on Monday as a decline in oil prices and concerns about the Chinese economy weighed on energy shares  which resumed their downward trend.",
        "date": "01192015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX declines as oil prices  energy shares weaken "
    },
    {
        "content": "TORONTO  Jan 16 Canada's main stock index rose nearly 2 percent on Friday as shares of oil and mining companies soared on the back of rebounding commodity prices.",
        "date": "01162015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX jumps nearly 2 percent as oil  metals strengthen "
    },
    {
        "content": "* U.S. crude oil stocks at highest ever level for time of year",
        "date": "01152015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "Oil traders to store W.African crude in U.S. until prices recover "
    },
    {
        "content": "TORONTO  Jan 16 Canada's main stock index climbed on Friday as shares of oil companies and gold miners gained along with crude and bullion prices after data showed a big drop in U.S. consumer prices in December and steady inflation.",
        "date": "01162015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX jumps as oil and gold shares rebound with commodity prices "
    },
    {
        "content": "* U.S. crude oil stocks at highest ever level for time of year",
        "date": "01162015",
        "name": "Suncor Energy  Inc",
        "news_type": "normal",
        "symbol": "SU",
        "title": "RPT-Oil traders to store W.African crude in U.S. until prices recover "
    },
    {
        "content": "TORONTO  Jan 7 Canada's main stock index advanced on Wednesday as positive U.S. economic data and firmer oil prices helped drive gains in most major sectors.",
        "date": "01072015",
        "name": "Suncor Energy  Inc",
        "news_type": "topStory",
        "symbol": "SU",
        "title": "CANADA STOCKS-TSX index climbs on U.S. data  firmer oil prices "
    }
]