[
    {
        "content": "* PayPal - sees Q4 revenue between $3.64 billion-$3.70 billion versus previous forecast $3.57 billion-$3.63 billion - Conf call",
        "date": "11162017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-PayPal raises Q4 revenue  EPS forecast after deal with Synchrony Financial "
    },
    {
        "content": "* Berkshire Hathaway ups share stake in Synchrony Financial by 19 percent to 20.8 million shares ‍​",
        "date": "11142017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Berkshire Hathaway ups share stake in Synchrony Financial  dissolves in Wabco‍​ "
    },
    {
        "content": "* Synchrony financial says transaction with paypal not expected to impact current capital plan announced may 17- sec filing‍​",
        "date": "11162017",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial sees deal with PayPal EPS accretive in 2019 "
    },
    {
        "content": "Nov 16 Consumer financial services company Synchrony Financial said on Thursday that it would buy $6.8 billion in receivables from PayPal Holdings Inc  including the payment processor's U.S. consumer credit receivables portfolio.",
        "date": "11162017",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "Synchrony to buy $6.8 bln receivables portfolio from PayPal "
    },
    {
        "content": "* PayPal and Synchrony Financial announce expanded strategic credit relationship",
        "date": "11162017",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "BRIEF-PayPal and Synchrony Financial announce expanded strategic credit relationship "
    },
    {
        "content": "* Synchrony Financial reports third quarter net earnings of $555 million or $0.70 per diluted share",
        "date": "10202017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial reports Q3 earnings per share of $0.70 "
    },
    {
        "content": "NEW YORK Concern among investors that General Electric Co  may not generate enough cash this year to fully cover its dividend and other promised spending sent its stock to its lowest level in more than four years on Wednesday.",
        "date": "10122017",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "GE stock hits 4-year low as analysts debate possibility of dividend cut "
    },
    {
        "content": "NEW YORK  Oct 11 Concern among investors that General Electric Co may not generate enough cash this year to fully cover its dividend and other promised spending sent its stock to its lowest level in more than four years on Wednesday.",
        "date": "10122017",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "ANALYSIS-GE stock hits 4-yr low as analysts debate possibility of dividend cut "
    },
    {
        "content": "NEW YORK Warren Buffett's Berkshire Hathaway Inc on Monday said it added a stake in Synchrony Financial  boosting its bet on the credit card industry  and shed its investment in the company's former parent  General Electric Co.",
        "date": "08142017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "Buffett's Berkshire adds Synchrony  sheds GE "
    },
    {
        "content": "NEW YORK  Aug 14 Warren Buffett's Berkshire Hathaway Inc on Monday said it added a stake in Synchrony Financial  boosting its bet on the credit card industry  and shed its investment in the company's former parent  General Electric Co.",
        "date": "08142017",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "UPDATE 1-Buffett's Berkshire adds Synchrony  sheds GE "
    },
    {
        "content": "NEW YORK  Aug 14 Warren Buffett's Berkshire Hathaway Inc on Monday said it has taken a 17.5 million share stake in Synchrony Financial and shed its investment in the financial services company's former parent  General Electric Co.",
        "date": "08142017",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "Buffett's Berkshire sheds GE  adds Synchrony "
    },
    {
        "content": "* Shares down 3 percent after touching 2-year low (Adds BreakingViews link)",
        "date": "07212017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "UPDATE 7-GE shares fall as profit slumps  investors await new CEO's targets "
    },
    {
        "content": "* Synchrony Financial reports second quarter net earnings of $496 million or $0.61 per diluted share",
        "date": "07212017",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial reports Q2 net earnings of $496 mln or EPS $0.61 "
    },
    {
        "content": "* Flannery to take over as CEO on Aug. 1  chairman on Dec. 31",
        "date": "06122017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "UPDATE 8-GE's new CEO Flannery to review portfolio with 'no constraint' "
    },
    {
        "content": "BUDAPEST/WARSAW  May 26 Several smaller cross-border banking mergers remain in the pipeline in central Europe as some western European lenders retreat from the region  although the immediate pressure to do deals has eased thanks to stronger local economies.",
        "date": "05262017",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "REUTERS SUMMIT-Strengthening central Europe can expect more banking M&A deals "
    },
    {
        "content": "* Synchrony Financial announces plans to increase quarterly common stock dividend to $0.15 per share and approval of a $1.64 billion share repurchase program",
        "date": "05182017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial announces plans to increase quarterly dividend to $0.15/shr "
    },
    {
        "content": "* GE Capital exits European consolidated prudential supervision",
        "date": "03302017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-General Electric says GE Capital exits European consolidated prudential supervision "
    },
    {
        "content": "* Synchrony Financial and Midas extend auto care consumer financing agreement",
        "date": "03272017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony financial and Midas extend auto care consumer financing deal "
    },
    {
        "content": "* Synchrony Financial to broaden cutting edge mobile commerce solutions for retailers through its acquisition of GPShopper",
        "date": "03202017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial to buy GPShopper "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd cuts share stake in Alibaba Group Holding Ltd by 10.3 percent to 35.5 million ADS",
        "date": "02142017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Temasek Holdings cuts share stake Alibaba  Univar  Synchrony Financial "
    },
    {
        "content": "* Synchrony financial and Belk extend consumer financing program agreement",
        "date": "01252017",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony financial and Belk extend consumer financing program agreement "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Succession planning is a big deal at most public companies. For the first time in 124 years  General Electric's may be determined by dealmaking. As Jeff Immelt nears retirement  the progress of two large acquisitions in the coming year will help guide GE's board on who should get the top job.",
        "date": "12292016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "GE's succession path lit by dueling deals "
    },
    {
        "content": "* Baker Hughes shares plunge   (Adds graphic  interview with GE and Baker Hughes executives  detail on breakup fee)",
        "date": "10312016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "UPDATE 6-GE to merge oil unit with Baker Hughes to create service giant "
    },
    {
        "content": "Oct 24 Synchrony Financial said on Monday its has joined R3  a group of companies working on blockchain technology  making it the first credit-card issuer to join the consortium.",
        "date": "10242016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "Credit-card issuer Synchrony Financial joins blockchain group "
    },
    {
        "content": "* Synchrony Financial and Hhgregg extend consumer financing program agreement",
        "date": "10102016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial and Hhgregg extend consumer financing program agreement "
    },
    {
        "content": "SEOUL Three private equity firms are bidding for General Electric's  43 percent stake in its South Korean credit card joint venture  Hyundai Card  in a deal that may be worth more than 600 billion won ($537 million)  Invest Chosun reported on Tuesday.",
        "date": "09202016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "Three private equity firms bid for GE's Hyundai Card stake: Invest Chosun "
    },
    {
        "content": "SEOUL  Sept 20 Three private equity firms are bidding for General Electric's 43 percent stake in its South Korean credit card joint venture  Hyundai Card  in a deal that may be worth more than 600 billion won ($537 million)  Invest Chosun reported on Tuesday.",
        "date": "09202016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "Three private equity firms bid for GE's Hyundai Card stake - Invest Chosun "
    },
    {
        "content": "Aug 30 General Electric Co on Tuesday named Richard Laxer chief executive of GE Capital  which the conglomerate began shrinking in 2015 as part of efforts to return to its industrial roots.",
        "date": "08302016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "UPDATE 1-GE names Richard Laxer CEO of GE Capital "
    },
    {
        "content": "Aug 30 General Electric Co on Tuesday appointed Richard Laxer as chief executive of its finance arm  GE Capital.",
        "date": "08302016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "GE names Richard Laxer CEO of GE Capital "
    },
    {
        "content": "* Keith S. Sherin to retire from GE after 35 years of service; Richard A. Laxer to lead GE Capital",
        "date": "08302016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "BRIEF- Keith Sherin to retire from General Electric and Richard Laxer to lead GE Capital "
    },
    {
        "content": "* Files for pricing of $200.0 million floating rate senior notes due 2017 - SEC filing  Source: (http://bit.ly/2bCulUh) Further company coverage:",
        "date": "08242016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial files for pricing of $200.0 mln senior notes "
    },
    {
        "content": "* Acquires 12 percent stake in Townsquare; Purchased about 3.2 million shares of GE Capital's class C common stock in private transaction",
        "date": "08172016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Madison Square Garden- Acquires 12 percent stake in Townsquare "
    },
    {
        "content": "* The Madison Square Garden Company  acquires 12 percent stake in Townsquare",
        "date": "08172016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "BRIEF-MSG Networks says Madison Square Garden acquires 12 pct stake in Townsquare "
    },
    {
        "content": "MILAN Italian bank Banca IFIS  said on Thursday it had agreed to buy GE Capital's  financial unit GE Capital Interbanca in a 2 billion euros ($2.2 billion) deal.",
        "date": "07282016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "Italy's Banca IFIS to buy Interbanca from GE Capital for 2 billion euros "
    },
    {
        "content": "MILAN  July 28 Italian bank Banca IFIS  said on Thursday it had agreed to buy GE Capital's  financial unit GE Capital Interbanca in a 2 billion euros ($2.2 billion) deal.",
        "date": "07282016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "Italy's Banca IFIS to buy Interbanca from GE Capital for 2 bln euros "
    },
    {
        "content": "* GE sells 14.4% stake in Penske Truck Leasing to Penske Automotive Group",
        "date": "07282016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "BRIEF-GE sells 14.4% stake in Penske Truck Leasing "
    },
    {
        "content": "NEW YORK  July 22 General Electric Co on Friday reported weak demand for new oil  gas and transportation equipment  raising concerns about its full-year performance and sending its shares down as much as 2.8 percent.",
        "date": "07222016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "UPDATE 4-GE reports weak demand for oil  transport equipment; profit beats "
    },
    {
        "content": "* Synchrony Financial reports second quarter net earnings of $489 million or $0.58 per diluted share",
        "date": "07222016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial reports Q2 earnings per share $0.58 "
    },
    {
        "content": "* Announced agreement with Cathay Pacific Airways to introduce a new co-branded visa credit program for u.s. Travelers",
        "date": "07192016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial and Cathay Pacific Airways to introduce credit card program "
    },
    {
        "content": "* Says expects to provide details about its capital plan on or before its next quarterly earnings update in July 2016 - SEC Filing  Source text for Eikon: (http://1.usa.gov/295n4bx) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06292016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial expects to provide capital plan details by its quarterly earnings update in July - SEC Filing "
    },
    {
        "content": "* To acquire approximately $581 million in performing loans and related relationships from an affiliate of GE Capital franchise finance",
        "date": "06272016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Wintrust Financial to buy some loans from GE Capital Franchise Finance "
    },
    {
        "content": "* GE Capital CEO Keith Sherin- compliance spending will go down further after SIFI decision  - CNBC",
        "date": "06292016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "BRIEF-GE Capital CEO says compliance spending will go down further after SIFI decision- CNBC "
    },
    {
        "content": "* GE Capital receives approval for rescission of status as systemically important financial institution",
        "date": "06292016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "BRIEF-GE Capital cancels status as \"systemically important\" "
    },
    {
        "content": "* GIC Private Limited reports 5.24 pct passive stake in Synchrony Financial as of June 16 - SEC filing",
        "date": "06232016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-GIC Private Limited reports 5.24 pct passive stake in Synchrony Financial "
    },
    {
        "content": "* Now expecting a 20-30 basis point increase in net charge-off rates as we look out over next 12 months",
        "date": "06142016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial expects higher reserve builds starting in Q2 "
    },
    {
        "content": "* Daniel S. Henson was elected to its board of directors effective June 2  2016",
        "date": "06062016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-On Deck Capital says Daniel Henson joins board "
    },
    {
        "content": "BUDAPEST  May 31 Hungary plans to set up a special vehicle to handle non-performing mortgages that burden banks' books  part of its efforts to encourage lending and spur the economy after a weak first quarter  its economy minister said on Tuesday.",
        "date": "05312016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "REUTERS SUMMIT-Hungary plans special vehicle to tackle distressed mortgages "
    },
    {
        "content": "BRUSSELS  May 31 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05312016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "EU mergers and takeovers (May 31) "
    },
    {
        "content": "* Moneta Money Bank says GE Capital will sell further 33 101 565 shares of Moneta common stock through an overallotment option on this month's listing on the Prague stock market at the offer price of 68 crowns per share",
        "date": "05202016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-GE Capital to cut stake in Moneta Bank to 42 pct through overallotment sale "
    },
    {
        "content": "* Synchrony Financial and Suzuki extend powersports consumer financing program agreement  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05042016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial  Suzuki extend powersports consumer financing program agreement "
    },
    {
        "content": "* GE closes sale of Franchise Finance U.S. Hotel business to western alliance; sale includes approximately $1.3 billion in ending net investment",
        "date": "04252016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-GE closes sale of Franchise Finance U.S. Hotel business to Western Alliance "
    },
    {
        "content": "* Says co and La-Z-Boy extend consumer credit card program agreement  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04202016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial  La-Z-Boy extend consumer credit card program agreement "
    },
    {
        "content": "* Synchrony financial reports first quarter net earnings of $582 million or $0.70 per diluted share",
        "date": "04222016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Synchrony Financial Q1 earnings per share $0.70 "
    },
    {
        "content": "* CWB to acquire GE Capital's Canadian franchise finance business",
        "date": "04072016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-Canadian Western Bank to buy GE Capital's Canadian franchise finance business "
    },
    {
        "content": "WARSAW  April 1 Poland's mid-tier lender Alior Bank has agreed to buy local rival Bank BPH's  core business from General Electric for 1.225 billion zlotys ($328.52 million)  or at a price to book value ratio of 0.93  Alior said on Friday.",
        "date": "04012016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "Poland's Alior Bank agrees Polish GE's unit buy for $329 mln "
    },
    {
        "content": "WASHINGTON  March 31 General Electric Co's  GE Capital financing arm on Thursday formally asked the U.S. government to stop designating it as a \"systemically important financial institution \" a label given to companies considered \"too big to fail.\"",
        "date": "03312016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "GE Capital asks U.S. government to lift 'too big to fail' designation "
    },
    {
        "content": "WASHINGTON Lender GE Capital asked the U.S. government on Thursday to stop designating it as \"too big to fail \" saying it had shrunk to the point where it would not pose a major threat to the nation's financial stability if it experiences distress. | Video ",
        "date": "04012016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "GE Capital asks U.S. government to lift 'too big to fail' designation "
    },
    {
        "content": "WASHINGTON  March 31 Lender GE Capital asked the U.S. government on Thursday to stop designating it as \"too big to fail \" saying it had shrunk to the point where it would not pose a major threat to the nation's financial stability if it experiences distress.",
        "date": "03312016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "UPDATE 4-GE Capital asks U.S. government to lift 'too big to fail' designation "
    },
    {
        "content": "NEW YORK Soros Fund Management  the team investing billionaire George Soros' fortune  is betting big on consumer finance by taking a large position in Synchrony Financial   according to a U.S. securities filing on Tuesday.",
        "date": "02162016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "Soros Fund Management takes stake in consumer lender Synchrony Financial: filing "
    },
    {
        "content": "NEW YORK  Feb 16 Soros Fund Management  the team investing billionaire George Soros' fortune  is betting big on consumer finance by taking a large position in Synchrony Financial  according to a U.S. securities filing on Tuesday.",
        "date": "02162016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "Soros Fund Management takes stake in consumer lender Synchrony Financial - filing "
    },
    {
        "content": "* GE Capital signed $157 billion of dispositions in 2015  on track to submit application for SIFI de-designation in 1Q'16",
        "date": "01222016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "BRIEF-GE says GE Capital reports 4th-qtr revenue of $2.59 bln  down 11 pct "
    },
    {
        "content": "* Massachusetts to give up to $120 mln in grants  incentives   (Adds details about tax rates in Connecticut and Massachusetts  comment by Connecticut governor)",
        "date": "01132016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "UPDATE 5-GE moving headquarters to Boston for tech talent  tax cut "
    },
    {
        "content": "U.S. conglomerate General Electric Co said it signed $157 billion in transactions in 2015 as part of its efforts to divest most of its finance business  GE Capital.",
        "date": "01072016",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "GE signs deals of $157 billion as part of GE Capital divestment "
    },
    {
        "content": "Jan 7 U.S. conglomerate General Electric Co  said it signed $157 billion in transactions in 2015 as part of its efforts to divest most of its finance business  GE Capital.",
        "date": "01072016",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "GE signs deals of $157 bln as part of GE Capital divestment "
    },
    {
        "content": "NEW YORK General Electric options have dominated the market this week  as traders have been using a complex trading strategy to take advantage of the conglomerate's tender offer for Synchrony Financial  shares to make a small profit.",
        "date": "11132015",
        "name": "Synchrony Financial",
        "news_type": "topStory",
        "symbol": "SYF",
        "title": "GE options volume surges on Synchrony swap "
    },
    {
        "content": "Aug 13 Goldman Sachs Group Inc is buying GE Capital Bank's U.S. online deposits  a move that will give the largest U.S. investment bank a more stable source of funding to help it better weather future crises.",
        "date": "08132015",
        "name": "Synchrony Financial",
        "news_type": "normal",
        "symbol": "SYF",
        "title": "UPDATE 3-Goldman Sachs to buy GE Capital's U.S. online deposits "
    }
]