[
    {
        "content": "* Symantec Corp - ‍SurfEasy will become part of Symantec's consumer business unit  which includes Norton and Lifelock brands​ Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec to acquire SurfEasy Inc "
    },
    {
        "content": "* closing of transaction took place simultaneously with entering into of agreement and all conditions for completion have therefore been fulfilled",
        "date": "11062017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Opera Software sells Surfeasy business to Symantec "
    },
    {
        "content": "* Symantec Corp - qtrly GAAP revenue $1 240​ million versus $979 million last year",
        "date": "11012017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec Corp reports qtrly non-GAAP EPS $0.40​ "
    },
    {
        "content": "* Symantec Corp files for offering of up to 1.0 million shares of common stock by the selling stockholders Source text: (http://bit.ly/2gt2Ufx) Further company coverage:",
        "date": "10202017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec Corp files for offering of up to 1.0 million shares of common stock "
    },
    {
        "content": "WASHINGTON U.S.-based cyber firm Symantec  is no longer allowing governments to review the source code of its software because of fears the agreements would compromise the security of its products  Symantec Chief Executive Greg Clark said in an interview with Reuters. | Video ",
        "date": "10102017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Exclusive: Symantec CEO says source code reviews pose unacceptable risk "
    },
    {
        "content": "* Reports a 11.3 pct passive stake in Symantec Corp as of September 30 - SEC filing ‍​ Source text: (http://bit.ly/2zaYTUV) Further company coverage:",
        "date": "10102017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-T. Rowe Price Associates reports a 11.3 pct passive stake in Symantec "
    },
    {
        "content": "MUMBAI Symantec Corp  a digital security company  says it has identified a sustained cyber spying campaign  likely state-sponsored  against Indian and Pakistani entities involved in regional security issues.",
        "date": "08282017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Exclusive: India and Pakistan hit by spy malware - cybersecurity firm "
    },
    {
        "content": "* Says Airtel and Symantec enter strategic partnership to offer cyber security solutions to businesses in India",
        "date": "08282017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Bharti Airtel  Symantec partner to offer cyber security solutions to businesses in India "
    },
    {
        "content": "* Symantec Corp - CEO Gregory Clark's total compensation for 2017 was $6.1 million - SEC filing‍​",
        "date": "08162017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec CEO Gregory Clark's total compensation for 2017 was $6.1 mln "
    },
    {
        "content": "NEW YORK  Aug 15 US internet security company DigiCert's banks have begun sounding out prospective investors about the debt financing that will support the company's acquisition of Symantec’s web certification business  according to four sources familiar with the matter.",
        "date": "08152017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "LPC: DigiCert to back Symantec unit buy with US$1.59bn loan "
    },
    {
        "content": "Symantec Corp raised its full-year adjusted revenue forecast above analysts' estimates as the cyber security provider benefits from strong demand in its enterprise division.",
        "date": "08022017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec raises FY revenue forecast above estimates "
    },
    {
        "content": "* Digicert to acquire Symantec's website security and related PKI solutions",
        "date": "08022017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Digicert to acquire Symantec's website security  related PKI solutions "
    },
    {
        "content": "Aug 2 Symantec Corp reported a 33 percent rise in quarterly revenue on Wednesday  helped by strong demand for its cyber security products.",
        "date": "08022017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec reports 33 percent rise in revenue "
    },
    {
        "content": "* Symantec Corp says ‍if deal is terminated  Digicert Entities will collectively be required to pay co $110 million as termination fee - SEC filing Source text: (http://bit.ly/2v4YKCz) Further company coverage:",
        "date": "08042017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec says ‍Digicert Entities to pay $110 mln on termination of the deal "
    },
    {
        "content": "Cyber security company Symantec Corp  has agreed to sell its business that helps verify the identity of websites to buyout firm Thoma Bravo LLC  people familiar with the matter said on Wednesday  a move that extricates it from a feud with Alphabet Inc's Google .",
        "date": "08022017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec to sell Web certificates business to Thoma Bravo: sources "
    },
    {
        "content": "Aug 2 Cyber security company Symantec Corp has agreed to sell its business that helps verify the identity of websites to buyout firm Thoma Bravo LLC  people familiar with the matter said on Wednesday  a move that extricates it from a feud with Alphabet Inc's Google.",
        "date": "08022017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec to sell Web certificates business to Thoma Bravo -sources "
    },
    {
        "content": "Cybersecurity firm Symantec Corp  is considering selling its website certification business  in a deal that could fetch more than $1 billion and extricate it from a feud with Alphabet Inc's  Google  people familiar with the matter said on Tuesday.",
        "date": "07122017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec explores selling web certificates business: sources "
    },
    {
        "content": "July 11 Cybersecurity firm Symantec Corp is considering selling its website certification business  in a deal that could fetch more than $1 billion and extricate it from a feud with Alphabet Inc's Google  people familiar with the matter said on Tuesday.",
        "date": "07122017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "UPDATE 1-Symantec explores selling web certificates business -sources "
    },
    {
        "content": "SAN FRANCISCO Symantec Corp  is acquiring Israeli cybersecurity startup Fireglass  the company said on Thursday  in a small deal designed to boost its products that protect corporate email and web browsing from threats. | Video ",
        "date": "07062017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec to buy Israeli cybersecurity firm Fireglass "
    },
    {
        "content": "SAN FRANCISCO  July 6 Symantec Corp is acquiring Israeli cybersecurity startup Fireglass  the company said on Thursday  in a small deal designed to boost its products that protect corporate email and web browsing from threats.",
        "date": "07062017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "CORRECTED-Symantec to buy Israeli cybersecurity firm Fireglass "
    },
    {
        "content": "July 11 Cybersecurity firm Symantec Corp is considering selling its website certification business  in a deal that could fetch more than $1 billion and extricate it from a feud with Alphabet Inc's Google  people familiar with the matter said on Tuesday.",
        "date": "07112017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec explores selling web certificates business -sources "
    },
    {
        "content": "* Symantec to acquire Fireglass to bring a generational leap forward in user protection",
        "date": "07062017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec to acquire Fireglass to bring a generational leap forward in user protection "
    },
    {
        "content": "* Panasonic will join with businesses inside and outside japan including Symantec to offer security services for the \"internet of things\" Source text for Eikon: Further company coverage:",
        "date": "07052017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Panasonic partners with Symantec to offer security services for \"Internet Of Things\"-Nikkei "
    },
    {
        "content": "* Symantec corp says  reaffirmed its financial guidance for q1 and full fiscal year 2018",
        "date": "06082017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec Corp says reaffirmed its financial guidance for Q1 and FY2018 "
    },
    {
        "content": "SAN FRANCISCO Cyber security firm Symantec Corp  said on Monday it was \"highly likely\" a hacking group affiliated with North Korea was behind the WannaCry cyber attack this month that infected more than 300 000 computers worldwide and disrupted hospitals  banks and schools across the globe.",
        "date": "05252017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec says 'highly likely' North Korea group behind ransomware attacks "
    },
    {
        "content": "* Norton by Symantec announced that Norton Core  secure wi-fi router  is available for pre-order purchase at Amazon and Best Buy Source text for Eikon: Further company coverage:",
        "date": "05152017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec says Norton Core is available for pre-order purchase at Amazon and Best Buy "
    },
    {
        "content": "* Blocks 22 million attempted wannacry ransomware attacks globally",
        "date": "05162017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec says it blocked nearly 22 mln WannaCry infection attempts across 300 000 endpoints "
    },
    {
        "content": "* Symantec reports fourth quarter and fiscal year 2017 results",
        "date": "05102017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec reports quarterly loss per share $0.23 "
    },
    {
        "content": "TORONTO Hackers are demanding increasingly hefty ransoms to free computers paralyzed with viruses  as cyber criminals seek to maximize profits from large numbers of victims willing to pay up  according to cyber security firm Symantec Corp .",
        "date": "04262017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Cyber extortion demands surge as victims keep paying: Symantec "
    },
    {
        "content": "A federal appeals court on Friday upheld last year’s $60 million settlement of a nationwide class action over computer security company Symantec’s marketing of “download insurance” for its popular Norton anti-virus software  rejecting claims by two objectors that attorneys will pocket too much of the total.",
        "date": "04282017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "8th Circuit upholds $60M Symantec settlement over ‘download insurance’ "
    },
    {
        "content": "* Symantec Corp - has filed a second patent infringement lawsuit against Zscaler  Inc. In U.S. Federal district court for district of delaware",
        "date": "04182017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec files second patent infringement lawsuit against Zscaler "
    },
    {
        "content": "* Making pre-breach cybersecurity services from Symantec Corp. available to eligible Travelers cyber policyholders Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Travelers Companies offers customers cybersecurity services from Symantec "
    },
    {
        "content": "SAN FRANCISCO  April 10 Past cyber attacks on scores of organizations around the world were conducted with top-secret hacking tools that were exposed recently by the Web publisher Wikileaks  the security researcher Symantec Corp said on Monday.",
        "date": "04102017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec attributes 40 cyber attacks to CIA-linked hacking tools "
    },
    {
        "content": "* Symantec Corp - on March 10  entered into accelerated stock repurchase agreements with financial institutions to repurchase $500 million of co's common stock",
        "date": "03132017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec Corp entered into accelerated stock repurchase agreements "
    },
    {
        "content": "* Symantec Corp says formation of Symantec Ventures to help cyber security startups accelerate delivery of core innovation to security marketplace  Source text for Eikon: Further company coverage:",
        "date": "03022017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec announces the formation of Symantec Ventures "
    },
    {
        "content": "Security software provider Symantec Corp held talks to acquire FireEye Inc about six months ago  but is not currently pursuing a deal with the cyber security company  people familiar with the matter said on Thursday.",
        "date": "02232017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec sought to buy FireEye  talks end with no deal: sources "
    },
    {
        "content": "Feb 23 Security software provider Symantec Corp  held talks to acquire FireEye Inc about six months ago  but is not currently pursuing a deal with the cyber security company  people familiar with the matter said on Thursday.",
        "date": "02232017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec sought to buy FireEye  talks end with no deal -sources "
    },
    {
        "content": "* Tiger Global Management dissolves share stake in Apple - sec filing",
        "date": "02142017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Tiger Global Management dissolves in Apple  takes in Symantec "
    },
    {
        "content": "* Capital world investors reports a 9.4 percent passive stake in symantec corp as of dec 30  2016 -sec filing  Source text for Eikon: (http://bit.ly/2kaETOj) Further company coverage:",
        "date": "02102017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Capital World Investors reports a 9.4 pct passive stake in Symantec Corp "
    },
    {
        "content": "* Symantec Corp - Increasing financial outlook for fiscal year 2017",
        "date": "02012017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec reports Q3 fiscal year 2017 results "
    },
    {
        "content": "* Symantec Corp - to offer $1.0 billion aggregate principal amount of senior unsecured notes due 2025",
        "date": "02012017",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec to offer $1.0 bln in senior unsecured notes "
    },
    {
        "content": "* LifeLock Inc- on January 16  2017  co  entered into amendment No. 1 to merger agreement with Symantec Corp- sec filing",
        "date": "01172017",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-LifeLock entered into amendment No.1 to merger agreement with Symantec on Jan. 16  2017 "
    },
    {
        "content": "Nov 20 Symantec Corp was in the lead to acquire LifeLock Inc following an auction for the U.S. identity theft protection services company  people familiar with the matter said on Sunday.",
        "date": "11202016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec in the lead to acquire LifeLock-sources "
    },
    {
        "content": "* Lifelock-Will be required to pay Symantec termination fee of $87.5 million if the merger agreement is terminated under certain circumstances-SEC filing",
        "date": "11212016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Lifelock- will pay symantec termination fee of $87.5 mln if merger fails "
    },
    {
        "content": "Symantec Corp  said it would acquire U.S. identity theft protection services company LifeLock Inc  for $2.3 billion  in a deal that it hopes will prop up sales at its Norton cybersecurity unit.",
        "date": "11212016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec to acquire LifeLock for $2.3 billion "
    },
    {
        "content": "* Fireeye names former Symantec and Nuance Communications executive Bill Robbins head of worldwide sales  Source text for Eikon:  Further company coverage:",
        "date": "11172016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-FireEye names former Symantec executive as head of worldwide sales "
    },
    {
        "content": "Nov 20 Symantec Corp said it would acquire U.S. identity theft protection services company LifeLock Inc for $2.3 billion  in a deal that it hopes will prop up sales at its Norton cybersecurity unit.",
        "date": "11212016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "UPDATE 4-Symantec to acquire LifeLock for $2.3 billion "
    },
    {
        "content": "Computer security software manufacturer Symantec Corp.  will acquire LifeLock Inc.  for $2.3 billion in cash  according to a tweet from CNBC  citing Dow Jones.",
        "date": "11212016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec agrees to buy LifeLock for $2.3 billion in cash: media "
    },
    {
        "content": "* Symantec has joined Dropbox Partner Network; company  Symantec to support \"multiple integration initiatives\"  Source text for Eikon:",
        "date": "11162016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec joins Dropbox Partner Network "
    },
    {
        "content": "Nov 20 Computer security software manufacturer Symantec Corp. will acquire LifeLock Inc. for $2.3 billion in cash  according to a tweet from CNBC  citing Dow Jones.",
        "date": "11212016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec agrees to buy LifeLock for $2.3 billion in cash -media "
    },
    {
        "content": "* Symantec Corp - Chief Financial Officer Noviello's annual base salary is $650 000  Source text: [http://bit.ly/2fpSrPs] Further company coverage:",
        "date": "11042016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec Corp says CFO Noviello's annual base salary is $650 000 "
    },
    {
        "content": "* Q2 earnings per share view $0.20  revenue view $978.9 million -- Thomson Reuters I/B/E/S",
        "date": "11032016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec- Q2 loss per share $0.23 "
    },
    {
        "content": "* Symantec Corp - Thomas Seifert  exec-VP and Chief Financial Officer  has informed board of directors of his plans to step down as CFO",
        "date": "11032016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec announces CFO transition "
    },
    {
        "content": "* Symantec Corp files for stock shelf; size undisclosed - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "10112016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec files for stock shelf size undisclosed - SEC filing "
    },
    {
        "content": "Cyber-security firm Symantec Corp said on Tuesday that a second hacking group has sought to rob banks using fraudulent SWIFT messages  the same approach that yielded $81 million in the high-profile February attack on Bangladesh's central bank.",
        "date": "10112016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Second hacker group targets SWIFT users  Symantec warns "
    },
    {
        "content": "Oct 11 Cyber-security firm Symantec Corp  said on Tuesday that a second hacking group has sought to rob banks using fraudulent SWIFT messages  the same approach that yielded $81 million in the high-profile February attack on Bangladesh's central bank.",
        "date": "10112016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "CORRECTED-Second hacker group targets SWIFT users  Symantec warns "
    },
    {
        "content": "Sept 26 ForeScout Technologies Inc has interviewed investment banks in recent weeks to hire underwriters for an initial public offering that could value the U.S. network security company at as much as $1 billion  people familiar with the matter said on Monday.",
        "date": "09262016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Network security company ForeScout interviews banks for IPO -sources "
    },
    {
        "content": "Symantec Corp shares could gain 25 percent or more following steps to cut costs and a recent acquisition that could propel the company's business in the hot cybersecurity market  a Barron's report said on Sunday.",
        "date": "08282016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Cost-cutting  growth could lift Symantec shares 25 percent: Barron's "
    },
    {
        "content": "FRANKFURT A previously unknown hacking group variously dubbed \"Strider\" or \"ProjectSauron\" has carried out cyber-espionage attacks against select targets in Russia  China  Iran  Sweden  Belgium and Rwanda  security researchers said on Monday.",
        "date": "08082016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "New spyware detected targeting firms in Russia  China: Symantec "
    },
    {
        "content": "FRANKFURT  Aug 8 A previously unknown group called \"Strider\" has been conducting cyber-espionage attacks against selected targets in Russia  China  Sweden  and Belgium  U.S.-based computer security firm Symantec Corp said on Monday.",
        "date": "08082016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "New spyware detected targeting firms in Russia  China - Symantec "
    },
    {
        "content": "Symantec Corp reported better-than-expected revenue for the first quarter and its revenue forecast for the current quarter also topped analysts' estimates  helped by strong demand for its security products from enterprise clients.",
        "date": "08042016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec results  forecast boosted by strong enterprise demand "
    },
    {
        "content": "Aug 4 Symantec Corp reported better-than-expected revenue for the first quarter and its revenue forecast for the current quarter also topped analysts' estimates  helped by strong demand for its security products from enterprise clients.",
        "date": "08042016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "UPDATE 1-Symantec results  forecast boosted by strong enterprise demand "
    },
    {
        "content": "* Q1 earnings per share view $0.25 -- Thomson Reuters I/B/E/S",
        "date": "08042016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec corp sees Q2 rev $960-$990 mln "
    },
    {
        "content": "Aug 4 Antivirus software maker Symantec Corp  reported a 3 percent fall in quarterly revenue as demand for its consumer security products slows down amid stiff competition.",
        "date": "08042016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "CORRECTED-Symantec revenue falls "
    },
    {
        "content": "* On July 18  2016  co entered into amendment agreement  dated as of July 18  2016 to credit agreement  dated as of may 10  2016",
        "date": "07202016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec entered into amendment to credit agreement "
    },
    {
        "content": "NEW YORK  July 12 Norton antivirus software maker Symantec is in the market with US$2.8bn in term loans backing the company's US$4.65bn acquisition of privately held cyber security company Blue Coat  sources said.",
        "date": "07122016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "LPC: Symantec markets US$2.8bn in term loans for Blue Coat acquisition "
    },
    {
        "content": "* Appoints Michael Fey as president and chief operating officer upon closing of Blue Coat acquisition",
        "date": "07112016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec appoints Michael Fey president  COO upon closing of Blue Coat acquisition "
    },
    {
        "content": "A U.S. federal agency issued a security alert over a vulnerability in Symantec Corp's anti-virus software that allows attackers to remotely control affected computers.",
        "date": "07052016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "U.S. agency warns of security bug in Symantec's anti-virus software "
    },
    {
        "content": "July 11 Cyber security firm Symantec Corp  said on Monday it planned to appoint Michael Fey to the post of president and chief operating officer as it prepares to purchase his company  Blue Coat  for $4.65 billion.",
        "date": "07112016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec names Fey COO as it prepares to close Blue Coat deal "
    },
    {
        "content": "July 5 A U.S. federal agency issued a security alert over a vulnerability in Symantec Corp's  anti-virus software that allows attackers to remotely control affected computers.",
        "date": "07052016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "US agency warns of security bug in Symantec's anti-virus software "
    },
    {
        "content": "* FireEye said to have rebuffed several recent takeover offers - Bloomberg  citing sources",
        "date": "06152016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-FireEye said to have rebuffed several recent takeover offers - Bloomberg "
    },
    {
        "content": "Technology security firm Symantec Corp said it would buy privately held cyber security company Blue Coat for $4.65 billion in a cash deal that will ramp up Symantec's enterprise security business.",
        "date": "06132016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec to buy Blue Coat for $4.7 billion to boost enterprise unit "
    },
    {
        "content": "June 12 Technology security firm Symantec Corp  said it would buy privately held cyber security company Blue Coat for $4.65 billion in a cash deal that will ramp up Symantec's enterprise security business.",
        "date": "06132016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec to buy Blue Coat for $4.7 bln to boost enterprise unit "
    },
    {
        "content": "* Greg clark  Blue Coat Ceo  to lead symantec following closing",
        "date": "06132016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec to acquire Blue Coat for about $4.65 billion in cash "
    },
    {
        "content": "* Symantec set to buy Blue Coat Systems in $4.65 billion deal Greg Clark is set to take ceo role at Symantec after deal closes-WSJ    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "06132016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec set to buy blue coat systems in $4.65 billion deal - WSJ "
    },
    {
        "content": "WASHINGTON Hackers who stole $81 million from Bangladesh's central bank have been linked to another cyber attack  this time on a bank in the Philippines  in addition to the 2014 hack on Sony Pictures Entertainment  cyber security company Symantec Corp said in a blog post on Thursday.",
        "date": "05262016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec says SWIFT heist linked to Philippines attack  Sony hack "
    },
    {
        "content": "May 26 The malware that was used to steal $81 million from Bangladesh's central bank has been linked to another cyber attack  this time on a bank in the Philippines  cyber security company Symantec Corp said in a blog post on Thursday.",
        "date": "05262016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec says SWIFT malware linked to attack in Philippines "
    },
    {
        "content": "* SWIFT attackers' malware linked to more financial attacks  bank in Philippines was also targeted by attackers -  Symantec blog",
        "date": "05262016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "BRIEF-Philippines bank also targeted by SWIFT hackers - Symantec "
    },
    {
        "content": "* Q4 earnings per share view $0.23 -- Thomson Reuters I/B/E/S",
        "date": "05122016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec Q4 shr $3.15 "
    },
    {
        "content": "LONDON  May 11 Standard Chartered has hired former Symantec Corp executive Cheri McGuire to be its new chief information security officer  the bank said on Wednesday  as lenders globally step up efforts to combat threats to cyber security.",
        "date": "05112016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "StanChart hires new cyber security chief from Symantec "
    },
    {
        "content": "Symantec Corp   best known for its Norton antivirus software  estimated fourth-quarter profit and revenue below analysts' estimates  and said Chief Executive Michael Brown would step down.",
        "date": "04282016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec's fourth-quarter estimates miss Street  says CEO Brown to step down "
    },
    {
        "content": "April 28 Symantec Corp  best known for its Norton antivirus software  cut its fourth-quarter profit and revenue forecast below analysts' estimates  and said its Chief Executive Michael Brown will step down.",
        "date": "04282016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec cuts 4th-qtr forecast  says CEO Brown to step down "
    },
    {
        "content": "* Launches $1 billion accelerated share repurchase transaction",
        "date": "03222016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec launches $1 bln accelerated share repurchase transaction "
    },
    {
        "content": "BERLIN  Feb 26 As anxiety over a slowing global economy grows  private equity players are looking to swoop on distressed assets but are fearful that funding could dry up.",
        "date": "02262016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Private equity sees risks and reward in uncertain times "
    },
    {
        "content": " (Correcting 12th paragraph of story published Feb. 18 to remove extra word \"is\" in quote from Symantec's Bob Shaker)",
        "date": "02192016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "California hospital makes rare admission of hack  ransom payment "
    },
    {
        "content": "LOS ANGELES/BOSTON  Feb 18 While it was not the first hacked organization to acquiesce to attackers' demands  the California hospital that paid $17 000 in ransom to hackers to regain control of its computer system was unusual in one notable way: It went public with the news.",
        "date": "02192016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "REFILE-California hospital makes rare admission of hack  ransom payment "
    },
    {
        "content": "Symantec Corp   best known for its Norton antivirus software  said Silver Lake Partners had invested $500 million in the company and that the private equity firm would get a board seat. | Video ",
        "date": "02052016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec gets $500 million from Silver Lake  sets $2.3 billion buyback "
    },
    {
        "content": "* Shares jump 9.5 pct after hours   (Adds details saying Elliott Management builds stake in Symantec)",
        "date": "02052016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "UPDATE 3-Symantec gets $500 mln from Silver Lake  sets $2.3 bln buyback "
    },
    {
        "content": "A federal appeals court on Tuesday revived Columbia University's claims against Symantec Corp on two malware patents but affirmed a win for the computer-security vendor on four others.",
        "date": "02032016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec  Columbia University split win on malware patents "
    },
    {
        "content": "Feb 4 Symantec Corp  best known for its Norton antivirus software  said investment firm Silver Lake Partners had invested $500 million in the company.",
        "date": "02042016",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Silver Lake invests $500 mln in Symantec "
    },
    {
        "content": "Jan 19 Antivirus software maker Symantec Corp  said on Tuesday it will receive $1 billion less in cash for its data storage unit Veritas from Carlyle Group LP  cutting the price of the biggest leveraged buyout of 2015 after debt backing the deal failed to sell.",
        "date": "01202016",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec to get $1 billion less cash in sale of Veritas to Carlyle "
    },
    {
        "content": "Symantec Corp  best known for its Norton antivirus software  reported a quarterly profit above market estimates on Thursday  helped by cost controls as it focuses on life after the pending sale of its data management business.",
        "date": "11052015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec beats profit estimates  accelerates buyback "
    },
    {
        "content": "* Sale of Veritas on track to close by year-end   (Adds details  analyst comment)",
        "date": "11052015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "UPDATE 2-Symantec beats profit estimates  accelerates buyback "
    },
    {
        "content": "Nov 5 Symantec Corp  best known for its Norton antivirus software  reported a 7.4 percent fall in quarterly revenue  hurt mainly by lower demand for consumer security products.",
        "date": "11052015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec's quarterly revenue falls 7.4 pct "
    },
    {
        "content": "BRUSSELS  Sept 16 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09162015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "EU mergers and takeovers (Sept 16) "
    },
    {
        "content": "Norton antivirus software maker Symantec Corp has agreed to sell its data storage unit  Veritas  for $8 billion to a group led by Carlyle Group LP as it seeks cash to turn around its core security software business. | Video ",
        "date": "08122015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec to sell Veritas for $8 billion to focus on security software "
    },
    {
        "content": "Aug 11 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "08112015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Norton antivirus software maker Symantec Corp  has agreed to sell its data storage unit  Veritas  for $8 billion to a group led by Carlyle Group LP  as it seeks cash to turn around its core security software business. | Video ",
        "date": "08112015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec to sell Veritas for $8 billion to focus on security software "
    },
    {
        "content": "* Shares fall as much as 6 pct   (Adds analysts' comments; updates shares)",
        "date": "08112015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "UPDATE 4-Symantec to sell Veritas for $8 bln to focus on security software "
    },
    {
        "content": "Aug 11 Antivirus maker Symantec Corp  said it would sell its data storage business  Veritas  for $8 billion in cash to a group that includes Carlyle Group LP  and Singapore's sovereign wealth fund GIC.",
        "date": "08112015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec to sell Veritas to Carlyle-led group for $8 bln "
    },
    {
        "content": "Software security company Symantec Corp has agreed to sell its data storage business Veritas to private equity firm Carlyle Group LP  according to a person familiar with the matter.",
        "date": "08112015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec agrees to sell data storage unit to Carlyle: source "
    },
    {
        "content": "Aug 11 Software security company Symantec Corp  has agreed to sell its data storage business Veritas to private equity firm Carlyle Group LP  according to a person familiar with the matter.",
        "date": "08112015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec agrees to sell data storage unit to Carlyle - source "
    },
    {
        "content": "MUMBAI  July 15 Global cybersecurity company TaaSera launched its India business on Thursday  joining a growing number of cybersecurity firms eyeing India as a growth frontier amid an expected doubling of online crime in the country.",
        "date": "07162015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Cybersecurity firms eye India as attacks on world's IT hub rise "
    },
    {
        "content": "July 8 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Wednesday:",
        "date": "07082015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "July 7 Software security company Symantec Corp  is in talks to sell its Veritas data storage business to private equity firm Carlyle Group LP  a person familiar with the matter said on Tuesday.",
        "date": "07072015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec in talks to sell Veritas storage unit to Carlyle -source "
    },
    {
        "content": "Software security company Symantec Corp  is in talks to sell its Veritas data storage business to private equity firm Carlyle Group LP   a person familiar with the matter said on Tuesday.",
        "date": "07072015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec in talks to sell Veritas storage unit to Carlyle: source "
    },
    {
        "content": "July 7 Software security company Symantec Corp  is in talks to sell its Veritas data storage business to private equity firm Carlyle Group LP  a person familiar with the matter said on Tuesday.",
        "date": "07072015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "UPDATE 1-Symantec in talks to sell Veritas storage unit to Carlyle -source "
    },
    {
        "content": "Antivirus and security software maker Symantec Corp's quarterly profit and revenue missed Wall Street estimates  hurt by a strong dollar and lower demand for its consumer security products.",
        "date": "05142015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec revenue misses Street on strong dollar "
    },
    {
        "content": "May 14 Antivirus and security software maker Symantec Corp's quarterly profit and revenue missed Wall Street estimates  hurt by a strong dollar and lower demand for its consumer security products.",
        "date": "05142015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "UPDATE 1-Symantec revenue misses Street on strong dollar "
    },
    {
        "content": "May 14 Antivirus and security software maker Symantec Corp reported a 6.6 percent fall in quarterly revenue  hurt by a strong dollar and lower demand for its consumer security products.",
        "date": "05142015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec quarterly revenue falls 6.6 pct "
    },
    {
        "content": "* For Veritas  expects FY 2015 revenue growth of about 2 percent  operating margin of about 20 percent",
        "date": "04172015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "BRIEF-Symantec sees FY 2015 GAAP earnings per share of $1.23 - $1.26 "
    },
    {
        "content": "April 16 Software security and storage provider Symantec is moving ahead with its plans to split into two publicly traded companies by January  a move that it views as more tax-efficient than a sale of one of its units  top executives said this week.",
        "date": "04172015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec CEO says pressing ahead with Veritas spin-off "
    },
    {
        "content": "April 14 When a cyber security breach hits the news  those most closely involved often have incentive to play up the sophistication of the attack.",
        "date": "04142015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "RPT-User mistakes aid most cyber attacks  Verizon and Symantec studies show "
    },
    {
        "content": "April 14 When a cyber security breach hits the news  those most closely involved often have incentive to play up the sophistication of the attack.",
        "date": "04142015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "User mistakes aid most cyber attacks  Verizon and Symantec studies show "
    },
    {
        "content": "Security software maker Symantec Corp has been seeking buyers for its storage software business  Veritas  or the entire company for several months  sources familiar with the matter said.",
        "date": "04102015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec has been exploring Veritas sale for months: sources "
    },
    {
        "content": "April 10 Security software maker Symantec Corp  has been seeking buyers for its storage software business  Veritas  or the entire company for several months  sources familiar with the matter said.",
        "date": "04102015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec has been exploring Veritas sale for months-sources "
    },
    {
        "content": "Two software security companies have launched a full-scale attack on the patents they are currently accused of infringing by patent licensor Intellectual Ventures  urging a U.S. court to cancel them because they should never have been granted in the first place.",
        "date": "03232015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec and Trend Micro attack Intellectual Ventures patents "
    },
    {
        "content": "Though a Delaware federal jury last month awarded patent licensor Intellectual Ventures far less than the $298 million it had been seeking in infringement damages against security software maker Symantec Corp  a judge Wednesday said he is inclined to cut the amount even further.",
        "date": "03052015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Judge hints at slashing Intellectual Ventures win against Symantec "
    },
    {
        "content": "Feb 6 Symantec Corp  maker of the popular Norton antivirus software  was ordered to pay $17 million in damages on Friday after a federal jury in Delaware found it had violated two patents owned by Intellectual Ventures  a major patent licensing company.",
        "date": "02062015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "U.S. court orders Symantec to pay $17 mln for patent infringement "
    },
    {
        "content": "Feb 6 Symantec Corp  maker of the popular Norton antivirus software  was ordered to pay $17 million in damages on Friday after a federal jury in Delaware found it had violated two patents owned by Intellectual Ventures  a major patent licensing company.",
        "date": "02062015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "UPDATE 1-U.S. court orders Symantec to pay $17 mln for patent infringement "
    },
    {
        "content": "Symantec Corp   best known for its Norton antivirus software  announced a new $1 billion share buyback program on Thursday.",
        "date": "02052015",
        "name": "Symantec Corporation",
        "news_type": "topStory",
        "symbol": "SYMC",
        "title": "Symantec announces $1 billion share buyback plan "
    },
    {
        "content": "Feb 5 Symantec Corp  best known for its Norton antivirus software  announced a new $1 billion share buyback program on Thursday.",
        "date": "02052015",
        "name": "Symantec Corporation",
        "news_type": "normal",
        "symbol": "SYMC",
        "title": "Symantec announces $1 bln share buyback plan "
    }
]