[
    {
        "content": "BEIJING/PARIS Chinese grains trader COFCO International has agreed to sell its crop seeds business to Swiss-based Syngenta AG as it  overhauls its activities following a series of major overseas acquisitions.",
        "date": "11062017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "China's COFCO sells Latam seeds business to Syngenta "
    },
    {
        "content": "* Latest step in shakeup after Nidera  Noble Agri acquisitions",
        "date": "11062017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-China's COFCO sells Latam seeds business to Syngenta "
    },
    {
        "content": "BEIJING  Nov 6 Chinese grains trader COFCO International has agreed to sell the seeds business of Dutch subsidiary Nidera BV to Chinese-owned global crop chemicals firm Syngenta AG  the companies said on Monday.",
        "date": "11062017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "China's Cofco International sells Nidera seeds business to Syngenta "
    },
    {
        "content": "* ‍ENTERED INTO A BINDING AGREEMENT TO ACQUIRE NIDERA SEEDS WHICH IS CURRENTLY OWNED BY COFCO INTERNATIONAL​",
        "date": "11062017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta says to acquire Nidera Seeds "
    },
    {
        "content": "* Agrees to acquire European product portfolio from Adama Agricultural Solutions​ and Syngenta AG for cash consideration of US$490 million",
        "date": "10232017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Nufarm Ltd to acquire European product portfolio from Adama and Syngenta "
    },
    {
        "content": "PARIS  Oct 19 Vilmorin expects China to end a ban on growing genetically modified crops after ChemChina's takeover of Syngenta  potentially benefiting Vilmorin due to a maize licensing deal it has with Syngenta.",
        "date": "10192017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Vilmorin sees GMO maize opening in China in wake of Syngenta "
    },
    {
        "content": "CHICAGO  Oct 11 Fitch Ratings on Wednesday became the second major ratings agency to put Syngenta AG on notice for a potential downgrade  over uncertainties surrounding the Swiss-based company's genetically modified corn lawsuit liabilities.",
        "date": "10112017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Fitch says Syngenta risks rating downgrade due to corn lawsuits "
    },
    {
        "content": "WASHINGTON (Reuters Breakingviews) - Chinese officials probably don’t read literary critic Harold Bloom. If they do  they are ignoring his advice to “make what is implicit ... finely explicit.” A dispute over whether the government will stand behind the potential liabilities of Syngenta   a Swiss seed maker acquired by a Chinese state firm earlier this year for about $43 billion  shows the problems that result from habitual murkiness.",
        "date": "10112017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Breakingviews - Syngenta puts Beijing’s unspoken promises to test "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 28 (Fitch) Syngenta's proposed legal settlement of its corn seed dispute with US farmers will make it harder for the company to achieve deleveraging in line with Fitch Ratings' expectation. Any potential impact on the rating would depend on the details of the payment and on any offsetting action taken by Syngenta or its parent  ChemChina. Syngenta's financial profile is stretched following its acquisition by ChemChina ",
        "date": "09282017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Fitch: Syngenta Settlement Will Add to Deleveraging Challenge "
    },
    {
        "content": "CHICAGO Syngenta AG moved closer to putting a troubled biotech corn seed launch behind it with a $1.5 billion settlement with farmers this week  but grain traders who filed two remaining lawsuits may be less ready to compromise  legal experts said.",
        "date": "09282017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ADM  Cargill still pursue Syngenta over China GMO corn rejections "
    },
    {
        "content": "CHICAGO  Sept 27 Syngenta AG moved closer to putting a troubled biotech corn seed launch behind it with a $1.5 billion settlement with farmers this week  but grain traders who filed two remaining lawsuits may be less ready to compromise  legal experts said.",
        "date": "09272017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ADM  Cargill still pursue Syngenta over China GMO corn rejections "
    },
    {
        "content": "Sept 26 Syngenta AG said on Tuesday that it had reached a settlement to resolve lawsuits by farmers stemming from its decision to commercialize a genetically modified strain of corn before China approved importing it.",
        "date": "09262017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta agrees to settle GMO corn litigation "
    },
    {
        "content": "ZURICH  Sept 6 Syngenta plans to issue multi-tranche  benchmark-sized notes with maturities up to 30 years to refinance bridge loans used by ChemChina for its $43 billion takeover of the Swiss chemical maker  Syngenta said on Wednesday.",
        "date": "09062017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta plans to issue notes to refinance takeover by ChemChina "
    },
    {
        "content": "* Amvac Mexico Srl acquires certain herbicide and fungicide products from Syngenta in Mexico",
        "date": "08232017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-American Vanguard's unit acquires certain herbicide and fungicide products from Syngenta in Mexico "
    },
    {
        "content": "* H1 SALES $6.9 BILLION: 2 PERCENT LOWER COMPARED WITH H1 2016",
        "date": "07262017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta H1 EBITDA $1.7 bln "
    },
    {
        "content": "* Syngenta receives China import approval for agrisure duracade corn trait",
        "date": "07172017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta receives China import approval for agrisure duracade corn trait "
    },
    {
        "content": "* EU Commission sets Aug 7 as provisional deadline for decision",
        "date": "06302017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "UPDATE 1-Bayer files for Monsanto takeover approval with EU regulators "
    },
    {
        "content": "BASEL Switzerland's Syngenta   the crop protection company acquired by ChemChina  has vowed to bulk up its seeds business and join the chase for assets rival Bayer  must sell to gain regulatory approval for its takeover of Monsanto.",
        "date": "06272017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Chinese-owned Syngenta eyes Bayer assets to bolster seeds "
    },
    {
        "content": "BASEL  June 27 Switzerland's Syngenta  the crop protection company acquired by ChemChina  has vowed to bulk up its seeds business and join the chase for assets rival Bayer must sell to gain regulatory approval for its takeover of Monsanto.",
        "date": "06272017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-Chinese-owned Syngenta eyes Bayer assets to bolster seeds "
    },
    {
        "content": "A U.S. jury on Friday ordered Syngenta AG  to pay $217.7 million to more than 7 000 Kansas farmers over its decision to commercialize a genetically modified strain of corn before China approved importing it.",
        "date": "06232017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta ordered to pay $217.7 million to Kansas farmers in GMO corn case "
    },
    {
        "content": "BASEL  June 27 Switzerland's Syngenta  the crop protection company acquired by ChemChina  said it would pursue deals to become the third-biggest player in the seeds industry.",
        "date": "06272017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina's Syngenta says aims to become top 3 seeds maker "
    },
    {
        "content": "June 23 A federal jury on Friday ordered Syngenta AG to pay $217.7 million to more than 7 000 Kansas farmers over its decision to commercialize a genetically modified strain of corn before China approved importing it.",
        "date": "06232017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta must pay $217.7 mln to Kansas farmers in GMO corn case -jury "
    },
    {
        "content": "ZURICH  June 9 Syngenta  the Swiss pesticides and seeds group being bought by ChemChina  has agreed to sell its global sugar beet seeds business to Denmark's DLF Seeds  the companies said on Friday.",
        "date": "06092017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta sells sugar beet seeds business to Denmark's DLF Seeds "
    },
    {
        "content": "ZURICH ChemChina has accumulated nearly 95 percent of shares in Swiss pesticides and seeds group Syngenta  as part of its $43 billion tender offer  China's biggest foreign takeover to date.",
        "date": "05312017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina gets nearly 95 percent of Syngenta  seeks more "
    },
    {
        "content": "ZURICH  May 31 ChemChina has accumulated nearly 95 percent of shares in Swiss pesticides and seeds group Syngenta as part of its $43 billion tender offer  China's biggest foreign takeover to date.",
        "date": "05312017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina gets nearly 95 pct of Syngenta  seeks more "
    },
    {
        "content": "HONG KONG ChemChina has raised $20 billion mainly in perpetual bonds to finance its purchase of Swiss seeds firm Syngenta   with Bank of China becoming the single largest investor providing half of that funding  according to a regulatory filing.",
        "date": "05252017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Bank of China main backer as ChemChina raises $20 billion for Syngenta deal "
    },
    {
        "content": "* Investment makes state-owned lender largest financier to deal",
        "date": "05252017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 2-Bank of China main backer as ChemChina raises $20 bln for Syngenta deal "
    },
    {
        "content": "* SAYS CHEMCHINA ANNOUNCED AT THE END OF THE ADDITIONAL ACCEPTANCE PERIOD ON MAY 24  AROUND 92.2 PERCENT OF SHARES HAVE BEEN TENDERED Source text - http://bit.ly/2rSUqTq Further company coverage: (Gdynia Newsroom)",
        "date": "05252017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta: ChemChina says 92.2% of shares tendered by May 24 "
    },
    {
        "content": "HONG KONG  May 25 ChemChina has raised $20 billion in perpetual bonds and preferred shares to finance its acquisition of Swiss seeds maker Syngenta  according to a regulatory filing by the state-owned Chinese company.",
        "date": "05252017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina raises $20 bln for Syngenta deal via perp bonds  preferred shares "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 19 (Fitch) Fitch Ratings has published a 'BBB' Foreign-Currency Long-Term Issuer Default Rating on Syngenta AG following its takeover by China National Chemical Corporation (ChemChina; A-/Stable). At the same time  Fitch has published a Foreign-Currency Short-Term Issuer Default Rating on the company of 'F3' and a senior unsecured long-term rating of 'BBB'. A full list of rating actions is at the end of this commentary. The ",
        "date": "05192017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Fitch Publishes 'BBB' Syngenta Rating  Outlook Stable "
    },
    {
        "content": "ZURICH ChemChina [CNCC.UL] has won more than enough support from Syngenta shareholders to clinch its $43 billion takeover of the Swiss pesticides and seeds group  the two companies said on Friday.",
        "date": "05052017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina clinches landmark $43 billion takeover of Syngenta "
    },
    {
        "content": "ZURICH ChemChina [CNCC.UL] has won around 82 percent support from Syngenta shareholders for its $43 billion takeover of the Swiss pesticides and seeds group  China's biggest foreign acquisition to date  the two companies said on Wednesday.",
        "date": "05102017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina gets around 82 percent of Syngenta in $43 billion deal "
    },
    {
        "content": "* ChemChina has won enough support to clinch Syngenta takeover",
        "date": "05052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 2-ChemChina clinches landmark $43 bln takeover of Syngenta "
    },
    {
        "content": "ZURICH  May 10 ChemChina has won around 82 percent support from Syngenta shareholders for its $43 billion takeover of the Swiss pesticides and seeds group  China's biggest foreign acquisition to date  the two companies said on Wednesday.",
        "date": "05102017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina gets around 82 pct of Syngenta in $43 bln deal "
    },
    {
        "content": "ZURICH  May 5 ChemChina's has won more than enough support from Syngenta shareholders to clinch its $43 billion takeover of the Swiss pesticides and seeds group  the two companies said on Friday.",
        "date": "05052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina clinches $43 bln takeover of Syngenta "
    },
    {
        "content": "* Says four of syngenta’s existing board members will become independent directors with effect from the change of control",
        "date": "04262017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta announces changes to board amid ChemChina takeover "
    },
    {
        "content": "FRANKFURT Syngenta   the Swiss pesticides and seeds group that is being acquired by ChemChina   said first quarter sales slipped 1 percent to $3.74 billion as growth in Asian corn seed markets were offset by lower demand for fungicides and herbicides in Latin America.",
        "date": "04242017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina target Syngenta sees first-quarter sales drop 1 percent "
    },
    {
        "content": "FRANKFURT  April 24 Syngenta  the Swiss pesticides and seeds group that is being acquired by ChemChina   said first quarter sales slipped 1 percent to $3.74 billion as growth in Asian corn seed markets were offset by lower demand for fungicides and herbicides in Latin America.",
        "date": "04242017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina target Syngenta sees Q1 sales drop 1 pct "
    },
    {
        "content": "* China National Chemical Corporation announced today that it has extended the tender offers to purchase all publicly held registered shares of Syngenta AG",
        "date": "04132017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Chemchina says tender offer to purchase all Syngenta shares will end on May 4 "
    },
    {
        "content": "ZURICH  April 12 China's Ministry of Commerce (MOFCOM) has approved ChemChina's $43 billion planned takeover of Swiss pesticides and seeds group Syngenta  the two companies said on Wednesday.",
        "date": "04122017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina-Syngenta deal wins Chinese regulatory approval "
    },
    {
        "content": "MEXICO CITY  April 11 Mexico's antitrust commission COFECE said on Tuesday it would condition its approval of ChemChina's planned $43 billion takeover bid of Swiss pesticides and seeds group Syngenta AG.",
        "date": "04112017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Mexican regulator pins conditions ChemChina  Syngenta deal "
    },
    {
        "content": "ZURICH  April 12 ChemChina's $43 billion planned takeover of Swiss pesticides and seeds group Syngenta has received approval from China's Ministry of Commerce (MOFCOM)  the two companies said on Wednesday.",
        "date": "04122017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-ChemChina-Syngenta deal wins Chinese regulatory approval "
    },
    {
        "content": "* Syngenta says China's approval for takeover by ChemChina comes with no conditions Source text for Eikon: Further company coverage: (Reporting by John Miller)",
        "date": "04122017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta: China's OK for takeover by ChemChina comes with no conditions "
    },
    {
        "content": "* Says acquisition of Syngenta by ChemChina approved by Mexican competition authority",
        "date": "04102017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-ChemChina Acquisition of Syngenta approved by Mexican competition authority "
    },
    {
        "content": "WASHINGTON  April 4 The China National Chemical Corp  or ChemChina  has won U.S. antitrust approval to buy Switzerland's Syngenta AG on condition that it divest three products  the Federal Trade Commission said on Tuesday.",
        "date": "04042017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "UPDATE 2-ChemChina  Syngenta win U.S. antitrust approval for deal "
    },
    {
        "content": "BRUSSELS ChemChina won conditional EU antitrust approval on Wednesday for its $43 billion bid for Swiss pesticides and seeds group Syngenta  a deal that could help China boost its domestic agricultural output.",
        "date": "04052017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "EU clears ChemChina's $43 bln takeover of Syngenta with conditions "
    },
    {
        "content": "WASHINGTON  April 4 The China National Chemical Corp  or ChemChina  has won U.S. antitrust approval to merge with Switzerland's Syngenta AG on condition that it divest three pesticides  the Federal Trade Commission said on Tuesday. (Reporting by Diane Bartz)",
        "date": "04042017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina  Syngenta win U.S. antitrust approval for deal "
    },
    {
        "content": "BRUSSELS  April 4 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04042017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "REFILE-EU mergers and takeovers (April 4) "
    },
    {
        "content": "BRUSSELS  April 5 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "EU mergers and takeovers (April 5) "
    },
    {
        "content": "WASHINGTON The China National Chemical Corp  or ChemChina  has won U.S. antitrust approval to buy Switzerland's Syngenta AG on condition that it divest three products  the Federal Trade Commission said on Tuesday.",
        "date": "04052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina  Syngenta win U.S. antitrust approval for deal "
    },
    {
        "content": "BRUSSELS ChemChina [CNNCC.UL] won conditional EU antitrust approval on Wednesday for its $43 billion bid for Swiss pesticides and seeds group Syngenta   a deal that could help China boost its domestic agricultural output.",
        "date": "04052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "EU clears ChemChina's $43 billion takeover of Syngenta with conditions "
    },
    {
        "content": "* To sell part of plant growth regulator business for cereals (Adds likely buyers of assets)",
        "date": "04052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 2-EU clears ChemChina's $43 bln takeover of Syngenta with conditions "
    },
    {
        "content": "ZURICH ChemChina's [CNNCC.UL] $43 billion bid for Swiss pesticides and seeds group Syngenta  is still set to close in the second quarter  the Swiss group said after the deal won EU and U.S. anti-trust approval on Wednesday.",
        "date": "04052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta says ChemChina takeover still set to close in second-quarter "
    },
    {
        "content": "ZURICH  April 5 ChemChina's $43 billion bid for Swiss pesticides and seeds group Syngenta is still set to close in the second quarter  the Swiss group said after the deal won EU and U.S. anti-trust approval on Wednesday.",
        "date": "04052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta says ChemChina takeover still set to close in Q2 "
    },
    {
        "content": "BRUSSELS  April 5 EU antitrust regulators approved on Wednesday ChemChina's $43 billion bid for Swiss pesticides and seeds group Syngenta after the Chinese company agreed to sell assets to address competition concerns",
        "date": "04052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "EU clears ChemChina takeover of Syngenta with conditions "
    },
    {
        "content": "BRUSSELS  April 5 EU antitrust chief Margrethe Vestager will hold a news conference at noon  where she is expected to approve ChemChina's bid for Syngenta and block a Croatian deal by Germany's HeidelbergCement and Schwenk.",
        "date": "04052017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "EU's Vestager to announce two merger decisions at noon "
    },
    {
        "content": "BEIJING ChemChina [CNNCC.UL] said on Monday that Beijing had accepted its application for regulatory approval of its $43 billion takeover of Syngenta last month.",
        "date": "03072017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina says Syngenta deal filing accepted by Beijing "
    },
    {
        "content": "BEIJING  March 6 China National Chemical Corp  or ChemChina  said on Monday that China's Ministry of Commerce on Feb. 9 accepted its application for anti-trust approval for the proposed $43 billion takeover of Swiss crop protection and seed group Syngenta.",
        "date": "03062017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina says Beijing accepted anti-trust application for Syngenta deal "
    },
    {
        "content": "BEIJING  March 6 ChemChina said on Monday that Beijing had accepted its application for regulatory approval of its $43 billion takeover of Syngenta last month.",
        "date": "03062017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 3-ChemChina says Syngenta deal filing accepted by Beijing "
    },
    {
        "content": "BEIJING  March 6 China's Commerce Ministry has not received an application from ChemChina seeking approval for its planned $43 billion takeover of Syngenta   Gao Hucheng  who recently retired as commerce minister  said on Monday.",
        "date": "03062017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "CORRECTED-UPDATE 1-China has not received ChemChina application for Syngenta deal -former minister "
    },
    {
        "content": "Feb 23 ChemChina  * Says extends public tender offers for Syngenta  Source text for Eikon: Further company coverage:   (Reporting By Zurich newsroom) ",
        "date": "02232017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-ChemChina extends tender offers for Syngenta to April 28 "
    },
    {
        "content": "ZURICH  Feb 23 China National Chemical Corporation (ChemChina) has extended until April 28 its $43 billion tender offer for Swiss pesticides and seeds group Syngenta  it said on Thursday.",
        "date": "02232017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Chemchina extends tender offer for Syngenta to April 28 "
    },
    {
        "content": "FRANKFURT/ZURICH Swiss pesticides and seeds group Syngenta  pushed back the expected closure of its agreed $43 billion takeover by ChemChina [CNNCC.UL] to the second quarter of 2017  but said it was making progress in winning regulatory approval for the deal.",
        "date": "02082017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta sees ChemChina takeover closing in the second-quarter "
    },
    {
        "content": "ZURICH  Feb 14 Syngenta has got another request for information from U.S. anti-trust regulators reviewing a proposed $43 billion takeover by ChemChina  but still sees the deal being completed in the second quarter  it said on Tuesday.",
        "date": "02142017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta: U.S. regulators' new request won't delay ChemChina deal "
    },
    {
        "content": "Feb 8 Swiss pesticides and seeds group Syngenta  said that the bridge financing for ChemChina's  agreed $43 billion takeover had been secured and that it was working with its prospective parent company on longer-term funding of the deal.",
        "date": "02082017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta says working with ChemChina on long-term deal financing "
    },
    {
        "content": "* 2016 EBITDA slightly better than expected  no dividend   (Add shares  analyst comments)",
        "date": "02082017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 2-Syngenta sees ChemChina takeover closing in Q2 "
    },
    {
        "content": "ZURICH  Feb 8 Swiss pesticides and seeds group Syngenta expects its $43 billion takeover by ChemChina  to close in the second quarter of 2017  it said on Wednesday while proposing to omit a regular dividend for 2016.",
        "date": "02082017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta sees ChemChina takeover closing in Q2 "
    },
    {
        "content": "BRUSSELS ChemChina [CNNCC.UL] is set to secure conditional EU antitrust approval for its $43 billion bid for Swiss pesticides and seeds group Syngenta   the largest foreign acquisition by a Chinese company  two people familiar with the matter said on Thursday. | Video ",
        "date": "02032017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "EU set to approve ChemChina's $43 bln bid for Syngenta: sources "
    },
    {
        "content": "BRUSSELS  Feb 2 ChemChina is set to secure conditional EU antitrust approval for its $43 billion bid for Swiss pesticides and seeds group Syngenta  the largest foreign acquisition by a Chinese company  two people familiar with the matter said on Thursday.",
        "date": "02022017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "UPDATE 1-EU set to approve ChemChina's $43 bln bid for Syngenta - sources "
    },
    {
        "content": "BRUSSELS  Feb 2 EU antitrust regulators are set to approve ChemChina's $43 billion bid for Swiss pesticides and seeds group Syngenta after the Chinese company agreed to sell some products  two people familiar with the matter said on Thursday.",
        "date": "02022017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "EU set to approve ChemChina's $43 bln bid for Syngenta - sources "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Syngenta has hedge funds sifting Chinese tea leaves. A sharp shift in sentiment over the Swiss agribusiness group's $43 billion sale to ChemChina  the state-backed giant  shows how Beijing's influence complicates life for merger arbitrageurs.",
        "date": "01262017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta forces hedgies to read Chinese tea leaves "
    },
    {
        "content": "BEIJING  Jan 20 China National Chemical Corp  or ChemChina  said on Friday it has sought the U.S. anti-trust regulator's approval for its planned $43 billion acquisition of Swiss crop protection and seed group Syngenta AG.",
        "date": "01202017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina seeks U.S. anti-trust approval for Syngenta deal "
    },
    {
        "content": "Jan 17 Syngenta Chairman Demaré tell Bloomberg TV",
        "date": "01172017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta Chairman says still confident ChemChina deal will go through -BBG TV "
    },
    {
        "content": "* Pair have only minor product overlaps   (Adds Syngenta comment)",
        "date": "01202017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-ChemChina seeks U.S. anti-trust approval for Syngenta deal "
    },
    {
        "content": "DAVOS  Switzerland Syngenta   the Swiss pesticides and seeds group being taken over by ChemChina [CNNCC.UL]  does not expect antitrust regulators to force the Chinese state-owned company to put its subsidiary Adama up for sale  Syngenta's CEO said on Tuesday.",
        "date": "01172017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta sees no sale of ChemChina's Adama to get merger nod "
    },
    {
        "content": "ZURICH Syngenta Chief Executive Erik Fyrwald expects regulatory approval soon for ChemChina's proposed $43 billion takeover of the Swiss pesticides and seeds group  he said on Monday.",
        "date": "01162017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta CEO expects regulatory approval for ChemChina deal soon: CNBC "
    },
    {
        "content": "* Says move beyond transgenic approach shows promise   (Adds details on future organisation  planned biotech R&D push in China)",
        "date": "01172017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-Syngenta sees no sale of ChemChina's Adama to get merger nod "
    },
    {
        "content": "DAVOS  Switzerland  Jan 17 Syngenta  the Swiss pesticides and seeds group being taken over by state-owned ChemChina  does not expect antitrust regulators to force the Chinese merger partner to put its crop chemicals subsidiary Adama up for sale  Syngenta's chief executive said on Tuesday.",
        "date": "01172017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta sees no need for sale of ChemChina's Adama to get merger approved "
    },
    {
        "content": "ZURICH  Jan 16 Syngenta Chief Executive Erik Fyrwald expects regulatory approval soon for ChemChina's proposed $43 billion takeover of the Swiss pesticides and seeds group  he said on Monday.",
        "date": "01162017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta CEO expects regulatory approval for ChemChina deal soon -CNBC "
    },
    {
        "content": "HONG KONG  Jan 16 Media reports of a merger of Chinese state-owned chemical firms Sinochem Group and ChemChina  which is finalising a $43 billion takeover of Swiss pesticides and seed group Syngenta are just rumours  Sinochem Group Chairman Ning Gaoning said.",
        "date": "01162017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "China's Sinochem chief dismisses ChemChina merger reports as \"rumour\" "
    },
    {
        "content": "BEIJING/HONG KONG China National Chemical Corp (ChemChina) [CNNCC.UL] and Swiss pesticides and seeds group Syngenta AG  have proposed minor concessions to the EU's competition watchdog to address concerns over their $43 billion merger plan  sources told Reuters.",
        "date": "01102017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina  Syngenta submit minor concessions to EU watchdog: sources "
    },
    {
        "content": "* EU watchdog website says parties have submitted \"commitments\"",
        "date": "01102017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 5-ChemChina  Syngenta submit minor concessions to EU watchdog - sources "
    },
    {
        "content": "Jan 10 The following bids  mergers  acquisitions and disposals were reported by 1100 GMT on Tuesday:",
        "date": "01102017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Spokesman confirms remedy proposal has been submitted to eu  confident transaction will successfully be closed  Source text for Eikon:  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "01102017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta confirms remedy proposal submitted  remains confident in deal "
    },
    {
        "content": "ZURICH  Jan 10 The Swiss blue-chip SMI  was seen opening 0.2 percent higher at 8 442 points on Tuesday  according to premarket indications by bank Julius Baer .",
        "date": "01102017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Swiss stocks - Factors to watch on Jan 10 "
    },
    {
        "content": "BRUSSELS European Union antitrust regulators have extended the deadline for a decision on ChemChina's proposed buy of Swiss pesticides and seeds group Syngenta by 10 working days to April 12.",
        "date": "01032017",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "EU regulators delay ChemChina/Syngenta merger decision to April 12 "
    },
    {
        "content": "HONG KONG  Jan 10 State-owned China National Chemical Corp (ChemChina) and Swiss pesticides and seeds group Syngenta AG on Monday submitted proposed remedies to the European Union's antitrust watchdog to address concerns over their $43 billion merger.",
        "date": "01102017",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina  Syngenta submit remedy proposals to EU antitrust watchdog "
    },
    {
        "content": "ZURICH State-owned China National Chemical Corp (ChemChina) [CNNCC.UL] on Tuesday said it has extended its $43 billion cash offer for Swiss agrichemicals group Syngenta AG  to March 2  2017.",
        "date": "12202016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina extends public tender offers for Syngenta to March 2 "
    },
    {
        "content": "BEIJING  Nov 17 A powerful U.S. senator said he is concerned that state-owned ChemChina  which is buying Swiss crop protection and seed group Syngenta for $43 billion  could use U.S. sovereign immunity laws to shield itself from claims in U.S. courts.",
        "date": "11172016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Key U.S. senator remains concerned over ChemChina-Syngenta deal "
    },
    {
        "content": "BRUSSELS  Nov 17 The European Commission has pushed back its deadline for a decision on ChemChina's plan to acquire Swiss pesticides and seeds group Syngenta by 10 working days to March 29.",
        "date": "11172016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "EU delays ChemChina/Syngenta merger decision to March 29 "
    },
    {
        "content": "BRUSSELS  Nov 17 The European Commission has pushed back its deadline for a decision on ChemChina's plan to acquire Swiss pesticides and seeds group Syngenta by 10 working days to March 29.",
        "date": "11172016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-EU delays ChemChina/Syngenta merger decision to March 29 "
    },
    {
        "content": "ZURICH State-owned China National Chemical Corp (ChemChina) [CNNCC.UL] on Tuesday said it has extended its $43 billion cash offer for Swiss agrichemicals group Syngenta AG  to Jan. 5 while it works to gain regulatory approval for the deal.",
        "date": "11012016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina extends $43 billion Syngenta buyout offer to Jan 5 "
    },
    {
        "content": "ZURICH  Nov 1 State-owned China National Chemical Corp (ChemChina) on Tuesday said it has extended its $43 billion cash offer for Swiss agrichemicals group Syngenta AG to Jan. 5 while it works to gain regulatory approval for the deal.",
        "date": "11012016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina extends $43 bln Syngenta buyout offer to Jan 5 "
    },
    {
        "content": "BRUSSELS European Union antitrust regulators on Friday opened an in-depth investigation into state-owned Chinese chemicals group ChemChina's $43 billion bid for Swiss pesticides and seeds group Syngenta   China's biggest-ever foreign acquisition.",
        "date": "10282016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "EU holds up ChemChina's $43 billion acquisition of Syngenta "
    },
    {
        "content": "BEIJING Chinese state-owned chemicals company ChemChina is ready to offer more concessions to win European Union anti-trust approval for its $43 billion bid for Swiss pesticide and seed group Syngenta AG   a source with direct knowledge of the process said.",
        "date": "10252016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Exclusive - ChemChina ready to offer EU extra remedies to clear $43 billion Syngenta deal: source "
    },
    {
        "content": "BRUSSELS  Oct 28 European Union antitrust regulators on Friday opened an in-depth investigation into state-owned Chinese chemicals group ChemChina's $43 billion bid for Swiss pesticides and seeds group Syngenta  China's biggest-ever foreign acquisition.",
        "date": "10282016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-EU holds up ChemChina's $43 bln acquisition of Syngenta "
    },
    {
        "content": "* Syngenta ceo says expects updated feedback from u.s. FTC on chemchina deal in next few days - conference call",
        "date": "10252016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta ceo says  seen no problems with chinese approval of chemchina transaction "
    },
    {
        "content": "* Syngenta & Chemchina transaction: update on regulatory process",
        "date": "10282016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta and ChemChina transaction update on regulatory process "
    },
    {
        "content": "ZURICH Syngenta   the world's largest pesticides maker  on Tuesday moved to reassure investors that the planned $43 billion takeover by ChemChina will go ahead even though it will miss the original forecast for the deal to close this year.",
        "date": "10252016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta says ChemChina deal to stretch into 2017 "
    },
    {
        "content": "BRUSSELS  Oct 28 European Union antitrust regulators on Friday opened an in-depth investigation into state-owned Chinese chemicals group ChemChina's $43 billion bid for Swiss pesticide and seed group Syngenta on concerns it may reduce competition.",
        "date": "10282016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "EU opens full probe into ChemChina's $43 bln acquisition of Syngenta "
    },
    {
        "content": "* Syngenta says expects deal to close in Q1 2017   (Adds CEO and CFO quotes  background  pre-market indicators)",
        "date": "10252016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-Syngenta says ChemChina deal to stretch into 2017 "
    },
    {
        "content": "LONDON  Oct 25 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "10252016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta  Air Liquide and more on the European equities LiveMarkets blog "
    },
    {
        "content": "BRUSSELS/ZURICH Syngenta  shares fell more than 9 percent on Monday after the European Commission triggered doubts about Chinese state-owned chemical company ChemChina's [CNNCC.UL] $43 billion bid for the Swiss pesticides and seeds group.",
        "date": "10242016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta slumps after EU watchdog sparks ChemChina deal doubts "
    },
    {
        "content": "* Shares fall more than 9 percent before partial recovery   (Adds Syngenta clarification of deal timetable comment)",
        "date": "10242016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 4-Syngenta slumps after EU watchdog sparks ChemChina deal doubts "
    },
    {
        "content": "ZURICH  Oct 24 A Syngenta spokesman clarified his comment earlier on Monday that the company remains confident a takeover by China's ChemChina will wrap up by the end of this year  saying he was simply repeating Syngenta's previous public comment from July 22.",
        "date": "10242016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta clarifies comment on timetable for ChemChina deal "
    },
    {
        "content": "FLORENCE  Italy Chinese state-owned chemical company ChemChina and Swiss pesticides and seeds group Syngenta  are prepared to offer concessions to EU antitrust regulators to ease concerns over their $43 billion deal  a person familiar with the matter said on Friday.",
        "date": "10142016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina  Syngenta ready to offer EU remedies over $43 billoon deal: source "
    },
    {
        "content": "ZURICH Swiss pesticides and seeds group Syngenta  remains optimistic that a $43 billion takeover by Chinese state-owned chemical company ChemChina [CNNCC.UL] will wrap up by the end of this year  a Syngenta spokesman said.",
        "date": "10242016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta confident ChemChina deal will happen this year: spokesman "
    },
    {
        "content": "ZURICH  Oct 24 Swiss pesticides and seeds group Syngenta remains optimistic that a $43 billion takeover by Chinese state-owned chemical company ChemChina  will wrap up by the end of this year  a Syngenta spokesman said.",
        "date": "10242016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta confident ChemChina deal will happen this year-spokesman "
    },
    {
        "content": "FLORENCE  Italy Chinese state-owned chemical company ChemChina and Swiss pesticides and seeds group Syngenta  are prepared to offer concessions to EU antitrust regulators to ease concerns over their $43 billion deal  a person familiar with the matter said on Friday.",
        "date": "10142016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina  Syngenta ready to offer EU remedies over $43 billion deal: source "
    },
    {
        "content": "BRUSSELS/ZURICH  Oct 24 Chinese state-owned chemical company ChemChina has not offered concessions over its $43 billion bid for Swiss pesticides and seeds group Syngenta  the European Commission said on Monday.",
        "date": "10242016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina has not offered concessions over Syngenta deal - EU "
    },
    {
        "content": "FLORENCE  Italy  Oct 14 Chinese state-owned chemical company ChemChina and Swiss pesticides and seeds group Syngenta are prepared to offer concessions to EU antitrust regulators to ease concerns over their $43 billion deal  a person familiar with the matter said on Friday.",
        "date": "10142016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina  Syngenta ready to offer EU remedies over $43 bln deal - source "
    },
    {
        "content": "* Syngenta expands production capacity in brazil and switzerland",
        "date": "10042016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta expands production capacity in Brazil and Switzerland "
    },
    {
        "content": "A U.S. district court judge in Kansas this week said lawsuits brought by U.S. farmers against seed company Syngenta AG over sales of biotech corn seeds not approved for import by China can proceed as a class action  according to a court filing.",
        "date": "09272016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "U.S. farmer lawsuits over Syngenta GMO corn granted class status "
    },
    {
        "content": "Sept 27 A U.S. district court judge in Kansas this week said lawsuits brought by U.S. farmers against seed company Syngenta AG over sales of biotech corn seeds not approved for import by China can proceed as a class action  according to a court filing.",
        "date": "09272016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "CORRECTED-U.S. farmer lawsuits over Syngenta GMO corn granted class status "
    },
    {
        "content": "BRUSSELS China National Chemical Corp (ChemChina) [CNNCC.UL] has sought antitrust approval for its $43 billion bid for Swiss pesticides and seeds group Syngenta  from the European Union and a decision is expected by Oct. 28.",
        "date": "09262016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "ChemChina seeks EU okay for Syngenta deal  decision due October 28 "
    },
    {
        "content": "BRUSSELS  Sept 26 China National Chemical Corp (ChemChina) has sought antitrust approval for its $43 billion bid for Swiss pesticides and seeds group Syngenta  from the European Union and a decision is expected by Oct. 28.",
        "date": "09262016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina seeks EU okay for Syngenta deal  decision due Oct. 28 "
    },
    {
        "content": "* Syngenta says appointment of jeff rowe to the new role of president global seeds and north america",
        "date": "09202016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta names Rowe president of global seeds and North America "
    },
    {
        "content": "NEW YORK/FRANKFURT German drug and crop chemical maker Bayer clinched a $66 billion takeover of U.S. seeds company Monsanto on Wednesday  ending months of wrangling with a third sweetened offer that marks the largest all-cash deal on record.",
        "date": "09152016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Bayer clinches Monsanto with improved $66 billion bid "
    },
    {
        "content": "NEW YORK/FRANKFURT  Sept 14 German drug and crop chemical maker Bayer clinched a $66 billion takeover of U.S. seeds company Monsanto on Wednesday  ending months of wrangling with a third sweetened offer that marks the largest all-cash deal on record.",
        "date": "09152016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "REFILE-UPDATE 6-Bayer clinches Monsanto with improved $66 billion bid "
    },
    {
        "content": "ZURICH  Sept 7 Syngenta said on Wednesday Chief Financial Officer John Ramsay has decided to retire from the Swiss agricultural chemicals company at the end of September to pursue other interests.",
        "date": "09072016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta says CFO Ramsay to retire at end of September "
    },
    {
        "content": "ZURICH  Sept 6 ChemChina on Tuesday extended by almost two months the deadline for Syngenta investors to tender their shares as the Chinese company seeks to complete a $43 billion takeover of the Swiss pesticides and seeds group.",
        "date": "09062016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "UPDATE 1-ChemChina extends public tender offers for Syngenta to Nov. 8 "
    },
    {
        "content": "ZURICH  Sept 6 ChemChina on Tuesday extended by almost two months the deadline for Syngenta investors to tenders their shares as the Chinese company seeks to complete a $43 billion takeover of the Swiss pesticides and seeds group.",
        "date": "09062016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "ChemChina extends public tender offers for Syngenta to Nov 8 "
    },
    {
        "content": "WASHINGTON/CHICAGO  Aug 31 The U.S. Justice Department filed a lawsuit on Wednesday aimed at stopping Deere & Co from buying Monsanto Co's Precision Planting farm equipment business  saying that the deal could make it more expensive for farmers to use fast  precise planting technology.",
        "date": "08312016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 4-U.S. sues to stop Deere from buying Precision Planting "
    },
    {
        "content": "WASHINGTON  Aug 23 The U.S. Senate Judiciary Committee will hold a hearing in late September to discuss the mergers of Dow Chemical Co and Dupont Co as well as China National Chemical Corp's purchase of Syngenta AG  committee chair Charles Grassley said in a statement on Tuesday.",
        "date": "08232016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "U.S. Senate Judiciary Committee to hold hearing on ag chemical deals "
    },
    {
        "content": "A U.S. national security panel has cleared ChemChina's $43 billion takeover of Swiss pesticides and seeds group Syngenta   the companies said  boosting chances that the largest foreign acquisition ever by a Chinese company will go through.",
        "date": "08222016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "U.S. clearance of ChemChina's Syngenta deal removes key hurdle "
    },
    {
        "content": "* Syngenta shares jump 11 percent in early trade   (Adds U.S. senator  professor comments  updates share price)",
        "date": "08222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 6-U.S. clearance of ChemChina's Syngenta deal removes key hurdle "
    },
    {
        "content": "* Kingspan yet to see Brexit effect  results beat expectations",
        "date": "08222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta deal clearance gives European stocks a lift "
    },
    {
        "content": "ChemChina's $43 billion acquisition of Syngenta AG  is in the final stages of being cleared by the Committee on Foreign Investment in the United States (CFIUS)  which scrutinizes deals for national security implications  people familiar with the matter said.",
        "date": "08222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Exclusive: ChemChina's Syngenta acquisition close to clearing U.S. review - sources "
    },
    {
        "content": "LONDON  Aug 22 Swiss shares outperformed a flat European stock market on Monday  boosted by a jump in Swiss chemical company Syngenta after a bid by ChemChina to buy the firm was cleared by a U.S. watchdog.",
        "date": "08222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta surge sees Swiss stocks outperform Europe "
    },
    {
        "content": "Syngenta  the world's largest pesticides maker being taken over by state-owned ChemChina  still expects the deal to close this year despite concerns that U.S. regulators could throw a spanner in the works  it said on Friday.",
        "date": "07222016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta sees ChemChina deal done this year  first-half profit disappoints "
    },
    {
        "content": "* Syngenta ceo says we are focused on getting ChemChina deal done",
        "date": "07222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta focused on getting ChemChina deal done - CEO "
    },
    {
        "content": "* Stock offers about 20 pct upside to investors betting on deal   (Adds CFO quote  stock upside  analyst)",
        "date": "07222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 2-Syngenta sees ChemChina deal done this year  first-half profit disappoints "
    },
    {
        "content": "* CFO says going into 2nd half currencies are looking to have fairly neutral effect",
        "date": "07222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "CORRECTED-BRIEF-Syngenta CFO - doesn't look like crop prices will improve in short term "
    },
    {
        "content": "* Cfo says going into 2nd half currencies are looking to have fairly neutral effect",
        "date": "07222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta CFO - doesn't look like crop prices will improve in H2 "
    },
    {
        "content": "July 22 Syngenta  the Swiss pesticides and seeds maker being taken over by state-owned ChemChina  reported a worse-than-expected drop in first-half profit  hurt by weak agricultural markets and a continued decline of its Latin American business.",
        "date": "07222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta H1 profit squeezed by weak crop markets  Latam region "
    },
    {
        "content": "* ChemChina says extends tender offers for all publicly held registered shares of Syngenta and all outstanding American depositary shares representing common shares until Sept. 13 unless further extended",
        "date": "07112016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-ChemChina extends public tender offers for Syngenta "
    },
    {
        "content": "* Latest companies to back tech startups as farm profits shrink",
        "date": "06222016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "CORRECTED-(OFFICIAL)-Bayer  Dupont join ag-tech investment boom to ease grain pain "
    },
    {
        "content": "* The Stockton Group and Syngenta have entered into a global development and distribution agreement for a new biofungicide technology",
        "date": "06272016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Stockton Group  Syngenta enter into a global development and distribution agreement "
    },
    {
        "content": "June 8 Agrium Inc  North America's largest retail seller of products for crop farming  could benefit if some of the biggest makers of seed and agricultural chemicals merge  Chief Executive Chuck Magro said on Wednesday.",
        "date": "06082016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-Agrium sees opportunities as seed  chemical companies talk mergers "
    },
    {
        "content": "* Expects Monsanto to honour collaboration agreements   (Adds market data  BASF business model in agriculture)",
        "date": "06082016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-BASF says not backed into a corner by Bayer's Monsanto swoop "
    },
    {
        "content": "* announces a new collaboration for enzyme optimization between Syngenta and a member of PCAS group  Protéus SA  Source text for Eikon:",
        "date": "06062016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-PCAS group firm Proteus makes new collaboration with Syngenta "
    },
    {
        "content": "* Barclays expected to handle Atotech sale - sources   (Adds details on valuation)",
        "date": "06032016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-Total readies sale of German chemicals maker Atotech -sources "
    },
    {
        "content": "The U.S. Department of Agriculture has agreed to join the U.S. government panel that is reviewing state-owned ChemChina's planned $43 billion acquisition of Swiss seeds and pesticide maker Syngenta AG  people familiar with the matter said on Monday.",
        "date": "05162016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "USDA to join U.S. panel reviewing ChemChina's Syngenta deal -sources "
    },
    {
        "content": "ZURICH The deadline for shareholders in Swiss pesticides maker Syngenta  to accept a $43 billion takeover bid from state-owned ChemChina has been extended to allow for some outstanding regulatory approvals  the company said on Tuesday.",
        "date": "05172016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta offer deadline extended as regulators probe deal "
    },
    {
        "content": "* Syngenta shares trade at discount to offer price   (Adds background on added scrutiny in U.S.  shares)",
        "date": "05172016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 1-Syngenta offer deadline extended as regulators probe deal "
    },
    {
        "content": "The U.S. Department of Agriculture has agreed to join the U.S. government panel that is reviewing state-owned ChemChina's planned $43 billion acquisition of Swiss seeds and pesticide maker Syngenta AG  people familiar with the matter said on Monday.",
        "date": "05172016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Exclusive: USDA to join U.S. panel reviewing ChemChina's Syngenta deal - sources "
    },
    {
        "content": "* Announced launch of EPIVIO(tm) brand family  a range of new biostimulants which address abiotic stresses through seed treatment",
        "date": "05122016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta launches new biological seed treatment "
    },
    {
        "content": "Across the U.S. Farm Belt  top grain handlers have banned genetically modified crops that are not approved in all major overseas markets  shaking up a decades-old system that used the world's biggest exporting country as a launchpad for new seeds from companies like Monsanto Co.",
        "date": "05062016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "U.S. traders reject GMO crops that lack global approval "
    },
    {
        "content": "May 12 Germany's Bayer AG is exploring a bid for seed company Monsanto Co  Bloomberg reported.",
        "date": "05122016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Germany's Bayer mulling bid for Monsanto - Bloomberg "
    },
    {
        "content": "ZURICH  May 4 Swiss agrichemicals group Syngenta  on Wednesday named J. Erik Fyrwald  chief executive of U.S. chemistry distribution company Univar Inc  as CEO from June 1. He succeeds John Ramsay  who has been ad interim CEO since November 2015.",
        "date": "05042016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Syngenta names Univar exec Fyrwald as CEO from June 1 "
    },
    {
        "content": "* Syngenta interim CEO Ramsay tells Reuters that seeking approval for ChemChina deal very much in line with plan including U.S. approval process",
        "date": "04202016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "BRIEF-Syngenta CEO says seeking U.S. approval in line with plan "
    },
    {
        "content": "FRANKFURT  April 20 Syngenta  the Swiss pesticides and seeds maker that is being taken over by state-owned ChemChina  said first-quarter sales declined 7 percent  hurt by a strong dollar and a drop at its Latin American business.",
        "date": "04202016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "Syngenta Q1 sales down 7 pct on currencies  weak Latam business "
    },
    {
        "content": "* HNA announced deal in Feb to acquire Ingram Micro for $6 bln   (Adds details about HNA Group  share reaction  fund manager comment)",
        "date": "04112016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "UPDATE 2-China's HNA extends M&A spree with $1.5 bln bid for Swiss Gategroup "
    },
    {
        "content": "BEIJING  April 8 Around 400 Chinese citizens have signed a letter to protest the purchase of Swiss-based seeds and pesticides company Syngenta by state-owned ChemChina  saying the deal would eventually lead to genetically modified crops being sown across swathes of the country.",
        "date": "04082016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "RPT-China citizens protest ChemChina-Syngenta deal amid GMO worries "
    },
    {
        "content": "BEIJING  April 8 Around 400 Chinese citizens have signed a letter to protest the purchase of Swiss-based seeds and pesticides company Syngenta by state-owned ChemChina  saying the deal would eventually lead to genetically modified crops being sown across swathes of the country.",
        "date": "04082016",
        "name": "Syngenta AG",
        "news_type": "normal",
        "symbol": "SYT",
        "title": "China citizens protest ChemChina-Syngenta deal amid GMO worries "
    },
    {
        "content": "CHICAGO  March 24 The U.S. government panel that reviews foreign acquisitions should assess the impact on domestic food security from state-owned China National Chemical Corp's planned $43.1 billion acquisition of Swiss seeds and pesticide maker Syngenta AG  four U.S. senators said in a letter on Thursday.",
        "date": "03242016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "U.S. senators call for review of ChemChina deal for Syngenta "
    },
    {
        "content": "TEL AVIV  March 21 Israel Chemicals  Chief Executive Stefan Borgas is a leading candidate to take the top job at Swiss agrochemicals group Syngenta  Israeli media reported on Monday.",
        "date": "03212016",
        "name": "Syngenta AG",
        "news_type": "topStory",
        "symbol": "SYT",
        "title": "Israel Chemicals CEO is candidate to head Syngenta- media "
    }
]