[
    {
        "content": "The U.S. Federal Aviation Administration on Friday said it had approved a request by AT&T Inc to use a new drone known as the Flying Cow or Cell on Wings to help restore cellular service in Puerto Rico in the wake of Hurricane Maria.",
        "date": "11172017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "FAA approves AT&T drone in Puerto Rico for cellular service "
    },
    {
        "content": "Nov 17 The U.S. Federal Aviation Administration on Friday said it had approved a request by AT&T Inc to use a new drone known as the Flying Cow or Cell on Wings to help restore cellular service in Puerto Rico in the wake of Hurricane Maria.",
        "date": "11172017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. agency approves AT&T drone in Puerto Rico for cellular service "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department has approached 18 state attorneys general to try to win their support for an antitrust lawsuit to block pay TV and wireless powerhouse AT&T Inc's $85.4 billion deal to buy media and entertainment company Time Warner Inc  a person briefed on the matter said on Wednesday. | Video ",
        "date": "11152017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. government approaches 18 states to fight AT&T-Time Warner deal "
    },
    {
        "content": "Comcast Corp and Verizon Communications Inc have both expressed interest in acquiring a significant part of Rupert Murdoch's Twenty-First Century Fox Inc's assets  two people familiar with the situation told Reuters on Thursday.",
        "date": "11172017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Comcast  Verizon approached Twenty-First Century Fox to buy some assets: sources "
    },
    {
        "content": "* Deal is a political flashpoint amid Trump's CNN criticism (Adds Washington State Attorney General's Office confirming review of complaint  updates share prices)",
        "date": "11152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 4-U.S. government approaches 18 states to fight AT&T-Time Warner deal "
    },
    {
        "content": "Nov 16 Comcast Corp and Verizon Communications Inc have both expressed interest in acquiring a significant part of Rupert Murdoch's Twenty-First Century Fox Inc's assets  two people familiar with the situation told Reuters on Thursday.",
        "date": "11172017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 4-Comcast  Verizon approached Twenty-First Century Fox to buy some assets -sources "
    },
    {
        "content": "NEW YORK U.S. fund investors walloped high-yield funds with their biggest week of withdrawals since March  Lipper data showed on Thursday.",
        "date": "11172017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. junk bond funds post fourth-biggest week of outflows ever: Lipper "
    },
    {
        "content": " (Adds details on mutual funds and ETFs  table)     By Trevor Hunnicutt     NEW YORK  Nov 16 U.S. fund investors walloped high-yield funds with their biggest week of withdrawals since March  Lipper data showed on Thursday.     The junk bond mutual funds and exchange-traded funds (ETFs) posted $4.4 billion in net withdrawals during the week ended Nov. 15  the fourth-largest weekly outflow on record dating back to 1992.     Several concerns weighed on high-yield markets during the week",
        "date": "11172017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-U.S. junk bond funds post 4th-biggest week of outflows ever -Lipper "
    },
    {
        "content": "WASHINGTON AT&T Inc said it hired media lawyer Daniel Petrocelli  whose clients have included U.S. President Donald Trump  to defend its acquisition of media and entertainment company Time Warner Inc if the government sues to block the deal.",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Ex-Trump lawyer to defend AT&T-Time Warner merger "
    },
    {
        "content": "WASHINGTON  Nov 15 Washington state attorney general's office acknowledged on Wednesday that it was reviewing a draft complaint being circulated by the U.S. Justice Department regarding AT&T's plan to buy Time Warner   confirming that the Justice Department has drawn up a complaint.",
        "date": "11152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Washington state AG's office confirms Justice Department circulating AT&T Time Warner complaint "
    },
    {
        "content": "NEW YORK  Nov 13 AT&T Inc and Verizon Communications Inc said on Monday they have agreed to lease hundreds of new cell towers from owner and operator Tillman Infrastructure  a move they hope will give them more leverage in negotiations with major U.S. tower vendors.",
        "date": "11132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T  Verizon strike tower agreement in effort to diversify vendors "
    },
    {
        "content": "WASHINGTON  Nov 14 U.S. Attorney General Jeff Sessions declined on Tuesday to answer if any White House officials contacted the Justice Department to discuss the government's review of AT&T Inc's proposed $85.4 billion acquisition of Time Warner Inc.",
        "date": "11142017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Sessions will not answer if White House asked about AT&T Time Warner merger "
    },
    {
        "content": "NEW YORK AT&T Inc still thinks its $85.4 billion deal to buy media and entertainment company Time Warner Inc will close  its chief financial officer said on Thursday.",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T continues to believe Time Warner deal will close: CFO "
    },
    {
        "content": "WASHINGTON  Nov 16 AT&T Inc said it hired media lawyer Daniel Petrocelli  whose clients have included U.S. President Donald Trump  to defend its acquisition of media and entertainment company Time Warner Inc if the government sues to block the deal.",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-Ex-Trump lawyer to defend AT&T-Time Warner merger "
    },
    {
        "content": "* State AGs have been approached by DOJ to sign on to complaint seeking to block AT&T-Time Warner deal - a person briefed on the matter Further company coverage:",
        "date": "11152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-DOJ approaches state AGs to support complaint to block AT&T-Time Warner deal - person briefed on the matter "
    },
    {
        "content": "NEW YORK  Nov 14 Viacom Inc should package 10 percent of its international operations and take it public  Mario Gabelli  chief executive office of GAMCO Investors Inc  said Tuesday at the Reuters Global Investment 2018 Outlook.",
        "date": "11142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "REUTERS SUMMIT-Gabelli suggests Viacom float part of its international business "
    },
    {
        "content": "WASHINGTON/NEW YORK President Donald Trump's broadsides against cable network CNN may complicate the U.S. government's legal case if it decides to block AT&T's deal to buy media company Time Warner  according to legal experts. | Video ",
        "date": "11102017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Trump's CNN attacks may hobble legal case to block AT&T-Time Warner deal "
    },
    {
        "content": "* AT&T reiterates commitment to step up U.S. investment if competitive tax rate enacted Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T reiterates commitment to step up U.S. investment if competitive tax rate enacted "
    },
    {
        "content": "* Says ‍announced pricing terms with respect to its private offers to exchange forty-six series of notes across two series of exchange offers​ Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T announces pricing terms for its exchange offers "
    },
    {
        "content": "Nov 15 The U.S. Department of Justice has approached state attorneys general to block AT&T Inc's $85.4 billion deal to buy Time Warner Inc  a person briefed on the matter told Reuters on Wednesday.",
        "date": "11152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. DoJ approaches state AGs to block AT&T-Time Warner deal - source "
    },
    {
        "content": "* DOJ works to get AG support on Time Warner-AT&T complaint - CNBC  citing sources‍​",
        "date": "11152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-DOJ works to get AG support on Time Warner-AT&T complaint - CNBC  citing sources‍​ "
    },
    {
        "content": "* Company  ‍AT&T & Tillman Infrastructure have entered joint agreement to build hundreds of cell towers​",
        "date": "11132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Verizon  ‍AT&T  Tillman Infrastructure enter agreement to build cell towers​ "
    },
    {
        "content": "* AT&T Inc announces modification of pricing terms and deadlines for its exchange offers",
        "date": "11132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T announces modification of pricing terms "
    },
    {
        "content": "NEW YORK  Nov 16 AT&T Inc still thinks its $85.4 billion deal to buy media and entertainment company Time Warner Inc will close  its chief financial officer said on Thursday.",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T continues to believe Time Warner deal will close - CFO "
    },
    {
        "content": "WASHINGTON  Nov 16 AT&T said on Thursday it had hired prominent media lawyer Daniel Petrocelli to serve as lead trial counsel if the U.S. Justice Department files a lawsuit to block the No. 2 U.S. wireless company's acquisition of media and entertainment company Time Warner.",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T hires ex-Trump lawyer to defend possible Time Warner deal lawsuit "
    },
    {
        "content": "WASHINGTON U.S. Attorney General Jeff Sessions would not say on Tuesday if White House officials contacted his department about its review of AT&T Inc's  proposed purchase of Time Warner   which one analyst said the Justice Department may sue to block as soon as Wednesday.",
        "date": "11152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Sessions declines to say if White House asked about AT&T-Time Warner merger "
    },
    {
        "content": "* AT&T Inc says ‍co & Shell have signed an agreement for provision of managed communications and network integration services for Shell globally​ Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Shell and AT&T sign global networking agreement "
    },
    {
        "content": "WASHINGTON  Nov 14 U.S. Attorney General Jeff Sessions would not say on Tuesday if White House officials contacted his department about its review of AT&T Inc's proposed purchase of Time Warner  which one analyst said the Justice Department may sue to block as soon as Wednesday.",
        "date": "11152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-Sessions declines to say if White House asked about AT&T-Time Warner merger "
    },
    {
        "content": "MEXICO CITY Mexico shot down a proposal by the United States to include provisions in the North America Free Trade Agreement that would benefit AT&T Inc   Mexico's Economy Minister Ildefonso Guajardo said on Wednesday.",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Mexico bristles at U.S. proposal that would benefit AT&T in NAFTA "
    },
    {
        "content": "AT&T Inc on Wednesday said that some U.S. customers were not able to make wireless calls but that restarting their cellphones would fix the issue.",
        "date": "11162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T reports some U.S. customers unable to make wireless calls "
    },
    {
        "content": "WASHINGTON/NEW YORK Nov 9 U.S. President Donald Trump's broadsides against cable network CNN may complicate the U.S. government's legal case if it decides to block AT&T's deal to buy media company Time Warner  according to legal experts.",
        "date": "11092017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 5-Trump's CNN attacks may hobble legal case to block AT&T-Time Warner deal "
    },
    {
        "content": "WASHINGTON  Nov 8 U.S. Justice Department officials said on Wednesday that selling cable channel CNN would not solve antitrust concerns about AT&T Inc's deal to buy media company Time Warner Inc.",
        "date": "11082017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Selling CNN does not fix AT&T deal for Time Warner -Justice Dept officials "
    },
    {
        "content": "A simple coding error in at least 685 apps put millions of smartphone users at risk of having some of their calls and text messages intercepted by hackers  cyber-security firm Appthority warned on Thursday.",
        "date": "11092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Mobile-app errors expose data on 180 million phones: security firm "
    },
    {
        "content": "Nov 8 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "11082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* AT&T to invest an additional $1 billion in the United States if competitive tax rate enacted",
        "date": "11082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T to invest additional $1 bln in U.S. if competitive tax rate enacted "
    },
    {
        "content": "Nov 9 A simple coding error in at least 685 apps put millions of smartphone users at risk of having some of their calls and text messages intercepted by hackers  cyber-security firm Appthority warned on Thursday.",
        "date": "11092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Mobile-app errors expose data on 180 mln phones -security firm "
    },
    {
        "content": "Nov 9 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "11092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Nov 9 AT&T Inc is ready to litigate if the U.S. Department of Justice blocks its $85.4 billion Time Warner Inc deal   Chief Executive Randall Stephenson said on Thursday.",
        "date": "11092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T CEO says open to litigation on Time Warner deal "
    },
    {
        "content": "* U.S. regulators demand CNN sale to approve AT&T-Time Warner deal- FT  citing sources Source text : http://on.ft.com/2zmMT5H Further company coverage:",
        "date": "11082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-U.S. regulators demand CNN sale to approve At&T-Time Warner deal - FT "
    },
    {
        "content": "AT&T Inc's  proposed acquisition of Time Warner Inc   which is being scrutinized by the U.S. Department of Justice  may not be dead yet  Dish Network Corp  Chief Executive Charlie Ergen said.",
        "date": "11092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T-Time Warner deal not dead yet: Dish CEO Ergen "
    },
    {
        "content": "The U.S. Department of Justice is pushing AT&T Inc  for \"structural remedies\" in order to satisfy antitrust concerns over its purchase of Time Warner Inc   a source told Reuters on Wednesday.",
        "date": "11082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. wants 'structural remedies' for approval of AT&T's purchase of Time Warner: source "
    },
    {
        "content": "Nov 9 U.S. Justice department's main concern over at&t acquisition of time warner is merged firm will raise costs of time warner content to rivals - source",
        "date": "11092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Justice Dept staff recommended AT&T divest Turner or DirecTV - gov't official "
    },
    {
        "content": "* AT&T CEO at NYT dealbook conference \"was never been told to sell CNN\" - CNBC",
        "date": "11092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T CEO says has never been told to sell CNN - NYT conference "
    },
    {
        "content": "Nov 9 AT&T Inc's proposed acquisition of Time Warner Inc  which is being scrutinized by the U.S. Department of Justice  may not be dead yet  Dish Network Corp Chief Executive Charlie Ergen said.",
        "date": "11092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T-Time Warner deal not dead yet - Dish CEO Ergen "
    },
    {
        "content": "WASHINGTON AT&T Inc and the U.S. Department of Justice are discussing conditions the No. 2 wireless carrier needs to meet in order to win government antitrust approval for its acquisition of Time Warner Inc  sources familiar with the situation told Reuters on Thursday.",
        "date": "11032017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. and AT&T discuss conditions for approval of Time Warner deal "
    },
    {
        "content": "Nov 8 The U.S. Department of Justice is pushing AT&T Inc for \"structural remedies\" in order to satisfy antitrust concerns over its purchase of Time Warner Inc  a source told Reuters on Wednesday.",
        "date": "11082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US wants 'structural remedies' for approval of AT&T's purchase of Time Warner -source "
    },
    {
        "content": "* AT&T CFO says timing of Time Warner deal closing 'now uncertain'- CNBC  citing DJ‍​ Source text : http://cnb.cx/2heNifO",
        "date": "11082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T CFO says timing of Time Warner deal closing 'now uncertain'- CNBC  citing DJ‍​ "
    },
    {
        "content": "WASHINGTON  Nov 2 AT&T Inc and the U.S. Department of Justice are discussing conditions the No. 2 wireless carrier needs to meet in order to win government antitrust approval for its acquisition of Time Warner Inc   sources familiar with the situation told Reuters on Thursday.",
        "date": "11022017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 5-U.S. and AT&T discuss conditions for approval of Time Warner deal "
    },
    {
        "content": "* AT&T  in relation to Time Warner deal  says \"we won't comment on our discussions with DOJ\"",
        "date": "11022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T will not comment on discussions with DOJ - spokesman "
    },
    {
        "content": "Nov 2 The U.S. Department of Justice is considering seeking to block AT&T Inc's merger with Time Warner Inc as it continues talks with the two companies  the Wall Street Journal reported on Thursday.",
        "date": "11022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "DoJ considers blocking AT&T deal for Time Warner -WSJ "
    },
    {
        "content": "* AT&T OFFICIALS HAVE MET WITH JUSTICE DEPARTMENT IN RECENT WEEKS REGARDING TIME WARNER DEAL - WSJ",
        "date": "11022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-U.S. weighs suit against AT&T's deal for Time Warner - WSJ "
    },
    {
        "content": "SAN FRANCISCO Chipmaker Qualcomm Inc and private equity firm JMC Capital Partners are looking to sell their stakes in a joint venture that operates more than 1 300 free WiFi kiosks fashioned from old phone booths around New York City  according to people familiar with the matter.",
        "date": "11022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Qualcomm  JMC seek to exit Alphabet-backed New York WiFi project: sources "
    },
    {
        "content": "SAN FRANCISCO  Nov 1 Chipmaker Qualcomm Inc and private equity firm JMC Capital Partners are looking to sell their stakes in a joint venture that operates more than 1 300 free WiFi kiosks fashioned from old phone booths around New York City  according to people familiar with the matter.",
        "date": "11022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Qualcomm  JMC seek to exit Alphabet-backed New York WiFi project -sources "
    },
    {
        "content": "* ‍Qualcomm Technologies - Co  AT&T  Ford  Nokia to help accelerate development of connected cars with first announced cellular-V2X trials in the U.S.​ Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-‍Qualcomm  AT&T  Ford and Nokia launch cellular-V2X connected car technology trials "
    },
    {
        "content": "WASHINGTON AT&T Inc   Verizon Communications Inc  and T-Mobile US Inc  are being awarded a U.S. defense contract worth $199 million for wireless services and devices  the Pentagon said on Monday.",
        "date": "10302017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T  Verizon  T-Mobile win $994 million U.S. defense contract: Pentagon "
    },
    {
        "content": "WASHINGTON  Oct 30 AT&T Inc  Verizon Communications Inc and T-Mobile US Inc are being awarded a U.S. defense contract worth $199 mln for wireless services and devices  the Pentagon said on Monday.",
        "date": "10302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T  Verizon  T-Mobile win $994 mln U.S. defense contract -Pentagon "
    },
    {
        "content": "* AT&T Inc. announces debt exchange offers for forty-six series of notes Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T Inc. announces debt exchange offers for forty-six series of notes "
    },
    {
        "content": "* Says collaborating with Tech Mahindra to build an open source artificial intelligence platform  Acumos  hosted by Linux Foundation​ Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T says collaborating with Tech Mahindra to build an open source artificial intelligence platform "
    },
    {
        "content": "* AT&T - co is ‍collaborating with Box to provide integrated private content management solution utilizing netbond for cloud​ Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T says collaborating with Box Inc "
    },
    {
        "content": "* AT&T expands strategic relationship with Amazon Web Services Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T expands strategic relationship with Amazon Web Services "
    },
    {
        "content": "MEXICO CITY For every peso cent Mexican mogul Carlos Slim's America Movil can charge for interconnection fees  the company's competitors in Mexico would collectively pay about $20 million per year  according to estimates from rival AT&T Inc provided to Reuters.",
        "date": "10262017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "America Movil's network fees may cost rivals millions: AT&T "
    },
    {
        "content": "MEXICO CITY  Oct 26 For every peso cent Mexican mogul Carlos Slim's America Movil can charge for interconnection fees  the company's competitors in Mexico would collectively pay about $20 million per year  according to estimates from rival AT&T Inc provided to Reuters.",
        "date": "10262017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "America Movil's network fees may cost rivals millions -AT&T "
    },
    {
        "content": "WASHINGTON  Oct 26 Seven groups ranging from the Tea Party Patriots to liberal consumer groups warned against AT&T's plan to buy Time Warner in a letter to Attorney General Jeff Sessions  saying the deal could give one company too much power over what Americans see on television.",
        "date": "10262017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Consumer groups join conservatives against AT&T deal for Time Warner "
    },
    {
        "content": "* AT&T Inc files for potential offering of global notes due 2066‍​; size not disclosed - SEC filing‍​",
        "date": "10252017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T files for potential offering of global notes due 2066‍​ "
    },
    {
        "content": "NEW YORK AT&T Inc's quarterly results missed Wall Street estimates as the U.S. No. 2 wireless carrier lost video subscribers to traditional and online TV competitors and fewer of its existing customers upgraded their devices ahead of Apple Inc's launch of the iPhone X.",
        "date": "10242017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T results miss estimates as video competition rises "
    },
    {
        "content": "NEW YORK  Oct 24 AT&T Inc's quarterly results missed Wall Street estimates as the U.S. No. 2 wireless carrier lost video subscribers to traditional and online TV competitors and fewer of its existing customers upgraded their devices ahead of Apple Inc's launch of the iPhone X.",
        "date": "10242017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T results miss estimates as video competition rises "
    },
    {
        "content": "NEW YORK  Oct 24   AT&T Inc's quarterly results missed Wall Street  estimates as the U.S. No. 2 wireless carrier lost video subscribers to traditional and online TV competitors and fewer of its existing customers upgraded their devices ahead Apple Inc's launch of the iPhone X.",
        "date": "10242017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "CORRECTED-UPDATE 1-AT&T results miss estimates as video competition rises "
    },
    {
        "content": "* Q3 earnings per share view $0.75 -- Thomson Reuters I/B/E/S",
        "date": "10242017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T reports Q3 adj. earnings per share $0.74 "
    },
    {
        "content": "NEW YORK  Oct 24   AT&T Inc's quarterly results missed Wall Street  estimates as the U.S. No. 2 wireless carrier lost video subscribers to pay-TV competitors.",
        "date": "10242017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T results miss estimates as pay-TV competition rises "
    },
    {
        "content": "* AT&T - Co  Time Warner to extend Oct. 22 \"termination date\" of deal agreement to help get final regulatory approval to close deal - SEC filing‍​",
        "date": "10232017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T - Co  Time Warner to extend Oct. 22 \"termination date\" of deal agreement "
    },
    {
        "content": "Oct 23 AT&T Inc said on Monday it had extended by a \"short period\" the deadline to close its proposed deal to acquire Time Warner Inc  to buy time to get the required regulatory approvals for the deal.",
        "date": "10232017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T extends deadline to close Time Warner deal "
    },
    {
        "content": "Oct 20 Alphabet Inc said on Friday it is collaborating with AT&T Inc to deliver limited internet connectivity to the hardest-hit areas of Puerto Rico through its \"Project Loon\" balloon project.",
        "date": "10202017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Alphabet balloon project to provide limited internet in Puerto Rico "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 20 (Fitch) Fitch Ratings has maintained on Rating Watch Negative the 'A-' long-term Issuer Default Ratings (IDRs) and senior unsecured debt of AT&T Inc. (AT&T) (NYSE: T) and its subsidiaries. Fitch has also affirmed the company's short-term IDR and commercial paper ratings at 'F2'. A full list of rating actions follows at the end of this release. The ratings are on Negative Watch due to the pending Time Warner Inc. acqu",
        "date": "10202017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Fitch Maintains AT&T's 'A-' L-T IDR on Rating Watch Negative "
    },
    {
        "content": "BRASILIA  Oct 18 Brazil's antitrust authority on Wednesday approved a merger of Time-Warner Inc and AT&T Inc  and allowed the companies to keep all of their assets in the country  under certain conditions.",
        "date": "10182017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Time-Warner  AT&T win conditional antitrust nod in Brazil "
    },
    {
        "content": "BRASILIA Brazil's antitrust regulator Cade is set to approve AT&T Inc's  acquisition of Time Warner Inc  on Wednesday  with conditions  newspaper Valor Economico reported on Monday.",
        "date": "10162017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Brazil antitrust regulator to approve AT&T-Time Warner merger: media "
    },
    {
        "content": "* Brazilian antitrust authority approves AT&T acquisition of Time Warner",
        "date": "10182017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Brazilian antitrust authority approves AT&T acquisition of Time Warner "
    },
    {
        "content": "BRASILIA  Oct 18 A key official on Brazil's antitrust watchdog Cade voted on Wednesday to approve AT&T Inc's acquisition of Time Warner Inc as long as both companies continued to run their Brazilian operations separately.",
        "date": "10182017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Brazilian antitrust official says AT&T  Time Warner must keep operations separate "
    },
    {
        "content": "BRASILIA  Oct 16 Brazil's antitrust regulator Cade is set to approve AT&T Inc's acquisition of Time Warner Inc on Wednesday  with conditions  newspaper Valor Economico reported on Monday. AT&T agreed to buy Time Warner last year for $85 billion in a transaction it has said it hopes to conclude by year's end.",
        "date": "10162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Brazil antitrust regulator to approve AT&T-Time Warner merger -media "
    },
    {
        "content": "AT&T Inc  said on Wednesday that its third-quarter results took a hit from a string of hurricanes that tore into parts of the United states and earthquakes in Mexico.",
        "date": "10112017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T says hurricanes  earthquakes hurt third-quarter results "
    },
    {
        "content": "Oct 11 AT&T Inc said on Wednesday that its third-quarter results took a hit from a string of hurricanes that tore into parts of the United states and earthquakes in Mexico.",
        "date": "10112017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T says hurricanes  earthquakes hurt third-quarter results "
    },
    {
        "content": "* Reiterates its full-year 2017 guidance of mid-single digit adjusted earnings growth",
        "date": "10112017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T reiterates FY17 guidance  continues to assess hurricane losses "
    },
    {
        "content": "WASHINGTON U.S. Senator Elizabeth Warren on Thursday urged the Justice Department's top antitrust official to recuse himself from an ongoing review of AT&T Inc's planned $85.4 billion acquisition of Time Warner Inc.",
        "date": "10122017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. Justice Dept official should not review AT&T/Time Warner deal: senator "
    },
    {
        "content": "Oct 11 AT&T Inc said on Wednesday that hurricanes in the U.S. and earthquakes in Mexico have significantly affected the no. 2 U.S. wireless carrier's third quarter results.",
        "date": "10112017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T expects 3rd-qtr to be hurt by hurricanes in U.S. "
    },
    {
        "content": "WASHINGTON  Oct 12 U.S. Senator Elizabeth Warren on Thursday urged the Justice Department's top antitrust official to recuse himself from an ongoing review of AT&T Inc's planned $85.4 billion acquisition of Time Warner Inc .",
        "date": "10122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-U.S. Justice Dept official should not review AT&T/Time Warner deal -senator "
    },
    {
        "content": "WASHINGTON  Oct 12 U.S. Senator Elizabeth Warren on Thursday urged the Justice Department's top antitrust official to recuse himself from an ongoing review of AT&T Inc's planned $85.4 billion acquisition of Time Warner Inc .",
        "date": "10122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. Justice Dept official should not review AT&T Time Warner deal -senator "
    },
    {
        "content": "NEW YORK  Oct 12 U.S. stocks edged lower on Thursday as bank shares fell following quarterly results from JPMorgan and Citigroup  while AT&T tumbled 6 percent after it said it lost subscribers in the last quarter.",
        "date": "10122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS SNAPSHOT-Wall St falls as banks weigh; AT&T slumps "
    },
    {
        "content": "NEW YORK AT&T Inc's third-quarter video losses sent pay-TV industry shares down on Thursday after Wall Street analysts raised concerns about the continued threat of consumers cancelling their cable and satellite television subscriptions.",
        "date": "10122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T subscriber losses highlight cord-cutting threat: analysts "
    },
    {
        "content": "NEW YORK  Oct 12 AT&T Inc's third-quarter video losses sent pay-TV industry shares down on Thursday after Wall Street analysts raised concerns about the continued threat of consumers cancelling their cable and satellite television subscriptions.",
        "date": "10122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T subscriber losses highlight cord-cutting threat -analysts "
    },
    {
        "content": "NEW YORK  Oct 12 AT&T Inc's third-quarter video losses sent pay-TV industry shares down on Thursday after Wall Street analysts raised concerns about the continued threat of consumers cancelling their cable and satellite television subscriptions.",
        "date": "10122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T subscriber losses highlight cord-cutting threat- analysts "
    },
    {
        "content": "WASHINGTON  Oct 3 The chairman of the U.S. telecoms regulator on Tuesday proposed making available up to $77 million to fund repairs of communication networks and restore services in storm-lashed Puerto Rico and the U.S. Virgin Islands.",
        "date": "10032017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 1-U.S. agency proposes extra funds to restore Puerto Rico comms "
    },
    {
        "content": "* AT&T Inc CEO on deal with Time Warner- \"mindful that we're buying a business that we don't have a lot of experience in - Vanity Fair Summit",
        "date": "10042017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T CEO on Time Warner deal \"mindful that we're buying a business that we don't have a lot of experience in\" "
    },
    {
        "content": "WASHINGTON  Oct 4 The U.S. Federal Communications Commission on Wednesday approved up to $77 million to fund repairs of communication networks and restore services in storm-lashed Puerto Rico and the U.S. Virgin Islands.",
        "date": "10042017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-U.S. FCC approves up to $77 mln to restore communications after hurricane "
    },
    {
        "content": "WASHINGTON  Oct 2 The U.S. Senate on Monday confirmed Federal Communications Commission Chairman Ajit Pai for another five-year term on the telecommunications regulatory panel where he faces decisions over dismantling Obama-era internet protections and a major television station merger.",
        "date": "10022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-U.S. Senate confirms FCC chairman to new five-year term "
    },
    {
        "content": "WASHINGTON  Sept 26 U.S. Senate Majority Leader Mitch McConnell on Tuesday moved to force the Senate to vote later this week on the nomination of Federal Communications Commission Chairman Ajit Pai to serve another five-year term.",
        "date": "09262017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. Senate plans to vote on FCC chairman tenure this week "
    },
    {
        "content": "* Tivo Corp - ‍extended license​ agreement with AT&T now includes a license to Tivo Solutions patent portfolio Source: (http://bit.ly/2hxPmiX) Further company coverage:",
        "date": "09272017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Tivo - ‍extended AT&T license​ agreement now includes license to Tivo Solutions patent portfolio "
    },
    {
        "content": "AT&T  is evaluating a sale of its pay TV operations in Latin America as it seeks to pay down debt following its planned $85.4 billion acquisition of Time Warner Inc   people familiar with the matter said on Friday.",
        "date": "09162017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Exclusive: AT&T weighs divestiture of Latin American TV assets - sources "
    },
    {
        "content": "Sept 18 Sprint Corp said on Monday it will offer Apple Inc's new iPhone 8 for free with a qualifying phone trade-in  following AT&T Inc's buy one  get one free promotion on Friday for DirecTV and U-verse TV customers.",
        "date": "09182017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Sprint follows AT&T with free iPhone 8 offer for trade-in "
    },
    {
        "content": "* at&t inc - ‍ iphone 8  iphone 8 plus  apple watch series 3 with built-in cellular arrive at AT&T on Sept 22​",
        "date": "09142017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T to offer iPhone 8  iPhone 8 plus  Apple watch series 3 "
    },
    {
        "content": "Sept 14 Oracle Corp forecast current-quarter adjusted profit largely below Wall Street's estimates and indicated to slowing growth in its soaring cloud business  sending the company's shares down as much as 5 percent in aftermarket trading.",
        "date": "09142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-Oracle's profit  cloud growth forecasts drag down shares "
    },
    {
        "content": "Sept 12 AT&T Inc  which is buying Time Warner Inc  said it plans to reinvest more advertising revenue into content as it goes head-to-head with online streaming services such as Netflix Inc.",
        "date": "09122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to reinvest more ad sales into content  extends free HBO offer "
    },
    {
        "content": "* AT&T says now co brings HBO to both current unlimited plans  unlimited plus and now unlimited choice  with no catch and no additional requirements‍​ Source text:( http://soc.att.com/2wXQ0PA) Further company coverage:",
        "date": "09122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T Unlimited Choice now includes HBO ‍​ "
    },
    {
        "content": "* Says co  Sprint  T-Mobile and Verizon are joining forces to create a mobile authentication taskforce​",
        "date": "09082017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T  Sprint  T-Mobile and Verizon team up to develop mobile authentication solution "
    },
    {
        "content": "* At&T Inc - ‍FNE's approval does not require sale or divestiture of any At&T or Time Warner assets​ Source text for Eikon: Further company coverage:",
        "date": "09042017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T says Chilean regulators approve AT&T acquisition of Time Warner "
    },
    {
        "content": "* AT&T - provided notice to Mizuho bank that co will make prepayment on Sept 5  of all remaining advances under $9 155 million credit agreement - SEC filing",
        "date": "09012017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T - provided notice to Mizuho bank that co will make prepayment on Sept 5 - SEC filing "
    },
    {
        "content": "Sept 1 About four million Time Warner Cable records containing details of its customers were found unsecured on an Amazon server last month  tech website Gizmodo reported on Friday.",
        "date": "09012017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Records of 4 mln Time Warner Cable customers left unsecured - Gizmodo "
    },
    {
        "content": "NEW YORK  Aug 30 AT&T Inc said on Wednesday that it is expanding its 5G trials to include three new U.S. cities by the end of the year as part of its push to develop a next-generation network.",
        "date": "08302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to expand 5G U.S. broadband trials "
    },
    {
        "content": "MEXICO CITY  Aug 23 America Movil's Telcel unit and AT&T have reached an agreement regarding roaming services in Mexico  America Movil announced on Wednesday.",
        "date": "08232017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "America Movil announces roaming agreement with AT&T for Mexico users "
    },
    {
        "content": "Aug 21 CNN on Monday began streaming \"The Update \" a daily show on Snapchat featuring at least five news stories each episode from reporters and bureaus around the world  to attract younger viewers.",
        "date": "08212017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "CNN launches daily news show on Snapchat "
    },
    {
        "content": "AT&T Inc  is exploring options for its Digital Life home security business  including selling it  as it seeks to pay down debt following its planned $85.4 billion acquisition of Time Warner Inc   people familiar with the matter said.",
        "date": "08182017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T considers sale of home security business: sources "
    },
    {
        "content": "Aug 18 AT&T Inc is exploring options for its Digital Life home security business  including selling it  as it seeks to pay down debt following its planned $85.4 billion acquisition of Time Warner Inc  people familiar with the matter said.",
        "date": "08182017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "REFILE-AT&T considers sale of home security business -sources "
    },
    {
        "content": "Aug 13 Hackers have released more unaired episodes of popular HBO shows but the latest leak did not include anything on the hit series \"Game of Thrones \" the Associated Press reported on Sunday.",
        "date": "08142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Hackers release more HBO episode shows -report "
    },
    {
        "content": "* AT&T announces CWA-represented employees vote to ratify west wireline agreement",
        "date": "08112017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T says CWA-represented employees vote to ratify west wireline agreement "
    },
    {
        "content": "Aug 11 Time Warner Inc's HBO network last month offered $250 000 to cyber criminals who hacked into its computer system  asking them to extend a deadline for paying a much larger ransom  according to an email reviewed by Reuters.",
        "date": "08112017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-HBO offered $250 000 to hackers in bid to delay data release "
    },
    {
        "content": "Aug 11 The hackers behind HBO's recent data breach have leaked an email in which the U.S. cable channel offered them $250 000 as a  \"bounty payment \" Hollywood trade paper Variety reported on Thursday.",
        "date": "08112017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "HBO offers $250 000 as 'bounty payment' to hackers - Variety "
    },
    {
        "content": "* Co has been selected by AT&T Corp to provide cloud call and communication capture solution for AT&T Collaborate service Source text for Eikon: Further company coverage:",
        "date": "08082017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Dubber Corp provides cloud call and communication capture solution for AT&T Collaborate service "
    },
    {
        "content": "Aug 8 HBO  the Time Warner Inc cable network that broadcasts \"Game of Thrones \" confirmed on Tuesday that it was investigating a hack that it disclosed to employees 10 days ago.",
        "date": "08082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "HBO says probe of hack is ongoing "
    },
    {
        "content": "* On June 21  commitments under bridge loan reduced to $21 billion as result of co receiving net cash proceeds from sale of certain global notes​ Source text for Eikon: Further company coverage:",
        "date": "08072017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T's commitments under bridge loan reduced to $21 bln "
    },
    {
        "content": "CBS Corp said on Monday it signed a deal for its shows to feature on AT&T Inc's DirecTV Now online streaming service.",
        "date": "08072017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "CBS signs with AT&T to stream networks on DirecTV Now "
    },
    {
        "content": "* AT&T names Brian Lesser CEO of new advertising & analytics company",
        "date": "08042017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T names Brian Lesser CEO of new advertising & analytics company "
    },
    {
        "content": "Aug 7 CBS Corp said on Monday it signed a deal for its shows to feature on AT&T Inc's DirecTV Now online streaming service.",
        "date": "08072017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-CBS signs with AT&T to stream networks on DirecTV Now "
    },
    {
        "content": "Aug 4 The unaired fourth episode of the new season of HBO's hit series \"Game of Thrones\" has been leaked online  the premium channel's distribution partner Star India said on Friday.",
        "date": "08042017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "New 'Game of Thrones' episode leaks online through HBO partner "
    },
    {
        "content": "Aug 7 CBS Corp said on Monday that AT&T Inc's DirecTV Now will livestream some of its channels including CBS  CBS Sports Network and Showtime.",
        "date": "08072017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T's DirecTV Now to stream some CBS networks "
    },
    {
        "content": "* AT&T says in coming weeks will begin to roll out CBS Television Network's popular entertainment  Sports and CBS news programming on Directv Now",
        "date": "08072017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T says to roll out CBS network's popular entertainment  Sports and CBS news programming on Directv Now "
    },
    {
        "content": "* CBS Corp reaches agreement with AT&T to join \"DirecTV Now\" live tv service",
        "date": "08072017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-CBS Corp reaches agreement with AT&T to join \"DirecTV Now\" live tv service "
    },
    {
        "content": "WASHINGTON  Aug 2 The premium movie channel Starz criticized AT&T's plan to buy Time Warner Inc on Wednesday  saying the megadeal would give AT&T the clout to steer customers away from Starz and toward its own premium channels.",
        "date": "08022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Pay TV channel Starz criticizes AT&T plan to buy Time Warner "
    },
    {
        "content": "Aug 2 Time Warner Inc  which is in the process of being bought by AT&T Inc  reported an 11.6 percent rise in quarterly profit  helped by the success of its latest superhero movie \"Wonder Woman\".",
        "date": "08022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "\"Wonder Woman\" lifts Time Warner profit "
    },
    {
        "content": "NEW YORK  July 28 AT&T Inc said on Friday that its executives will head its media and wireless businesses following the close of its $85.4 billion acquisition of Time Warner Inc.",
        "date": "07282017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T executives to run combined company after Time Warner deal "
    },
    {
        "content": "Five of the largest U.S. pay-TV providers posted subscriber losses during the second quarter as younger viewers increasingly cut the cord and moved to \"skinny bundles \" or cheaper packages with select channels  and Internet streaming services like Netflix or Hulu.",
        "date": "07282017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Factbox: More subscribers abandon pay-TV in the second quarter "
    },
    {
        "content": "* Indexes up: Dow 0.48 pct  S&P 0.04 pct  Nasdaq 0.16 pct (Adds details  changes comment  updates prices)",
        "date": "07262017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Boeing  AT&T power Wall St to record; Fed in focus "
    },
    {
        "content": "* Indexes up: Dow 0.44 pct  S&P 0.08 pct  Nasdaq 0.24 pct (Updates to open)",
        "date": "07262017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St opens at record highs on strong earnings "
    },
    {
        "content": " (Adds auction results  quotes; updates prices)     * Treasury sells $28 bln seven-year notes to fair demand     * AT&T markets large bond sale     * Gross domestic product data in focus on Friday      By Karen Brettell     NEW YORK  July 27 U.S. Treasury prices fell on Thursday as the market was weighed down by government and corporate debt supply  and as investors evaluated the Federal Reserve's statement that it is closer to paring its balance sheet.     The Treasury Department so",
        "date": "07272017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "TREASURIES-Bond prices fall  yield curve steepens on heavy supply "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 27 (Fitch) Fitch Ratings has assigned an 'A-' rating to AT&T Inc.'s (AT&T; NYSE: T) benchmark senior unsecured note offering. The senior unsecured offering will be in seven tranches: senior unsecured fixed rate notes due in 2023  2024  2027  2037  2050 and 2058 as well as senior unsecured floating rate notes due in 2023. AT&T's Long-Term Issuer Default Rating (IDR) is 'A-'. The company's IDR and debt securities remain on R",
        "date": "07272017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Fitch Rates AT&T's Sr. Unsecured Note Offering 'A-'; Remains on Rating Watch Negative "
    },
    {
        "content": "NEW YORK AT&T Inc's  quarterly profit topped Wall Street estimates on Tuesday as the No. 2 U.S. wireless carrier lowered operating costs and introduced new promotions bundling video with phone service that helped it compete in a fierce market for customers.",
        "date": "07252017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T's quarterly profit tops Wall Street estimates  shares rise "
    },
    {
        "content": "NEW YORK  July 25 AT&T Inc's quarterly profit topped Wall Street estimates on Tuesday as the No. 2 U.S. wireless carrier lowered operating costs and introduced new promotions bundling video with phone service that helped it compete in a fierce market for customers.",
        "date": "07252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T's quarterly profit tops Wall St estimates  shares rise "
    },
    {
        "content": "* Global Omnicom/AT&T network strategy will utilize AT&T flexware  AT&T netbond for cloud and AT&T threat manager Source text for Eikon: Further company coverage:",
        "date": "07242017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T to build global network for Omnicom Group "
    },
    {
        "content": "NEW YORK  July 25 AT&T Inc's quarterly profit topped Wall Street estimates on Tuesday as the No. 2 U.S. wireless carrier introduced new promotions that bundle video with phone service to lure customers.",
        "date": "07252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T's quarterly profit tops Wall St estimates "
    },
    {
        "content": "* Q2 revenue $39.8 billion versus I/B/E/S view $39.79 billion",
        "date": "07252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T reports Q2 earnings per share $0.63 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  July 25 (Fitch) Fitch Ratings has assigned a 'BBB-' rating to Crown Castle International Corp.'s (Crown) offering of senior unsecured notes due in 2024 and senior unsecured notes due in 2027  in each case subject to market and other conditions. Net proceeds from the offering will be used to finance the debt portion of Crown's acquisition of LTS Group Holdings LLC (Lightower). On July 18  2017  Crown announced a definitive agre",
        "date": "07252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Fitch Rates Crown Castle's Notes Offering 'BBB-'; Outlook Stable "
    },
    {
        "content": "WASHINGTON U.S. Democrats unveiled an economic platform on Monday that included plans to address unfair market competition  rising pharmaceuticals costs and stagnant wages. | Video ",
        "date": "07252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Democrats take aim at big companies in economic blueprint "
    },
    {
        "content": "WASHINGTON  July 13 Seven consumer advocacy groups wrote to Attorney General Jeff Sessions on Thursday to ask him to consider blocking AT&T's plan to buy Time Warner on the grounds that it will lead to higher prices and slow innovation in showing video online.",
        "date": "07132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. attorney general urged to consider blocking AT&T deal for Time Warner "
    },
    {
        "content": "* Announces Netcomm Wireless works with AT&T to enable fixed wireless internet availability to rural and underserved areas in U.S. Source text for Eikon: Further company coverage:",
        "date": "07132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Netcomm wireless updates on USA Fixed Wireless contract with AT&T "
    },
    {
        "content": "AT&T Inc will run its wireless and DirecTV satellite television businesses separately from Time Warner Inc's media assets following its $85.4 billion acquisition of the entertainment group  a source told Reuters on Friday.",
        "date": "07142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to run wireless  media as separate units - source "
    },
    {
        "content": "July 14 AT&T Inc will run its wireless and DirecTV satellite television businesses separately from Time Warner Inc's media assets following its $85.4 billion acquisition of the entertainment group  a source told Reuters on Friday.",
        "date": "07142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 7-AT&T to run wireless  media as separate units -source "
    },
    {
        "content": "* Has reached a tentative agreement with AT&T West with the help of a federal mediator‍​",
        "date": "07142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Communications Workers of America reaches tentative agreement with AT&T West "
    },
    {
        "content": "NEW YORK AT&T Inc  Chief Executive Officer Randall Stephenson will remain chairman and CEO of the company following its $85.4 billion acquisition of Time Warner Inc   an AT&T spokesman said on Friday.",
        "date": "07142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T CEO will keep title after Time Warner deal close: spokesman "
    },
    {
        "content": "NEW YORK  July 14 AT&T Inc Chief Executive Officer Randall Stephenson will remain chairman and CEO of the company following its $85.4 billion acquisition of Time Warner Inc  an AT&T spokesman said on Friday.",
        "date": "07142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T CEO will keep title after Time Warner deal close - spokesman "
    },
    {
        "content": "July 14 Broadband provider AT&T Inc is planning a redefined role for Chief Executive Randall Stephenson amid major organizational changes following its $85.4 billion acquisition of Time Warner Inc  Bloomberg reported on Friday.",
        "date": "07142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "CORRECTED-AT&T planning organizational changes  including new role for CEO - Bloomberg "
    },
    {
        "content": "* AT&T is planning organizational changes to follow its deal for Time Warner  including redefined role for CEO Randall Stephenson- Bloomberg  citing sources",
        "date": "07142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T plans major organizational changes after Time-Warner deal- Bloomberg  citing sources "
    },
    {
        "content": "WASHINGTON Seven consumer advocacy groups wrote to Attorney General Jeff Sessions on Thursday to ask him to consider blocking AT&T's plan to buy Time Warner on the grounds that it will lead to higher prices and slow innovation in showing video online.",
        "date": "07142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. attorney general urged to consider blocking AT&T deal for Time Warner "
    },
    {
        "content": "WASHINGTON  July 12 Senator Richard Blumenthal  a member of the Judiciary Committee  said on Wednesday that he asked President Donald Trump's top antitrust pick to meet to discuss any contact he has had with the White House regarding AT&T's plan to merge with Time Warner.",
        "date": "07122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Blumenthal asks antitrust pick to discuss White House role in AT&T deal "
    },
    {
        "content": "NEW YORK/WASHINGTON  July 12 Facebook Inc   Twitter Inc  Alphabet Inc and dozens of other major technology companies protested online on Wednesday against proposed changes to U.S. net neutrality rules that prohibit broadband providers from giving or selling access to certain internet services over others.",
        "date": "07122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-Tech firms protest proposed changes to U.S. net neutrality rules "
    },
    {
        "content": "* AT&T - Virginia​ ‍governor signed letter accepting firstnet & co plan to deliver wireless broadband network to commonwealth's public safety community",
        "date": "07112017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T says Virginia​ ‍governor signed letter accepting Firstnet & Co plan "
    },
    {
        "content": "* At&T Inc - ‍AT&T and Coral will identify additional companies to invest in fund​",
        "date": "07062017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T says investing up to $200 mln in venture capital fund "
    },
    {
        "content": "* FINANCIAL TERMS OF AGREEMENT WERE NOT DISCLOSED Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07052017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Kudelski agrees to patent cross license with AT&T "
    },
    {
        "content": "July 3 AT&T customers in central Indiana including Indianapolis experienced service outages on Monday  the company said on social media.",
        "date": "07042017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T customers in central Indiana  other parts of U.S. report outages "
    },
    {
        "content": "July 3 AT&T customers in central Indiana including Indianapolis experienced service outages on Monday and into Tuesday morning after a fiber wire was cut  the company said.",
        "date": "07042017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T customers in central Indiana  other parts of U.S. report outages "
    },
    {
        "content": "NEW YORK  June 30 AT&T Inc has expanded the lineup of local channels on its DirecTV Now internet streaming service  it said on Friday  as the No. 2 wireless carrier seeks to win online subscribers who prefer not to pay for a traditional cable package.",
        "date": "06302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T expands local television stations on DirecTV Now service "
    },
    {
        "content": "* Sets quarterly dividend of $0.49 per share Source text for Eikon: Further company coverage:",
        "date": "06302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T sets quarterly dividend of $0.49 per share "
    },
    {
        "content": "* AT&T Inc - Expect that trial will provide speeds up to 1 gigabit per second using mmWave spectrum​ Source text for Eikon: Further company coverage:",
        "date": "06272017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T launches 5G trial with DIRECTV NOW in Austin "
    },
    {
        "content": "* Leidos and AT&T to implement software defined networking for the Defense Information Systems Agency Source text for Eikon: Further company coverage:",
        "date": "06262017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Leidos and AT&T to implement software defined networking for the Defense Information Systems Agency "
    },
    {
        "content": "* Requesting amendment to credit agreement  for additional time to deliver its Q1 2017 financial statements - SEC filing",
        "date": "06222017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Synchronoss Technologies says previous 2017 annual guidance is withdrawn "
    },
    {
        "content": "WASHINGTON AT&T Inc was confident it would win regulatory approval for its $85.4 billion acquisition of Time Warner Inc  before year's end as the Justice Department continues its review  but was still awaiting details about any final requirements for the deal  a senior executive said.",
        "date": "06222017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T unclear what final merger conditions Justice Department will seek "
    },
    {
        "content": "* at&t names new vice president and general manager in the mid-atlantic states",
        "date": "06212017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T says Betsy Francis to oversee mobility  consumer markets in mid-Atlantic states​ "
    },
    {
        "content": "* AT&T announces cwa-represented employees vote to ratify east wireline agreement",
        "date": "06212017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T announces CWA-represented employees vote to ratify east wireline agreement "
    },
    {
        "content": "* at&t names rob dapkiewicz vice president-federal civilian in its global public sector organization",
        "date": "06202017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T names Rob Dapkiewicz VP-Federal Civilian  Global Public Sector "
    },
    {
        "content": "* Files for pricing of £1.0 billion  3.550% global notes due 2037 - sec filing Source text : http://bit.ly/2spgDuU Further company coverage:",
        "date": "06142017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T files for pricing of £1.0 bln global notes "
    },
    {
        "content": "* AT&T Inc files preliminary prospectus supplement with U.S. SEC to file for potential offering of global notes due 2037 - SEC Filing‍​ ‍​ Source text for Eikon: Further company coverage:",
        "date": "06142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T files preliminary prospectus supplement with U.S. Sec to file for potential offering of global notes due 2037 ‍​ "
    },
    {
        "content": "* AT&T  Communications Workers Of America reach tentative agreement in east wireline contract negotiations",
        "date": "06052017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T and CWA reach tentative agreement in east wireline contract negotiations "
    },
    {
        "content": "* AT&T offers entertainment packages to all unlimited customers",
        "date": "06012017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T offers entertainment packages to all unlimited customers "
    },
    {
        "content": "* CWA reaches tentative agreement with AT&T West and DIRECTV West covering 17 000 workers‍​",
        "date": "06022017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-CWA reaches tentative agreement with AT&T West  DIRECTV West covering 17 000 workers "
    },
    {
        "content": "* AT&T Inc - intends to hire certain Brocade employees associated with that business",
        "date": "06022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T to acquire Vyatta Software Technology from Brocade "
    },
    {
        "content": "* AT&T announces IBEW-represented employees vote to ratify midwest wireline agreement",
        "date": "05272017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T announces IBEW-represented employees vote to ratify midwest wireline agreement "
    },
    {
        "content": "A federal judge in Chicago conditionally certified a class action accusing AT&T Inc subsidiaries in the midwest of not paying call center workers the overtime they were entitled to under federal wage law.",
        "date": "05252017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Federal judge approves FLSA class in AT&T call center overtime case "
    },
    {
        "content": "* Dxc technology and at&t to deliver new services to businesses globally",
        "date": "05232017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-DXC Technology  AT&T to deliver new services to businesses globally "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 23 (Fitch) Fitch Ratings has affirmed UK-based WPP Plc's Long-term Issuer Default Rating (IDR) and senior unsecured rating at 'BBB+'. The Outlook is Stable. A full list of ratings actions is below. The ratings reflect the leading market position of WPP within the marketing communications services sector and its effective scale and diversification across geographies  products and customer market sectors. The ratings are suppo",
        "date": "05232017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Fitch Affirms WPP at 'BBB+'; Outlook Stable "
    },
    {
        "content": "* AT&T CEO Randall Stephenson at JPM conference - still optimistic about the prospect of corporate tax reform Further company coverage:",
        "date": "05232017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T CEO Stephenson says still optimistic about prospect of corporate tax reform "
    },
    {
        "content": "About 37 000 AT&T Inc  workers  or less than 14 percent of the company's total workforce  began a three-day strike on Friday after failing to reach an agreement with the No. 2 U.S. wireless carrier over new contracts.",
        "date": "05192017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "About 37 000 AT&T workers go on three-day strike "
    },
    {
        "content": "May 19 About 37 000 AT&T Inc workers  or less than 14 percent of the company's total workforce  began a three-day strike on Friday after failing to reach an agreement with the No. 2 U.S. wireless carrier over new contracts.",
        "date": "05192017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1- About 37 000 AT&T workers go on three-day strike "
    },
    {
        "content": "* Says 37 000 AT&T workers currently on strike Further company coverage:",
        "date": "05192017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T spokesperson says 37 000 workers currently on strike "
    },
    {
        "content": "May 19 A majority of AT&T Inc's wireless  wireline and DirecTV  workers began a three-day strike on Friday after failing to reach an agreement with the No. 2 U.S. wireless carrier over new contracts.",
        "date": "05192017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T workers go on three-day strike "
    },
    {
        "content": "* AT&T invests nearly $60 million over 3-year period to enhance local networks in Modesto area Source text for Eikon: Further company coverage:",
        "date": "05192017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T invests nearly $60 mln over 3-year period "
    },
    {
        "content": "* Completed deployment of its nationwide LTE-m network ahead of schedule",
        "date": "05182017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T completed deployment of nationwide LTE-M network ahead of schedule "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 18 (Fitch) Fitch Ratings has assigned an 'A-' rating to AT&T Inc.'s (AT&T; NYSE: T) CAD1.35 billion senior unsecured note offering. The offering was in two tranches  CAD600 million 2.85% senior unsecured notes due 2024 and CAD750 million 4.85% senior unsecured notes due 2047. AT&T's Long-Term Issuer Default Rating (IDR) is 'A-'. The company's IDR and debt securities remain on Rating Watch Negative  where they were placed in",
        "date": "05182017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Fitch Rates AT&T's Sr. Unsecured Note Offering 'A-'; Remains on Negative Watch "
    },
    {
        "content": "* AT&T awarded $119m  5-year contract to support centers for disease control and prevention",
        "date": "05162017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T awarded $119 mln contract to support centers for disease control and prevention "
    },
    {
        "content": "* voip-pal.com announces plans to increase damage demands in lawsuits versus Apple  Verizon and AT&T",
        "date": "05152017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Voip-Pal.Com plans to increase damage demands in lawsuits versus Apple  Verizon and AT&T "
    },
    {
        "content": "* Epsilon- Epsilon  an alliance data company announced signing of relationship expansion agreement with AT&T business solutions Source: (http://bit.ly/2rmh1aD) Further company coverage:",
        "date": "05162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Epsilon signs relationship expansion agreement with AT&T "
    },
    {
        "content": "Verizon Communications Inc  snapped up wireless spectrum holder Straight Path Communications Inc  in a $3.1 billion deal  roughly double rival AT&T's  initial offer  as Verizon seeks an advantage in the race toward a 5G network. | Video ",
        "date": "05112017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Verizon beats AT&T to buy spectrum holder Straight Path "
    },
    {
        "content": "* Indexes end down: Dow 0.11 pct  S&P 0.22 pct  Nasdaq 0.22 pct (Updates to close)",
        "date": "05112017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall Street slides as investors fret about retail "
    },
    {
        "content": "* Indexes down: Dow 0.12 pct  S&P 0.24 pct  Nasdaq 0.22 pct (Updates to afternoon)",
        "date": "05112017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall Street drops as investors worry about retail "
    },
    {
        "content": "May 11 Verizon Communications Inc snapped up wireless spectrum holder Straight Path Communications Inc in a $3.1 billion deal  roughly double rival AT&T's initial offer  as Verizon seeks an advantage in the race toward a 5G network.",
        "date": "05112017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-Verizon beats AT&T to buy spectrum holder Straight Path "
    },
    {
        "content": "* Verizon to enter into definitive agreement to acquire Straight Path Communications for $184.00 per share in all stock deal; Straight Path Communications to terminate definitive agreement with AT&T",
        "date": "05112017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Verizon to acquire Straight Path Communications for an enterprise value of about $3.1 bln "
    },
    {
        "content": "Straight Path Communications Inc  said on Monday an unnamed telecommunications company had raised its offer to buy the wireless spectrum holder  in the latest move in a bidding war with AT&T Inc .",
        "date": "05082017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Straight Path gets higher offer from unnamed bidder "
    },
    {
        "content": "May 8 Straight Path Communications Inc said on Monday an unnamed telecommunications company had raised its offer to buy the wireless spectrum holder  in the latest move in a bidding war with AT&T Inc.",
        "date": "05082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Straight Path gets higher offer from unnamed bidder "
    },
    {
        "content": "* Straight Path board determines that a revised offer from a multi-national telecommunications company to acquire Straight Path for $184.00 per share constitutes a “superior proposal”",
        "date": "05082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Straight Path gets higher offer from unnamed bidder "
    },
    {
        "content": "WASHINGTON  May 7 Francis Ford Coppola  director of classic films such as \"The Godfather\" and \"Apocalypse Now \" has sent a letter to the top U.S. telecommunications regulator to urge support for \"net neutrality \" which prevents internet companies from blocking  throttling or giving \"fast lanes\" to particular websites.",
        "date": "05082017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Director Francis Ford Coppola weighs in on preserving net neutrality "
    },
    {
        "content": "WASHINGTON U.S. government claims that AT&T Mobility illegally slowed down or \"throttled\" data sent to wireless devices will be reheard  a U.S. appeals court in California said on Tuesday after it dismissed the case last year.",
        "date": "05092017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. regulator's 'throttling' lawsuit against AT&T to be reheard: court "
    },
    {
        "content": "* U.S. appeals court agrees to revisit decision that had dismissed Federal Trade Commission claims against AT&T Mobility over \"data throttling\"-order",
        "date": "05092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Appeals court agrees to revisit AT&T \"data throttling\" case "
    },
    {
        "content": "* AT&T invests nearly $6.8 billion over 3-year period to enhance local networks in Texas",
        "date": "05092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T sees significant investment to upgrade  maintain Texas' FirstNet network over next 25 yrs "
    },
    {
        "content": "* Oracle - AT&T signed agreement to move thousands of large scale internal databases to co's cloud infrastructure as a service and platform as a service",
        "date": "05042017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Oracle and AT&T enter into strategic agreement "
    },
    {
        "content": "* Straight Path board determines that a revised offer from a multi-national telecommunications company to acquire Straight Path for $135.96 per share constitutes a “superior proposal”",
        "date": "05032017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Straight Path says revised offer to buy Co for $135.96/share constitutes “superior proposal” "
    },
    {
        "content": "May 3 Time Warner Inc  which is being bought by AT&T  reported a 17.3 percent rise in profit  helped by the success of its releases \"Kong: Skull Island\" and \"The Lego Batman Movie\" in the first quarter.",
        "date": "05032017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Time Warner first-quarter profit rises 17.3 pct "
    },
    {
        "content": "WASHINGTON A federal appeals court on Monday declined to rehear a challenge to the Obama administration's landmark \"net neutrality\" rules requiring internet providers to guarantee equal access to all websites.",
        "date": "05012017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. appeals court will not rehear 'net neutrality' challenge "
    },
    {
        "content": "WASHINGTON  May 1 A federal appeals court on Monday declined to rehear a challenge to the Obama administration's landmark \"net neutrality\" rules requiring internet providers to guarantee equal access to all websites.",
        "date": "05012017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-U.S. appeals court will not rehear 'net neutrality' challenge "
    },
    {
        "content": "LONDON  May 2 (IFR) - AT&T is expected to tap the European bond market soon to help finance its US$85.4bn acquisition of Time Warner  according to several market participants.",
        "date": "05022017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 1-Investors expect AT&T to hit debt market "
    },
    {
        "content": "LONDON  May 2 (IFR) - AT&T is expected to tap the European bond market soon to help finance its US$85.4bn acquisition of Time Warner  according to several market participants.",
        "date": "05022017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Investors expect AT&T to hit debt market "
    },
    {
        "content": "* AT&T  IBEW reach tentative agreement in Midwest wireline contract negotiations",
        "date": "04262017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T  IBEW reach tentative agreement in Midwest wireline contract negotiations "
    },
    {
        "content": "WASHINGTON The head of the U.S. Federal Communications Commission on Wednesday proposed overturning the landmark 2015 Obama-era net neutrality rules that prohibit broadband providers from giving or selling access to certain internet services over others.",
        "date": "04262017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC chairman to propose reversing 'net neutrality' rules "
    },
    {
        "content": "WASHINGTON  April 24 The head of the U.S. Federal Communications Commission is expected to unveil his strategy this week to overturn landmark 2015 net neutrality rules  a move that will kickoff a new battle over the future of the internet.",
        "date": "04242017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "FCC chairman expected to unveil strategy to reverse net neutrality -sources "
    },
    {
        "content": "AT&T Inc's  quarterly revenue missed estimates due to lower equipment sales as customers held onto phones longer and rival wireless carriers offered new promotions on unlimited data plans  the No. 2 U.S. wireless carrier said on Tuesday.",
        "date": "04252017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T revenue misses estimates as customers keep phones longer "
    },
    {
        "content": "April 25 AT&T Inc's quarterly revenue missed estimates due to lower equipment sales as customers held onto phones longer and rival wireless carriers offered new promotions on unlimited data plans  the No. 2 U.S. wireless carrier said on Tuesday.",
        "date": "04252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T revenue misses estimates as customers keep phones longer "
    },
    {
        "content": "April 25 AT&T Inc  the No. 2 U.S. wireless carrier  reported a drop in quarterly revenue and unexpectedly lost postpaid subscribers as lower prices for its unlimited plans failed to attract customers in a saturated wireless market.",
        "date": "04252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T unexpectedly loses postpaid subscribers in first quarter "
    },
    {
        "content": "April 25 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON The head of the U.S. Federal Communications Commission is expected to unveil his strategy this week to overturn landmark 2015 net neutrality rules  a move that will kickoff a new battle over the future of the internet.",
        "date": "04252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "FCC chairman expected to unveil strategy to reverse net neutrality -sources "
    },
    {
        "content": "Verizon Communications Inc  has made an offer for Straight Path Communications Inc   topping an earlier bid from AT&T Inc   in a move that starts a bidding war for a company holding spectrum used in 5G technology  according to a source familiar with the matter.",
        "date": "04252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Verizon's bid challenges AT&T's offer for Straight Path: source "
    },
    {
        "content": "* Straight Path shares up 12.5 pct (Adds analyst comment  adds detail on share price)",
        "date": "04252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 4-Verizon's bid challenges AT&T's offer for Straight Path -source "
    },
    {
        "content": "* Indexes up: Dow 0.89 pct  S&P 0.41 pct  Nasdaq 0.37 pct (Updates to open)",
        "date": "04252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Nasdaq breaches 6 000 mark for first time ever "
    },
    {
        "content": "* Straight Path board determines that an unsolicited offer from a multi-national telecommunications company to acquire Straight Path for $104.64 per share constitutes a “superior proposal”",
        "date": "04252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Straight Path board says offer of $104.64/shr to buy co is “superior proposal” "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission said on Monday it approved Time Warner Inc's sale of a broadcast station in Atlanta to Meredith Corp  a transaction that could help speed Time Warner's planned merger with AT&T Inc.",
        "date": "04182017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. FCC approves Time Warner sale of Atlanta TV station "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission said on Monday it approved Time Warner Inc's  sale of a broadcast station in Atlanta to Meredith Corp   a transaction that could help speed Time Warner's planned merger with AT&T Inc .",
        "date": "04172017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "FCC approves Time Warner sale of Atlanta TV station "
    },
    {
        "content": "WASHINGTON  April 17 The U.S. Federal Communications Commission said on Monday it approved Time Warner Inc's sale of a broadcast station in Atlanta to Meredith Corp  a transaction that could help speed Time Warner's planned merger with AT&T Inc.",
        "date": "04172017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC approves Time Warner sale of Atlanta TV station "
    },
    {
        "content": "Verizon Communications Inc is considering making a buyout offer for Straight Path Communications Inc which would top AT&T Inc's $1.25 billion bid  people familiar with the matter said.",
        "date": "04172017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Verizon considering topping AT&T's bid to buy Straight Path-sources "
    },
    {
        "content": "Verizon Communications Inc  is considering making a buyout offer for Straight Path Communications Inc  which would top AT&T Inc's  $1.25 billion bid  people familiar with the matter said.",
        "date": "04142017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Verizon considering topping AT&T's bid for Straight Path: sources "
    },
    {
        "content": "April 13 Verizon Communications Inc is considering making a buyout offer for Straight Path Communications Inc which would top AT&T Inc's $1.25 billion bid  people familiar with the matter said.",
        "date": "04142017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-Verizon considering topping AT&T's bid for Straight Path -sources "
    },
    {
        "content": "* Former AT&T executive joins Caterpillar's board of directors",
        "date": "04122017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Former AT&T executive Ray Wilkins joins Caterpillar's board "
    },
    {
        "content": "April 13 Straight Path Communications Inc   which agreed to be bought by AT&T Inc for $1.25 billion  said on Thursday it had received a letter from a third party that was considering topping AT&T's offer.",
        "date": "04132017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Straight Path says third party may top AT&T's buyout offer "
    },
    {
        "content": "* Straight Path Communications - upon termination of merger agreement under certain circumstances co to pay at&t termination fee equal to $38 million-sec filing",
        "date": "04132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Straight Path Communications says third party currently evaluating topping AT&T bid "
    },
    {
        "content": "* AT&T Inc -  in relation to successful bid for Spectrum  a refund in amount of $1.4 billion is expected from FCC Source text: (http://bit.ly/2oEn8Iu) Further company coverage:",
        "date": "04132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T expects $1.4 bln refund from FCC  in relation to bid for spectrum "
    },
    {
        "content": "* Says has blocked its billionth unwanted robocall using a new program that detects violators through network data analysis Source text for Eikon: Further company coverage:",
        "date": "04132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T says has blocked its billionth unwanted robocall "
    },
    {
        "content": "AT&T Inc said on Monday it would buy Straight Path Communications Inc  a holder of licenses to wireless spectrum  for $1.25 billion in an all-stock deal as it aims to accumulate the airwaves it needs for a next generation network.",
        "date": "04102017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T bets on 5G with Straight Path Communications buy for $1.25 bln "
    },
    {
        "content": "* Indexes up: Dow 0.01 pct  S&P 0.1 pct  Nasdaq 0.1 pct (Updates to close)",
        "date": "04102017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St ends choppy session up slightly; energy helps "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.3 pct  Nasdaq 0.3 pct (Updates to late afternoon)",
        "date": "04102017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St edges higher late; helped by energy "
    },
    {
        "content": "WASHINGTON  April 7 Advocates of landmark net neutrality rules on Friday blasted Federal Communications Commission chairman Ajit Pai's plans to roll back the Obama era legal framework.",
        "date": "04072017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. net neutrality advocates blast Pai effort to reverse rules "
    },
    {
        "content": "AT&T Inc  said on Monday it would buy Straight Path Communications Inc   a holder of licenses to wireless spectrum  for $1.25 billion in an all-stock deal as it aims to accumulate the airwaves it needs for a next generation network. | Video ",
        "date": "04102017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T bets on 5G with Straight Path Communications buy for $1.25 billion "
    },
    {
        "content": "April 10 AT&T Inc said on Monday it would buy Straight Path Communications Inc  a holder of licenses to wireless spectrum  for $1.25 billion in an all-stock deal as it aims to accumulate the airwaves it needs for a next generation network.",
        "date": "04102017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T bets on 5G with Straight Path Communications buy for $1.25 bln "
    },
    {
        "content": "* Indexes down: Dow 0.16 pct  S&P 0.13 pct  Nasdaq 0.14 pct (Updates to early afternoon)",
        "date": "04102017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St in the red as banks slip ahead of earnings "
    },
    {
        "content": "* Indexes up: Dow 0.41 pct  S&P 0.37 pct  Nasdaq 0.38 pct (Adds details  comments  updates prices)",
        "date": "04102017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St gets a lift from higher oil; bank earnings eyed "
    },
    {
        "content": "* AT&T will acquire 735 mmwave licenses in 39 ghz band and 133 licenses in 28 ghz band Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "REFILE-BRIEF-AT&T to acquire Straight Path "
    },
    {
        "content": "April 10 U.S. wireless carrier AT&T Inc said on Monday it would buy Straight Path Communications Inc   a holder of licenses to wireless spectrum  for $1.25 billion.",
        "date": "04102017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to buy Straight Path Communications for $1.25 bln "
    },
    {
        "content": "* Asx alert-purchase order received from CNM - AT&T wireless distributor-CIO.AX",
        "date": "04042017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Connected Io Ltd says received purchase order from AT&T wireless distributor "
    },
    {
        "content": "* AT&T Inc says created a new global public sector organization and named AT&T executive Kay Kapoor to lead it",
        "date": "04032017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T Inc says created a new global public sector organization "
    },
    {
        "content": "* Says beginning April 6  co to include HBO as part of AT&T Unlimited Plus wireless plan; new and existing customers on plan to get HBO included",
        "date": "04052017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T says starting April 6  co to include HBO as part of AT&T Unlimited Plus wireless plan "
    },
    {
        "content": "April 5 AT&T Inc said on Wednesday customers of its unlimited mobile data plan would get Time Warner Inc's HBO  home to hit shows such as \"Game of Thrones\" and \"Veep\"  as part of the service at no additional cost.",
        "date": "04052017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T adds HBO to unlimited wireless plan for free "
    },
    {
        "content": "* Sets quarterly dividend of $0.49per share Source text for Eikon: Further company coverage:",
        "date": "03312017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T sets quarterly dividend of $0.49per share "
    },
    {
        "content": "* Selected by at&t as a core team member for u.s. Firstnet network Source text for Eikon: Further company coverage: (Reporting By London Bureau)",
        "date": "03312017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Inmarsat selected by AT&T as team member for Firstnet network "
    },
    {
        "content": "March 28 The vote by the U.S. Congress to repeal rules that limit how internet service providers can use customer data has generated renewed interest in an old internet technology: virtual private networks  or VPNs.",
        "date": "03292017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "RPT-UPDATE 1-Vote to repeal U.S. broadband privacy rules sparks interest in VPNs "
    },
    {
        "content": "March 28 The decision by the U.S. Congress to repeal rules that limit how internet service providers can use customer data has generated renewed interest in an old internet technology: virtual private networks  or VPNs.",
        "date": "03292017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Vote to repeal U.S. broadband privacy rules sparks interest in VPNs "
    },
    {
        "content": "The United States on Thursday awarded a contract to AT&T Inc to build a nationwide wireless broadband network to better equip first responders  years after a federal commission recommended setting up such a system following the 9/11 attacks.",
        "date": "03302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. awards AT&T contract to build wireless network for first responders "
    },
    {
        "content": "March 28 The vote by the U.S. Congress to repeal rules that limit how internet service providers can use customer data has generated renewed interest in an old internet technology: virtual private networks  or VPNs.",
        "date": "03292017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Vote to repeal U.S. broadband privacy rules sparks interest in VPNs "
    },
    {
        "content": "* Selected by FirstNet to build and manage America's first nationwide public safety broadband network dedicated to first responders",
        "date": "03302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-FirstNet selects AT&T to build emergency broadband network "
    },
    {
        "content": "March 30 The United States on Thursday awarded a contract to AT&T Inc to build a nationwide wireless broadband network to better equip first responders  years after a federal commission recommended setting up such a system following the 9/11 attacks.",
        "date": "03302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-U.S. awards AT&T contract to build wireless network for first responders "
    },
    {
        "content": "March 30 The U.S. Department of Commerce on Thursday awarded a 25-year contract to AT&T Inc for the construction of a nationwide wireless broadband network to better equip first responders during emergencies.",
        "date": "03302017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. awards AT&T contract to build emergency broadband network "
    },
    {
        "content": "NEW YORK  March 27 Comcast Corp is planning to rebrand and expand a streaming video option for broadband subscribers who do not want to pay for a traditional cable package  sources told Reuters on Monday.",
        "date": "03282017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "CORRECTED-Comcast to expand streaming service amid cord-cutting trend "
    },
    {
        "content": "* Files for floating rate global notes offering of up to $800 million  due 2020  Source text: (http://bit.ly/2nZIobw) Further company coverage:",
        "date": "03272017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T files for floating rate global notes offering of up to $800 mln  due 2020 "
    },
    {
        "content": "March 23 AT&T Inc said 17 000 workers in California and Nevada resumed work on Thursday  after going on a strike on Wednesday.",
        "date": "03232017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Striking AT&T workers in California  Nevada return to work "
    },
    {
        "content": "* AT&T removes ads from Google's non-search platforms - AT&T spokesperson      Further company coverage:",
        "date": "03222017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T removes ads from Google's non-search platforms - AT&T spokesperson "
    },
    {
        "content": "U.S. wireless carriers Verizon Communications Inc  and AT&T Inc  said on Wednesday they have suspended digital advertising on Google's YouTube and other advertising platforms not related to search over concerns that their ads may have run next to extremist videos.",
        "date": "03232017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Verizon  AT&T suspend ads from Google over offensive videos "
    },
    {
        "content": "March 22 About 17 000 AT&T Inc workers in California and Nevada went on strike on Wednesday  alleging that the company violated contract terms by forcing employees to do work outside their areas of expertise.",
        "date": "03222017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "About 17 000 AT&T workers in California and Nevada go on strike "
    },
    {
        "content": "BRUSSELS  March 15 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03152017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "EU mergers and takeovers (March 15) "
    },
    {
        "content": "BRUSSELS  March 14 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03142017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "EU mergers and takeovers (March 14) "
    },
    {
        "content": "March 15 The following bids  mergers  acquisitions and disposals were reported by 2030 GMT on Wednesday:",
        "date": "03152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "AT&T Inc has won approval from the European Commission for its planned $85.4 billion acquisition of Time Warner Inc  the No. 2 U.S. wireless carrier said on Wednesday.",
        "date": "03152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T's $85.4 billion deal for Time Warner wins EU thumbs-up "
    },
    {
        "content": "* As part of deal  Wahlberg will appear in a series of TV and digital ads",
        "date": "03132017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-At&T signs exclusive deal with Mark Wahlberg "
    },
    {
        "content": "March 15 AT&T Inc has won approval from the European Commission for its planned $85.4 billion acquisition of Time Warner Inc  the No. 2 U.S. wireless carrier said on Wednesday.",
        "date": "03152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T's $85.4 bln deal for Time Warner wins EU thumbs-up "
    },
    {
        "content": "* Akamai - under agreement  AT&T will continue to offer Akamai's full product suite as part of its broader portfolio of business solutions",
        "date": "03132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Akamai Technologies and AT&T renew global alliance through 2019 "
    },
    {
        "content": "March 15 AT&T Inc has won approval from the European Commission for its planned $85.4 billion acquisition of Time Warner Inc  the No. 2 U.S. wireless carrier said on Wednesday.",
        "date": "03152017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T's $85.4 bln deal for Time Warner wins EU thumbs-up "
    },
    {
        "content": "* AT&T Inc - starting friday  AT&T GoPhone customers can get unlimited data for $60 a month after they sign up for autopay  Source text for Eikon: Further company coverage:",
        "date": "03102017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T Inc says starting friday  AT&T GoPhone customers can get unlimited data for $60 a month after they sign up for autopay "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission said on Thursday it will investigate why AT&T wireless subscribers in several states could not make emergency 911 calls late Wednesday.",
        "date": "03092017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. FCC probes why AT&T customers could not call 911 "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission said on Thursday it will investigate why AT&T wireless subscribers in several states could not make emergency 911 calls late Wednesday.",
        "date": "03092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "FCC probes why AT&T customers could not call 911 "
    },
    {
        "content": "WASHINGTON  March 9 The U.S. Federal Communications Commission said on Thursday it will investigate why AT&T wireless subscribers in several states could not make emergency 911 calls late Wednesday.",
        "date": "03092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-U.S. FCC probes why AT&T customers could not call 911 "
    },
    {
        "content": "March 8 Some customers of U.S. wireless carrier AT&T were unable to use their cell phones to dial 911 emergency dispatchers in their area for a time on Wednesday  a problem the company later said has been resolved.",
        "date": "03092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-Emergency-911 service restored for AT&T mobile customers in US - company "
    },
    {
        "content": "* AT&T  CWA reach tentative agreement in Southwest wireline contract negotiations",
        "date": "03032017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T  CWA reach tentative agreement in Southwest wireline contract negotiations "
    },
    {
        "content": "The second biggest U.S. wireless carrier AT&T said its mobile phone service to 911 emergency dispatchers was restored on Wednesday evening after what public safety agencies called a nationwide outage affecting the company's cell phone customers.",
        "date": "03092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Emergency-911 service restored for AT&T mobile customers in U.S.: company "
    },
    {
        "content": "March 8 U.S. mobile phone customers of AT&T  were unable to dial the 911 emergency number on Wednesday evening  according to alerts from public safety agencies from Texas to Washington  D.C.",
        "date": "03092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. mobile phone clients of AT&T unable to dial 911 -agencies "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 02 (Fitch) Fitch Ratings has assigned an 'A-' rating to AT&T  Inc.'s (AT&T; NYSE: T) $1.43 billion 5.5% senior unsecured note offering due  2047. AT&T's Long-Term Issuer Default Rating (IDR) is 'A-'. The company's IDR  and debt securities remain on Rating Watch Negative  where they were placed in  October 2016 upon the announcement of the acquisition of Time Warner Inc. Time  Warner has a Long-Term IDR of 'BBB+'. Proceeds",
        "date": "03022017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Fitch Rates AT&T's Sr. Unsecured Formosa Note Offering 'A-'; Remains on Negative Watch "
    },
    {
        "content": "NEW YORK  March 1 U.S. regulators on Wednesday blocked some Obama administration rules on the eve of implementation  regulations that would have subjected broadband providers to stricter scrutiny than web sites face to protect customers' private data.",
        "date": "03012017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-U.S. FCC blocks stricter broadband privacy rules from taking effect "
    },
    {
        "content": "NEW YORK The U.S. Federal Communications Commission on Wednesday blocked some Obama administration rules approved last year that would have subjected broadband providers to stricter scrutiny than websites  a victory for internet providers such as AT&T Inc  Comcast Corp and Verizon Communications Inc .",
        "date": "03012017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-U.S. FCC blocks stricter broadband privacy rules from taking effect "
    },
    {
        "content": "* AT&T Inc -  AT&T and members of Bridge Alliance have formed a long-term agreement to extend their global connected car leadership to new territories  Source text for Eikon:  Further company coverage:",
        "date": "02282017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T  Bridge Alliance members form agreement to extend global connected car leadership to new territories "
    },
    {
        "content": "NEW YORK  March 1 The U.S. Federal Communications Commission on Wednesday blocked some Obama administration rules approved last year that would have subjected broadband providers to stricter scrutiny than websites  a victory for internet providers such as AT&T Inc   Comcast Corp and Verizon Communications Inc  .",
        "date": "03012017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC blocks stricter broadband privacy rules from taking effect "
    },
    {
        "content": "WASHINGTON  Feb 23 Time Warner Inc said on Thursday it plans to sell a broadcast station in Atlanta to Meredith Corp  which could help speed the company's planned merger with AT&T Inc.",
        "date": "02232017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Time Warner to sell TV station as it seeks AT&T merger OK "
    },
    {
        "content": "WASHINGTON  Feb 27 The head of the U.S. Federal Communications Commission does not expect to review AT&T Inc's  planned $85.4 billion acquisition of Time Warner Inc   a spokesman for the agency said on Monday.",
        "date": "02272017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "No AT&T-Time Warner merger review expected -U.S. regulator's chairman "
    },
    {
        "content": "WASHINGTON  Feb 23 Time Warner Inc said on Thursday it plans to sell a broadcast station in Atlanta to Meredith Corp for $70 million  which could help speed the company's planned merger with AT&T Inc.",
        "date": "02232017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Time Warner to sell TV station as it seeks AT&T merger OK "
    },
    {
        "content": "WASHINGTON The head of the U.S. Federal Communications Commission does not expect to review AT&T Inc's  planned $85.4 billion acquisition of Time Warner Inc   a spokesman for the agency said on Monday.",
        "date": "02272017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "No AT&T-Time Warner merger review expected: U.S. regulator's chairman "
    },
    {
        "content": "* Nokia says co and AT&T recently completed fixed wireless 5G tests with AT&T's internet TV streaming service  DIRECTV NOW  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Nokia and AT&T recently completed fixed wireless 5G tests with AT&T's internet TV streaming service "
    },
    {
        "content": "* FCC chairman says doesn't expect agency to review AT&T-Time Warner - WSJ  Source text - http://on.wsj.com/2lYrkBq Further company coverage:   (Bengaluru Newsroom)",
        "date": "02272017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-FCC chairman says doesn't expect agency to review AT&T-Time Warner - WSJ "
    },
    {
        "content": "* Voted to adopt merger agreement between AT&T Inc and co with 78 pct of outstanding shares of common stock voting in favor",
        "date": "02152017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Time Warner shareholders approve merger with AT&T "
    },
    {
        "content": "* AT&T  CWA reach tentative agreement covering former DirecTV employees in four states",
        "date": "02172017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T  CWA reach tentative agreement covering former DirecTV employees in four states "
    },
    {
        "content": "NEW YORK  Feb 16 AT&T Inc said on Thursday it would make its unlimited data plan available to all wireless customers who pay a monthly bill  days after rival Verizon Communications Inc announced an unlimited option.",
        "date": "02162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T expands access to unlimited plan after Verizon launch "
    },
    {
        "content": "* Starting Feb 17  AT&T will launch a new AT&T Unlimited Plan",
        "date": "02162017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T says will launch a new Unlimited Plan starting Feb 17 "
    },
    {
        "content": "Feb 8 Time Warner Inc  which is in the process of being bought by AT&T Inc  reported an 11.47 rise in quarterly revenue  helped by the success of the \"Harry Potter\" spinoff \"Fantastic Beasts and Where To Find Them.\"",
        "date": "02082017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "CORRECTED-Time Warner reports 11.47 pct rise in revenue "
    },
    {
        "content": "* Starz launches on AT&T streaming service DirecTV Now  Source text for Eikon:  Further company coverage:",
        "date": "02072017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Starz launches on AT&T streaming service DirecTV Now "
    },
    {
        "content": "WASHINGTON  Feb 3 The U.S. Federal Communications Commission said on Friday it was closing inquiries into sponsored data programs and TV services offered by AT&T Inc  Verizon Communications Inc  Comcast Corp   T-Mobile USA Inc undertaken during the Obama administration without taking any action.",
        "date": "02032017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. FCC closes 'sponsored data' inquiries "
    },
    {
        "content": "NEW YORK  Feb 3 (IFR) - Apple  AT&T and Microsoft flooded the US investment-grade bond market with $37 billion of debt this week and seized on a strong bid for long paper by issuing bonds with maturities out to 40 years.",
        "date": "02032017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Investors cheer long bonds from tech giants "
    },
    {
        "content": "* at&t inc - files for six-part global notes offering of up to $10 billion - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "02022017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T Inc - files for notes offering of up to $10 bln - SEC filing "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 31 (Fitch) Fitch Ratings has assigned an 'A-' rating to AT&T  Inc.'s (AT&T; NYSE: T) senior unsecured note offering. AT&T's Long-Term Issuer  Default Rating (IDR) is 'A-'. The company's IDR and debt securities remain on  Rating Watch Negative  where they were placed in October 2016 upon the  announcement of the acquisition of Time Warner Inc. Time Warner has a Long-Term  IDR of 'BBB+'. Proceeds from the offering are exp",
        "date": "01312017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Fitch Rates AT&T's Sr. Unsecured Note Offering 'A-'; Remains on Rating Watch Negative "
    },
    {
        "content": "NEW YORK - Big deals from AT&T and Microsoft this week helped push January's high-grade bond volumes to historic levels.",
        "date": "01312017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Issuers swarm US corporate bond market despite Trump uncertainty "
    },
    {
        "content": "* Fed begins two-day meeting     * Corporate supply weighs on long-dated debt     * Heavy data week anticipated      By Karen Brettell     NEW YORK  Jan 31 Most U.S. Treasury prices were steady on Tuesday as the Federal Reserve began its two-day meeting and investors awaited a barrage of data due later in the week  while new corporate debt supply weighed on long-dated bonds.     The U.S. Federal Reserve is expected to keep interest rates unchanged when it concludes its meeting on Wed",
        "date": "01312017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "TREASURIES-Bonds steady before Fed  corporate supply weighs on long-end "
    },
    {
        "content": "* At&T Inc - is in advanced discussions with power companies and others to trial project airgig in at least two locations by this fall  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-At&T says in talks with companies to trial project AirGig "
    },
    {
        "content": "* AT&T  CWA reach tentative agreement covering former DIRECTV employees in seven states",
        "date": "01302017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T  CWA reach tentative agreement covering former DIRECTV employees in seven states "
    },
    {
        "content": "A former president of content and advertising sales for AT&T Inc filed a lawsuit on Tuesday claiming he was unlawfully fired for sending racially-charged text messages because the company needed a \"scapegoat\" to deflect claims of widespread race bias ahead of its merger with DirecTV.",
        "date": "01242017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Former AT&T executive says he was scapegoated in race bias row "
    },
    {
        "content": "AT&T Inc   the No. 2 U.S. wireless carrier  reported quarterly results that matched analysts' estimates  as it added more smartphone customers in a saturated wireless market  and said it was confident its deal to buy Time Warner Inc  would be approved.",
        "date": "01252017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T's results match Street expectations  smartphone subscriber base grows "
    },
    {
        "content": "Jan 25 AT&T Inc  the No. 2 U.S. wireless carrier  reported quarterly results that matched analysts' estimates  as it added more smartphone customers in a saturated wireless market  and said it was confident its deal to buy Time Warner Inc would be approved.",
        "date": "01252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T's results match Street expectations  smartphone subscriber base grows "
    },
    {
        "content": "* AT&T CFO says going to be careful with DirecTV Now expectations - conf call",
        "date": "01252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T CFO says \"confident\" that Time Warner deal will be approved "
    },
    {
        "content": "* AT&T reports fourth-quarter and full-year results; AT&T meets full-year guidance with strong customer growth",
        "date": "01252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T reports Q4 earnings per share $0.39 "
    },
    {
        "content": "Jan 25 AT&T Inc  which has agreed to buy Time Warner Inc  reported a marginal fall in quarterly operating revenue on Wednesday amid intensified competition in a saturated U.S. wireless market.",
        "date": "01252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T reports marginal fall in quarterly revenue "
    },
    {
        "content": "WASHINGTON  Jan 25 Thirteen Democratic senators on Wednesday asked AT&T Inc to explain how its planned $85.4 billion takeover of Time Warner Inc is in the public interest  as the company hopes to avoid a review of the deal by the primary U.S. telecommunications agency.",
        "date": "01252017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Democratic senators want AT&T to detail Time Warner deal benefits "
    },
    {
        "content": "AT&T Inc  said it added more than 200 000 paying subscribers to DirecTV Now in what industry observers called a strong launch of the streaming television service introduced in November.",
        "date": "01202017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T shares buoyed by DirecTV Now subscriber numbers "
    },
    {
        "content": "Jan 20 AT&T Inc said it added more than 200 000 paying subscribers to DirecTV Now in what industry observers called a strong launch of the streaming television service introduced in November.",
        "date": "01202017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T shares buoyed by DirecTV Now subscriber numbers "
    },
    {
        "content": "WASHINGTON Outgoing U.S. Federal Communications Commission Chairman Tom Wheeler warned Republicans against dismantling the Obama administration's landmark \"net neutrality\" protections that bar internet service providers from slowing consumer access to web content.",
        "date": "01202017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Outgoing FCC chair warns against overturning net neutrality "
    },
    {
        "content": "* AT&T Inc -for quarter ended dec 31  2016  expect to record noncash  pre-tax loss of approximately $1.0 billion",
        "date": "01202017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T says to record $1 bln pre-tax loss in Q4 "
    },
    {
        "content": "Jan 20 AT&T Inc  the largest U.S. pay TV operator and No.2 U.S. wireless carrier  said it will record a pre-tax loss of about $1 billion in the fourth quarter ended Dec. 31.",
        "date": "01202017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T says to record $1 bln pre-tax loss in Q4 "
    },
    {
        "content": "WASHINGTON U.S. President-elect Donald Trump's meeting with AT&T Inc's  chief executive this week focused on job creation and government regulations  not the company's planned merger with Time Warner Inc   Trump spokesman Sean Spicer told reporters on Friday.",
        "date": "01132017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Trump  AT&T CEO discussed jobs  not Time Warner deal: Trump spokesman "
    },
    {
        "content": "WASHINGTON  Jan 13 U.S. President-elect Donald Trump's meeting with AT&T Inc's chief executive this week focused on job creation and government regulations  not the company's planned merger with Time Warner Inc  Trump spokesman Sean Spicer told reporters on Friday.",
        "date": "01132017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Trump  AT&T CEO discussed jobs  not Time Warner deal -Trump spokesman "
    },
    {
        "content": "* Former AT&T executive  Kent Mathy  joins sequential technology international as chief executive officer  Source text for Eikon:  Further company coverage:",
        "date": "01122017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Former AT&T executive  Kent Mathy  joins sequential technology international as chief executive officer "
    },
    {
        "content": "SAN FRANCISCO  Jan 12 Straight Path Communications Inc said on Thursday it would pay $15 million to settle a federal probe of claims that the wireless spectrum owner had submitted false data to renew airwave licenses  sparking a 30 percent rally in its stock.",
        "date": "01122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-Straight Path settles U.S. license investigation  shares jump "
    },
    {
        "content": "NEW YORK AT&T Inc  Chief Executive Randall Stephenson on Thursday met in New York with U.S. President-elect Donald Trump  an opponent of  the company's acquisition of Time Warner Inc .",
        "date": "01122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T chief executive  Trump meet amid planned Time Warner merger "
    },
    {
        "content": "NEW YORK  Jan 12 AT&T Inc Chief Executive Randall Stephenson on Thursday met in New York with U.S. President-elect Donald Trump  an opponent of  the company's acquisition of Time Warner Inc.",
        "date": "01122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T chief executive  Trump meet amid planned Time Warner merger "
    },
    {
        "content": "* AT&T says its CEO had a \"very good meeting\" with trump today  but pending Time Warner merger \"was not a topic of discussion\"- CNBC",
        "date": "01122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T says pending Time Warner merger \"was not a topic of discussion\" with Trump today- CNBC "
    },
    {
        "content": "TEL AVIV  Jan 9 The venture arms of Microsoft  and Qualcomm have invested in Team8  an Israeli creator of cybersecurity start-ups  as big multinational companies get behind Israel's burgeoning cyber industry in the face of growing threats.",
        "date": "01092017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Microsoft  Qualcomm back Israel's Team8 cybersecurity firm "
    },
    {
        "content": "U.S. President-elect Donald Trump held meetings in New York on Thursday as he prepared to take over the White House from President Barack Obama on Jan. 20.",
        "date": "01122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Factbox: Trump meets with AT&T CEO  others "
    },
    {
        "content": "NEW YORK  Jan 12 AT&T chief executive Randall Stephenson on Thursday visited Trump Tower in New York for talks over the company's planned merger with Time Warner Inc  according to a source  a deal which has been criticized by President-elect Donald Trump.",
        "date": "01122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T chief executive at Trump Tower to discuss Time Warner merger: source "
    },
    {
        "content": "SAN FRANCISCO  Jan 12 Straight Path Communications Inc  a holder of licenses to wireless spectrum  said it has settled with the U.S. Federal Communications Commission  resolving an investigation into the company.",
        "date": "01122017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Straight Path settles with FCC over licenses "
    },
    {
        "content": "Donald Trump remains opposed to AT&T Inc's  planned $85.4 billion acquisition of Time Warner Inc   Bloomberg reported  citing people close to the president-elect.",
        "date": "01052017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Trump remains opposed to AT&T-Time Warner deal: Bloomberg "
    },
    {
        "content": "Jan 6 The following bids  mergers  acquisitions and disposals were reported by 2120 GMT on Friday:",
        "date": "01062017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "AT&T Inc said it plans to test its high-speed wireless 5G network  which reached speeds of 14 gigabits per second in lab trials  for customers of its online streaming television service  DirecTv Now  in Austin  Texas.",
        "date": "01042017",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T to conduct 5G network trials for DirecTv Now customers "
    },
    {
        "content": "WASHINGTON  Jan 6 AT&T Inc expects to be able to bypass a powerful telecommunications regulator in its planned $85.4 billion acquisition of Time Warner Inc  the companies said in  regulatory filings on Friday.",
        "date": "01062017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T says Time Warner purchase could avoid FCC scrutiny "
    },
    {
        "content": "WASHINGTON AT&T Inc expects to be able to bypass a powerful telecommunications regulator in its planned $85.4 billion acquisition of Time Warner Inc   the companies said in  regulatory filings on Friday.",
        "date": "01062017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T says Time Warner purchase could avoid FCC scrutiny "
    },
    {
        "content": "WASHINGTON  Jan 6 AT&T Inc said on Friday it expects to bypass a powerful telecommunications regulator in its planned $85.4 billion acquisition of Time Warner Inc.",
        "date": "01062017",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T does not expect to seek FCC approval to buy Time Warner "
    },
    {
        "content": "WASHINGTON AT&T Inc's  planned $85.4 billion acquisition of Time Warner Inc  will increase innovation and bring \"better-priced options\" to consumers upset by high cable bills  AT&T Chief Executive Randall Stephenson told lawmakers on Wednesday. | Video ",
        "date": "12072016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T touts Time Warner merger at U.S. Senate hearing "
    },
    {
        "content": "NEW YORK AT&T Inc's new streaming television service  DirectTV Now  has so far exceeded expectations  AT&T's CEO Randall Stephenson told investors on Tuesday.",
        "date": "12062016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "DirecTV Now streaming television exceeding expectations: AT&T CEO "
    },
    {
        "content": "MEXICO CITY/NEW YORK AT&T Inc Vice Chairman Ralph de la Vega  who played a critical role in bringing the iPhone to the U.S. market  will retire on Dec. 31  a spokesman for the wireless carrier said on Thursday.",
        "date": "12082016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T says vice chairman de la Vega to retire "
    },
    {
        "content": "WASHINGTON Billionaire investor Mark Cuban will be among the witnesses  scheduled to testify at a U.S. Senate Judiciary panel hearing on Dec. 7 on AT&T Inc's  proposed $85.4 billion acquisition of Time Warner Inc .",
        "date": "12022016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Investor Cuban to testify at Senate hearing on AT&T-Time Warner deal "
    },
    {
        "content": "NEW YORK  Nov 28 AT&T Inc  the largest U.S. TV provider  took the wraps off its new DirecTV Now streaming service on Monday  making a foray into the new and crowded online video service market and hoping to win subscribers who shun pay-television subscriptions.",
        "date": "11282016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T unveils DirecTV Now streaming service ahead of Nov 30 launch "
    },
    {
        "content": "* AT&T Inc says on Nov 30  AT&T begins offering 3 video streaming services - DIRECTV NOW  FreeVIEW and Fullscreen",
        "date": "11282016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T begins offering 3 video streaming services "
    },
    {
        "content": "* at&t inc -integrating at&t netbond with aws direct connect bundle to offer highly secure access to infor and pegasystems  Source text for Eikon:  Further company coverage:",
        "date": "11292016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T expands service offerings on Amazon web services "
    },
    {
        "content": "NEW YORK AT&T Inc  the largest U.S. TV provider  unveiled on Monday the pricing and launch date for DirecTV Now  which will stream television programming through the internet to win customers who shun traditional cable and satellite TV subscriptions.",
        "date": "11292016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T unveils DirecTV Now streaming service ahead of November 30 launch "
    },
    {
        "content": "NEW YORK  Nov 28 AT&T Inc  the largest U.S. TV provider  unveiled on Monday the pricing and launch date for DirecTV Now  which will stream television programming through the internet to win customers who shun traditional cable and satellite TV subscriptions.",
        "date": "11292016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T unveils DirecTV Now streaming service ahead of Nov. 30 launch "
    },
    {
        "content": "* AT&T Inc - INVIDI will continue operating independently under three companies' collective ownership",
        "date": "11212016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T  DISH and WPP to acquire INVIDI  operate it together "
    },
    {
        "content": "NEW YORK AT&T Inc's DirecTV mobile video services that do not carry data charges for video streaming do not violate net neutrality rules  as any other online video provider can pay the wireless company to offer similar services on equal terms  the telecommunications company told the U.S. Federal Communications Commission in a letter on Monday.",
        "date": "11212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "DirecTV mobile streaming services in line with regulations  AT&T tells FCC "
    },
    {
        "content": "Otter Media  the joint venture between AT&T Inc and The Chernin Group  has partnered with Reese Witherspoon to form a new multimedia company  Hello Sunshine  aimed at telling female-driven stories.",
        "date": "11212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Reese Witherspoon  AT&T venture  form media company aimed at women "
    },
    {
        "content": "NEW YORK  Nov 21 AT&T Inc's DirecTV mobile video services that do not carry data charges for video streaming do not violate net neutrality rules  as any other online video provider can pay the wireless company to offer similar services on equal terms  the telecommunications company told the U.S. Federal Communications Commission in a letter on Monday.",
        "date": "11212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-DirecTV mobile streaming services in line with regulations  AT&T tells FCC "
    },
    {
        "content": "Nov 21 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "11212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* At&T Inc - Fox Networks Group and At&T expand multi-platform distribution agreement including Directv NOW",
        "date": "11212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Fox Networks Group and At&T expand multi-platform distribution agreement including Directv NOW "
    },
    {
        "content": "Nov 21 AT&T has signed a deal with Fox Networks Group to continue showing its networks across its offerings including its online video service  DirectTV Now  the two companies announced on Monday.",
        "date": "11212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T signs on Fox for DirectTV Now "
    },
    {
        "content": "Nov 21 Otter Media  the joint venture between AT&T Inc and The Chernin Group  has partnered with Reese Witherspoon to form a new multimedia company  Hello Sunshine  aimed at telling female-driven stories.",
        "date": "11212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "CORRECTED-Reese Witherspoon  AT&T venture  form media company aimed at women "
    },
    {
        "content": "* AT&T Inc - on November 15  2016 co entered into a $10 billion term loan credit agreement - sec filing",
        "date": "11152016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T Inc entered into $10 bln term loan credit agreement on Nov.15 "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission told AT&T Inc  it has \"serious concerns\" about whether rivals will be able to compete with its DirecTV Now online video service that will cost $35 a month and demanded answers by Nov. 21.",
        "date": "11102016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. FCC says it has 'serious concerns' about AT&T Direct TV mobile video service "
    },
    {
        "content": "WASHINGTON  Nov 10 The U.S. Federal Communications Commission told AT&T Inc it has \"serious concerns\" about whether rivals will be able to compete with its DirecTV Now online video service that will cost $35 a month and demanded answers by Nov. 21.",
        "date": "11102016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-U.S. FCC says it has 'serious concerns' about AT&T Direct TV mobile video service "
    },
    {
        "content": "WASHINGTON/NEW YORK U.S. corporate dealmakers were likely to put major merger plans on hold as they assess whether U.S. President-elect Donald Trump will follow through on his populist promises and a threat to block AT&T Inc's  purchase of Time Warner Inc   or act more like traditional business-friendly Republican administrations.",
        "date": "11092016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Trump victory clouds outlook for Time Warner-AT&T  other mergers "
    },
    {
        "content": "PARIS Altice   the fourth-biggest cable operator in the United States  sees more deals between media and telecoms operators in the country if AT&T Inc's  $85 billion acquisition of Time Warner Inc  eventually goes through under the administration of President-elect Donald Trump.",
        "date": "11102016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Altice sees more U.S. deals if AT&T-Time Warner merger goes through "
    },
    {
        "content": "WASHINGTON/NEW YORK  Nov 9 U.S. corporate dealmakers were likely to put major merger plans on hold as they assess whether President-elect Donald Trump will follow through on his populist promises and a threat to block AT&T Inc's  purchase of Time Warner Inc  or act more like traditional business-friendly Republicans.",
        "date": "11092016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 5-Trump victory clouds outlook for Time Warner-AT&T  other mergers "
    },
    {
        "content": "* Group focused on integration of U.S. businesses   (Recasts story  adds executive quotes  details)",
        "date": "11102016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Altice sees more U.S. deals if AT&T-Time Warner merger goes through "
    },
    {
        "content": "Republican Donald Trump  who defeated heavily favored Democratic rival Hillary Clinton in Tuesday's U.S. presidential election  has said he won't approve AT&T Inc's  $85 billion acquisition of Time Warner Inc  because the deal represented \"too much power in the hands of too few.\"",
        "date": "11092016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Factbox: Trump stand on AT&T/Time Warner not indicative of M&A policy - analysts "
    },
    {
        "content": "Nov 9 AT&T Inc is optimistic about deal to Buy Time Warner Inc",
        "date": "11092016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T is optimistic about deal to buy Time Warner-AT&T CFO "
    },
    {
        "content": "* Suzuken to offer digital monitoring of storage and shipping conditions for pharmaceuticals through cargo-monitoring system from AT&T - Nikkei  Source text (http://s.nikkei.com/2fnwmCp) Further company coverage:",
        "date": "11042016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Suzuken to offer digital monitoring services through cargo-monitoring system from AT&T - Nikkei "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department filed a lawsuit on Wednesday against AT&T's  DirecTV  alleging it acted as a ringleader to illegally swap information with rival pay-TV providers about negotiations over showing Dodgers baseball games in the Los Angeles area.",
        "date": "11022016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. sues DirecTV for illegal information trading during Dodgers talks "
    },
    {
        "content": "WASHINGTON  Nov 2 The U.S. Justice Department filed a lawsuit on Wednesday against AT&T's DirecTV  alleging it acted as a ringleader to illegally swap information with rival pay-TV providers about negotiations over showing Dodgers baseball games in the Los Angeles area.",
        "date": "11022016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 5-U.S. sues DirecTV for illegal information trading during Dodgers talks "
    },
    {
        "content": "* Fox chief executive James Murdoch - Fox does not have a \"heightened appetite\" for M&A after AT&T/Time Warner deal- conf call",
        "date": "11022016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Twenty-first Century Fox says does not have \"heightened appetite\" for M&A after AT&T/Time Warner deal- CEO on conf call "
    },
    {
        "content": "Time Warner Inc   which has agreed to be acquired by telecom company AT&T Inc   on Wednesday raised its full-year outlook and reported quarterly profit topping Wall Street expectations  powered by higher box office and cable network revenues. | Video ",
        "date": "11022016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Time Warner beats expectations  raises outlook "
    },
    {
        "content": "Nov 2 Time Warner Inc  which has agreed to be acquired by telecom company AT&T Inc  on Wednesday raised its full-year outlook and reported quarterly profit topping Wall Street expectations  powered by higher box office and cable network revenues.",
        "date": "11022016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-Time Warner beats expectations  raises outlook "
    },
    {
        "content": "Nov 2 Time Warner Inc  the media company being bought by AT&T Inc  reported a 9.2 percent rise in quarterly revenue on Wednesday  helped by the box office success of the superhero movie \"Suicide Squad\".",
        "date": "11022016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Time Warner revenue jumps 9.2 pct  helped by \"Suicide Squad\" "
    },
    {
        "content": "* Communications workers of America vote to ratify AT&T national internet contract  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Communications workers of America vote to ratify AT&T national internet contract "
    },
    {
        "content": "MEXICO CITY  Oct 28 Mexican telecoms company America Movil said on Friday that offering content is important  and will become \"very important\" in the future  as rival AT&T Inc  bids for U.S. media powerhouse Time Warner Inc.",
        "date": "10282016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 1-America Movil says offering content will become \"very important\" "
    },
    {
        "content": "NEW YORK/WASHINGTON Media companies plan to ask U.S. regulators to force AT&T Inc and Time Warner Inc  to share their trove of customer data if the telecom and content companies merge  fearing the combined behemoth would have an unfair advantage selling targeted mobile advertising  a handful of media executives told Reuters this week.",
        "date": "10262016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Media companies want U.S. to force AT&T-Time Warner to share customer data "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Comcast is schooling AT&T on media M&A. The $155 billion cable giant now gets more than a third of its revenue from NBC Universal  a deal it concluded in early 2013. The regulatory and political climate was more accommodating and Chief Executive Brian Roberts' strategy sound. AT&T's $85 billion bid for Time Warner  by contrast  is a dog's breakfast.",
        "date": "10262016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Comcast schools AT&T on media M&A "
    },
    {
        "content": "BOSTON  Oct 25 Many actively managed U.S. mutual funds were cool toward AT&T Inc even before the telecom giant's planned $85.4 billion acquisition of Time Warner Inc .",
        "date": "10252016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. funds downbeat on AT&T even before Time Warner deal "
    },
    {
        "content": "NEW YORK  Oct 25 AT&T Inc's upcoming DirecTV Now online video service will cost $35 per month  Chief Executive Randall Stephenson said  speaking at the WSJ.D Live conference in California on Tuesday.",
        "date": "10252016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T's DirecTV Now online video service to cost $35 per month "
    },
    {
        "content": "NEW YORK  Oct 25 AT&T Inc's upcoming DirecTV Now online video service will cost $35 per month  including mobile streaming costs  and target viewers who shun pay-television subscriptions  Chief Executive Randall Stephenson said on Tuesday.",
        "date": "10252016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T's DirecTV Now online video service to cost $35 per month "
    },
    {
        "content": "Wall Street signaled skepticism on Monday that AT&T Inc would secure the government approvals needed to carry out its planned $85.4 billion acquisition of Time Warner Inc  with shares of both companies falling as analysts scrutinized the deal. | Video ",
        "date": "10242016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T  Time Warner shares dip with worries about deal clearance "
    },
    {
        "content": "* Sprint Corp CEO Marcelo Claure on AT&T-Time Warner deal says its a bold move by AT&T- CNBC",
        "date": "10252016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Sprint CEO on AT&T-Time Warner deal says its a bold move by AT&T- CNBC "
    },
    {
        "content": "Oct 24 Wall Street signaled skepticism on Monday that AT&T Inc would secure the government approvals needed to carry out its planned $85.4 billion acquisition of Time Warner Inc  with shares of both companies falling as analysts scrutinized the deal.",
        "date": "10242016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 5-AT&T  Time Warner shares dip with worries about deal clearance "
    },
    {
        "content": "* Broadcaster CME co-CEO Michael Del Nin says on conference call: anticipates proposed AT&T acquisition of Time Warner would not have impact on CME",
        "date": "10252016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Broadcaster CME anticipates no impact of AT&T-Time Warner deal "
    },
    {
        "content": "Donald Trump  the Republican Party's candidate in the Nov. 8 U.S. presidential election  said on Saturday he would not approve a proposed deal for AT&T Inc to buy Time Warner Inc if he is elected. | Video ",
        "date": "10222016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Trump says will not approve AT&T-Time Warner deal if elected U.S. president "
    },
    {
        "content": "NEW YORK When Time Warner Inc's  Jeff Bewkes welcomed AT&T Inc's  Randall Stephenson for lunch at Time Warner Center in New York in late August  their meeting was supposed to be one of the catch-ups the two chief executives have had over the years.",
        "date": "10232016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "For AT&T  Time Warner was always on the menu "
    },
    {
        "content": "NEW YORK  Oct 24 AT&T Inc shareholders who have profited for most of 2016 from owning a major telecommunications provider with a strong dividend yield are now tied to a controversial media acquisition that comes with new growth potential but also fresh risks.",
        "date": "10242016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T investors weigh new growth  risks with Time Warner deal "
    },
    {
        "content": "AT&T Inc  reached a deal to buy media company Time Warner Inc  for more than $80 billion  The Wall Street Journal reported on Saturday.",
        "date": "10222016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T reaches deal to buy Time Warner for more than $80 billion: WSJ "
    },
    {
        "content": "Oct 22 AT&T Inc reached a deal to buy media company Time Warner Inc for more than $80 billion  The Wall Street Journal reported on Saturday.",
        "date": "10222016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T reaches deal to buy Time Warner for more than $80 billion -WSJ "
    },
    {
        "content": "U.S. SENATOR BERNIE SANDERS SAYS OBAMA ADMINISTRATION \"SHOULD KILL THE TIME WARNER/AT&T MERGER. THIS DEAL WOULD MEAN HIGHER PRICES AND FEWER CHOICES FOR THE AMERICAN PEOPLE.\" -STATEMENT",
        "date": "10232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. SENATOR BERNIE SANDERS SAYS OBAMA ADMINISTRATION \"SHOULD KILL THE TIME WARNER/AT&T MERGER. THIS DEAL WOULD MEAN HIGHER PRICES AND FEWER CHOICES FOR THE AMERICAN PEOPLE.\" -STATEMENT "
    },
    {
        "content": "* AT&T discussed idea of takeover in Time Warner meetings - Bloomberg  citing sources  Source text - http://bloom.bg/2enGhLw Further company coverage:",
        "date": "10202016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T discussed idea of takeover in Time Warner meetings - Bloomberg "
    },
    {
        "content": "NEW YORK  Oct 23 When Time Warner Inc's  Jeff Bewkes welcomed AT&T Inc's Randall Stephenson for lunch at Time Warner Center in New York in late August  their meeting was supposed to be one of the catch-ups the two chief executives have had over the years.",
        "date": "10232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "DEALTALK-For AT&T  Time Warner was always on the menu "
    },
    {
        "content": "Oct 20 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "10202016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "PRESS DIGEST- Wall Street Journal - Oct 20 "
    },
    {
        "content": "Alphabet Inc's  Google has reached an agreement with CBS Corp  to carry the network on its planned web TV service and is in advanced talks with 21st Century Fox   Walt Disney Co  and Viacom Inc  to distribute their channels  people with knowledge of the talks told Reuters on Wednesday.",
        "date": "10202016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Google signs CBS  in talks with others on web TV: sources "
    },
    {
        "content": "Oct 19 Alphabet Inc's Google has reached an agreement with CBS Corp to carry the network on its planned web TV service and is in advanced talks with 21st Century Fox  Walt Disney Co and Viacom Inc  to distribute their channels  people with knowledge of the talks told Reuters on Wednesday.",
        "date": "10202016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-Google signs CBS  in talks with others on web TV -sources "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 24 (Fitch) Fitch Ratings has placed the 'A-' Long-Term Issuer  Default Ratings (IDRs) and outstanding debt of AT&T Inc. (AT&T) (NYSE: T) and  its subsidiaries on Rating Watch Negative. The company's 'F2' Short-Term IDR and  commercial paper rating are affirmed based on the expectation that a downgrade   if it occurs  will be limited to one notch.  Fitch has affirmed the Long-Term IDRs of Time Warner Inc. and its subsidi",
        "date": "10242016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Fitch Places AT&T's 'A-' IDR on Negative Watch on Proposed Time Warner Inc. Acquisition "
    },
    {
        "content": "Oct 24 AT&T Inc's plan to buy Time Warner Inc for $85.4 billion in the biggest global acquisition of the year will bring the second-largest U.S. bridge loan financing ever to a market hungry for mergers and acquisitions loans.",
        "date": "10242016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "TIMEWARNER-M&A/AT&T-LOANS-Market welcomes AT&T's $40 bln Time Warner loan "
    },
    {
        "content": "WASHINGTON The U.S. Senate subcommittee on antitrust will hold a hearing sometime this year on AT&T Inc's planned acquisition of Time Warner  a spokesman for the subcommittee's chairman  Mike Lee  said on Sunday.",
        "date": "10232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Senate to hold hearing on AT&T acquisition of Time Warner "
    },
    {
        "content": "WASHINGTON An acquisition of Time Warner Inc by AT&T Inc. could raise significant antitrust issues that the U.S. Senate committee on antitrust would carefully examine  the chairman and ranking member of the committee said Sunday.",
        "date": "10232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Senate committee on antitrust to 'carefully examine' AT&T-Time Warner deal "
    },
    {
        "content": "* AT&T nears deal to buy Time Warner Inc for about $110/share - Bloomberg  Source text : http://bloom.bg/2es1rnh Further company coverage:",
        "date": "10212016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T nears deal to buy Time Warner Inc for about $110/share - Bloomberg "
    },
    {
        "content": "Time Warner Inc Chief Executive Jeff Bewkes could walk away with a $32 million payout if the media company completes its $85 billion merger with AT&T Inc.",
        "date": "10242016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Time Warner CEO Bewkes could get $32 million from AT&T merger "
    },
    {
        "content": "WASHINGTON  Oct 23 An acquisition of Time Warner Inc by AT&T Inc. could raise significant antitrust issues that the U.S. Senate committee on antitrust would carefully examine  the chairman and ranking member of the committee said Sunday.",
        "date": "10232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. Senate committee on antitrust to \"carefully examine\" AT&T-Time Warner deal "
    },
    {
        "content": "* Dow down 0.25 pct  S&P down 0.16 pct  Nasdaq up 0.14 pct   (Updates to afternoon)",
        "date": "10212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Health  energy stocks hit Wall St  Microsoft lifts Nasdaq "
    },
    {
        "content": "Oct 21 AT&T Inc is in advanced talks to acquire media conglomerate Time Warner Inc  and a deal could come as early as this weekend  the Wall Street Journal reported. (http://on.wsj.com/2eOTDjH)",
        "date": "10212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T in advanced talks to buy Time Warner - WSJ "
    },
    {
        "content": "* Time Warner Inc ratings placed on creditwatch positive on pending acquisition by AT&T Inc  Source text (http://bit.ly/2f9J3mQ) Further company coverage:",
        "date": "10242016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-S&P places Time Warner Inc's ratings on creditwatch positive on pending acquisition by AT&T "
    },
    {
        "content": "NEW YORK AT&T Inc  said on Saturday it agreed to buy Time Warner Inc  for $85.4 billion  the boldest move yet by a telecommunications company to acquire content to stream over its network to attract a growing number of online viewers.",
        "date": "10232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to pay $85 billion for Time Warner  create telecom-media giant "
    },
    {
        "content": "NEW YORK  Oct 22 AT&T Inc said on Saturday it agreed to buy Time Warner Inc for $85.4 billion  the boldest move yet by a telecommunications company to acquire content to stream over its network to attract a growing number of online viewers.",
        "date": "10232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 6-AT&T to buy Time Warner for $85 bln  create telecom-media giant "
    },
    {
        "content": "* Starting tuesday  AT&T customers can talk  text and use data while in Cuba  Source text for Eikon:  Further company coverage:",
        "date": "10182016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T debuts Cuba roaming "
    },
    {
        "content": "* AT&T is in advanced talks to acquire Time Warner  and a deal could come as early as this weekend - WSJ",
        "date": "10212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T is in advanced talks to acquire Time Warner  and a deal could come as early as this weekend - WSJ "
    },
    {
        "content": "* S&P - AT&T Inc. 'BBB+' ratings placed on creditwatch negative on its agreement to acquire Time Warner Inc.",
        "date": "10242016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-S&P says AT&T's ratings placed on Creditwatch negative "
    },
    {
        "content": "TIME WARNER MUST PAY AT&T AT LEAST $1.7 BLN IF IT FINDS A NEW BUYER  IF REGULATORS BLOCK DEAL  AT&T MUST PAY TIME WARNER $500 MLN - SOURCES",
        "date": "10232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "TIME WARNER MUST PAY AT&T AT LEAST $1.7 BLN IF IT FINDS A NEW BUYER  IF REGULATORS BLOCK DEAL  AT&T MUST PAY TIME WARNER $500 MLN - SOURCES "
    },
    {
        "content": "T-Mobile US Inc  raised its forecast for customer additions for the year and Chief Executive John Legere said AT&T Inc's  proposed plan to buy Time Warner Inc  could help T-Mobile to carve out more market share.",
        "date": "10242016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "T-Mobile raises forecast; sees 'upside' from AT&T-Time Warner deal "
    },
    {
        "content": "SAN FRANCISCO  Oct 10 Apple Inc's stock on Monday jumped 2.3 percent  reaching a high not seen since December  after rival Samsung Electronics Co Ltd  suspended production of its flagship Galaxy Note 7 smartphones following reports of fires in replacement devices.",
        "date": "10102016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Apple stock hits highest since Dec on Samsung Note 7 fire crisis "
    },
    {
        "content": "SAN FRANCISCO  Oct 10 Apple Inc's stock on Monday jumped 2.2 percent  reaching a high not seen since December  after rival Samsung Electronics Co Ltd  suspended production of its flagship Galaxy Note 7 smartphones following reports of fires in replacement devices.",
        "date": "10102016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Apple stock hits highest since Dec on Samsung Note 7 fire crisis "
    },
    {
        "content": "Oct 9 AT&T Inc said on Sunday it will stop exchanging Samsung Electronics' Galaxy Note 7 following reports of fires from the replacement devices.",
        "date": "10092016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T stops Note 7 replacements after reports of fire "
    },
    {
        "content": "* AT&T announces new strategic relationship with Amazon Web Services to integrate cloud and networking capabilities",
        "date": "10062016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T announces new strategic relationship with Amazon Web Services "
    },
    {
        "content": "* AT&T  Communications Workers of America reach tentative agreement in national internet contract negotiations",
        "date": "10042016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T  Communications Workers of America reach tentative agreement in national internet contract negotiations "
    },
    {
        "content": "WASHINGTON  Oct 6 The U.S. Federal Communications Commission will vote on Oct. 27 on a revised proposed regulation setting rules to safeguard the privacy of broadband users.",
        "date": "10062016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC to vote on revised broadband privacy regulations "
    },
    {
        "content": "NEW YORK  Oct 4 AT&T Inc has signed pop star Taylor Swift to an exclusive  multiyear partnership that includes a performance at a party the wireless and pay-TV service provider will host the night before the 2017 Super Bowl  the company said on Tuesday.",
        "date": "10042016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T signs Taylor Swift to multiyear partnership deal "
    },
    {
        "content": "* New collaborations with AT&T  Microsoft to deliver \"enhancements\" to detroit connect suite of connected vehicle services",
        "date": "10042016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Daimler Trucks North America collaborates with AT&T  Microsoft Corp on new connectivity solutions "
    },
    {
        "content": "* Sets quarterly dividend of $0.48 per share  Source text for Eikon:  Further company coverage:",
        "date": "09302016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T sets quarterly dividend of $0.48/share "
    },
    {
        "content": "* Three regional agreements cover about 200 employees in two states in midwest region",
        "date": "09292016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T  CWA reach 3 tentative agreements covering former Directv employees "
    },
    {
        "content": "WASHINGTON  Sept 23 The U.S. Federal Communications Commission said on Friday that AT&T Inc has agreed to pay a $450 000 fine for unauthorized operations of fixed wireless stations and will not engage in repeat behavior  resolving a lengthy government investigation.",
        "date": "09232016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 1-AT&T agrees to pay $450 000 to settle U.S. probe "
    },
    {
        "content": "* Scripps Networks Interactive  AT&T sign long-term multi-platform distribution agreement",
        "date": "09222016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Scripps Networks Interactive  AT&T sign long-term multi-platform distribution agreement "
    },
    {
        "content": "* U.S. General Services Administration has awarded AT&T extensions to 2 Networx contracts",
        "date": "09132016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T lands extensions to its Networx contracts "
    },
    {
        "content": "WASHINGTON  Sept 7 The top U.S. communications regulator plans on Thursday to unveil a revised plan to allow about 100 million pay TV subscribers to replace expensive set-top boxes with less-costly apps that provide access to television and video programs  two people briefed on the plan said.",
        "date": "09072016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC chief to unveil revised plan to eliminate cable boxes "
    },
    {
        "content": "* Qualcomm and AT&T to trial drones on cellular network to accelerate wide-scale deployment",
        "date": "09062016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Qualcomm and AT&T to trial drones on cellular network "
    },
    {
        "content": "* AT&T and HBO reach historic multi-platform programming agreement",
        "date": "08272016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T and HBO reach multi-platform programming agreement "
    },
    {
        "content": "WASHINGTON A federal appeals court in California on Monday dismissed a U.S. government lawsuit that accused AT&T Inc  of deception for reducing internet speeds for customers with unlimited mobile data plans once their use exceeded certain levels.",
        "date": "08302016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. appeals court dismisses AT&T data throttling lawsuit "
    },
    {
        "content": "* Moody's - Moody's affirms AT&T's BAA1 rating; Changes outlook to stable",
        "date": "08292016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Moody's changes AT&T's outlook to stable; Affirms BAA1 rating "
    },
    {
        "content": "WASHINGTON A federal appeals court in California on Monday dismissed a U.S. government lawsuit that accused AT&T Inc of deception for reducing internet speeds for customers with unlimited mobile data plans once their use exceeded certain levels.",
        "date": "08292016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. appeals court dismisses AT&T data throttling lawsuit "
    },
    {
        "content": "WASHINGTON  Aug 29 A federal appeals court in California on Monday dismissed a U.S. government lawsuit that accused AT&T Inc of deception for reducing internet speeds for customers with unlimited mobile data plans once their use exceeded certain levels.",
        "date": "08292016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-U.S. appeals court dismisses AT&T data throttling lawsuit "
    },
    {
        "content": "Aug 22 AT&T Inc  the No.2 U.S. wireless carrier  said it had signed a deal with Cuba's state-owned telecoms provider to offer direct roaming services to its customers visiting Cuba.",
        "date": "08222016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T signs deal to offer roaming services in Cuba "
    },
    {
        "content": "WASHINGTON More than 30 major technology and communication companies said on Friday they are joining the U.S. government to crack down on \"robocalls \" automated  prerecorded phone calls that regulators have labeled a \"scourge.\" | Video ",
        "date": "08202016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T  Apple  Google to work on 'robocall' crackdown "
    },
    {
        "content": "* AT&T and ETECSA sign deal for Cuba roaming and direct connections",
        "date": "08222016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T and ETECSA sign deal for Cuba roaming and direct connections "
    },
    {
        "content": "NEW YORK  Aug 17 AT&T Inc  the No. 2 U.S wireless provider  said on Wednesday that it would roll out a new data plan that does away with overage fees and reduces data speeds for wireless customers who surpass their data allowance.",
        "date": "08172016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T revamps cellular data plans  eliminates overage fees "
    },
    {
        "content": "* \"Is working with several global technology leaders and operators to align on 5G\"  Source text for Eikon:  Further company coverage:",
        "date": "08172016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T says working with \"several global technology leaders\" to align on 5G "
    },
    {
        "content": "WASHINGTON AT&T Inc will pay $7.75 million in refunds and fines after federal investigators found it allowed unauthorized third-party charges related to phony directory-assistance service on its customers' telephone bills  U.S. regulators said on Monday.",
        "date": "08082016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T to pay $7.75 million for allowing sham directory-assistance calls "
    },
    {
        "content": "WASHINGTON  Aug 8 AT&T will pay $7.75 million after a federal investigation found it allowed unauthorized third-party charges on its customers' telephone bills  the U.S. Federal Communications Commission said Monday.",
        "date": "08082016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to pay $7.75 mln for allowing sham directory assistance calls "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 05 (Fitch) Fitch Ratings has assigned an 'A-' rating to AT&T  Inc.'s (AT&T; NYSE: T) senior unsecured exchange notes. AT&T commenced an offer  to exchange up to 21 series of existing senior unsecured notes previously issued  by AT&T and certain operating subsidiaries for new notes and cash.  The first pool of nine series existing notes will be exchanged for up to $2.5  billion principal amount of new notes due 2048  and ",
        "date": "08052016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Fitch Rates AT&T's Exchange Offering 'A-'; Outlook Stable "
    },
    {
        "content": "* AT&T Inc - AT&T Mobility has reached a new tentative agreement with Communications Workers of America in benefits negotiations",
        "date": "08032016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T Inc - AT&T Mobility has reached a new tentative agreement with Communications Workers of America "
    },
    {
        "content": "Aug 5 At&T Inc. Announces Offers To Exchange Twenty",
        "date": "08052016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-At&T Inc. Announces offers to exchange twenty-one series of notes for new notes due 2048 and 2049 and cash  as applicable "
    },
    {
        "content": "* On track to achieve our goal of generating $200 million of operating earnings in this growing segment by end of 2019",
        "date": "08022016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Gamestop acquires 507 AT&T mobility stores "
    },
    {
        "content": "* AT&T Trek\u007f 2 HD Tablet Available Starting August 5th for $0.99 with a Two-Year Agreement  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07292016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-At&T says At&T 2 HD Tablet available starting Aug. 5 "
    },
    {
        "content": "Its name may reflect one of the most common expressions used around the world  but the distinctiveness of Citigroup Inc's \"ThankYou\" customer loyalty program is in jeopardy now that AT&T Inc has launched its own rewards system that looks and sounds too similar  the bank told a Manhattan federal judge on Thursday.",
        "date": "07292016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Citigroup tries to stop AT&T from saying 'thanks' to loyal customers "
    },
    {
        "content": "* Plans to fine at&t $106 425 for overcharging schools in florida  Further company coverage:",
        "date": "07282016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Federal communications commission to fine AT&T $106 425 for overcharging schools "
    },
    {
        "content": "The No. 2 U.S. wireless carrier AT&T Inc  reported adjusted profit in line with estimates on Thursday  as it signed up new wireless subscribers but saw a drop in pay-TV customers.",
        "date": "07212016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T adjusted profit meets estimates  TV subscribers drop "
    },
    {
        "content": "July 21 The No. 2 U.S. wireless carrier AT&T Inc  reported adjusted profit in line with estimates on Thursday  as it signed up new wireless subscribers but saw a drop in pay-TV customers.",
        "date": "07212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T adjusted profit meets estimates  TV subscribers drop "
    },
    {
        "content": "* Qtrly operating income margin 29.8 % versus 29.0 %  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T qtrly operating income margin 29.8 % versus 29.0 % "
    },
    {
        "content": "* AT&T  IBEW reach two tentative agreements covering former DirecTV employees",
        "date": "07192016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-At&T reaches 2 tentative agreements with International Brotherhood Of Electrical Workers "
    },
    {
        "content": "* Qtrly consolidated revenues of $40.5 billion  up more than 22%",
        "date": "07212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T reports Q2 earnings per share of $0.55 "
    },
    {
        "content": "Yahoo Inc's core business secured five bidders in the final round including  Verizon Communications Inc  Quicken Loans Inc founder Dan Gilbert and Vector Capital Management  Bloomberg reported on Tuesday  citing people familiar with the matter.",
        "date": "07192016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Verizon among leading bidders for Yahoo's core business: Bloomberg "
    },
    {
        "content": "July 21 AT&T Inc reported a 22.7 percent increase in quarterly operating revenue as it added more television subscribers  helped by its acquisition of DirecTV.",
        "date": "07212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T revenue jumps 22.7 percent "
    },
    {
        "content": "July 19 Yahoo Inc's core business secured five bidders in the final round including  Verizon Communications Inc  Quicken Loans Inc founder Dan Gilbert and Vector Capital Management  Bloomberg reported on Tuesday  citing people familiar with the matter.",
        "date": "07192016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Verizon among leading bidders for Yahoo's core business-Bbg "
    },
    {
        "content": "SAN FRANCISCO July 21 Former Yahoo executive Dan Rosensweig has not worked at the pioneering internet company in nearly a decade.",
        "date": "07212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "RPT-Silicon Valley's Yahoo diaspora mourns company's decline "
    },
    {
        "content": "* Verizon  Quicken Loans  Vector Capital said among likely winning Yahoo bidders - Bloomberg citing sources",
        "date": "07192016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Verizon  Quicken  Vector said among likely winning Yahoo bidders - BBG "
    },
    {
        "content": "SAN FRANCISCO July 21 Former Yahoo executive Dan Rosensweig has not worked at the pioneering internet company in nearly a decade.",
        "date": "07212016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Silicon Valley's Yahoo diaspora mourns company's decline "
    },
    {
        "content": "A federal appeals court on Monday threw out the cancellation of a patent on customized Web filtering that had been used to sue AT&T Inc for infringement  because the court said it had been wrongly labeled as covering a basic idea rather than something truly inventive.",
        "date": "06282016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Federal Circuit revives Web filtering patent in case against AT&T "
    },
    {
        "content": "* Yang is a founding partner and managing director of venture capital firm Redpoint Ventures  Source text for Eikon:  Further company coverage:",
        "date": "06242016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Geoffrey Yang joins AT&T board of directors "
    },
    {
        "content": "* Says dividend is payable on August 1  2016  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "06242016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T sets quarterly dividend of $0.48/shr "
    },
    {
        "content": "June 17 Satellite TV operator Dish Network Corp  blacked out the National Football League-owned sports channels  NFL Network and NFL RedZone  the first time the league has been dropped by a TV services provider  the NFL said.",
        "date": "06172016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Dish drops NFL Network  NFL RedZone amid fee dispute "
    },
    {
        "content": "San Francisco June 13 Yahoo Inc's  venerable email system could have a better shot at challenging category crusher Gmail if a telecommunications company wins a Yahoo asset auction and presents it to a wider audience.",
        "date": "06132016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Yahoo Mail could get boost if bought by mobile firm "
    },
    {
        "content": "NEW YORK Citigroup Inc  sued AT&T Inc  on Friday  saying the phone company's use of \"thanks\" and \"AT&T thanks\" in a new customer loyalty program infringed its trademark rights to the phrase \"thankyou.\"",
        "date": "06102016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "No thanks: Citigroup sues AT&T for trademark infringement "
    },
    {
        "content": "* AT&T says Citigroup has no monopoly on \"thanks\"   (Adds AT&T statement)",
        "date": "06102016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-No thanks: Citigroup sues AT&T for trademark infringement "
    },
    {
        "content": "NEW YORK  June 10 Citigroup Inc on Friday sued AT&T Inc  saying the phone company infringed its trademarks in the phrase \"thankyou\" by using the terms \"thanks\" and \"AT&T thanks\" in a new customer loyalty program.",
        "date": "06102016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Citigroup sues AT&T for trademark infringement "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_06102016.pdf               FACTORS TO WATCH     3:00 pm: Foreign Investment Promotion Board meets to consider fourteen FDI proposals in New Delhi.     5:00 pm: Power Minister Piyush Goyal at an event in Mumbai.     5:00 pm: RBI to release weekly foreign exchange data in Mumbai.     5:30 pm: Government to release April industrial output data in New Delhi.            GMF: LIVECHAT",
        "date": "06102016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Morning News Call - India  June 10 "
    },
    {
        "content": "Yahoo Inc is set to put together a new shortlist of bidders for its core internet assets after several parties  including Verizon Communications Inc and AT&T Inc  made second-round offers  people familiar with the matter said.",
        "date": "06092016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T seeks to top Verizon as Yahoo reviews new bids -sources "
    },
    {
        "content": "* On June 2  2016  co made $5 billion optional prepayment of advances under $9.155 billion term loan credit agreement  dated as of January 21  2015  Source text - (http://1.usa.gov/1r4k59B) Further company coverage:",
        "date": "06022016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T says made $5 bln prepayment of advances under credit agreement "
    },
    {
        "content": "* Invests nearly $50 million over three-year period to enhance local networks in Amarillo area  Source text for Eikon:  Further company coverage:",
        "date": "06022016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T invests about $50 mln to enhance local networks in Amarillo area "
    },
    {
        "content": "AT&T Inc   the No. 2 U.S. wireless carrier  has made a bid for Yahoo Inc's  internet business  Bloomberg reported on Wednesday  citing people familiar with the matter.",
        "date": "05252016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T bids for Yahoo's internet business: Bloomberg "
    },
    {
        "content": "May 25 AT&T Inc  the No. 2 U.S. wireless carrier  has made a bid for Yahoo Inc's internet business  Bloomberg reported on Wednesday  citing people familiar with the matter.",
        "date": "05252016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T bids for Yahoo's internet business - Bloomberg "
    },
    {
        "content": "May 25 AT&T Inc  the No. 2 U.S. wireless carrier  has made a bid for Yahoo Inc's internet business  Bloomberg reported on Wednesday  citing people familiar with the matter.",
        "date": "05252016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T bids for Yahoo's internet business - Bloomberg "
    },
    {
        "content": "* AT&T is interested in buying Yahoo's internet business - Bloomberg  Source text : (http://bloom.bg/1U8AjpC)   (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05252016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T interested in buying Yahoo's internet business - Bloomberg "
    },
    {
        "content": "Sergio Garcia displayed shades of Seve Ballesteros on his way to victory at the AT&T Byron Nelson in Texas on Sunday  matching his late countryman for most career wins by a Spaniard on the PGA Tour.",
        "date": "05222016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Garcia joins Ballesteros on nine PGA Tour victories "
    },
    {
        "content": "* Names Anthony Robbins Vice President-Global Defense in its public sector solutions business  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05242016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T says names Anthony Robbins as Vice President-Global Defense in public sector solutions business "
    },
    {
        "content": "May 17 Quantenna Communications Inc  a U.S. company that designs Wi-Fi chips used in set-top boxes and wireless routers  has hired investment banks for an initial public offering (IPO) that could come later this year  people familiar with the matter said.",
        "date": "05172016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Quantenna hires banks to prepare for IPO -sources "
    },
    {
        "content": "May 16 Warren Buffett's Berkshire Hathaway Inc  revealed a more than $1 billion stake in Apple Inc  in a rare foray into the technology sector  which Buffett has largely shunned apart from a poorly performing investment in IBM.",
        "date": "05172016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 6-Warren Buffett's Berkshire takes $1 bln bite of Apple "
    },
    {
        "content": "* AT&T invests nearly $1.5 billion over 3-year period to enhance local networks in Ohio  Source text for Eikon:  Further company coverage:",
        "date": "05162016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T invests nearly $1.5 bln over 3-yr period to enhance local networks in Ohio "
    },
    {
        "content": "* Says starting May 20   customers can get our new Mexico roaming feature for no additional charge",
        "date": "05162016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T says customers can get new Mexico roaming feature for no additional charge "
    },
    {
        "content": "* To enhance next generation video-delivery platform with acquisition of Quickplay from Madison Dearborn partners",
        "date": "05162016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T to acquire Quickplay from Madison Dearborn Partners "
    },
    {
        "content": "* AT&T invests nearly $2.7 billion over a 3-year period to enhance local networks in Florida  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05162016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-At&T invests nearly $2.7 bln to enhance local networks in Florida "
    },
    {
        "content": "* Takes share stake in Apple Inc of 9.8 million shares - SEC filing",
        "date": "05162016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Berkshire Hathaway takes stake in Apple  dissolves stake in AT&T "
    },
    {
        "content": "* Invested more than $575 million in colorado wireless networks during 2013-2015  Source text for Eikon:  Further company coverage:",
        "date": "05122016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T says invested more than $575 mln in Colorado wireless networks "
    },
    {
        "content": "* AT&T awarded contract worth up to $74.6 million to support U.S. Defense  Source text for Eikon:  Further company coverage:",
        "date": "05112016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T awarded contract worth up to $74.6 mln to support U.S. Defense "
    },
    {
        "content": "* AT&T invests nearly $900 mln over 3-year period to enhance local networks in South Florida",
        "date": "05092016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T invests nearly $900 mln to enhance networks in South Florida "
    },
    {
        "content": "* AT&T invests nearly $100 mln over 3-year period to enhance local networks in Wyoming  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05092016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T invests nearly $100 mln over 3 yrs in Wyoming "
    },
    {
        "content": "* Files for notes offering of up to $4.0 billion - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05052016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T files for notes offering of up to $4 billion "
    },
    {
        "content": "* Continues to expect approximately $1 billion of transformation program costs",
        "date": "05032016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Sprint posts Q4 loss per share $0.14 "
    },
    {
        "content": "* At&T said it has awarded contract to host its web and mobile portals to Synacor Inc-WSJ",
        "date": "05042016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-At&T unwinds 15-year web alliance with Yahoo- WSJ "
    },
    {
        "content": "MEXICO CITY America Movil said on Wednesday first-quarter profit fell more than 40 percent from a year ago  as mobile competition from AT&T Inc intensified in Mexico and it started paying rent on cell towers after a sweeping regulatory overhaul.",
        "date": "04282016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "America Movil profit drops as Mexico competition grows "
    },
    {
        "content": "MEXICO CITY  April 27 America Movil  said on Wednesday first-quarter profit fell more than 40 percent from a year ago  as mobile competition from AT&T Inc  intensified in Mexico and it started paying rent on cell towers after a sweeping regulatory overhaul.",
        "date": "04282016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-America Movil profit drops as Mexico competition grows "
    },
    {
        "content": "HANOVER  Germany U.S. telecoms provider AT&T is betting it can carve out a significant business in connecting objects with one another  the head of that unit told Reuters in an interview  as it seeks new revenue sources in an oversaturated wireless market.",
        "date": "04272016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T exec says Internet of Things is a top priority "
    },
    {
        "content": "AT&T Inc  said on Tuesday the No. 2 U.S. wireless carrier lost television subscribers and signed up fewer-than-expected monthly wireless customers in the first quarter  even as it beat  profit estimates.",
        "date": "04262016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T loses TV subscribers; profit beats expectations "
    },
    {
        "content": "April 26 AT&T Inc said on Tuesday the No. 2 U.S. wireless carrier lost television subscribers and signed up fewer-than-expected monthly wireless customers in the first quarter  even as it beat  profit estimates.",
        "date": "04262016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T loses TV subscribers; profit beats expectations "
    },
    {
        "content": "* Reports strong revenue and adjusted earnings growth with solid margin expansion in first-quarter results",
        "date": "04262016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T reports Q1 earnings per share $0.61 "
    },
    {
        "content": "* Reported a net gain of 2.3 million north american wireless subscribers in q1 of 2016",
        "date": "04262016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-AT&T reports net gain of 2.3 mln North American wireless subscribers in Q1 "
    },
    {
        "content": "April 26 AT&T Inc  the No. 2 U.S. wireless carrier  reported a 24.4 percent jump in quarterly revenue  largely helped by the acquisition of satellite TV operator DIRECTV.",
        "date": "04262016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T's revenue jumps 24.4 pct on DIRECTV acquisition "
    },
    {
        "content": "April 18 YP Holdings LLC  the digital advertising business of what was formerly called Yellowpages.com  is planning to submit a first-round bid on Monday to merge with Yahoo Inc  a source familiar with the matter said on Monday.",
        "date": "04182016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-YP Holdings plans first-round bid to merge with Yahoo-source "
    },
    {
        "content": "YP Holdings LLC  the digital advertising business of what was formerly called Yellowpages.com  is planning to submit a first-round bid on Monday to merge with Yahoo Inc  a source familiar with the matter said on Monday.",
        "date": "04182016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "YP Holdings plans first-round bid to merge with Yahoo-source "
    },
    {
        "content": "* Alphabet Inc  Comcast Corp  AT&T Inc and IAC/Interactivecorp have opted not to bid for Yahoo- Dow jones  citing source",
        "date": "04182016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Time inc won't move ahead with bid for yahoo- Dow jones  citing source "
    },
    {
        "content": "April 1 EHarmony on Friday launched a recruitment portal  but the online matchmaker's long-promised service will begin to generate revenue only late this year  a company executive told Reuters.",
        "date": "04012016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Dating site eHarmony sees rev from new job portal late this year "
    },
    {
        "content": "WASHINGTON Video provider Netflix did not violate any U.S. regulations when it \"throttled\" the picture quality for AT&T and Verizon wireless customers and the FCC has no plans to investigate  FCC chairman Tom Wheeler said on Thursday.",
        "date": "03312016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. FCC not to investigate Netflix throttling of some mobile consumers "
    },
    {
        "content": "WASHINGTON Video provider Netflix did not violate any U.S. regulations when it \"throttled\" the picture quality for AT&T and Verizon wireless customers and the FCC has no plans to investigate  FCC chairman Tom Wheeler said on Thursday.",
        "date": "03312016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "FCC not to investigate Netflix throttling of some mobile consumers "
    },
    {
        "content": "WASHINGTON  March 31 Video provider Netflix  did not violate any U.S. regulations when it \"throttled\" the picture quality for AT&T and Verizon wireless customers and the FCC has no plans to investigate  FCC chairman Tom Wheeler said on Thursday.",
        "date": "03312016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-U.S. FCC not to investigate Netflix throttling of some mobile consumers "
    },
    {
        "content": "WASHINGTON  March 31 The U.S. Federal Communications Commission on Thursday advanced a proposal to ensure the privacy of broadband Internet users by barring providers from collecting user data without consent.",
        "date": "03312016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "FCC advances privacy proposal for U.S. internet users "
    },
    {
        "content": "* Verse home internet plans with more choices and more data for all internet customers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03292016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T to update u-Verse home internet plans "
    },
    {
        "content": "WASHINGTON/NEW YORK  March 29 The U.S. Federal Communications Commission on Tuesday kicked off an auction of low-frequency spectrum relinquished by television  broadcasters to wireless companies and other bidders that are seeking new airwaves to build and improve wireless networks.",
        "date": "03292016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC begins first phase of airwaves auction "
    },
    {
        "content": "* Netflix admits for first time that it throttles videos on most mobile networks around the world  including Verizon and AT&T networks -CNBC  citing DJ",
        "date": "03242016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Netflix admits for first time that it throttles videos on most mobile networks around the world  including Verizon and AT&T networks -CNBC  citing DJ "
    },
    {
        "content": "NEW YORK  March 20 A quiet decision by private equity firm Blackstone Group LP to recently sell three TV stations may foreshadow uncertain returns for some selling TV airwaves and lower wireless demand in the U.S. government's upcoming spectrum auction  industry watchers say.",
        "date": "03202016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Blackstone makes quiet sale ahead of FCC airwaves auction "
    },
    {
        "content": "* Sets quarterly dividend of $0.48 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03252016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T sets quarterly dividend of $0.48 per share "
    },
    {
        "content": "SAN FRANCISCO  March 18 GameStop  one of the most shorted U.S. stocks  has started to attract institutional buyers and dissuade some traders betting against it as it fights off a consumer shift toward downloading video games and its depressed share price stabilizes.",
        "date": "03182016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "GameStop attracts large investors as shorts back off "
    },
    {
        "content": "March 15 Ratings agency Moody's Investors Services said Tuesday a proposal by U.S. communications regulators to impose privacy restrictions on broadband providers like Verizon Communications Inc  AT&T Inc  Comcast Corp and Charter Communications Inc is \"credit negative.\"",
        "date": "03152016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Moody's says FCC internet privacy proposal could harm broad internet providers "
    },
    {
        "content": "* Hiring for more than 340 jobs in Georgia for retail and technical positions  Source text for Eikon:  Further company coverage:    ;))",
        "date": "03142016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T hiring for more than 340 jobs in Georgia "
    },
    {
        "content": "DirecTV  the satellite TV provider owned by No. 2 U.S. wireless carrier AT&T Inc   said all channels have been restored after experiencing loss of audio and video for at least two hours on Tuesday.",
        "date": "03092016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "DirecTV says all channels restored after two-hour outage "
    },
    {
        "content": "March 8 DirecTV  the satellite TV provider owned by No. 2 U.S. wireless carrier AT&T Inc  said all channels have been restored after experiencing loss of audio and video for at least two hours on Tuesday.",
        "date": "03092016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-DirecTV says all channels restored after two-hour outage "
    },
    {
        "content": "March 3 AT&T Inc filed a legal brief supporting Apple Inc in a high profile fight against the U.S. Justice Department's bid to unlock an encrypted iPhone belonging to one of the San Bernardino shooters.",
        "date": "03032016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T supports Apple in U.S. iPhone encryption dispute "
    },
    {
        "content": "NEW YORK  March 1 AT&T Inc on Tuesday said it will roll out three new ways to stream DIRECTV content on wireless and wired devices from smartphones to PCs  targeted at price-conscious U.S. viewers who shun pricey cable and satellite subscriptions.",
        "date": "03012016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to launch three DIRECTV video streaming options "
    },
    {
        "content": "MEXICO CITY  Feb 23 Mexico's federal consumer protection agency said on Tuesday a local court had ruled that the domestic business of wireless provider Nextel will have to compensate consumers for poor service and improper charges between 2012 and 2014.",
        "date": "02242016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 1-Mexico court orders Nextel to pay damages to consumers "
    },
    {
        "content": "BARCELONA Commitments AT&T Inc made to build out fixed high-speed Internet services to gain regulatory approval for its $48.5 billion purchase of DIRECTV will give it the edge over U.S. rival Verizon Communications Inc in the roll-out of the next generation of cellular technology  AT&T's strategy chief said on Monday.",
        "date": "02232016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T says has edge in 5G due to expanded Internet access "
    },
    {
        "content": "TEL AVIV  Feb 23 Team8  an Israeli firm the creates cybersecurity companies  said on Tuesday it has raised $23 million from strategic partners  bringing the total amount raised so far to $40 million.",
        "date": "02232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-Israel's Team8 raises another $23 mln for cyber security firms "
    },
    {
        "content": "BARCELONA  Feb 22 Commitments AT&T Inc  made to build out fixed high-speed Internet services to gain regulatory approval for its $48.5 billion purchase of DIRECTV will give it the edge over U.S. rival Verizon Communications Inc  in the roll-out of the next generation of cellular technology  AT&T's strategy chief said on Monday.",
        "date": "02232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T says has edge in 5G due to expanded Internet access "
    },
    {
        "content": "Feb 22 AT&T Inc has entered into a multiyear contract to help Porsche  the luxury sports division of Volkswagen AG  provide Internet connectivity in its cars in the United States  beginning with some 2017 models  the companies announced on Monday.",
        "date": "02222016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T  Ericsson set deals with automakers on Internet-connected cars "
    },
    {
        "content": "BARCELONA  Feb 22 Commitments AT&T Inc  made to build out fixed high-speed Internet services to gain regulatory approval for its $48.5 billion purchase of DIRECTV will give it the edge over U.S. rival Verizon in the roll-out of the next generation of cellular technology  AT&T's strategy chief said on Monday.",
        "date": "02232016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "CORRECTED-AT&T says has edge in 5G due to expanded Internet access "
    },
    {
        "content": "NEW YORK  Feb 22 Wireless provider AT&T Inc said on Monday it will partner with chipmaker Intel Corp to test the functionality of drones on its high-speed LTE wireless network.",
        "date": "02222016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T and Intel team up to test drone technology "
    },
    {
        "content": "NEW YORK  Feb 21 AT&T Inc will invest about $10 billion in its global business solutions division  as it seeks to boost the unit that offers services such as wireless connectivity  cloud storage and security to companies  the wireless provider said on Sunday.",
        "date": "02222016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to invest $10 billion to bolster global enterprise services "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO  Feb 12 Alphabet Inc's  Google will not participate in the U.S. Federal Communications Commission's upcoming auction of broadcast airwaves that can help the wireless industry improve coverage  a spokeswoman told Reuters on Friday.",
        "date": "02122016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-Google says will not participate in 2016 U.S. airwaves auction "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 29 (Fitch) Fitch Ratings has assigned an 'A-' rating to AT&T  Inc.'s (AT&T; NYSE: T) offering of senior unsecured notes. Proceeds from the  notes are expected to be used to refinance debt maturing in 2016 as well as for  general corporate purposes. AT&T's Issuer Default Rating (IDR) is currently  'A-'  and the Rating Outlook is Stable.  KEY RATING DRIVERS Large Scale and Financial Flexibility: The 'A-' rating assigned t",
        "date": "01292016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Fitch Rates AT&T's Sr. Unsecured Notes Offering 'A-'; Outlook Stable "
    },
    {
        "content": "AT&T Inc  the No. 2 U.S. wireless carrier  said fourth-quarter revenue grew less than expected as it added fewer mainstream wireless customers than a year ago due to stiffer competition from rivals.",
        "date": "01262016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T revenue below forecasts  shares fall "
    },
    {
        "content": "Jan 26 AT&T Inc  the No. 2 U.S. wireless carrier  said fourth-quarter revenue grew less than expected as it added fewer mainstream wireless customers than a year ago due to stiffer competition from rivals.",
        "date": "01262016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T revenue below forecasts  shares fall "
    },
    {
        "content": "Jan 26 AT&T Inc  the No. 2 U.S. wireless carrier  reported a 22.3 percent rise in quarterly revenue  helped mainly by the acquisition of satellite TV operator DirecTV.",
        "date": "01262016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T quarterly revenue rises 22.3 percent "
    },
    {
        "content": "AT&T Inc   the No. 2 U.S. wireless carrier  said it expected to record a gain of about $2.2 billion in the fourth quarter  due to an increase in the assumed discount rates used to measure pension and post-retirement obligation.",
        "date": "01222016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T sees pension-related gain of $2.2 billion in fourth quarter "
    },
    {
        "content": "Jan 22 AT&T Inc  the No. 2 U.S. wireless carrier  said it expected to record a gain of about $2.2 billion in the fourth quarter  due to an increase in the assumed discount rates used to measure pension and post-retirement obligation.",
        "date": "01222016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T sees pension-related gain of $2.2 bln in 4th qtr "
    },
    {
        "content": "Jan 22 AT&T Inc  the No. 2 U.S. wireless carrier  said it expected to record a gain of about $2.2 billion in the fourth quarter  due to an increase in the assumed discount rates used to measure pension and post retirement obligation.",
        "date": "01222016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to record $2.2 bln gain related to pension obligations "
    },
    {
        "content": "Spanish telecommunications company Telefonica SA has expressed interest in buying AT&T Inc's pay TV assets in Latin America  which could be valued at around $10 billion  according to people familiar with the matter.",
        "date": "01152016",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Exclusive: Telefonica eyes AT&T's $10 billion Latin American TV assets - sources "
    },
    {
        "content": "NEW YORK  Jan 5 AT&T Inc will expand its smart city services to help municipal authorities remotely monitor conditions of roads and bridges in real time and give citizens mobile apps to stay informed about things like traffic and safety problems  the company said on Tuesday.",
        "date": "01052016",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T steps up 'smart cities' push  to offer more services "
    },
    {
        "content": "MEXICO CITY  Dec 17 Mexico's telecoms regulator on Thursday said it had approved swaps of frequency blocks and a spectrum rental deal between AT&T Inc and Telefonica SA   the main competitors to the country's dominant player  Carlos Slim's America Movil.",
        "date": "12182015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Mexico telecoms regulator backs AT&T and Telefonica spectrum deal "
    },
    {
        "content": "WASHINGTON  Dec 17 The Federal Communications Commission said on Thursday it has asked major Internet providers to discuss innovative data policies in the wake of the government's net neutrality rules.",
        "date": "12172015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "FCC wants details on AT&T  Comcast  T-Mobile data plans "
    },
    {
        "content": "WASHINGTON  Dec 17 The Federal Communications Commission said on Thursday it asked major Internet providers to answer questions on policies aimed at offering consumers free data by using preferred services and whether they violate the government's net neutrality rules.",
        "date": "12172015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-FCC wants details on AT&T  Comcast  T-Mobile data plans "
    },
    {
        "content": "* Says to expand availability of ultra-fast speeds through  AT&T GigaPower to 38 additional metros across the U.S.",
        "date": "12072015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T to expand availability of ultra-fast speeds through AT&T GigaPower to 38 additional metros "
    },
    {
        "content": "Dec 8 AT&T Inc Chief Executive Randall Stephenson on Tuesday hinted at launching a mobile video streaming service as early as January to target price-conscious U.S. viewers who don't currently have payTV subscriptions.",
        "date": "12082015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T CEO hints at launching mobile video streaming service "
    },
    {
        "content": "Dec 8 AT&T Inc Chief Executive Randall Stephenson on Tuesday hinted at launching a mobile video streaming service as early as January to target price-conscious U.S. viewers who don't currently have pay-TV subscriptions.",
        "date": "12082015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T CEO hints at launching mobile video streaming service "
    },
    {
        "content": "* AT&T Adworks launches cross-screen addressable advertising trial across TV and mobile devices",
        "date": "11102015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-Opera and AT&T Adworks launch cross-screen ads trial "
    },
    {
        "content": "Nov 2 AT&T Inc said on Monday it would offer BlackBerry Ltd's new Android-powered smartphone in its retail stores in the United States and online from Friday.",
        "date": "11022015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to offer BlackBerry's new Android phone from Friday "
    },
    {
        "content": "AT&T Inc   the No. 2 U.S. wireless carrier and the world's largest pay-TV operator  raised its 2015 earnings forecast as quarterly earnings beat expectations on cost cuts and gains in wireless and DirecTV subscribers.",
        "date": "10232015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T profit beats Street  raises full-year forecast "
    },
    {
        "content": "AT&T Inc   long the No. 2 U.S. wireless carrier and since July the world's biggest pay-TV operator  raised its full-year earnings forecast after reporting a better-than-expected quarterly profit as it added more wireless mobile subscribers.",
        "date": "10222015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T profit beats Street  raises full-year forecast "
    },
    {
        "content": "Oct 22 AT&T Inc  the No. 2 U.S. wireless carrier and the world's largest pay-TV operator  raised its 2015 earnings forecast as quarterly earnings beat expectations on cost cuts and gains in wireless and DirecTV subscribers.",
        "date": "10232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 4-AT&T profit beats Street  raises full-year forecast "
    },
    {
        "content": "Oct 22 AT&T Inc  long the No. 2 U.S. wireless carrier and since July the world's biggest pay-TV operator  raised its full-year earnings forecast after reporting a better-than-expected quarterly profit as it added more wireless mobile subscribers.",
        "date": "10222015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T profit beats Street  raises full-year forecast "
    },
    {
        "content": "Oct 22 AT&T Inc  the No. 2 U.S. wireless carrier and the world's largest pay-TV operator  raised its 2015 earnings forecast as quarterly earnings beat expectations on cost cuts and gains in wireless and DirecTV subscribers.",
        "date": "10232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "CORRECTED-UPDATE 3-AT&T profit beats Street  raises full-year forecast "
    },
    {
        "content": "Oct 22 AT&T Inc  long the No. 2 U.S. wireless carrier and since July the world's biggest pay-TV operator  reported an 18.6 percent rise in quarterly revenue  helped by its DirecTV acquisition and as it added more prepaid mobile subscribers.",
        "date": "10222015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T revenue rises 18.6 pct on DirecTV acquisition "
    },
    {
        "content": "AT&T Inc said on Wednesday that consensus revenue estimates for its third-quarter were \"inflated\" as they differed from its own accounting  which includes results from DirecTV  acquired by the No. 2 U.S. wireless carrier in July.",
        "date": "10212015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T says third-quarter consensus revenue estimates 'inflated' "
    },
    {
        "content": "Oct 21 AT&T Inc said on Wednesday that consensus revenue estimates for its third-quarter were \"inflated\" as they differed from its own accounting  which includes results from DirecTV  acquired by the No. 2 U.S. wireless carrier in July.",
        "date": "10212015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T says Q3 consensus revenue estimates \"inflated\" "
    },
    {
        "content": "NEW YORK  Oct 16 AT&T Inc said on Friday it has partnered with Uber to roll out connected car rides in four cities for a limited time to let passengers watch college football games live from tablets in the backseat during their trips.",
        "date": "10162015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T  Uber to test college football streaming in connected cars "
    },
    {
        "content": "AT&T Inc   the No. 2 U.S. wireless carrier  said it expects to report more than 2 million net subscriber additions for the third quarter  with gains in every category including postpaid and prepaid.",
        "date": "09292015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T expects 2 million net wireless subscriber adds in third-quarter "
    },
    {
        "content": "Sept 29 AT&T Inc  the No. 2 U.S. wireless carrier  said it expects to report more than 2 million net subscriber additions for the third quarter  with gains in every category including postpaid and prepaid.",
        "date": "09292015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T expects 2 mln net wireless subscriber adds in Q3 "
    },
    {
        "content": "Sept 29 AT&T Inc said it expects to report more than 2 million net subscriber additions for the third quarter  with gains in every category including postpaid and prepaid.",
        "date": "09292015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T expects 2 mln net subscriber adds in third quarter "
    },
    {
        "content": "AT&T Inc may take a charge estimated at $1.1 billion related to DirecTV's Venezuela assets in what is the latest U.S. company to confront the South American country's currency woes.",
        "date": "09292015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T may take $1.1 billion charge on DirecTV's Venezuela assets "
    },
    {
        "content": "Sept 29 AT&T Inc may take a charge estimated at $1.1 billion related to DirecTV's Venezuela assets in what is the latest U.S. company to confront the South American country's currency woes.",
        "date": "09292015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T may take $1.1 bln charge on DirecTV's Venezuela assets "
    },
    {
        "content": "* Ericsson says has been selected to work with AT&T on the evolution of AT&T's TV experience platform  Further company coverage:    (Stockholm Newsroom)",
        "date": "09102015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T selects Ericsson to enhance its TV platform "
    },
    {
        "content": "MEXICO CITY  Aug 16 America Movil said on Sunday it removed roaming charges on calls to and data in the United States for 40 million Mexican prepay clients as it gears up to prevent new rival AT&T Inc. stealing market share on its home turf.",
        "date": "08162015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Slim's America Movil extends Mexico-U.S. 'borderless' plan to prepay "
    },
    {
        "content": "UNITED NATIONS  Aug 17 The United Nations said it expects member states to respect its right to privacy and is assessing how to respond to a report that telecommunications company AT&T Inc helped the U.S. National Security Agency spy on the world body's communications.",
        "date": "08172015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.N. says expects states to respect privacy after AT&T spying report "
    },
    {
        "content": "WASHINGTON Telecommunications powerhouse AT&T Inc  has provided extensive assistance to the U.S. National Security Agency as the spy agency conducts surveillance on huge volumes of Internet traffic passing through the United States  the New York Times reported on Saturday  citing newly disclosed NSA documents.",
        "date": "08152015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T helped U.S. NSA in spying on Internet traffic: N.Y. Times "
    },
    {
        "content": "NEW YORK  Aug 16    -- Source link: (http://nyti.ms/1NbD0Ix)",
        "date": "08162015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "MEDIA-AT&T aided U.S. government's Internet spying for years "
    },
    {
        "content": "WASHINGTON  Aug 15 Telecommunications powerhouse AT&T Inc has provided extensive assistance to the U.S. National Security Agency as the spy agency conducts surveillance on huge volumes of Internet traffic passing through the United States  the New York Times reported on Saturday  citing newly disclosed NSA documents.",
        "date": "08152015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T helped U.S. NSA in spying on Internet traffic -N.Y. Times "
    },
    {
        "content": "AT&T Inc said on Wednesday it expects revenue  earnings and free cash flow to grow through 2018 following its DirecTV purchase and investments in Mexico  though it also sees higher capital expenditure.",
        "date": "08122015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T ups revenue  profit forecast after DirecTV buy "
    },
    {
        "content": "Aug 12 AT&T Inc said on Wednesday it expects revenue  earnings and free cash flow to grow through 2018 following its DirecTV purchase and investments in Mexico  though it also sees higher capital expenditure.",
        "date": "08122015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T ups revenue  profit forecast after DirecTV buy "
    },
    {
        "content": "Aug 12 AT&T Inc  the No.2 U.S. telecom company  said it expected double-digit consolidated revenue growth for the rest of 2015  citing gains from its purchase of DirecTV.",
        "date": "08122015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T sees double-digit revenue growth "
    },
    {
        "content": "WASHINGTON  Aug 6 The U.S. Federal Communications Commission on Thursday denied T-Mobile US Inc's  request that more airwaves be set aside for smaller wireless companies like itself to bid on during a government auction next year.",
        "date": "08062015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 2-U.S. FCC rejects T-Mobile request to limit spectrum for Verizon  AT&T "
    },
    {
        "content": "The U.S. Federal Communications Commission on Thursday denied T-Mobile US Inc's request that more airwaves be set aside for smaller wireless companies like itself to bid on during a government auction next year.",
        "date": "08062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "FCC rejects T-Mobile request to limit spectrum for AT&T  Verizon "
    },
    {
        "content": "* Offer includes hd  dvr service for up to 4 tv receivers  unlimited talk  text for 4 wireless lines  10 gb of shareable wireless data",
        "date": "08032015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "BRIEF-AT&T to bundle wireless service with DirecTV's pay-TV offerings "
    },
    {
        "content": "Aug 3 The No. 2 U.S. wireless carrier AT&T Inc  said it will bundle its wireless service with DirecTV's pay-TV offerings after the $48.5 billion deal was approved last month.",
        "date": "08032015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to bundle wireless service with DirecTV's pay-TV offerings "
    },
    {
        "content": "July 22 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "07222015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON The No. 2 U.S. wireless carrier AT&T Inc and the biggest satellite-TV provider DirecTV  became the country's largest pay-TV company on Friday  completing their $48.5 billion merger after receiving final regulatory approval.",
        "date": "07242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T  DirecTV complete merger to form biggest pay-TV company "
    },
    {
        "content": "NEW YORK AT&T  which on Friday received final U.S. regulatory approval to buy DirecTV  will offer ad-supported TV streaming and mobile video products while building out its advertising technology  John Stankey  the AT&T executive named as chief of the company's Internet and Entertainment division  told Reuters.",
        "date": "07242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "With DirecTV  mobile video services and ad revenue to come  AT&T executive says "
    },
    {
        "content": "AT&T Inc  reported a better-than-expected quarterly profit as it managed costs and added wireless customers  sending its shares up 2.1 percent in extended trading on Thursday.",
        "date": "07232015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Wireless gains  managing costs helps AT&T beat profit estimates "
    },
    {
        "content": "WASHINGTON  July 24 The No. 2 U.S. wireless carrier AT&T Inc and the biggest satellite-TV provider DirecTV became the country's largest pay-TV company on Friday  completing their $48.5 billion merger after receiving final regulatory approval.",
        "date": "07242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T  DirecTV complete merger to form biggest pay-TV company "
    },
    {
        "content": "July 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "07242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Shares up 2 pct in extended trading   (Adds cost controls  details on Mexico  DirecTV deal  executive quotes  and updates stock price)",
        "date": "07232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-Wireless gains  managing costs helps AT&T beat profit estimates "
    },
    {
        "content": "WASHINGTON  July 24 AT&T received the final blessing from the U.S. Federal Communications Commission on Friday to buy DirecTV for $48.5 billion  combining the country's No. 2 wireless carrier with the largest satellite-TV provider.",
        "date": "07242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC gives AT&T final clearance to buy DirecTV "
    },
    {
        "content": "July 23 AT&T Inc reported a 1.4 percent rise in quarterly revenue as it added postpaid customers.",
        "date": "07232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T's revenue rises as it adds postpaid customers "
    },
    {
        "content": "WASHINGTON AT&T Inc's  proposed $48.5 billion purchase of DirecTV  has cleared its final regulatory hurdle as the U.S. Federal Communications Commission voted on Thursday to approve the merger  according to people familiar with the votes.",
        "date": "07242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T clears final hurdle to close DirecTV merger: sources "
    },
    {
        "content": "* Indexes down: Dow 0.52 pct  S&P 0.45 pct  Nasdaq 0.25 pct   (Updates to early afternoon)",
        "date": "07232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall Street slumps for third day as earnings disappoint "
    },
    {
        "content": "WASHINGTON AT&T Inc's proposed $48.5 billion purchase of DirecTV has cleared its final regulatory hurdle as the U.S. Federal Communications Commission voted on Thursday to approve the merger  according to people familiar with the votes.",
        "date": "07242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T clears final hurdle to close DirecTV merger -sources "
    },
    {
        "content": "WASHINGTON  July 23 AT&T Inc's proposed $48.5 billion purchase of DirecTV has cleared its final regulatory hurdle as the U.S. Federal Communications Commission voted on Thursday to approve the merger  according to people familiar with the votes.",
        "date": "07242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T clears final hurdle to close DirecTV merger -sources "
    },
    {
        "content": "WASHINGTON AT&T Inc is close to wrapping up its deal to buy DirecTV as U.S. telecom and antitrust regulators signaled a green light for the $48.5 billion merger that would create the country's largest pay-TV company.",
        "date": "07212015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T nears U.S. approval of $48.5 bln DirecTV merger "
    },
    {
        "content": "* Dow falls 0.09 pct  S&P up 0.05 pct  Nasdaq up 0.42 pct   (Adds details  adds comment  updates prices)",
        "date": "07232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-U.S. stocks higher; 3M  Caterpillar weigh on Dow "
    },
    {
        "content": "WASHINGTON AT&T Inc  is close to wrapping up its deal to buy DirecTV  as U.S. telecom and antitrust regulators signaled a green light for the $48.5 billion merger that would create the country's largest pay-TV company.",
        "date": "07212015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T nears U.S. approval of $48.5 billion DirecTV merger "
    },
    {
        "content": "* Dow falls 0.23 pct  S&P down 0.05 pct  Nasdaq up 0.14 pct   (Updates to open)",
        "date": "07232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Nasdaq rebounds but weak results weigh on Dow  S&P "
    },
    {
        "content": "MEXICO CITY  July 16 Mexican telecoms giant America Movil  controlled by billioinaire Carlos Slim  will respond to a challenge from U.S. carrier AT&T by offering some subscribers free calls to and data in the United States  and will also invest $6 billion in its network in Mexico  its chief executive said on Thursday.",
        "date": "07162015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 2-Facing AT&T  America Movil pledges free roaming  $6 bln network upgrade "
    },
    {
        "content": "WASHINGTON  July 21 AT&T Inc is close to wrapping up its deal to buy DirecTV as U.S. telecom and antitrust regulators signaled a green light for the $48.5 billion merger that would create the country's largest pay-TV company.",
        "date": "07212015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T nears U.S. approval of $48.5 bln DirecTV merger "
    },
    {
        "content": "* Futures: Dow down 8 pts  S&P up 1.25 pts  Nasdaq up 6.25 pts   (Adds details  comment  updates prices)",
        "date": "07232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St set to open little changed after two-day dip "
    },
    {
        "content": "WASHINGTON  July 21 AT&T Inc has won U.S. antitrust approval to buy DirecTV for $48.5 billion  an acquisition that will combine the country's No. 2 wireless carrier with the largest satellite-TV provider  the Justice Department said on Tuesday.",
        "date": "07212015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Justice Department gives nod to AT&T-DirecTV merger "
    },
    {
        "content": "WASHINGTON  July 21 U.S. Federal Communications Commission Chairman Tom Wheeler on Tuesday outlined some of the conditions he is recommending as part of the approval of AT&T Inc's $48.5 billion bid to buy DirecTV.",
        "date": "07212015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "FCC chairman outlines conditions for AT&T-DirecTV merger "
    },
    {
        "content": "* Says sees US$ - and yuan-bonds growing by $5 - $10 bln for rest of 2015   (Adds details in paragraphs 8-9)",
        "date": "07062015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 1-Taiwan aims to set up first U.S. dollar bond exchange "
    },
    {
        "content": "July 1 CBS Corp said AT&T Inc has agreed to keep the television network's channels on its web-based TV service  U-verse.",
        "date": "07022015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 1-AT&T's U-verse TV service to carry CBS channels "
    },
    {
        "content": "July 1 CBS Corp said AT&T Inc has agreed to carry the television network's channels on its IP-based TV service  U-verse.",
        "date": "07012015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T's internet TV service to carry CBS channels "
    },
    {
        "content": "AT&T Inc   the No. 2 U.S. telecom company  said it has extended the \"termination date\" of the merger agreement with satellite TV provider DirecTV  for \"a short period of time\"  the second time in two months.",
        "date": "06292015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T  DirecTv extend 'termination date' for second time "
    },
    {
        "content": "June 29 AT&T Inc  the No. 2 U.S. telecom company  said it has extended the \"termination date\" of the merger agreement with satellite TV provider DirecTV for \"a short period of time\"  the second time in two months.",
        "date": "06292015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T  DirecTv extend \"termination date\" for second time "
    },
    {
        "content": "WASHINGTON  June 25 The Federal Communications Commission is considering capping bidding discounts that small businesses can receive in U.S. auctions of airwaves  after Dish Network Corp partners sought $3 billion in discounts under current rules.",
        "date": "06252015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 1-U.S. FCC may cap small-business discount in airwaves auctions "
    },
    {
        "content": "MEXICO CITY AT&T Inc  plans to invest around $3 billion in its high-speed mobile Internet network in Mexico  the company said on Thursday.",
        "date": "06252015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to invest $3 billion to boost Mexico mobile network "
    },
    {
        "content": "* Energy rises alongside oil prices; AT&T rallies on upgrades",
        "date": "06232015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "US STOCKS-Wall St edges up in quiet session; Nasdaq ends at record "
    },
    {
        "content": "MEXICO CITY  June 25 AT&T Inc plans to invest around $3 billion in its high-speed mobile Internet network in Mexico  the company said on Thursday.",
        "date": "06252015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T to invest $3 bln to boost Mexico mobile network "
    },
    {
        "content": "Thomson Reuters June 23  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                **",
        "date": "06232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "WASHINGTON  June 25 U.S. Federal Communications Commission Chairman Tom Wheeler wants the agency to reject a T-Mobile US Inc request that more airwaves be set aside for smaller wireless companies like itself to bid on during a government auction next year.",
        "date": "06252015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC chair wants no further restrictions for AT&T  Verizon in 2016 auction "
    },
    {
        "content": "AT&T Inc  which was found to be too late to appeal a $40 million judgment against the company in a patent infringement lawsuit because its attorneys did not read key rulings in time  will ask the U.S. Supreme Court to review the case.",
        "date": "06172015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T  Sidley Austin lawyers to appeal missed deadline case to Supreme Court "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission on Wednesday proposed a $100 million fine for AT&T Inc   accusing the No. 2 wireless carrier of misleading customers who paid for unlimited data plans about possible slowing of download speeds.",
        "date": "06172015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T faces potential $100 million U.S. fine over 'throttling' disclosures "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission on Wednesday proposed a $100 million fine for AT&T Inc  accusing the No. 2 wireless carrier of misleading customers who paid for unlimited data plans about possible slowing of download speeds.",
        "date": "06172015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T faces potential $100 mln U.S. fine over 'throttling' disclosures "
    },
    {
        "content": "WASHINGTON  June 17 The U.S. Federal Communications Commission on Wednesday proposed a $100 million fine for AT&T Inc  accusing the No. 2 wireless carrier of misleading customers who paid for unlimited data plans about possible slowing of download speeds.",
        "date": "06172015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T faces potential $100 mln U.S. fine over 'throttling' disclosures "
    },
    {
        "content": "WASHINGTON  June 17 The U.S. Federal Communications Commission on Wednesday proposed a $100 million fine against AT&T Inc  accusing the second-largest U.S. wireless carrier of misleading unlimited-data customers about possible slowdowns in download speeds.",
        "date": "06172015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC plans $100 mln fine for AT&T over 'throttling' disclosures "
    },
    {
        "content": "WASHINGTON  June 11 A U.S. federal appeals court on Thursday declined to suspend new Internet traffic regulations  rejecting the telecom industry's request to partially block the implementation of the \"net neutrality\" rules while they're being litigated.",
        "date": "06112015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. court denies request to block parts of net neutrality rules "
    },
    {
        "content": "MEXICO CITY Foreign direct investment (FDI) in Mexico rose to $7.57 billion in the first quarter of the year according to preliminary figures  boosted by U.S. telecoms giant AT&T's  purchase of Iusacell  the economy ministry said on Wednesday.",
        "date": "05202015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Mexico foreign direct investment rises to $7.57 billion in first quarter "
    },
    {
        "content": "MEXICO CITY  May 20 Foreign direct investment (FDI) in Mexico rose to $7.57 billion in the first quarter of the year according to preliminary figures  boosted by U.S. telecoms giant AT&T's purchase of Iusacell  the economy ministry said on Wednesday.",
        "date": "05202015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Mexico foreign direct investment rises to $7.57 bln in 1st-qtr "
    },
    {
        "content": "AT&T Inc's $49-billion bid for DirecTV  is unlikely to be blocked by U.S. authorities  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "05122015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T-DirecTV deal unlikely to be blocked - WSJ "
    },
    {
        "content": "AT&T Inc's  $49-billion bid for DirecTV  is unlikely to be blocked by U.S. authorities  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "05122015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T-DirecTV deal unlikely to be blocked: WSJ "
    },
    {
        "content": "WASHINGTON  May 13 Dish Network Corp  Cogent Communications Holdings Inc and advocacy groups are asking U.S. regulators to restrict AT&T Inc's power over online video and other content as part of its proposed purchase of DirecTV.",
        "date": "05132015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Dish  Cogent specify demands for concessions in AT&T-DirecTV merger "
    },
    {
        "content": "* DoJ  FCC regulators nearing a decision - source   (Adds FCC statement)",
        "date": "05122015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T-DirecTV deal unlikely to be blocked - WSJ "
    },
    {
        "content": "May 12 AT&T Inc's $49-billion bid for DirecTV is unlikely to be blocked by U.S. authorities  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "05122015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T-DirecTV deal unlikely to be blocked by regulators - WSJ "
    },
    {
        "content": "AT&T Inc  the No. 2 U.S. wireless company  said on Wednesday its users will be able to access the Hulu streaming video service on its website and mobile app starting later this year.",
        "date": "05132015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to offer Hulu on website  app this year "
    },
    {
        "content": "May 13 AT&T Inc  the No. 2 U.S. wireless company  said on Wednesday its users will be able to access the Hulu streaming video service on its website and mobile app starting later this year.",
        "date": "05132015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T to offer Hulu on website  app this year "
    },
    {
        "content": "May 13 AT&T Inc  the No. 2 U.S. wireless company  said it would offer the Hulu subscription streaming service to its customers through its websites and mobile apps beginning later this year.",
        "date": "05132015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to offer Hulu to customers this year "
    },
    {
        "content": "Thomson Reuters May 13  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05132015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "RIVIERA MAYA  Mexico AT&T Inc will take \"a couple of years\" to shape up its new business in Mexico  where it competes with billionaire Carlos Slim's dominant carrier America Movil  AT&T Mexico Chief Executive Thaddeus Arroyo said in an interview on Thursday.",
        "date": "05072015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T Mexico chief: will take 'couple of years' to shape up Mexico business "
    },
    {
        "content": "May 5 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "05052015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Netflix Inc has urged the U.S. Federal Communications Commission to reject the pending $48 billion merger of AT&T Inc and DirecTV unless its concerns about the deal are addressed.",
        "date": "05052015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Netflix asks FCC to reject AT&T-DirecTV merger unless changes made "
    },
    {
        "content": "WASHINGTON  May 5 Netflix Inc has urged the U.S. Federal Communications Commission to reject the pending $48 billion merger of AT&T Inc and DirecTV unless its concerns about the deal are addressed.",
        "date": "05052015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-Netflix asks U.S. FCC to reject AT&T-DirecTV merger unless changes made "
    },
    {
        "content": "* Netflix Spokeswoman Says Company Does Not Oppose At&T Inc-DirecTV merger  seeks conditions    (Reporting By Alina Selyukh)",
        "date": "05052015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "BRIEF-Netflix says does not oppose AT&T-DirecTV merger  seeks conditions "
    },
    {
        "content": "April 29 AT&T Inc fired the president of its U-Verse business  after an African American female employee filed a racial discrimination lawsuit.",
        "date": "04292015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T fires executive after lawsuit alleging racial discrimination "
    },
    {
        "content": "WASHINGTON AT&T Inc  CenturyLink Inc  and U.S. telecom and cable industry groups called for regulators to block parts of new rules for Internet service providers on Friday  citing \"crushing\" compliance costs and threats to investment.",
        "date": "05012015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T  U.S. telecom groups seek to block new Internet rules "
    },
    {
        "content": "WASHINGTON  May 1 AT&T Inc  CenturyLink Inc and U.S. telecom and cable industry groups called for regulators to block parts of new rules for Internet service providers on Friday  citing \"crushing\" compliance costs and threats to investment.",
        "date": "05012015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T  U.S. telecom groups seek to block new Internet rules "
    },
    {
        "content": "WASHINGTON U.S. telecom industry groups  alongside AT&T Inc and CenturyLink Inc  called for regulators to block parts of new rules for Internet service providers on Friday  citing \"crushing\" compliance costs and threats to investment.",
        "date": "05012015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. telecom groups  AT&T seek to block new Internet rules "
    },
    {
        "content": "MEXICO CITY Mexico's America Movil  said on Friday that it was still reviewing alternatives to a sale of assets in Mexico in the wake of AT&T's entry into the market  adding that it did not want to sell infrastructure.",
        "date": "04242015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "America Movil says still looking at Mexico asset sale alternatives "
    },
    {
        "content": "MEXICO CITY  April 24 Mexico's America Movil  said on Friday that it was still reviewing alternatives to a sale of assets in Mexico in the wake of AT&T's entry into the market  adding that it did not want to sell infrastructure.",
        "date": "04242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-America Movil says still looking at Mexico asset sale alternatives "
    },
    {
        "content": "Thomson Reuters April 24  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "MEXICO CITY  April 23 Mexico's America Movil on Thursday reported a 41 percent slump in first-quarter net profit  missing expectations due to a foreign exchange loss for the second consecutive quarter  mostly on the depreciation of the Brazilian real against the dollar.",
        "date": "04242015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-America Movil profit hammered by weak Brazilian currency "
    },
    {
        "content": "* U.S. sells $18 bln 5-year TIPS to mediocre demand     * AT&T bond deal lures investor attention from Treasuries     * Steep fall in U.S. new home sales revives economic worries   (New throughout  updates prices and market activity)     By Richard Leong     NEW YORK  April 23 U.S. Treasuries yields fell on Thursday with benchmark yields retreating from 3-1/2 week highs as investors stepped back in the bond market a day after a broad selloff in Treasuries  German Bunds and British Gi",
        "date": "04232015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "TREASURIES-U.S. bond market rebounds on weak data  Greece "
    },
    {
        "content": "Thomson Reuters April 23  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04232015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "A slew of Dow 30 companies report results in the week: Chemicals conglomerate DuPont  industrial conglomerate United Technologies Corp  property and casualty insurer Travelers Companies Inc and wireless carrier Verizon Communications Inc on Tuesday; McDonald's Corp  AT&T Inc  Boeing Co and Coca-Cola Co on Wednesday; and diversified manufacturer 3M Co  Procter & Gamble and Microsoft Corp on Thursday. While DuPont is expected to report lower first-quarter results  Travelers Companies Inc's first-q",
        "date": "04172015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 1-What to Watch in the Week Ahead and on Monday  April 20 "
    },
    {
        "content": "AT&T Inc on Wednesday reported better-than expected earnings and said fewer wireless customers switched to other networks at a rate not seen in any first quarter.",
        "date": "04222015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T profit beats Street estimates  fewer subscribers defect "
    },
    {
        "content": "April 22 AT&T Inc on Wednesday reported better-than expected earnings and said fewer wireless customers switched to other networks at a rate not seen in any first quarter.",
        "date": "04222015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T profit beats Street estimates  fewer subscribers defect "
    },
    {
        "content": "April 22 AT&T Inc reported a 13 percent fall in quarterly profit and said revenue was nearly flat from a year earlier.",
        "date": "04222015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T first-quarter profit falls 13 pct "
    },
    {
        "content": "April 22 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "04222015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON  April 22 California Governor Jerry Brown told the U.S. Federal Communications Commission he supports the proposed $48 billion merger of wireless carrier AT&T Inc and satellite provider DirecTV  according to a letter released on Wednesday.",
        "date": "04222015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "California governor backs AT&T-DirecTV merger to FCC "
    },
    {
        "content": "NEW YORK AT&T Inc  and three cable and wireless trade groups filed separate lawsuits on Tuesday challenging the U.S. Federal Communications Commission over its new web traffic regulations.",
        "date": "04142015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T  trade groups mount court challenge to FCC Internet rules "
    },
    {
        "content": "NEW YORK  April 14 AT&T Inc and three cable and wireless trade groups filed separate lawsuits on Tuesday challenging the U.S. Federal Communications Commission over its new web traffic regulations.",
        "date": "04142015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T  trade groups mount court challenge to FCC Internet rules "
    },
    {
        "content": "NEW YORK Cable and wireless trade groups filed separate lawsuits on Tuesday challenging the U.S. Federal Communications Commission over its new web traffic regulations.",
        "date": "04142015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Trade groups mount legal challenges to FCC's new Internet rules "
    },
    {
        "content": "NEW YORK  April 14 AT&T Inc on Tuesday filed a lawsuit challenging the U.S Federal Communications Commission's net neutrality rules.   (Reporting by Malathi Nayak)",
        "date": "04142015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T appeals against FCC's net neutrality rules "
    },
    {
        "content": "NEW YORK The Federal Communications Commission reached a $25 million settlement with AT&T Inc over a consumer data breach at call centers in Mexico  Colombia and the Philippines  the U.S. communications regulator said on Wednesday.",
        "date": "04082015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. FCC imposes $25 mln fine on AT&T over customer data breach "
    },
    {
        "content": "NEW YORK The Federal Communications Commission reached a $25 million settlement with AT&T Inc over a consumer data breach at call centers in Mexico  Colombia and the Philippines  the U.S. communications regulator said on Wednesday.",
        "date": "04082015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC imposes $25 million fine on AT&T over customer data breach "
    },
    {
        "content": "NEW YORK  April 8 The Federal Communications Commission reached a $25 million settlement with AT&T Inc  over a consumer data breach at call centers in Mexico  Colombia and the Philippines  the U.S. communications regulator said on Wednesday.",
        "date": "04082015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-U.S. FCC imposes $25 mln fine on AT&T over customer data breach "
    },
    {
        "content": "SAO PAULO  April 1 With regional heavyweight Brazil less of a force in global capital markets this year  Mexican companies are filling the void by luring more investment in the form of mergers and acquisitions  bond and equity offerings.",
        "date": "04012015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "RPT-Mexico fills deal-making void left by Brazil in tough year "
    },
    {
        "content": "SAO PAULO  April 1 With regional heavyweight Brazil less of a force in global capital markets this year  Mexican companies are filling the void by luring more investment in the form of mergers and acquisitions  bond and equity offerings.",
        "date": "04012015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Mexico fills deal-making void left by Brazil in tough year "
    },
    {
        "content": "MEXICO CITY  March 19 A subsidiary of Mexican billionaire Carlos Slim's Grupo Financiero Inbursa  bank has entered two loan agreements for nearly $700 million  pledging America Movil stock as collateral  according to a filing published on Thursday.",
        "date": "03192015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "UPDATE 2-Carlos Slim bank unit pledges America Movil stock for new loans "
    },
    {
        "content": "NEW YORK  March 19 AT&T Inc was too late to appeal a $40 million loss in a  patent infringement case because its lawyers did not read key rulings in time  a federal appeals court said on Thursday.",
        "date": "03192015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. court rules AT&T's lawyers too late to appeal patent loss "
    },
    {
        "content": "WASHINGTON AT&T Inc's proposed acquisition of satellite television company DirecTV is getting a smooth ride from U.S. regulators and industry rivals  who instead are directing their firepower at a merger deal between the nation's two biggest cable operators. | Video ",
        "date": "03172015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T-DirecTV merger escapes heat as all eyes on Comcast "
    },
    {
        "content": "T-Mobile US Inc rolled out cellular and data plans for business customers  taking aim at a lucrative market segment long dominated by larger rivals AT&T Inc and Verizon Communications Inc.",
        "date": "03182015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "T-Mobile takes aim at business market with new cellular plans "
    },
    {
        "content": "March 18 T-Mobile US Inc rolled out cellular and data plans for business customers  taking aim at a lucrative market segment long dominated by larger rivals AT&T Inc and Verizon Communications Inc.",
        "date": "03182015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-T-Mobile takes aim at business market with new cellular plans "
    },
    {
        "content": "March 18 T-Mobile US Inc rolled out various promotions and cheap data plans for businesses to take away market share from larger rivals AT&T Inc and Verizon Communications Inc.",
        "date": "03182015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "T-Mobile rolls out promotions for businesses "
    },
    {
        "content": "American Express Co  said it will team up with seven U.S. companies  including Macy's Inc   AT&T Inc  and Exxon Mobil Corp   to launch a cross-brand loyalty program for the first time in the United States.",
        "date": "03182015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AmEx to launch its first cross-brand loyalty program in U.S. "
    },
    {
        "content": "March 18 American Express Co said it will team up with seven U.S. companies  including Macy's Inc   AT&T Inc and Exxon Mobil Corp  to launch a cross-brand loyalty program for the first time in the United States.",
        "date": "03182015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AmEx to launch its first cross-brand loyalty program in U.S. "
    },
    {
        "content": "March 18 American Express Co will team up with seven companies  including Macy's Inc  AT&T Inc  and Exxon Mobil Corp  to launch a loyalty program this spring  the Wall Street Journal reported.",
        "date": "03182015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AmEx to launch cross-brand loyalty program - WSJ "
    },
    {
        "content": "WASHINGTON  March 13 The U.S. Federal Communications Commission on Friday paused its informal 180-day countdown to deciding the fate of two mergers - Comcast Corp's  with Time Warner Cable Inc and AT&T Inc's  with DirecTV.",
        "date": "03132015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC pauses clock on Comcast-TWC  AT&T-DirecTV merger reviews "
    },
    {
        "content": "AT&T Inc  said it expected to take a charge of about $130 million in the current quarter  related to the voluntary retirement of nearly 3 000 employees by March 31.",
        "date": "03112015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T to take $130 million charge related to voluntary retirement "
    },
    {
        "content": "March 10 AT&T Inc said it expected to take a charge of about $130 million in the current quarter  related to the voluntary retirement of nearly 3 000 employees by March 31.",
        "date": "03112015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T to take $130 mln charge related to voluntary retirement "
    },
    {
        "content": "AT&T Inc  said it expected to take a charge of about $130 million in the current quarter  related to the voluntary retirement of nearly 3 000 employees by March 31.",
        "date": "03102015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T to take $130 million charge related to voluntary retirement "
    },
    {
        "content": "March 10 AT&T Inc said it expected to take a charge of about $130 million in the current quarter  related to the voluntary retirement of nearly 3 000 employees by March 31.",
        "date": "03102015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 1-AT&T to take $130 mln charge related to voluntary retirement "
    },
    {
        "content": "March 10 AT&T Inc said it expected to take a charge of about $130 million in the current quarter related to the voluntary retirement of nearly 3 000 employees by March 31.",
        "date": "03102015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to take $130 mln charge related to voluntary retirement "
    },
    {
        "content": "NEW YORK Apple Inc   the largest U.S. company by market value  will join the Dow Jones industrial average   replacing AT&T Inc   in a change that reflects the dominant position of the iPhone maker in the U.S. consumer economy. | Video ",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "At long last  Dow gets a taste for Apple "
    },
    {
        "content": "NEW YORK  March 6 Apple Inc  the largest U.S. company by market value  will join the Dow Jones industrial average  replacing AT&T Inc  in a change that reflects the dominant position of the iPhone maker in the U.S. consumer economy.",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 7-At long last  Dow gets a taste for Apple "
    },
    {
        "content": "* Indexes off: Dow 1.54 pct  S&P 1.42 pct  Nasdaq 1.11 pct   (Updates to close  adds comments)",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St ends lower as jobs data may bring rate hike sooner "
    },
    {
        "content": "* Indexes off: Dow 1.17 percent  S&P 1.1 percent  Nasdaq 0.88 percent   (Updates to afternoon trading  adds comments)",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St falls as strong jobs data may bring rate hike sooner "
    },
    {
        "content": "* Indexes off: Dow 1.17 percent  S&P 1.1 percent  Nasdaq 0.88 percent   (Updates to afternoon  adds comments)",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St falls after strong payrolls report "
    },
    {
        "content": "* Indexes off: Dow 0.88 pct  S&P 0.77 pct  Nasdaq 0.5 pct   (Updates to late morning  adds comments)",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St falls after payrolls; Apple to join Dow "
    },
    {
        "content": "U.S. chief executive officers are modestly more upbeat about the economy and almost half plan to increase capital spending over the next six months  a quarterly business group survey said on Tuesday.",
        "date": "03032015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "U.S. CEOs modestly more upbeat on economy  spending: survey "
    },
    {
        "content": "NEW YORK  March 6 Apple Inc  the largest U.S. company by market value  will join the storied Dow Jones industrial average  replacing AT&T Inc  in a change that reflects the dominant position of iPhone maker in the U.S. economy and society.",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "RPT-UPDATE 3-Apple to replace AT&T in Dow industrials "
    },
    {
        "content": "* Indexes off: Dow 0.5 pct  S&P 0.35 pct  Nasdaq 0.16 pct   (Updates to market open)",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St lower after payrolls; Apple to join Dow "
    },
    {
        "content": "NEW YORK AT&T Inc  will link its connected car and smart home technologies to bolster its foothold in the fast-growing market for Internet-connected devices  a new battleground for the company and rivals ranging from Verizon  to Google Inc .",
        "date": "03022015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T to hook up its automated home and connected car services "
    },
    {
        "content": "March 6 Apple Inc  the nation's largest company by market value  will join the Dow Jones Industrial Average on March 18  replacing AT&T Inc  S&P Dow Jones Indices said on Friday.    (Reporting By David Gaffen)",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Apple to replace AT&T in Dow industrials "
    },
    {
        "content": "BARCELONA Telecom network gear makers are on a collision course with Silicon Valley computing giants as software and cloud computing have begun to change the way operators from AT&T to China Mobile run their networks.",
        "date": "03062015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Computing  telecoms industries set on collision course "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 23 (Fitch) Fitch Ratings has assigned an 'A-' rating to AT&T  Inc.'s (AT&T) Euro note offering of senior unsecured debt  consisting of EUR1.25  billion 1.3% notes due 2023 and EUR1.25 billion of 2.45% notes due 2035. The  Rating Outlook is Stable.  Proceeds from this offering are expected to be used for general corporate  purposes  including the repayment of upcoming debt maturities. KEY RATING DRIVERS The rating and S",
        "date": "02232015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Fitch Rates AT&T'S Senior Unsecured Notes Offering 'A-'; Outlook Stable "
    },
    {
        "content": "Feb 19 Digital security company Gemalto NV  was hacked by American and British spies to steal encryption keys used to protect the privacy of cellphone communications  news website Intercept reported  citing documents provided by whistleblower Edward Snowden.",
        "date": "02192015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "NSA  British spies hack Gemalto to tap mobile calls - Intercept "
    },
    {
        "content": "Feb 20 AT&T Inc has urged the U.S. Federal Communications Commission to relook into bidding rules for spectrum  saying licenses should not go to \"speculators or stockpilers\".",
        "date": "02202015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T urges FCC to revisit spectrum bidding rules "
    },
    {
        "content": "PARIS  Feb 20 Gemalto said on Friday it would investigate a report saying that U.S. and British spies had hacked the digital security firm to steal its encryption keys.",
        "date": "02202015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "REFILE-Gemalto says investigating hacking report "
    },
    {
        "content": "Feb 3 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "02032015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO  Feb 2 AT&T Inc is selling some data centers worth about $2 billion as it continues its streak of asset sales  people familiar with the matter said on Monday.",
        "date": "02022015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to sell data centers worth $2 bln - sources "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO AT&T Inc is selling some data centers worth about $2 billion as it continues its streak of asset sales  people familiar with the matter said on Monday.",
        "date": "02022015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to sell data centers worth $2 billion: sources "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 29 (Fitch) Fitch Ratings has assigned an 'A' rating to AT&T  Inc.'s (AT&T) debt issue in Taiwan. AT&T's Issuer Default rating (IDR) is 'A'.  The company's IDR and debt securities remain on Rating Watch Negative  where  they were placed on May 19 upon the announcement of the acquisition of DIRECTV.  DIRECTV's wholly-owned indirect subsidiary  DIRECTV Holdings LLC  has an IDR of  'BBB-'. Proceeds from this offering are ex",
        "date": "01292015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Fitch Rates AT&T's Sr Unsecured Notes Offering 'A'; Remains on Negative Watch "
    },
    {
        "content": "WASHINGTON U.S. Federal Communications Commission on Thursday voted to propose a fine of about $600 000 for second-biggest wireless carrier AT&T Inc over violations of rules and requirements for operating some airwaves licenses.",
        "date": "01292015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "FCC proposes $600 000 fine for AT&T over license rules "
    },
    {
        "content": "SAN FRANCISCO AT&T Inc  on Tuesday posted a quarterly net loss that was slightly slimmer than Wall Street expected  as its mobile device deals attracted more customers  but its users switched to other networks at a higher rate.",
        "date": "01282015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T results beat Wall Street  shares rise after hours "
    },
    {
        "content": "WASHINGTON  Jan 29 U.S. Federal Communications Commission on Thursday voted to propose a fine of about $600 000 for second-biggest wireless carrier AT&T Inc over violations of rules and requirements for operating some airwaves licenses.",
        "date": "01292015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "U.S. FCC proposes $600 000 fine for AT&T over license rules "
    },
    {
        "content": "SAN FRANCISCO  Jan 27 AT&T Inc on Tuesday posted a quarterly net loss that was slightly slimmer than Wall Street expected  as its mobile device deals attracted more customers  but its users switched to other networks at a higher rate.",
        "date": "01282015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T results beat Wall Street  shares rise after hours "
    },
    {
        "content": "Jan 26 AT&T Inc said it will buy bankrupt NII Holdings Inc's wireless business in Mexico for $1.875 billion  less outstanding net debt.",
        "date": "01262015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T to buy NII Holdings' wireless business in Mexico "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO AT&T Inc  spent close to half the total in the record-setting U.S. sale of airwaves for mobile data  with Dish Network Corp  spending heavily to manage a surprise win at No.2 ahead of Verizon  results showed on Friday.",
        "date": "01302015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T top buyer at U.S. airwaves auction; Dish spends big "
    },
    {
        "content": "SAN FRANCISCO AT&T Inc  on Tuesday posted a quarterly net loss that was slightly slimmer than Wall Street expected  as its mobile device deals attracted more customers  but its users switched to other networks at a higher rate.",
        "date": "01272015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T results beat Wall Street  shares rise after hours "
    },
    {
        "content": "Jan 26 AT&T Inc said on Monday it would buy bankrupt NII Holdings Inc's wireless business in Mexico for $1.875 billion in a move to create a larger Mexican wireless player that will have a better chance of competing with No. 1 America Movil.",
        "date": "01262015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T to buy NII Holdings' wireless business in Mexico "
    },
    {
        "content": "SAN FRANCISCO  Jan 27 AT&T Inc on Tuesday posted a quarterly net loss that was slightly slimmer than Wall Street expected  as its mobile device deals attracted more customers  but its users switched to other networks at a higher rate.",
        "date": "01272015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 2-AT&T results beat Wall Street  shares rise after hours "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO  Jan 30 AT&T Inc  spent close to half the total in the record-setting U.S. sale of airwaves for mobile data  with Dish Network Corp  spending heavily to manage a surprise win at No.2 ahead of Verizon  results showed on Friday.",
        "date": "01302015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "UPDATE 3-AT&T top buyer at U.S. airwaves auction; Dish spends big "
    },
    {
        "content": "Jan 30 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "01302015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Indexes down: Dow 1.7 pct  S&P 1.3 pct  Nasdaq 1.9 pct   (Updates with results from Apple  AT&T and Yahoo)",
        "date": "01272015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "US STOCKS-Wall St falls 1 pct on earnings; Apple rallies late "
    },
    {
        "content": "WASHINGTON  Jan 30 AT&T Inc  Verizon Communications Inc and bidding partners of Dish Network Corp spent the most on the record-setting U.S. sale of wireless airwaves for mobile data  known as AWS-3  according to auction results released on Friday.",
        "date": "01302015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T  Verizon  Dish bid the most in U.S. airwaves auction "
    },
    {
        "content": "SAN FRANCISCO  Jan 26 Cablevision System Corp  said on Monday it would launch in February a wireless Internet phone service to give users an alternative to pricier data plans from cellular companies such as AT&T and Verizon.",
        "date": "01262015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Cablevision to launch WiFi phone service for data-hungry users "
    },
    {
        "content": "SAN FRANCISCO  Jan 27 AT&T Inc on Tuesday reported higher quarterly revenue  slightly above Wall Street forecasts.",
        "date": "01272015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T fourth-quarter revenue rises "
    },
    {
        "content": "NEW YORK  Jan 30 (IFR) - Microsoft's coveted Triple A rating could come into question and AT&T is likely to lose its Single A rating after both brand names outlined plans that could see their leverage surge.",
        "date": "01302015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Microsoft  AT&T risk ratings "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 27 (Fitch) Fitch Ratings does not anticipate taking an  immediate rating action associated with AT&T's plans to acquire the wireless  operations of NII Holdings  Inc. in Mexico (Nextel Mexico) for $1.875 billion   less the outstanding net debt of the business at closing.  The transaction is expected to close in mid-2015 following the approvals by the  U.S. Bankruptcy Court of the Southern District of New York and Mexico",
        "date": "01272015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Fitch: AT&T's Acquisition of Nextel Mexico to be Included in Existing Negative Watch "
    },
    {
        "content": "AT&T Inc said it expected to record charges of about $10 billion for the fourth quarter but the non-cash losses would not affect operating results.",
        "date": "01162015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T estimates charges of $10 billion in fourth quarter "
    },
    {
        "content": "Jan 16 AT&T Inc said it expected to record charges of about $10 billion for the fourth quarter but the non-cash losses would not affect operating results.",
        "date": "01162015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T estimates charges of $10 bln in fourth quarter "
    },
    {
        "content": "WASHINGTON Sprint Corp will keep investing in its networks even if U.S. regulators adopt stricter \"net neutrality\" rules as long as they are applied with a \"light touch \" the company said in a letter to the FCC released on Friday. | Video ",
        "date": "01162015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "Sprint says Obama net neutrality plan wouldn't curb investments "
    },
    {
        "content": "MEXICO CITY  Jan 16 AT&T said on Friday it had appointed company veteran F. Thaddeus Arroyo as the chief executive of Iusacell  Mexico's No.3 wireless carrier which it recently bought.",
        "date": "01162015",
        "name": "AT&T Inc",
        "news_type": "normal",
        "symbol": "T",
        "title": "AT&T appoints Arroyo as Iusacell CEO in Mexico "
    },
    {
        "content": "MEXICO CITY  Jan 8 Mexican broadcaster Grupo Televisa on Thursday said it sold its 50 percent stake in cellphone company Iusacell back to its joint-venture partner Grupo Salinas  paving the way for U.S. phone giant AT&T Inc to acquire Mexico's No. 3 phone company.",
        "date": "01092015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "Mexico's Televisa completes sale of its 50 pct stake in Iusacell "
    },
    {
        "content": "AT&T Inc said it would introduce a rollover data plan for some of its customers  less than a month after smaller rival T-Mobile US Inc launched its own plan.",
        "date": "01072015",
        "name": "AT&T Inc",
        "news_type": "topStory",
        "symbol": "T",
        "title": "AT&T launches rollover data plan "
    }
]