[
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 27 (Fitch) Fitch Ratings has affirmed The Toronto-Dominion Bank's (TD) Long- and Short-Term Issuer Default Ratings (IDRs) at 'AA-' and 'F1+'  respectively. The Rating Outlook is Stable. A full list of rating actions is at the end of this rating action commentary. This rating action follows Fitch's periodic review of the Canadian Banks Peer Group  which includes Bank of Montreal (BMO)  Bank of Nova Scotia (BNS)  Canadia",
        "date": "10272017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "Fitch Affirms The Toronto-Dominion Bank's Ratings at 'AA-/F1+'; Outlook Stable "
    },
    {
        "content": "* Entered into agreements with two-third party sellers to repurchase common shares through daily purchases",
        "date": "10042017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-Toronto-Dominion Bank announces intention to buy back common shares "
    },
    {
        "content": "* The Toronto-Dominion Bank amends its normal course issuer bid to repurchase for cancellation up to an additional 20 million of its common shares",
        "date": "09182017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-Toronto-Dominion Bank amends normal course issuer bid "
    },
    {
        "content": "* Toronto-Dominion Bank - ‍increased its prime lending rate by 25 basis points to 3.2 per cent  effective September 7  2017​ Source text for Eikon: Further company coverage:",
        "date": "09062017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-Td Canada Trust announces change to prime lending rate "
    },
    {
        "content": "* Toronto-Dominion Bank qtrly Canadian retail net income was $1 725 million  an increase of 14% from Q3 last year",
        "date": "08312017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-Toronto-Dominion Bank Group reports Q3 earnings per share C$1.46 "
    },
    {
        "content": "* TD Bank Group announces redemption of 4.644 percent fixed rate/floating rate subordinated notes issued by TD Bank  N.A.",
        "date": "08152017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD Bank Group announces redemption of 4.644 percent fixed rate/floating rate subordinated notes issued by TD Bank  N.A. "
    },
    {
        "content": "* Toronto-Dominion bank - ‍expects TD Ameritrade's Q3 earnings to translate into about CDN $122 million equity in net income of investment in TD Ameritrade for Q3​",
        "date": "07182017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD Bank Group comments on expected impact of TD Ameritrade Holding Corp's third quarter earnings "
    },
    {
        "content": "* Td Bank Group - entered agreement with group of underwriters to issue  on a bought deal basis  12 million series 16 shares at price of $25.00 per share",
        "date": "07052017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD BANK group to issue NVCC preferred shares "
    },
    {
        "content": "* Toronto-Dominion bank cfo says pleased there has been a cooling of housing market particularly in greater toronto area Further company coverage: (Reporting by Matt Scuffham)",
        "date": "05252017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD Bank CFO \"pleased\" by cooling of Toronto housing market "
    },
    {
        "content": "TORONTO  May 25 Toronto-Dominion Bank on Thursday reported second quarter results which were ahead of market expectations helped by a strong performance at its retail and investment banking businesses.",
        "date": "05252017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "UPDATE 1-Toronto-Dominion Bank's quarterly earnings beat market forecasts "
    },
    {
        "content": "* Q2 earnings per share view c$1.24 -- Thomson Reuters I/B/E/S",
        "date": "05252017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "BRIEF-TD Bank Group's Q2 revenue C$8.47 billion "
    },
    {
        "content": "TORONTO  May 25 Toronto-Dominion Bank on Thursday reported second quarter results which were ahead of market expectations helped by a strong performance at its retail and investment banking businesses.",
        "date": "05252017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "Toronto-Dominion Bank's quarterly earnings beat market forecasts "
    },
    {
        "content": "* TD bank group comments on expected impact of TD Ameritrade Holding Corp's second quarter earnings",
        "date": "04192017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD Bank comments on expected impact of TD Ameritrade Holding's Q2 earnings "
    },
    {
        "content": "* The Toronto-Dominion Bank announces intention to buy back common shares through specific share repurchase program in connection with normal course issuer bid",
        "date": "03292017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-Toronto-Dominion Bank announces intention to buy back common shares through specific share repurchase program in connection with normal course issuer bid "
    },
    {
        "content": "TORONTO  March 30 Toronto-Dominion Bank's chief executive officer told shareholders at the bank's annual meeting on Thursday that it does not have a \"widespread problem\" with its sales practices  responding to a report staffers were pressured to meet targets.",
        "date": "03302017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "Canada's TD Bank denies widespread problem with sales practices "
    },
    {
        "content": "TORONTO  March 30 Canada's main stock index pulled back from a one-month high on Thursday as deal-related news pressured shares of Cenovus Energy Inc and Canadian Imperial Bank of Commerce.",
        "date": "03302017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "CANADA STOCKS-TSX falls as deal news pressures Cenovus  CIBC "
    },
    {
        "content": "* The Toronto-Dominion Bank to repurchase for cancellation up to 15 million of its common shares",
        "date": "03162017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-Toronto-Dominion Bank to repurchase for cancellation up to 15 mln of its common shares "
    },
    {
        "content": "TORONTO  March 10 Canada's benchmark stock index slipped in afternoon trade on Friday  with shares in Toronto-Dominion Bank (TD) falling sharply after CBC News reported that employees of the bank were being pressured to meet high sales revenue goals  traders said.",
        "date": "03102017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "CANADA STOCKS-TSX turns lower as TD Bank and energy shares fall "
    },
    {
        "content": "* Toronto-Dominion bank - announced dividend of 60 cents per fully paid common share  an increase of five cents or 9 percent compared with last quarter  Source text for Eikon:  Further company coverage:",
        "date": "03022017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD Bank says qtrly dividend of 60 cents per fully paid share "
    },
    {
        "content": "TORONTO  March 2 Toronto-Dominion Bank reported quarterly earnings ahead of market expectations  helped by a strong performance by its retail banking businesses in the United States and Canada.",
        "date": "03022017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "TD reports first quarter earnings ahead of market expectations "
    },
    {
        "content": "* TD Bank Group announces intention to repurchase for cancellation up to 15 million of its common shares",
        "date": "03022017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "BRIEF-TD Bank Group says to repurchase for cancellation up to 15 mln shares "
    },
    {
        "content": "* Qtrly Canadian retail net income was $1 566 million  an increase of 4% compared with same quarter last year",
        "date": "03022017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "BRIEF-TD Bank Group reports Q1 adj earnings per share C$1.33 "
    },
    {
        "content": "* Td ceo says strategy to organically grow franchise in u.s.  will look at acquisition opportunities",
        "date": "01102017",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD would look at acquisitions in south-east of U.S. "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 28 (Fitch) Fitch Ratings has affirmed The Toronto-Dominion  Bank's (TD) Long- and Short-Term Issuer Default Ratings (IDRs) at 'AA-' and  'F1+'  respectively. The Rating Outlook is Stable. A full list of rating actions  is at the end of this rating action commentary.   This rating action follows Fitch's periodic review of the Canadian Banks Peer  Group  which includes Bank of Montreal (BMO)  Bank of Nova Scotia (BNS)   ",
        "date": "10282016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "Fitch Affirms The Toronto-Dominion Bank's Ratings at 'AA-/F1+'; Outlook Stable "
    },
    {
        "content": "* TD Bank announces redemption of 4.779% subordinated debentures",
        "date": "10272016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD Bank to redeem 4.779 pct subordinated debentures "
    },
    {
        "content": "* TD Bank Group comments on expected impact of TD Ameritrade Holding Corp's fourth quarter earnings",
        "date": "10242016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD Bank Group comments on expected impact of TD Ameritrade's Q4 results "
    },
    {
        "content": "* TD bank  America's most convenient bank CEO Mike Pedersen to retire",
        "date": "10272016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "BRIEF-TD Bank CEO Mike Pedersen to retire "
    },
    {
        "content": "* TD Ameritrade and Toronto-dominion bank are nearing deal to buy  scottrade financial services for $4 billion- source",
        "date": "10232016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD Ameritrade and Toronto-Dominion bank nearing deal to buy  Scottrade for $4 bln- source "
    },
    {
        "content": "* TD Ameritrade and Toronto-Dominion bank are nearing deal to buy online brokerage scottrade financial services for $4 billion- Bloomberg  citing sources",
        "date": "10232016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "BRIEF-TD Ameritrade and TD Bank nearing deal to buy Scottrade Financial for $4 bln- Bloomberg  citing sources "
    },
    {
        "content": "TORONTO  Sept 15 Toronto Dominion Bank  has sold home improvement financing assets to financial technology company Financeit and Concentra  a provider of services to credit unions  the buyers said on Thursday.",
        "date": "09152016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "TD sells home improvement financing assets "
    },
    {
        "content": "* Size of preferred share offering increased to 40 million Series 14 shares",
        "date": "08292016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-Toronto-Dominion bank's size of preferred share offering increased to 40 mln Series 14 shares "
    },
    {
        "content": "* Toronto-Dominion Bank - qtrly common equity Tier 1 capital ratio on a Basel III fully phased-in basis was 10.4 pct  compared with 10.1 pct last quarter",
        "date": "08252016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-TD Bank Group reports Q3 adj. earnings per share C$1.27 "
    },
    {
        "content": "* Toronto-dominion Bank files for mixed shelf of up to $40 billion - sec filing  Source text:  http://1.usa.gov/1ZbhGWs Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "05312016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-Toronto-Dominion Bank files for mixed shelf of up to $40 bln "
    },
    {
        "content": "May 26 Toronto-Dominion Bank  Canada's second-biggest lender  reported a 10.4 percent rise in quarterly profit on Thursday  helped by growth in its retail banking business.",
        "date": "05262016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "UPDATE 1-Toronto-Dominion Bank's quarterly profit rises 10.4 pct "
    },
    {
        "content": "May 26 Toronto-Dominion Bank  Canada's second-biggest lender  reported a 10.4 percent rise in quarterly profit on Thursday  helped by growth in its retail banking business.",
        "date": "05262016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "Toronto-Dominion Bank's quarterly profit rises 10.4 pct "
    },
    {
        "content": "* Dominion bank - q2 return on common equity (adjusted) 14.0 percent versus 15 percent",
        "date": "05262016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "BRIEF-TD Bank Group Q2 adjusted earnings per share C$1.20 "
    },
    {
        "content": "TORONTO  March 31 Toronto Dominion Bank  Canada's second biggest bank  said on Thursday that it expected losses from bad loans in the oil & gas sector to be manageable given its relatively small exposure to the energy sector.",
        "date": "03312016",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "Canada's TD Bank confident oil & gas loan losses will be \"manageable\" "
    },
    {
        "content": "* CEO says growth focus in USA is in major metropolitan areas - BBG TV interview  Further company coverage:    (Reporting By Rod Nickel)",
        "date": "12112015",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "BRIEF-Toronto-Dominion Bank CEO says US growth focus on major cities "
    },
    {
        "content": "May 26 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "05262015",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "TORONTO  May 26 Toronto Dominion Bank  said on Tuesday it will acquire Nordstrom's U.S. consumer credit card portfolio as the Canadian bank looks to use its strong balance sheet to expand its lending business in the United States.",
        "date": "05262015",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "normal",
        "symbol": "TD",
        "title": "TD Bank to buy Nordstrom's U.S. consumer credit card portfolio "
    },
    {
        "content": "where assigned  and hit the newskey (F9 on Reuters terminals)",
        "date": "04172015",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "New Issue- Toronto-Dominion Bank prices 1.25 bln euro 2022 bond "
    },
    {
        "content": "Guarantor               TD Covered Bond (Legislative) Guarantor Partnership",
        "date": "04082015",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "New Issue- Toronto-Dominion Bank  prices 500 mln stg  2018 FRN "
    },
    {
        "content": "March 26 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "03262015",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Feb 26 Toronto-Dominion Bank   Canada's second-largest lender  reported a higher quarterly net profit on Thursday  helped by its retail banking business.",
        "date": "02262015",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "CORRECTED-Toronto-Dominion Bank posts higher quarterly profit "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 23 (Fitch) Fitch Ratings has affirmed The Toronto-Dominion  Bank's (TD) Long and Short-term Issuer Default Ratings (IDRs) at 'AA-' and 'F1+'  respectively. The Rating Outlook is Stable.  This rating action follows a periodic review of the Canadian Banking sector.  Fitch will publish the main findings of this review in a report 'Canadian Banks:  Nearing a Tipping Point' available at www.fitchratings.com KEY RATING DRIVE",
        "date": "01232015",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "Fitch Affirms The Toronto-Dominion Bank's Ratings at 'AA-/F1+'; Outlook Stable "
    },
    {
        "content": "Listing                 London Stock Exchange's regulated market",
        "date": "01142015",
        "name": "Toronto Dominion Bank (The)",
        "news_type": "topStory",
        "symbol": "TD",
        "title": "New Issue- TD prices 500 mln stg 2018 FRN "
    }
]