[
    {
        "content": "VANCOUVER Teck Resources Ltd  has held talks with Dominic Barton  the global managing partner of consulting firm McKinsey & Co  about becoming the Canadian miner's next chairman  replacing Norman Keevil  two people familiar with the matter told Reuters.",
        "date": "11152017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "Exclusive: Miner Teck taps McKinsey boss Barton for chairman role - sources "
    },
    {
        "content": "* Expects \"very strong\" Q4 industry benchmark price for steelmaking coal - chief executive donald lindsay",
        "date": "10262017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck CEO expects \"very strong\" Q4 benchmark coal price "
    },
    {
        "content": "* Teck receives regulatory approval for share buy-back program",
        "date": "10052017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck receives regulatory approval for share buy-back program "
    },
    {
        "content": "* Teck increases Red Dog production guidance and updates exploration results in the Red Dog district",
        "date": "09182017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck increases production guidance for its Red Dog operation "
    },
    {
        "content": "* Signing of a participation agreement for Teck's proposed frontier oil sands project​",
        "date": "09152017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck Resources says co  Metis Local 1909 sign project agreement "
    },
    {
        "content": "VANCOUVER A unit of Chinese sovereign wealth fund China Investment Corp (CIC)  a cornerstone shareholder of Teck Resources Ltd  has sold around 41.5 percent of its stake in the Canadian miner  Teck said on Tuesday  sending its shares tumbling.",
        "date": "09052017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "Canadian miner Teck slumps as China's CIC fund sells partial stake "
    },
    {
        "content": "Canadian miner Teck Resources Ltd  on Wednesday raised its forecast for sales volumes of its steelmaking coal in the third quarter  and also said it expects to realize an average price of around $158 to $163 a ton.",
        "date": "09062017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "Miner Teck raises third-quarter coal sales volume forecast "
    },
    {
        "content": "VANCOUVER  Sept 5 A unit of Chinese sovereign wealth fund China Investment Corp (CIC)  a cornerstone shareholder of Teck Resources Ltd  has sold around 41.5 percent of its stake in the Canadian miner  Teck said on Tuesday  sending its shares tumbling.",
        "date": "09052017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "UPDATE 2-Canadian miner Teck slumps as China's CIC fund sells partial stake "
    },
    {
        "content": "* Teck Resources - ‍China Investment Corp advised that Unit Fullbloom Investment Corp sold in private transaction 42 million Class B subordinate voting shares",
        "date": "09052017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck Resources says China Investment Corp's unit sold 42 million Class B subordinate voting shares of Teck "
    },
    {
        "content": "Sept 6 Canadian miner Teck Resources Ltd on Wednesday raised its forecast for sales volumes of its steelmaking coal in the third quarter  and also said it expects to realize an average price of around $158 to $163 a tonne.",
        "date": "09062017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "UPDATE 1-Miner Teck raises 3rd-qtr coal sales volume forecast "
    },
    {
        "content": "Sept 6 Teck Resources Ltd said it expected lower average realized prices on the sale of steelmaking coal for the third quarter.",
        "date": "09062017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "Teck expects lower steelmaking coal prices in Q3 "
    },
    {
        "content": "Sept 5 A unit of China Investment Corp (CIC) has sold 42 million class B voting shares of Teck Resources Ltd   equal to 7.26 percent of all outstanding Teck shares  in a private transaction  the Canadian miner said on Tuesday.",
        "date": "09052017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "CIC sells part of stake in Canada's Teck Resources "
    },
    {
        "content": "* Teck updates steelmaking coal guidance Source text for Eikon: Further company coverage:",
        "date": "09062017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck updates steelmaking coal guidance "
    },
    {
        "content": "* United Steelworkers says has voted 84.5 percent in favour of ratifying a new agreement with Teck Resources Ltd",
        "date": "08102017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-United Steelworkers ratify a new agreement with Teck Resources "
    },
    {
        "content": "* Says BC Hydro has exercised its right of first offer to acquire Teck's two-thirds interest in Waneta dam",
        "date": "08022017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Fortis says purchase agreement between co and Teck has been terminated "
    },
    {
        "content": "* Teck Resources Ltd - BC Hydro has exercised right of first offer to buy co's two-thirds interest in Waneta dam  British Columbia  Canada  for $1.2 billion cash",
        "date": "08022017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck Resources provides update on Waneta dam sale "
    },
    {
        "content": "July 27 Teck Resources Ltd is interested in expanding its sales of steelmaking coal to India  company officials said on Thursday  as the Canadian miner reported quarterly earnings that beat market expectations  lifting its shares.",
        "date": "07272017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "REFILE-UPDATE 2-Canada's Teck Resources keen to expand coal sales to India "
    },
    {
        "content": "* Teck Resources CEO says no tempting acquisition targets out there  company focusing on internal projects such as QB2",
        "date": "07272017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck Resources CEO sees no tempting acquisition targets "
    },
    {
        "content": "July 27 Canada's Teck Resources Ltd   the world's second-biggest shipper of steelmaking coal  reported a surge in second-quarter profit on Thursday compared to a year ago  aided by higher coal prices and sales.",
        "date": "07272017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "Teck Resources second-quarter profit jumps to C$577 mln "
    },
    {
        "content": "* Teck resources ltd says expect our steelmaking coal sales to reach at least 7.0 million tonnes in q3",
        "date": "07272017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck says Q2 profit attributable to shareholders $577 mln "
    },
    {
        "content": "NEW DELHI India is in talks with Canada's Teck Resources Ltd   the largest North American producer of coking coal used to make steel  for long-term purchase agreements after a cyclonic disruption in Australia cut supplies earlier this year.",
        "date": "07082017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "India in talks with Canada's Teck Resources to buy coking coal: sources "
    },
    {
        "content": "TORONTO Teck Resources Ltd  shares fell nearly 4 percent on Thursday after the diversified Canadian miner clipped its forecast of the average realized price for its steelmaking coal in the second quarter  citing sales disruptions.",
        "date": "06152017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "Teck lowers forecast for steelmaking coal price  shares drop "
    },
    {
        "content": "TORONTO  June 15 Teck Resources Ltd shares fell nearly 4 percent on Thursday after the diversified Canadian miner clipped its forecast of the average realized price for its steelmaking coal in the second quarter  citing sales disruptions.",
        "date": "06152017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "UPDATE 1-Teck lowers forecast for steelmaking coal price  shares drop "
    },
    {
        "content": "June 15 Teck Resources Ltd on Thursday forecast a drop in its average realized price from sale of steelmaking coal for the second quarter  sending its shares down nearly 4 percent in late afternoon trading.",
        "date": "06152017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "Teck forecasts drop in quarterly price for steelmaking coal "
    },
    {
        "content": "* Teck Resources Ltd - now expects its Q2 average realized coal price to be between US$160 and US$165 per tonne",
        "date": "06152017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck updates steelmaking coal guidance "
    },
    {
        "content": "* Teck announces redemption of us$214 million principal amount of notes",
        "date": "06022017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck reports redemption of $214 mln principal amount of notes "
    },
    {
        "content": "VANCOUVER  May 24 Canadian miner Teck Resources does not expect a material impact on production at its Highland Valley copper unit because of unusual spring weather earlier in May  a spokesman said on Wednesday.",
        "date": "05242017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "Teck Resources says does not expect snow melt to materially affect copper mine "
    },
    {
        "content": "VANCOUVER  May 8 Teck Resources Ltd is still mining some parts of the Lornex and Valley pits of its Highland Valley Copper operation in Western Canada after water inflow resulted in a suspension of some work in those areas  it said on Monday.",
        "date": "05082017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "Teck continues to mine parts of waterlogged Highland Valley pits "
    },
    {
        "content": "TORONTO  May 12 Canada's main stock index gained in early trade on Friday  helped by gains for mining stocks including Teck Resources  which will raise C$1.2 billion ($876 million) in an asset sale.",
        "date": "05122017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "CANADA STOCKS-TSX rises with resource stocks  Teck shines "
    },
    {
        "content": "* Teck Resources -unusual spring weather conditions   rapid snow melt have resulted in water inflow into Lornex and valley pits at Highland Valley Copper operations",
        "date": "05082017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck Resources says mining has been temporarily suspended in affected areas "
    },
    {
        "content": "May 12 Canadian utility Fortis Inc said on Friday it would will buy Teck Resources Ltd's two-thirds stake in the Waneta dam in British Columbia as well as any related transmission assets for C$1.2 billion ($875 million) in cash.",
        "date": "05122017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "Fortis to buy Teck Resources' stake in British Columbia dam for $875 mln "
    },
    {
        "content": "* Fortis inc- teck expects to realize a net book gain of approximately $800 million on the closing of the transaction",
        "date": "05122017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Fortis and Teck announce Waneta Dam agreement "
    },
    {
        "content": "CALGARY  Alberta  April 27 Suncor Energy Inc   Canada's largest energy producer  is still evaluating opportunities for oil sands acquisitions in northern Alberta as foreign oil majors exit the high-cost region  Chief Executive Steve Williams said on Thursday.",
        "date": "04272017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "UPDATE 1-Suncor evaluates potential oil-sand deals as global majors exit "
    },
    {
        "content": "TORONTO  April 26 Teck Resources Ltd said on Wednesday that it will double its dividend payout and consider a supplemental dividend annually  based on the diversified miner's free cash flow  capital priorities and business conditions.",
        "date": "04262017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "Teck doubles dividend payout  adopts new policy "
    },
    {
        "content": "* Board will look at dividend policy at April board meeting  possibly June meeting too - CEO Donald Lindsay",
        "date": "04252017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck CEO says second-quarter outlook \"very solid\" "
    },
    {
        "content": "* Teck Resources - initial eligible dividend of $0.10 per share on its outstanding class A common shares and class B subordinate voting shares Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck doubles dividend and announces dividend policy "
    },
    {
        "content": "TORONTO Teck Resources Ltd    North America's largest producer of steelmaking coal  reported earnings and revenue that lagged expectations on weakness at its zinc unit  sending its U.S.-listed shares down about 6 percent.",
        "date": "04252017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "Teck Resources profit misses estimates as costs rise  shares slip "
    },
    {
        "content": "TORONTO  April 25 Teck Resources Ltd   North America's largest producer of steelmaking coal  reported earnings and revenue that lagged expectations on weakness at its zinc unit  sending its U.S.-listed shares down about 6 percent.",
        "date": "04252017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "UPDATE 2-Teck Resources profit misses estimates as costs rise  shares slip "
    },
    {
        "content": "* Expecting coal sales in Q2 of 2017 to be at least 6.8 million tonnes",
        "date": "04252017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck says qtrly profit attributable to shareholders $0.99 "
    },
    {
        "content": "April 25 Canada's Teck Resources Ltd   North America's largest producer of steelmaking coal  reported a surge in first-quarter profit on Tuesday  lifted by significantly higher prices for the commodity  and increased prices of zinc and copper.",
        "date": "04252017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "Canada's Teck Resources first-quarter profit jumps "
    },
    {
        "content": "* Teck Resources - Caisse de depot et placement tendered 1.6 million class A shares of co for conversion into same number of class B subordinate voting shares Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck resources says Caisse de depot et placement tendered 1.6 million class A shares of co for conversion into same number of class B subordinate voting shares "
    },
    {
        "content": "TORONTO  April 3 Canada's main stock index opened higher on Monday with Toronto-Dominion Bank and Teck Resources Ltd leading broad gains across most sectors.",
        "date": "04032017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "CANADA STOCKS-TSX opens higher as TD  Teck Resources lead broad gains "
    },
    {
        "content": "* Teck Resources Ltd - steelmaking coal sales volumes for q2 of 2017 are expected to be at least 6.8 million tonnes",
        "date": "03292017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck Resources says reconfirms annual production guidance "
    },
    {
        "content": "* Teck Resources Ltd - has subscribed for and acquired additional 543 478 shares of Erdene Resource Development Corpat a cost of $0.92 per common share  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck announces subscription to Erdene Placement "
    },
    {
        "content": "* Teck announces cash tender offers and consent solicitations",
        "date": "02222017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck announces cash tender offers and consent solicitations "
    },
    {
        "content": "* Teck increasing interest in deep-south to 35pct through asset sale",
        "date": "02162017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF- Teck to sell its 70pct interest in Haib Minerals to Deep-South Resources Inc "
    },
    {
        "content": "TORONTO/VANCOUVER Canadian miner Teck Resources Ltd  reported a better-than-expected quarterly profit on Wednesday  lifted by a surge in the price of coal for steelmaking  but weaker demand at the start of the year spooked investors  sending its shares lower.",
        "date": "02152017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "Teck shares slide on coal demand woes despite earnings beat "
    },
    {
        "content": "TORONTO/VANCOUVER  Feb 15 Canadian miner Teck Resources Ltd reported a better-than-expected quarterly profit on Wednesday  lifted by a surge in the price of coal for steelmaking  but weaker demand at the start of the year spooked investors  sending its shares lower.",
        "date": "02152017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "UPDATE 3-Teck shares slide on coal demand woes despite earnings beat "
    },
    {
        "content": "Feb 15 Teck Resources Ltd  North America's largest producer of steel-making coal  reported a profit  compared to a year-ago loss  when it recorded one-time charges of C$536 million.",
        "date": "02152017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "CORRECTED-Teck Resources posts quarterly profit after year-ago loss "
    },
    {
        "content": "* Teck reports unaudited fourth quarter results for 2016  Source text for Eikon:  Further company coverage:",
        "date": "02152017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck reports unaudited fourth quarter results for 2016 "
    },
    {
        "content": "* Record q4 adjusted profit attributable to shareholders of $930 million  or $1.61 per share",
        "date": "02152017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "BRIEF-Teck Resources reports Q4 pofit attributable to shareholders of $1.21/share "
    },
    {
        "content": "* Teck Resources- Suncor provided an update regarding its recently completed review of schedule  project costs and throughput",
        "date": "02092017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck updates Fort Hills guidance "
    },
    {
        "content": "SYDNEY  Feb 2 After years of cutting budgets and squeezing existing mines  global mining giants are again scouting for new deposits: industry analysts say 2017 will see the first increase in spending on exploration in five years.",
        "date": "02012017",
        "name": "Teck Resources Ltd",
        "news_type": "normal",
        "symbol": "TECK",
        "title": "Ending years of cuts  miners are exploring again - cautiously "
    },
    {
        "content": "* Teck Resources Ltd - Fort Mckay Métis  co announced signing of participation agreement for Teck's proposed frontier oil sands project  Source text for Eikon:  Further company coverage:",
        "date": "01302017",
        "name": "Teck Resources Ltd",
        "news_type": "topStory",
        "symbol": "TECK",
        "title": "BRIEF-Teck Resources Ltd & Fort Mckay Métis announced signing of participation agreement for Teck's proposed frontier oil sands project "
    }
]