[
    {
        "content": "GUATEMALA CITY  Nov 12 The Guatemalan unit of telecommunications firm Telefonica SA suspended its customer service operations and closed its shops over the weekend after three of its employees were shot to death in the Central American nation.",
        "date": "11132017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica suspends customer service operations in Guatemala after killings "
    },
    {
        "content": "* SAID ON MONDAY KKR HAD EXERCISED THE CALL OPTION OVER 38 MILLION SHARES OF TELXIUS (REPRESENTING 15.2 PERCENT OF ITS SHARE CAPITAL) FOR 484.5 MILLION EUROS (12.75 EUROS PER SHARE)",
        "date": "11142017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica says KKR exercises call option for 15.2 pct of Telxius "
    },
    {
        "content": "* Buoyant commercial trends in Spain not translating into profit",
        "date": "10262017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 1-Telefonica core profit falls as Spanish market weighs "
    },
    {
        "content": "MADRID  Oct 26 Spanish telecoms group Telefonica on Thursday posted a 1.9 fall in third-quarter core profit from a year earlier  below forecasts after a disappointing performance in its home market and negative currency effects in Britain and Latin America.",
        "date": "10262017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica posts 1.9 pct fall in Q3 core profit "
    },
    {
        "content": "* SAYS REITERATED ITS GUIDANCE AND DIVIDEND ANNOUNCED FOR 2017 Source text for Eikon:",
        "date": "10262017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica Q3 net profit at 839 mln euros "
    },
    {
        "content": "* SAYS TRANSFERS TO KKR 62 MILLION SHARES OF TELXIUS (24.8 PCT OF ITS SHARE CAPITAL) IN EXCHANGE FOR 790.5 MILLION EUROS",
        "date": "10242017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica closes sale of 24.8 pct in Telxius for 790.5 mln euros "
    },
    {
        "content": "Oct 20 Experimental communications balloons provided by Alphabet Inc in collaboration with AT&T Inc will allow some of the carrier's customers in storm-ravaged Puerto Rico to send texts and access critical information on the internet  Alphabet said on Friday.",
        "date": "10202017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Alphabet balloon project to provide limited internet in Puerto Rico "
    },
    {
        "content": "* Says has issued 154 326 696 new shares representing 2.9723 pct of its share capital in order to attend conversion of bonds into shares",
        "date": "09202017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica hikes capital 3 pct to convert bonds into shares "
    },
    {
        "content": "MEXICO CITY  Sept 7 Telefonica  the Spanish telecoms giant which has long struggled to gain traction in Mexico  is appealing to Mexican officials for a discount on spectrum payments coming due next year  three people with knowledge of the matter said.",
        "date": "09072017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Facing spectrum payments  Telefonica lobbies Mexico for a discount "
    },
    {
        "content": "MADRID Telefonica's  Colombian division plans to raise about 1.8 billion euros ($2.15 billion) in fresh capital to reduce  debt and pay a fine linked to a local dispute  the Spanish telecoms company said on Wednesday.",
        "date": "08302017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica's Colombian unit to raise 1.8 billion euros to repay debt  fine "
    },
    {
        "content": "MADRID  Aug 30 Telefonica's Colombian division plans to raise about 1.8 billion euros ($2.15 billion) in fresh capital to reduce  debt and pay a fine linked to a local dispute  the Spanish telecoms company said on Wednesday.",
        "date": "08302017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Telefonica's Colombian unit to raise 1.8 bln euros to repay debt  fine "
    },
    {
        "content": "MADRID  Aug 30 Telefonica's Colombian division plans to raise about 1.8 billion euros ($2.15 billion) in fresh capital to reduce  debt and pay a fine linked to a local dispute  the Spanish telecoms company said on Wednesday.",
        "date": "08302017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica's Colombian unit to raise 1.8 bln euros to repay debt  fine "
    },
    {
        "content": "* SAYS COLOMBIA TELECOMUNICACIONES (COLTEL) TO INCREASE CAPITAL BY ABOUT 1.37 BILLION EUROS TO PAY DEBT",
        "date": "08302017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica to subscribe to ColTel's capital increase to settle PARAPAT debt "
    },
    {
        "content": "* Spain's Telefonica no longer holds shares in the Italian phone group after the expiry of a convertible bond  a filing by Italian market regulator Consob shows Further company coverage: (Reporting by Milan newsroom)",
        "date": "07252017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica no longer holds shares in Telecom Italia - filing "
    },
    {
        "content": "* THE AMOUNT ESTABLISHED IN ARBITRATION AWARD AFFECTING COLOMBIA TELECOMUNICACIONES SA ESP (COLTEL) AND OTHER TELECOMMUNICATIONS OPERATOR IN COLOMBIA IS ABOUT 469.5 MILLION EUROS FOR COLTEL‍​",
        "date": "07272017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica says arbitration award at about 469.5 mln euros for Colombia Telecomunicaciones "
    },
    {
        "content": "* Says it has named chief financial officer Angel Vila Boix as the new chief operating officer Further company coverage: (Reporting by Madrid Newsroom)",
        "date": "07252017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica names CFO Angel Vila as new COO "
    },
    {
        "content": "* INFORMS ABOUT THE RESOLUTION OF ARBITRATION PROCEEDINGS IN COLOMBIA",
        "date": "07272017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica informs about the resolution of arbitration proceedings in Colombia "
    },
    {
        "content": "MADRID  July 27 Spanish telecoms firm Telefonica on Thursday lifted its revenue target for 2017 after its second-quarter earnings beat analysts' forecast  helped by a buoyant Latin American business that more than offset persistent weakness in Spain.",
        "date": "07272017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Telefonica lifts revenue target despite Spanish weakness "
    },
    {
        "content": "MADRID  July 26 Spanish telecoms firm Telefonica on Thursday lifted its revenue target for 2017 after its second-quarter earnings beat analysts' forecast  helped by a buoyant Latin American business which more than offset persistent weakness in Spain.",
        "date": "07272017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica lifts revenue target despite Spanish weakness "
    },
    {
        "content": "* H1 NET SALES 26.09 BILLION EUROS VERSUS 25.24 BILLION EUROS YEAR AGO",
        "date": "07272017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica H1 net profit rises to 1.60 bln euros; upgrades guidance "
    },
    {
        "content": "MEXICO CITY America Movil  the telecommunications company of Mexican tycoon Carlos Slim  and Movistar  the Colombian unit of Spain's Telefonica SA  may not have to pay any compensation while legal action in Colombia is under review  a government minister said on Wednesday.",
        "date": "07272017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Shares in Slim's America Movil shrug off Colombian order to pay $1 billion "
    },
    {
        "content": "* Says Elevenpaths  Telefonica Cybersecurity unit and Subex sign a global framework agreement​ Source text for Eikon: Further company coverage:",
        "date": "07192017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Subex  ‍Elevenpaths  Telefonica Cybersecurity sign global framework agreement​ "
    },
    {
        "content": "MILAN Italian broadcaster Mediaset  said on Monday it had acquired an 11.1 percent stake in its pay-TV unit Mediaset Premium from Spanish telephone group Telefonica .",
        "date": "06192017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Mediaset owns all pay TV unit after acquiring Telefonica stake "
    },
    {
        "content": "MILAN  June 19 Italian broadcaster Mediaset said on Monday it had acquired an 11.1 percent stake in its pay-TV unit Mediaset Premium from Spanish telephone group Telefonica.",
        "date": "06192017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Mediaset owns all pay TV unit after acquiring Telefonica stake "
    },
    {
        "content": "MILAN Spain's Telefonica  will get part of any damages Italian broadcaster Mediaset may receive from Vivendi  in an ongoing legal spat in exchange for its stake in pay TV unit Mediaset Premium  a source close to the matter said on Monday.",
        "date": "06192017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica to get part of damages Mediaset may be awarded in Vivendi spat for Premium stake: source "
    },
    {
        "content": "MILAN  June 19 Spain's Telefonica will get part of any damages Italian broadcaster Mediaset may receive from Vivendi in an ongoing legal spat in exchange for its stake in pay TV unit Mediaset Premium  a source close to the matter said on Monday.",
        "date": "06192017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica to get part of damages Mediaset may be awarded in Vivendi spat for Premium stake - source "
    },
    {
        "content": "MILAN  June 19 Italian broadcaster Mediaset said on Monday it had bought an 11.1 percent stake in its pay TV unit Mediaset Premium from Spanish telephone group Telefonica.",
        "date": "06192017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Mediaset buys Telefonica stake in Premium TV unit "
    },
    {
        "content": "* SAYS SIGNS AGREEMENT FOR RENEWABLE ELECTRICITY SUPPLY IN 2018 WITH ACCIONA",
        "date": "06082017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica and Acciona sign renewable electricity supply agreement "
    },
    {
        "content": "June 9 Chairman of Spain's Telefonica  Jose Maria Alvarez-Pallete:",
        "date": "06092017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Chairman of Telefonica says still considering potential IPO of UK's O2 "
    },
    {
        "content": "MADRID  June 6 Spain's telecom firm Telefonica on Tuesday launched Movistar Money  a consumer loans service available in its Spanish home market  in a move into online financial services aimed at diversifying its sources of revenue.",
        "date": "06062017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spain's Telefonica moves into online financial services "
    },
    {
        "content": "A global cyber attack on Friday infected computers at businesses  healthcare facilities and other organizations in dozens of countries  disrupting operations at some facilities.",
        "date": "05132017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Carmakers  hospitals  others disrupted by global cyber attack "
    },
    {
        "content": "MADRID Spain said on Friday a large number of companies  including telecommunications giant Telefonica   had been infected with malicious software known as \"ransomware\" which locks up computers and demands ransoms. | Video ",
        "date": "05122017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica  other Spanish firms hit in \"ransomware\" attack "
    },
    {
        "content": "* Shares down 3 percent (Adds CEO comments on Spanish business)",
        "date": "05112017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 2-Telefonica's profits rise but Spanish business disappoints "
    },
    {
        "content": "MADRID  May 12 Spain said on Friday a large number of companies  including telecommunications giant Telefonica  had been infected with malicious software known as \"ransomware\" which locks up computers and demands ransoms.",
        "date": "05122017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "CORRECTED-UPDATE 2-Telefonica  other Spanish firms hit in \"ransomware\" attack "
    },
    {
        "content": "MADRID  May 11 Spanish telecoms group Telefonica on Thursday posted a 4.8 percent rise in first-quarter core profit thanks to a recovering Brazilian real which more than offset a weaker performance in Spain and Germany.",
        "date": "05112017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica Q1 Oibda up 4.8 pct as Brazil currency recovers "
    },
    {
        "content": "BRUSSELS  May 8 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05082017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "EU mergers and takeovers (May 8) "
    },
    {
        "content": "MADRID  May 4 Spain's Telefonica said on Thursday it was reducing the size of its board and that former chairman Cesar Alierta would stand down as part of the revamp.",
        "date": "05042017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Former Telefonica chief Alierta to leave board "
    },
    {
        "content": "April 24  Comision Nacional de los Mercados y la Competencia (CNMC):",
        "date": "04242017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's competition authority fines Telefonica 3 mln euros - CNMC "
    },
    {
        "content": "MEXICO CITY  April 20 Mexican broadcaster Televisa said on Thursday it had signed a deal with Spanish telecoms giant Telefonica that would give the mobile operator's customers cheaper access to the broadcaster's content carried on its digital platform Blim.",
        "date": "04202017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Mexico's Televisa signs deal with Telefonica to distribute content "
    },
    {
        "content": "* Says its unit Ezentis Argentina wins 117.7 million euro ($124.6 million) deal from Telefonica Argentina for installation and maintenance of telecommunications network Source text for Eikon:",
        "date": "04102017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Grupo Ezentis wins 117.7 mln euro deal from Telefonica Argentina "
    },
    {
        "content": "* Says its unit Ezentis Colombia has been awarded by Telefonica Colombia a four year contract in Bogota  Colombia for about 17.5 million euros ($18.7 million) Source text for Eikon:",
        "date": "04062017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Grupo Ezentis wins four year contract in Colombia for 17.5 mln euros "
    },
    {
        "content": "* Jan-Dec profit reached HK$33.01 billion vs HK$32 bln f'cast",
        "date": "03222017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 2-Profits rise 6 pct at Li Ka-shing's CK Hutchison  beats forecast "
    },
    {
        "content": "* Says Ferrovial chooses Telefonica as communications provider for the next five years",
        "date": "03212017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Ferrovial chooses Telefonica as communications provider for the next five years "
    },
    {
        "content": "* Telefonica and Vodafone sign a commercial agreement for wholesale access to optic fiber network",
        "date": "03162017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica to grant Vodafone access to its optic fiber network "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  March 10 (Fitch) This commentary replaces the version published on 5  September 2016 to include the senior unsecured notes issued by Telefonica  Participaciones  S.A.U in the full list of rating actions. There is no change to  Telefonica SA's Long-Term Issuer Default Rating and senior unsecured rating of  'BBB/Stable'. The original rating action commentary with the correction is  presented below. Fitch Ratings has downgraded Tel",
        "date": "03102017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Fitch Corrects Telefonica September 2016 Commentary "
    },
    {
        "content": "* Enters share swap deal with Koninklijke KPN NV under which it transfers 72.0 million of its own treasury shares (1.43 percent of its share capital) in exchange for 178.5 million shares of Telefonica Deutschland Holding AG (6.0 percent of its share capital)",
        "date": "03132017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica increases stake in Telefonica Deutschland to 69.2 pct "
    },
    {
        "content": "March 8 Comision Nacional de los Mercados y la Competencia:",
        "date": "03082017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's competition authority fines Telefonica with 3 mln euros - CNMC "
    },
    {
        "content": "* Signs global framework agreement with Telefonica Group  for geolocation  Source text for Eikon:  Further company coverage:   (Gdynia Newsroom)",
        "date": "03012017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Astellia signs framework agreement with Telefonica for geolocation "
    },
    {
        "content": "BARCELONA  Feb 27 The brave new world of remote-controlled cars is now technically possible using wireless technologies which are set to be commonplace early in the next decade  two major telecoms companies said at a test drive staged on Monday during an industry conference in Barcelona.",
        "date": "02272017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "New mobile networks set to enable remote driving  Telefonica says "
    },
    {
        "content": "BARCELONA  Spain Spanish telecoms giant Telefonica announced a new strategy on Sunday promising to give customers back control of their own data with the help of a new digital personal assistant.",
        "date": "02262017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica bets on Aura to keep customers sweet "
    },
    {
        "content": "* \"Aura\" allows users to decide whether to share data insights",
        "date": "02262017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 2-Telefonica bets on Aura to keep customers sweet "
    },
    {
        "content": "* New platform designed to answer questions about growth strategy",
        "date": "02262017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Telefonica promises customers more control of own data "
    },
    {
        "content": "BARCELONA  Spain  Feb 26 Spanish telecoms provider Telefonica is betting on a broad plan it calls the \"fourth platform\" to retain customers with digital services that allow them to keep greater control over their data.",
        "date": "02262017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica unveils new strategy promising customers more control "
    },
    {
        "content": "* Mobile operators chase new sources of growth beyond data plans",
        "date": "02242017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Beyond phones and 5G  mobile world seeks to reinvent itself "
    },
    {
        "content": "MADRID Spain's Telefonica  said on Tuesday it had agreed to sell up to a 40 percent stake in its telecom masts subsidiary Telxius to private equity firm KKR  for 1.275 billion euros ($1.35 billion).",
        "date": "02212017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica to sell up to 40 percent of Telxius to KKR for 1.3 billion euros "
    },
    {
        "content": "* Sees stable revenue this year  improving margins   (Adds comments by CFO on reducing debt  M&A)",
        "date": "02232017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 2-Spain's Telefonica targets higher profitability in 2017 to cut debt "
    },
    {
        "content": "MADRID  Feb 21 Spain's Telefonica said on Tuesday it had agreed to sell up to a 40 percent stake in its telecom masts subsidiary Telxius to private equity firm KKR  for 1.275 billion euros ($1.35 billion).",
        "date": "02212017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica to sell up to 40 pct of Telxius to KKR for 1.3 bln euros "
    },
    {
        "content": "Feb 23 Spain's Telefonica Chief Financial Officer Angel Villa:",
        "date": "02232017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica to focus on organic deleveraging  keep M&A options open "
    },
    {
        "content": "MADRID  Feb 23 Spanish telecoms group Telefonica  will focus on higher profitability in 2017 in efforts cut debt and find the right opportunity to divest assets including its British unit O2.",
        "date": "02232017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "CORRECTED-UPDATE 1-Spain's Telefonica targets higher profitability in 2017 to cut debt "
    },
    {
        "content": "MADRID  Feb 23 Spanish telecoms group Telefonica  on Thursday reported a 14.3 percent rise in full-year core profit  helped by an improving underlying business and lower restructuring costs which more than offset negative currency effects.",
        "date": "02232017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica 2016 core profit up 14.3 pct y/y "
    },
    {
        "content": "MADRID Spain's Telefonica is in talks with private equity firms KKR   CVC [CVC.UL] and Ardian as well as sovereign fund GIC [GIC.UL] about the sale of a 49 percent stake in its telecom masts subsidiary Telxius  four sources said.",
        "date": "02092017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Exclusive: Spain's Telefonica in talks to sell Telxius stake - sources "
    },
    {
        "content": "MADRID  Feb 10 Spain's Telefonica has received several offers for a stake in its telecom masts subsidiary Telxius  the telecoms company said in a statement on Friday  adding it was negotiating and analysing the different options available.",
        "date": "02102017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica says has received several offers for stake in Telxius "
    },
    {
        "content": "MEXICO CITY Spain's Telefonica  has fended off a bid by Mexico to slap the telecoms giant with a 30 billion Mexican peso ($1.42 billion) tax bill and is in talks with local tax officials to resolve over 20 other open audits  people familiar with the matter said.",
        "date": "01272017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Exclusive: Telefonica fends off Mexico $1.4 billion tax audit  in talks on others "
    },
    {
        "content": "Jan 27 The following bids  mergers  acquisitions and disposals were reported by 1030 GMT on Friday:",
        "date": "01272017",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Says approves Telefonica's wholesale fibre optic access charges for competitors",
        "date": "01182017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spanish market regulator says approves Telefonica's fibre optic charges "
    },
    {
        "content": "MADRID  Jan 17 Telefonica will make a one-off provision against 2016 results linked to the extension of its early retirement programme  a source with knowledge of the matter said on Tuesday  without revealing the size of the provision.",
        "date": "01172017",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica to make 2016 provision on extended retirement scheme "
    },
    {
        "content": "MEXICO CITY Mexican telecoms giant America Movil   controlled by tycoon Carlos Slim  said on Monday its Mexican unit had reached an agreement to provide a national roaming service to its main competitor in the local market  Telefonica Mexico.",
        "date": "12062016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Mexico's America Movil to provide national roaming service to Telefonica Mexico "
    },
    {
        "content": "The following Spanish stocks may be affected by newspaper reports and other factors on Friday. Reuters has not verified the newspaper reports  and cannot vouch for their accuracy:",
        "date": "11182016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spanish stocks - Factors to watch on Friday "
    },
    {
        "content": "* Completes first proof-of-concept test for 5G UCNC radio access networks with Huawei",
        "date": "11172016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica and Huawei complete proof-of-concept test for 5G UCNC radio access networks "
    },
    {
        "content": "Nov 15 Viacom Inc  the owner of Comedy Central  Nickelodeon and MTV  said on Tuesday it bought Argentine broadcaster Television Federal SA (Telefe) for $345 million in cash.",
        "date": "11152016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "CORRECTED-Viacom buys Telefonica's Telefe for $345 mln "
    },
    {
        "content": "Nov 15 Viacom Inc  the owner of Comedy Central  Nickelodeon and MTV  said on Tuesday it had bought Argentine broadcaster Television Federal SA (Telefe) from telecom carrier Telefonica SA for $345 million in cash.",
        "date": "11152016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 2-Viacom buys Argentine broadcaster from Telefonica for $345 mln "
    },
    {
        "content": "* under terms of agreement  Viacom will acquire all of Telefe's brands and assets",
        "date": "11152016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Viacom acquires Televisión Federal S.A. in Argentina from Telefónica S.A. for $345 mln "
    },
    {
        "content": "* Says it has sold 100 percent of Television Federal SA to Viacom International Inc for $345 million",
        "date": "11152016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica sells Television Federal to Viacom International for $345 mln "
    },
    {
        "content": "* Has entered into a new mobile access agreement with Telefonica in Spain which will replace current arrangement with Vodafone",
        "date": "11072016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Zegona says Telecable signs agreement with Telefonica in Spain "
    },
    {
        "content": "Viacom Inc   the owner of Comedy Central  Nickelodeon and MTV  is in talks to acquire Argentine broadcaster Television Federal SA from phone carrier Telefonica SA  for up to $385 million  according to people familiar with the deal.",
        "date": "11032016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Viacom in talks to buy Telefonica's Telefe for around $385 million: sources "
    },
    {
        "content": "Nov 3 Viacom Inc  the owner of Comedy Central  Nickelodeon and MTV  is in talks to acquire Argentine broadcaster Television Federal SA from phone carrier Telefonica SA for up to $385 million  according to people familiar with the deal.",
        "date": "11032016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Viacom in talks to buy Telefonica's Telefe for around $385 million -sources "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  October 28 (Fitch) Fitch Ratings says Telefonica's (BBB / Stable)  dividend cut demonstrates management's commitment to reduce leverage and will  increase Telefonica's free cashflow (FCF) and organic deleveraging capacity.  The company cut dividends to EUR0.55 in 2016 and  EUR0.40 from 2017 from EUR0.75  per share. The EUR0.35 per share reduction from 2017 removes the scrip portion  of the dividend that Telefonica has been payin",
        "date": "10282016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Fitch: Telefonica Dividend Cut Supports Organic Deleveraging "
    },
    {
        "content": "* Does not want to be forced into poorly-timed asset sales   (Adds quotes from conference call)",
        "date": "10272016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 2-Spain's Telefonica cuts dividend to speed up debt reduction "
    },
    {
        "content": "* Says it does not foresee any strategic changes with Telefonica after dividend cut",
        "date": "10272016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-BBVA says won't change strategy with Telefonica after dividend cut "
    },
    {
        "content": "* Says Telefonica's dividend cut will have an impact of 95 million euros on its accounts for 2017",
        "date": "10272016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-BBVA says Telefonica's dividend cut will have a negative impact in 2017 "
    },
    {
        "content": "* Shares down 3 percent   (Adds comments by CEO; share price reaction)",
        "date": "10272016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 2-Demand for fibre helps BT meet forecasts  pension deficit widens "
    },
    {
        "content": "* Says dividend payout ratio to be around 50 percent of free cash flow  assuming free cash flow of 4 billion euros ($4.36 billion) per year  versus more than 90 percent previously",
        "date": "10272016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says dividend payout ratio to be 50 pct of cash flow "
    },
    {
        "content": "MADRID  Oct 21 Spain's Telefonica may struggle to deliver on its debt-cutting ambitions if it does not change its dividend policy  says Moody's  which has warned that any deviation from the debt reduction plan could trigger a ratings downgrade.",
        "date": "10212016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 1-Telefonica may struggle with debt goals without dividend change -Moody's "
    },
    {
        "content": "LONDON  Oct 11 Two European companies cancelled plans to IPO on Tuesday due to unfavourable conditions  joining a growing number of firms to cancel listings this year amid disappointing debuts for many that did brave choppy markets.",
        "date": "10112016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Two European IPOs cancelled on market volatility "
    },
    {
        "content": "* Says Telefonica Emisiones to issue notes for 2 billion euros  ($2.24 billion) guaranteed by Telefonica",
        "date": "10102016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica issues 2 bln euros in notes "
    },
    {
        "content": "* Says to cancel shares worth 1.5 percent of share capital  Further company coverage:    (Reporting by Madrid newsroom)",
        "date": "09282016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says to cancel shares worth 1.5 pct of capital "
    },
    {
        "content": "MADRID  Sept 29 Spain's Telefonica said on Thursday it had canceled a listing of Telxius   its telecom masts business  due to weak investor demand.",
        "date": "09292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica cancels Telxius IPO on weak investor interest "
    },
    {
        "content": "MADRID  Sept 29 Spain's Telefonica said on Thursday it had cancelled a listing of Telxius   its telecom masts business  due to weak investor demand  piling pressure on the group to find other ways to cut its 53 billion euros ($59.59 billion) of debt.",
        "date": "09292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Spain's Telefonica cancels Telxius IPO on weak investor interest "
    },
    {
        "content": "MADRID Spain's Telefonica  is close to postponing a listing of Telxius   its telecom masts business  due to weak investor demand  Bloomberg reported on Thursday.",
        "date": "09292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica considering postponing listing of Telxius: Bloomberg "
    },
    {
        "content": "MADRID  Sept 29 Spain's Telefonica is close to postponing a listing of Telxius   its telecom masts business  due to weak investor demand  Bloomberg reported on Thursday.",
        "date": "09292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica considering postponing listing of Telxius - Bloomberg "
    },
    {
        "content": "LONDON Spain's Telefonica  is looking to list about 30 percent of its British mobile unit O2 in what would be one of the biggest initial public offerings (IPOs) on the London market this year  sources told Reuters.",
        "date": "09272016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica aims to list mobile firm O2 in London this year: sources "
    },
    {
        "content": "LONDON  Sept 27 Spain's Telefonica is looking to list about 30 percent of its British mobile unit O2 in what would be one of the biggest initial public offerings (IPOs) on the London market this year  sources told Reuters.",
        "date": "09272016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica aims to list mobile firm O2 in London this year - sources "
    },
    {
        "content": "FRANKFURT  Sept 21 A handful of European tech firms are testing the appetite for initial public offerings  taking their lead from a modest rebound in listings in the United States following a two-year slump.",
        "date": "09212016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "European tech firms tiptoe back to IPO market "
    },
    {
        "content": "MADRID Spanish telecoms group Telefonica  said on Tuesday it would raise up to 1.5 billion euros ($1.68 billion) with the initial public offer of shares in Telxius  its telecoms masts business  as it tries to reduce its debt.",
        "date": "09202016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spain's Telefonica to raise up to 1.5 billion euros with Telxius IPO "
    },
    {
        "content": "MADRID  Sept 20 Spanish telecoms group Telefonica said on Tuesday it would raise up to 1.5 billion euros ($1.68 billion) with the initial public offer of shares in Telxius  its telecoms masts business  as it tries to reduce its debt.",
        "date": "09202016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Spain's Telefonica to raise up to 1.5 bln euros with Telxius IPO "
    },
    {
        "content": "* Registers prospectus for partial listing of telecoms towers unit Telxius",
        "date": "09202016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says could sell up to 40 pct of Telxius unit "
    },
    {
        "content": "MADRID  Sept 20 Spanish telecoms group Telefonica will raise up to 1.4 billion euros ($1.57 billion) through the listing of around 36 percent of its telecom towers unit Telxius on the Madrid stock exchange  business daily Expansion said on Tuesday.",
        "date": "09202016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica to raise up to 1.4 bln euros with Telxius listing - report "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 05 (Fitch) Fitch Ratings has downgraded Telefonica SA's  Long-Term Issuer Default Rating (IDR) and senior unsecured rating to 'BBB' from  'BBB+'. The Outlook on the IDR is Stable. A full list of rating actions is  available below. The rating downgrade reflects expectations that Telefonica is unlikely to reduce  leverage on an organic basis during 2016 as we originally envisaged. This is due  to higher-than-expected pre",
        "date": "09052016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Fitch Downgrades Telefonica SA to 'BBB'; Outlook Stable "
    },
    {
        "content": "SANTANDER  Spain Spain's telecoms group Telefonica  said it plans to float a minority stake in its telecoms masts business Telxius  and said it would hold a partial sale or an initial public offering (IPO) for its British unit O2 before early 2017.",
        "date": "09052016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica prepares for partial listing of Telxius  to decide on O2 "
    },
    {
        "content": "SANTANDER  Spain  Sept 5 Spain's telecoms group Telefonica said it plans to float a minority stake in its telecoms masts business Telxius  and said it would hold a partial sale or an initial public offering (IPO) for its British unit O2 before early 2017.",
        "date": "09052016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "RPT-UPDATE 1-Telefonica prepares for partial listing of Telxius  to decide on O2 "
    },
    {
        "content": "SANTANDER  Spain  Sept 5 Spain's telecoms group Telefonica said it plans to float a minority stake in its telecoms masts business Telxius  and said it would hold a partial sale or an initial public offering (IPO) for its British unit O2 before early 2017.",
        "date": "09052016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Telefonica prepares for partial listing of Telxius  to decide on O2 "
    },
    {
        "content": "MADRID  Sept 5 Spain's telecoms group Telefonica  on Monday registered its intention to float for a partial listing of its masts unit Telxius  while its chairman said it would hold a partial sale or an IPO for its British unit O2 before early 2017.",
        "date": "09052016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica registers intention to float for partial listing of Telxius "
    },
    {
        "content": "* Participation in European collaborative program STARR alongside CEA TECH and Telefonica",
        "date": "08232016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Bluelinea participates in STARR alongside CEA TECH and Telefonica "
    },
    {
        "content": "* Rev drops 7.7 pct to 12.72 bln euros vs 12.89 bln forecast   (Recasts with dividend  O2 comments)",
        "date": "07282016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 2-Telefonica sticks with 2016 dividend  but will review at year end "
    },
    {
        "content": "* Says current level of dividend comfortably covered by cash flow generation  potential measures such partial sale of British or telecoms masts unit",
        "date": "07282016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says will review dividend at year-end "
    },
    {
        "content": "* Says will decide in H2 if it cancels 1.5 percent of share capital currently owned as treasury stock",
        "date": "07282016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says may cancel 1.5 pct of treasury stock in H2 "
    },
    {
        "content": "* Debt up to 52.6 bln euros at end June from 50.2 bln at end-March",
        "date": "07282016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "CORRECTED-UPDATE 1-Spain's Telefonica affirms dividend despite weak second quarter "
    },
    {
        "content": "* Says treasury stock at end-June was 4.23 percent of company's share capital versus 3.29 percent in January  Further company coverage:    (Madrid Newsroom)",
        "date": "07282016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says had treasury stock worth 4.23 pct of capital at end-June "
    },
    {
        "content": "MADRID  July 28 Spanish telecoms group Telefonica on Thursday reported a 7.1 percent fall in second-quarter core profit  hit by the fall in the value of Latin American currencies and of the sterling after the Brexit vote.",
        "date": "07282016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica Q2 core profit down 7 percent on Brexit  Latam "
    },
    {
        "content": "* Says second quarter revenues were 12.7 billion euros  ($14.1 billion) compared to a Reuters poll of 12.9 billion euros",
        "date": "07282016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica misses Q2 earnings forecasts  dividend unchanged "
    },
    {
        "content": "SAO PAULO  July 25 Telefonica Brasil SA   the country's largest wireless carrier  is investigating whether contracting practices at its marketing division failed to meet internal guidelines and allowed excessive price discrepancies  Valor Econômico newspaper reported on Monday.",
        "date": "07252016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefónica probes Brazil marketing deals for discrepancies -report "
    },
    {
        "content": "LONDON  July 15 Spain's Telefonica said on Friday that finance executive Mark Evans would replace Ronan Dunne as the boss of its British network operator O2 on August 1.",
        "date": "07152016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica says Mark Evans to replace Ronan Dunne as CEO of O2 UK "
    },
    {
        "content": "* Brexit hits PE firms' ability to raise debt for O2 bid - sources",
        "date": "07132016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "\"All the stages of grief\": private equity ponders dismal Brexit outlook "
    },
    {
        "content": "HONG KONG Spanish telecoms giant Telefonica SA  has raised about $364 million by selling some of its shares in China Unicom (Hong Kong) Ltd   China's No. 2 telecommunications service provider  sources with direct knowledge of the deal told IFR.",
        "date": "07092016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica raises $364 million from China Unicom share sale: sources "
    },
    {
        "content": "* Says has sold 361 794 559 shares  worth approximately 322 million euros  in China Unicom   Source text for Eikon:  Further company coverage:    (Reporting by Madrid newsroom)",
        "date": "07102016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica says has sold around 322 mln euros of shares in China Unicom "
    },
    {
        "content": "HONG KONG  July 9 Spanish telecoms giant Telefonica SA has launched an up to $367 million stake sale in China Unicom (Hong Kong) Ltd  China's second-largest telecommunications service provider  according to a term sheet seen by IFR on Saturday.",
        "date": "07092016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica launches up to $367 mln stake sale in China Unicom - term sheet "
    },
    {
        "content": "CARACAS  July 6 Spanish agriculture company Grupo Agroinsumos Ibero-americanos and associated firms have filed an arbitration case against Venezuela via a World Bank tribunal  seeking compensation for the 2010 nationalization of its operations.",
        "date": "07062016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spanish agriculture firms file arbitration claim against Venezuela "
    },
    {
        "content": "* Says will fully reconsolidate British unit o2 when it reports Q2 earnings in July",
        "date": "06292016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says to reconsolidate UK unit O2 "
    },
    {
        "content": "MADRID  June 24 Spain's telecoms group Telefonica on Friday said it was sticking to its 2016 targets despite the decision from Britain to leave the European Union  which could potentially hit its business in the country and the group's balance sheet.",
        "date": "06242016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spain's Telefonica sticks to 2016 targets despite Brexit "
    },
    {
        "content": "* Spain's Telefonica and ZTE Corporation sign memorandum of understanding (MOU) to jointly develop 5G technology   Further company coverage:    (Gdynia Newsroom)",
        "date": "06242016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica and ZTE Corp to jointly develop 5G technology "
    },
    {
        "content": "* Shareholders of GC have now committed to purchase $10 million of GGAC shares in public market.",
        "date": "06152016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Garnero Group announces merger amendment terms with Grupo Colombo "
    },
    {
        "content": "LONDON  June 10 (IFR) - The European Central Bank has started muscling into the corporate primary market  with allocation statistics on new trades showing a huge hike in central bank involvement.",
        "date": "06102016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-ECB bursts into European primary corporate market "
    },
    {
        "content": "BRUSSELS  June 7 CK Hutchison Holdings  has offered to strengthen rivals such as Swisscom's Fastweb in return for EU antitrust approval for its plan to merge its Italian mobile business with that of Vimpelcom  a person familiar with the matter said on Tuesday.",
        "date": "06072016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Hutchison seeks EU OK for Vimpelcom deal with concessions "
    },
    {
        "content": "LONDON  June 10 Trading in corporate bonds that could be targeted by the European Central Bank (ECB) rose sharply this week as the central bank's corporate bond purchase programme got underway  data from bond trading platform and data provider MarketAxess showed on Friday.",
        "date": "06102016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Trading in corporate bonds eligible for ECB purchase jumps - MarketAxess "
    },
    {
        "content": "BRUSSELS  June 7 CK Hutchison Holdings  has offered concessions in a bid to secure EU antitrust approval for its plan to merge its Italian mobile business with that of Vimpelcom  the European Commission said on Tuesday.",
        "date": "06072016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison seeks EU okay for Vimpelcom deal with concessions "
    },
    {
        "content": "MEXICO CITY  June 8 The head of the Mexican unit of Spain's Telefonica  Francisco Gil Diaz  will step down at the end of June and company executive Carlos Morales will take the helm  the firm said on Wednesday.",
        "date": "06082016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 1-Spain's Telefonica replaces head of Mexican business "
    },
    {
        "content": "MEXICO CITY  June 8 Francisco Gil Diaz will step down at the end of June as the head of Spain's Telefonica's  Mexican business  the company said in a statement  naming Telefonica Mexico executive Carlos Morales Paulin as the new president and chief executive officer.",
        "date": "06082016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Gil Diaz to step down as president of Telefonica Mexico "
    },
    {
        "content": "LONDON  June 8 (IFR) - The European Central Bank has started buying utility  insurance and telecom bonds in the secondary market as the hotly anticipated Corporate Sector Purchase Programme gets underway.",
        "date": "06082016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "ECB fires starting gun on corporate purchase programme "
    },
    {
        "content": "BRUSSELS  May 26 EU member states approved plans on Thursday to coordinate the roll-out of a key spectrum across the 28-nation bloc to provide faster mobile broadband speeds and improve access to Internet services  including in remote areas.",
        "date": "05262016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-EU states approve plans to coordinate key mobile spectrum "
    },
    {
        "content": "May 17 Quantenna Communications Inc  a U.S. company that designs Wi-Fi chips used in set-top boxes and wireless routers  has hired investment banks for an initial public offering (IPO) that could come later this year  people familiar with the matter said.",
        "date": "05172016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Quantenna hires banks to prepare for IPO -sources "
    },
    {
        "content": "* Says debt levels will improve thanks to cash generation and active portfolio management",
        "date": "05122016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says to cancel treasury stock worth 1.5 pct of capital "
    },
    {
        "content": "LONDON British broadband operator TalkTalk  said it had bounced back from a customer data theft in October  stabilizing its customer base in the final quarter after 95 000 subscribers left following the breach.",
        "date": "05122016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "TalkTalk says back on track after cyber attack "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 11 (Fitch) Fitch Ratings says the failed sale of O2 UK will not  affect Telefonica SA's rating (BBB+/Stable)  following the EU's announcement  that it will move to block Hutchison's acquisition of the British mobile  operator.   Telefonica's rating is based on organic development of the business and excludes  the impact of any potential M&A activities. However  a successful sale of O2 UK  would have improved financial flexib",
        "date": "05112016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Fitch: Telefonica's Rating Unaffected by Blocked O2 UK Sale "
    },
    {
        "content": "LONDON  May 10 Liberty Global said it would consider buying Telefonica's O2 in Britain if Brussels blocks Hutchison buying the mobile network  but it valued the flexibility of its current mobile strategy based on a virtual network.",
        "date": "05102016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Liberty Global says would look at Telefonica's O2 "
    },
    {
        "content": "* Apax Partners CVC Capital Partners and KKR are examining possible bid for Telefonica's O2 unit - Sky News  Source text : (http://bit.ly/1WrE6Fc)   (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05122016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Apax Partners CVC Capital Partners  KKR examining bid for Telefonica's O2 unit- Sky News "
    },
    {
        "content": "BRUSSELS  May 11 The European Union's competition regulator blocked on Wednesday CK Hutchison Holdings' plan to become Britain's  biggest mobile telecoms network operator  in a decision which also cast doubts on whether it can still win approval for another deal in Italy.",
        "date": "05112016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "RPT-UPDATE 4-EU blocks Hutchison's deal to buy Telefonica's O2 UK "
    },
    {
        "content": "* Apax Partners  CVC Capital Partners and KKR are examining a possible offer to O2's parent  Telefonica - Sky News  Source text : (http://bit.ly/1WrE6Fc)   (Bengaluru Newsroom :+1 646 223 8780)",
        "date": "05122016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Apax Partners  CVC Capital Partners  KKR examining offer for Telefonica - Sky News "
    },
    {
        "content": "MOSCOW  May 12 Telecoms firm Vimpelcom  said on Thursday it still expected to merge its Italian business with that of CK Hutchison Holdings around the end of 2016  a day after European regulators blocked a separate Hutchison deal.",
        "date": "05122016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Vimpelcom still expects to complete Italy deal at end-2016 "
    },
    {
        "content": "* Says closes sale of its stake in Distribuidora de Television Digital SA (DTS) to Telefonica de Contenidos at final price of 724.6 million euros",
        "date": "05132016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Prisa closes sale of DTS to Telefonica at 725 million euros "
    },
    {
        "content": "BRUSSELS The European Union's competition regulator blocked on Wednesday CK Hutchison Holdings'  plan to become Britain's  biggest mobile telecoms network operator  in a decision which also cast doubts on whether it can still win approval for another deal in Italy.",
        "date": "05112016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "EU blocks Hutchison's deal to buy Telefonica's O2 UK "
    },
    {
        "content": "* Says it was sticking to its dividend policy and its financial targets after the European veto of the sale of its 02 unit to Hutchison   Source text for Eikon:  Further company coverage:    (Reporting by Madrid Newsroom)",
        "date": "05112016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica sticks to dividend policy after EU veto of O2 sale "
    },
    {
        "content": " ",
        "date": "05112016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": ". "
    },
    {
        "content": "* Shares fall 4.2 percent   (Recasts with chairman and CFO comments  new comments)",
        "date": "04292016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 2-Telefonica says has other options for O2 if sale is blocked "
    },
    {
        "content": "* Says convinced remedies offered by Hutchison  over O2 deal should convince European watchdog",
        "date": "04292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says EU veto to O2 sale should not be discarded "
    },
    {
        "content": "LONDON - The yen hit an 18-month high as investors wager the Bank of Japan might be done adding fresh stimulus to the economy  culminating in a sharp rise on the week that dragged stocks around the world lower. (GLOBAL-MARKETS/ (WRAPUP 5)  moved  by Jamie McGeever  710 words)",
        "date": "04292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Reuters Business News Schedule at 1230 GMT/0830 AM ET "
    },
    {
        "content": "* Says Telxius unit had Oibda of around 300 million euros in 2015",
        "date": "04292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says Telxius unit had 300 mln euros OIBDA in 2015 "
    },
    {
        "content": "MADRID  April 29 Spain's Telefonica on Friday posted a 6.7 percent drop in first-quarter core profit to 3.376 billion euros ($3.85 billion)  just missing forecasts as lower currencies in key overseas markets more than offset a slight business growth.",
        "date": "04292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica core profit drops 6.7 pct in Q1  debt stable "
    },
    {
        "content": "FRANKFURT  April 22 The DAX top-30 index  looked set to open 0.4 percent lower on Friday  according to premarket data from brokerage Lang & Schwarz at 0618 GMT.",
        "date": "04222016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "German stocks - Factors to watch on April 22 "
    },
    {
        "content": "SAO PAULO  April 21 Brazilian construction company Grupo OAS said its creditors would take over its 24.5 percent stake in infrastructure company Invepar as part of a restructuring plan.",
        "date": "04212016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Brazil's OAS creditors to take over Invepar stake "
    },
    {
        "content": "FRANKFURT  April 22 Telefonica Deutschland  agreed to sell its passive tower infrastructure to Telxius  which is owned by Spanish parent Telefonica SA   for 587 million euros ($663 million)  it said on Friday.",
        "date": "04222016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica Deutschland sells passive towers for 587 mln eur "
    },
    {
        "content": "CARACAS  April 8 Spain's Telefonica  this month will suspend international phone service from Venezuela  the firm's local subsidiary said on Friday  amid a growing shortage of foreign exchange that has limited telecom investments.",
        "date": "04082016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica subsidiary halts international calls from Venezuela "
    },
    {
        "content": "* EU competition watchdog getting tougher on telecoms mergers",
        "date": "04072016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison lines up network-sharing deals to smooth way for O2 takeover "
    },
    {
        "content": "* Says reaffirms 0.75 euro ($0.853) per share dividend against 2016 (not 2015) earnings  Source text for Eikon:  Further company coverage:   ($1 = 0.8792 euros)   (Reporting by Madrid newsroom)",
        "date": "04082016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-CORRECTED-Spain's Telefonica reaffirms 0.75 euro per share dividend "
    },
    {
        "content": "* Says via its unit  Telefonica Emisiones SAU  it has issued bonds of 2.75 billion euros ($3.14 billion) on the Euromarket under Guaranteed Euro Programme for the Issuance of Debt Instruments",
        "date": "04062016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica via its unit issues 2.75 bln euro bonds on Euromarket "
    },
    {
        "content": "MADRID  April 6 Spain's Telefonica will sell 1.4 billion euros ($1.6 billion) of a 6-year bond and 1.35 billion euros of 10-year bond  both issued on Wednesday  said a financial source close to the operation.",
        "date": "04062016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica to issue 2.75 bln eur in 6-yr  10-yr bonds - source "
    },
    {
        "content": "* Move suggests soft transition but challenges ahead   (Adds more details  analysts)",
        "date": "03292016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 2-Telefonica boss Alierta steps down  replaced by deputy "
    },
    {
        "content": "MADRID Spain's Telefonica chairman Cesar Alierta will step down after 16 years and be replaced by his deputy Jose Maria Alvarez-Pallete  the company said on Tuesday  seeking to open a new era of digital growth.",
        "date": "03292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica boss Alierta steps down  replaced by deputy "
    },
    {
        "content": "MADRID  March 29 Cesar Alierta will step down as chairman of Spain's Telefonica and will be replaced by the company's current Chief Operating Officer Jose Maria Alvarez-Pallete  the company said in a filing to the stock market regulator.",
        "date": "03292016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Cesar Alierta steps down as Telefonica chairman "
    },
    {
        "content": "* Says \u007fInternexa  a telecommunications company part of Colombia's ISA Group  signs agreement to use Telefonica's new submarine cable BRUSA",
        "date": "03162016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Internexa signs deal to use Telefonica's new submarine cable BRUSA\u007f "
    },
    {
        "content": "* Announces \u007fdeployment of BRUSA  a new submarine cable nearly 11 000 km in length linking Rio de Janeiro and Fortaleza (Brazil) with San Juan (Puerto Rico) and Virginia Beach (US)",
        "date": "03092016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica to link Brazil and US with new submarine cable "
    },
    {
        "content": "* Vivendi to buy all of Mediaset's stake in pay-TV unit -source",
        "date": "03092016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "REFILE-UPDATE 1-Mediaset close to agreeing sale of pay-TV unit to Vivendi-sources "
    },
    {
        "content": "MILAN  March 9 Italian broadcaster Mediaset  is in talks to sell its pay-TV unit to French media group Vivendi and a deal could be sealed soon  three sources close to the matter said on Wednesday.",
        "date": "03092016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Mediaset in talks to sell pay-TV unit to Vivendi - sources "
    },
    {
        "content": "* Says the issuance of bonds will ascend to 600 million euros  ($651 million)",
        "date": "03022016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica to issue bonds of 600 mln euros "
    },
    {
        "content": "BRUSSELS CK Hutchison Holdings Ltd  has offered concessions to address the EU competition regulator's concerns over its  proposed 10.3 billion-pound ($14.5 billion) deal to merge its UK mobile network operator Three with Telefonica's  O2 UK.",
        "date": "03022016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison offers EC concessions on UK mobile merger deal "
    },
    {
        "content": "BRUSSELS  March 2 CK Hutchison Holdings Ltd  has offered concessions to address the EU competition regulator's concerns over its  proposed 10.3 billion-pound ($14.5 billion) deal to merge its UK mobile network operator Three with Telefonica's O2 UK.",
        "date": "03022016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "REFILE-UPDATE 1-Hutchison offers EC concessions on UK mobile merger deal "
    },
    {
        "content": "BRUSSELS  March 2 CK Hutchison Holdings Ltd  has offered concessions in a bid to secure EU antitrust approval for its proposed 10.3-billion-pound ($14.47 billion) bid for Telefonica's British mobile unit  the European Commission said on Wednesday.",
        "date": "03022016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison offers EU concessions over UK mobile deal "
    },
    {
        "content": "MADRID  March 2 Spain's Telefonica said on Wednesday it plans to issue a 5-year bond linked to its share price and it would announce the full details of the issuance later in the day.    (Reporting by Jose Elias Rodriguez; Writing by Paul Day; Editing by Sarah White)",
        "date": "03022016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica to announce details of 5-yr bond on Wednesday "
    },
    {
        "content": "* Says 0.75 eur/share dividend assured for 5-10 years   (Adds Chairman comments  shares  new details)",
        "date": "02262016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 2-Telefonica sees solid 2016  but Spanish clouds linger "
    },
    {
        "content": "MADRID  Feb 23 The following Spanish stocks may be affected by newspaper reports and other factors on Tuesday. Reuters has not verified the newspaper reports  and cannot vouch for their accuracy:",
        "date": "02232016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spanish stocks - Factors to watch on Tuesday "
    },
    {
        "content": "MADRID  Feb 26 Spanish telecoms group Telefonica  on Friday posted a 17.2 percent fall in full-year core profits to 11.41 billion euros ($12.61 billion)  hit by one-off charges totalling 3.5 billion euros  and missing analysts' forecast.",
        "date": "02262016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica 2015 core profit down 17.2 pct on one-off charges "
    },
    {
        "content": "* Says Telefonica and Huawei join forces to develop the Smart Home category in Latin America\u007f\u007f",
        "date": "02242016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica and Huawei join forces to develop Smart Home category in Latin America\u007f\u007f "
    },
    {
        "content": "* Companies have signed a Memorandum of Understanding for the development of 5G technologies  products and services   Further company coverage:    (Reporting Stockholm Newsroom)",
        "date": "02172016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Ericsson  Telefonica sign MoU to develop 5G "
    },
    {
        "content": "MADRID  Feb 11 Spanish telecoms group Telefonica  said on Thursday it was examining the potential listing of its new infrastructure unit Telxius  which will run the group's telecommunication towers and global fibre optic network.",
        "date": "02112016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spain's Telefonica examining potential listing of new unit Telxius "
    },
    {
        "content": "* Says it has created a new unit Telxius to include infrastructure assets",
        "date": "02102016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica creates new unit to include towers  fiber optic network "
    },
    {
        "content": "HONG KONG  Feb 4 CK Hutchison Holdings  will freeze mobile call and text messaging rates in the UK  the Hong Kong telecoms operator said on Thursday  as it seeks to force rivals to lower prices further in the highly competitive UK market.",
        "date": "02042016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "CK Hutchison to cap call and text rates  invest 5 bln pounds in UK "
    },
    {
        "content": "MADRID  Jan 28 Spanish telecoms group Telefonica  said it had reached a deal with unions that will enable it to cut staff costs by 370 million euros ($405 million) per year from 2017 onwards.",
        "date": "01282016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spain's Telefonica seals union deal to cut staff costs "
    },
    {
        "content": "* Sunrise Communications and Telefonica extend their broad partnership agreement",
        "date": "01252016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Sunrise Communications and Telefonica extend partnership agreement\u007f "
    },
    {
        "content": "MADRID  Jan 18 Spanish telecommunication company Telefonica SA said on Monday it had increased its holdings of treasury stock to 3.3 percent from 2.3 percent  taking advantage of the falling value of its shares.",
        "date": "01182016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica lifts treasury stock holding to 3.3 pct from 2.3 pct "
    },
    {
        "content": "MADRID  Jan 11 Spain's Telefonica has started to spin-off its domestic  infrastructure unit and will seek to list or make a trade sale in a so-called 'dual track' offer process by mid-2016  a source familiar with the matter said on Monday.",
        "date": "01112016",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 1-Telefonica set for Spanish infrastucture unit sale by July - source "
    },
    {
        "content": "MADRID  Jan 11 Spain's Telefonica has started to spin-off its domestic telecoms towers and cables into a new unit worth up to 6 billion euros  ($6.53 billion) that it will list or partially sell in a so-called 'dual track' process by mid-2016  a source familiar with the process said.",
        "date": "01112016",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica to do 'dual track' with towers  cables in H1 - source "
    },
    {
        "content": "MEXICO CITY  Dec 17 Mexico's telecoms regulator on Thursday said it had approved swaps of frequency blocks and a spectrum rental deal between AT&T Inc and Telefonica SA   the main competitors to the country's dominant player  Carlos Slim's America Movil.",
        "date": "12182015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Mexico telecoms regulator backs AT&T and Telefonica spectrum deal "
    },
    {
        "content": "MADRID  Nov 30 Spain's Telefonica plans to grow revenues  core profits and cash flow in the years to 2020  Chairman Cesar Alierta said on Monday.",
        "date": "11302015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spain's Telefonica aims to grow revenues  core profits and cash flow "
    },
    {
        "content": "BARCELONA  Nov 11 Spain's Telefonica is committed to staying in the Mexican market and sees its subsidiary there as an attractive candidate for a share market flotation  the group's finance chief said on Wednesday.",
        "date": "11112015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica says Mexican arm could be candidate for flotation "
    },
    {
        "content": "MEXICO CITY  Nov 9 Mexico's telecommunications regulator on Monday fined a unit of Spain's Telefonica a record 410.9 million Mexican pesos ($25 million) for not complying with quality controls.",
        "date": "11102015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "REFILE-Mexico's Telefonica unit given record fine over quality "
    },
    {
        "content": "* Net profit falls short of expectations   (Adds CFO comments on O2  infrastructure portfolio  updates shares)",
        "date": "11062015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 3-Telefonica Spanish sales rise fails to impress investors "
    },
    {
        "content": "* Says base case scenario on sale of British business O2 to Hutchison Whampoa is that it will be receive the green light of European anti-trust authorities  with remedies",
        "date": "11062015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica sees authorities approving O2 sale with remedies "
    },
    {
        "content": "WASHINGTON - U.S. job growth surged in October after two straight months of tepid gains  with the unemployment rate hitting a 7-1/2-year low in a show of domestic strength that makes it almost likely the Federal Reserve will hike interest rates in December. (USA-ECONOMY/ (WRAPUP 3)  moving shortly  by Lucia Mutikani  535 words)",
        "date": "11062015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Reuters Business News Schedule at 1330 GMT/0830 AM ET "
    },
    {
        "content": "MADRID  Nov 6 Spanish telecoms group Telefonica  on Friday posted a 1.9 percent fall in third-quarter net profit to 884 million euros ($961 million)  missing analysts' forecast  although its home unit reported rising sales for the first time since 2008.",
        "date": "11062015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica Q3 profit misses forecast but home market rises "
    },
    {
        "content": "* says Telefonica to pay additional 123 million euros to media group Prisa for Digital Plus pay-TV deal  a unit of Canal Plus in Spain",
        "date": "10202015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica to pay Prisa additional 123 mln euros for Digital Plus "
    },
    {
        "content": "BOGOTA  Oct 26 Telecom operator Internexa  a subsidiary of Colombia's ISA  said it has signed a $120 million contract with Telefonica in Colombia and Brazil for rights to use submarine fiber optic cables.",
        "date": "10272015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Colombia's Internexa inks $120 mln deal to use Telefonica fiber optic "
    },
    {
        "content": "MADRID  Oct 15 Spain's anti-trust watchdog CNMC said on Thursday it had fined Telefonica 5 million euros ($5.7 million) for failing to comply with regulation on renting broadband connections to its competitors for more than four years.",
        "date": "10152015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spain's anti-trust watchdog fines Telefonica "
    },
    {
        "content": "* Says the two-year agreement recognizes Astellia as preferred supplier for Telefónica network optimization  Further company coverage:    (Gdynia Newsroom)",
        "date": "10072015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Astellia signs global framework contract with Telefónica "
    },
    {
        "content": "MILAN  Oct 8 European shares were little changed on Thursday  with profit taking across several sectors offset by stronger auto stocks  while Deutsche Bank was volatile after rigorously cleaning up its balance sheet.",
        "date": "10082015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "European shares flat amid uncertainty over earnings  economy "
    },
    {
        "content": "LONDON/MILAN  Oct 8 European shares were little changed on Thursday after days of gains  with profit taking across several sectors offset by stronger auto stocks  while Deutsche Bank was volatile after rigorously cleaning up its balance sheet.",
        "date": "10082015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "European shares little changed; Deutsche Bank  autos up "
    },
    {
        "content": "HONG KONG  Sept 29 Asia's richest man Li Ka-shing voiced support for Chinese president Xi Jinping on Tuesday and rejected claims he was divesting assets from China after a barrage of media articles accused him of turning his back on the mainland.",
        "date": "09292015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Asia's richest man Li voices support for China's leadership "
    },
    {
        "content": "BRUSSELS  Oct 2 Britain's competition authority has asked EU antitrust regulators to let it examine Hutchison Whampoa's 10.25-billion-pound ($15.6 billion) bid for Telefonica's British mobile unit O2 because the deal would impact the UK most.",
        "date": "10022015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UK regulator wants EU to hand over Hutchison  O2 case "
    },
    {
        "content": "* Says China Unicom and Telefonica sign a global agreement to exchange data center capabilities driving enhanced value for multinational clients",
        "date": "09282015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica and China Unicom agree to exchange data center capabilities "
    },
    {
        "content": "PARIS  Sept 15 French media company Vivendi  could raise its 15.5 percent stake in Telecom Italia  again  possibly to about 20 percent of the capital  French daily Les Echos said on Tuesday.",
        "date": "09152015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Vivendi could raise Telecom Italia's stake further - Les Echos "
    },
    {
        "content": "Sept 18 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "09182015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "CERNOBBIO  Italy Sept 5 The chief executive of Vivendi did not rule out on Saturday that the French media group may raise its stake in Spain's Telefonica  in the future  but said there was no plan to increase its holding in Telecom Italia.",
        "date": "09052015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Vivendi CEO does not rule out raising stake in Telefonica "
    },
    {
        "content": "SANTANDER  Spain  Aug 31 Spanish telecoms company Telefonica is gaining market share in Brazil  Chief Operating Officer Jose Maria Alvarez-Pallete told journalists  as he played down the significance of a recession in the Latin American country.",
        "date": "08312015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spain's Telefonica says gaining market share in Brazil "
    },
    {
        "content": "* Alcatel-Lucent and Telefonica SA carry out 100G upgrade of PENCAN undersea cable systems linking Spanish mainland and Canary Islands",
        "date": "08242015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Alcatel-Lucent and Telefonica upgrade PENCAN undersea cable systems "
    },
    {
        "content": "* Alcatel-Lucent transforms Telefonica's IP network as demand grows for highest network performance to deliver data and video",
        "date": "08192015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Alcatel-Lucent transforms Telefonica's IP network "
    },
    {
        "content": "MADRID  Aug 7 French telecom group Orange  said on Friday its Spanish unit would raise the price of mobile and fixed-line bundles from next month  following similar moves by competitors Telefonica and Vodafone .",
        "date": "08072015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Orange raises prices in Spain after buying Jazztel "
    },
    {
        "content": "MILAN/PARIS  Aug 6 Vimpelcom and Hutchison have agreed to combine their Italian mobile operations in a long-awaited deal that would cut the number of players in Europe's fourth-largest telecom market to three from four.",
        "date": "08072015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "CORRECTED-UPDATE 3-Hutchison  Vimpelcom to merge Italian mobile businesses "
    },
    {
        "content": "* Acquisitions pressure margins  but higher synergies seen   (Adds details on Spain  synergies in Brazil and Germany  COO comments)",
        "date": "07302015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 2-Telefonica lifts revenue forecast as Spanish market turns corner "
    },
    {
        "content": "* Says not planning to make any significant acquisitions in second half of the year",
        "date": "07302015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica says not planning acquisitions in H2 "
    },
    {
        "content": "* Says sees significant synergies being unlocked by restructured portfolio",
        "date": "07302015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica sees restructured portfolio delivering \"significant\" synergies "
    },
    {
        "content": "MADRID  July 30 Spanish telecoms group Telefonica on Thursday said its revenues were seen growing by over 9.5 percent this year  up from more than 7 percent previously  after recent acquisitions in Brazil and Spain which  however  pressured margins.",
        "date": "07302015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica lifts revenues forecast but margins pressured "
    },
    {
        "content": "July 27 Please ignore the alert on Telefonica  selling a 4.9 percent stake in O2 Czech Republic  which was information dating from Oct. 31  2014. There will be no substitute.",
        "date": "07272015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Ignore alert on Telefonica sale of O2 Czech Republic stake "
    },
    {
        "content": "* Fines Telefonica and Yoigo 6.3 million euros ($6.9 million) for business agreements that it says violated antitrust rules  Further company coverage:  ($1 = 0.9155 euros)   (Reporting by Tracy Rucinski  Editing by Sarah White)",
        "date": "07212015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spanish regulator fines Telefonica and Yoigo 6.3 mln euros "
    },
    {
        "content": "AMSTERDAM  July 21 Dutch mapping company TomTom  reported a lower second-quarter net profit on Tuesday that eked ahead of expectations thanks to solid revenue growth driven by license renewals from customers including Apple  and Telefonica.",
        "date": "07212015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "TomTom tops modest expectations and predicts auto turnaround ahead "
    },
    {
        "content": "MILAN U.S. investment bank JP Morgan  has a 7 percent stake in Telecom Italia  as part of a deal with Spain's Telefonica   according to a filing by Italian market watchdog Consob.",
        "date": "07022015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "JP Morgan has 7 percent of Telecom Italia as part of Telefonica bond deal "
    },
    {
        "content": "FRANKFURT  June 30 The DAX top-30 index  looked set to open 0.6 percent lower on Tuesday  according to premarket data from brokerage Lang & Schwarz at 0630 GMT.",
        "date": "06302015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "German stocks - Factors to watch on June 30 "
    },
    {
        "content": "MILAN  July 2 U.S. investment bank JP Morgan  has a 7 percent stake in Telecom Italia as part of a deal with Spain's Telefonica  according to a filing by Italian market watchdog Consob.",
        "date": "07022015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "JP Morgan has 7 pct of Telecom Italia as part of Telefonica bond deal "
    },
    {
        "content": "(Adds quote  detail)     LONDON  June 30 European stocks were seen falling on Tuesday  extending the previous session's drop as Greece looked set to default on an international loan ahead of a weekend referendum that could pave the way for it to leave the euro.     With Greece hours away from defaulting on a 1.6 billion euro loan from the International Monetary Fund  tens of thousands of Greeks rallied on Monday to back their leftwing government in a clash with foreign lenders whi",
        "date": "06302015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "European Factors to Watch-Shares set to extend slump as Greece nears default "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  June 26 (Fitch) Fitch Ratings has revised Telefonica SA's Outlook to  Stable from Negative  while affirming its Long-term Issuer Default Rating (IDR)  at 'BBB+'. A full list of rating actions is available below. The revision of the Outlook to Stable is driven by expectations of stabilising  operational trends within Telefonica's domestic market in Spain and improving  group EBITDA over the next 12 to 18 months. Higher capital ex",
        "date": "06262015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Fitch Revises Telefonica SA's Outlook to Stable; Affirms at 'BBB+' "
    },
    {
        "content": "MILAN France's Vivendi does not rule out increasing its stake in Telecom Italia after becoming the group's largest investor with 14.9 percent  CEO Arnaud de Puyfontaine was quoted as saying on Thursday.",
        "date": "06252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Vivendi CEO does not rule out raising Telecom Italia stake further: paper "
    },
    {
        "content": "* Says it plans to cut by 45 percent wholesale broadband tariffs for indirect access to Telefonica networks",
        "date": "06232015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain plans to cut tariffs to access Telefonica network "
    },
    {
        "content": "PARIS  June 24 Vivendi said on Wednesday it has raised its stake in Telecom Italia to 14.9 percent  replacing Telefonica as its biggest shareholder and gaining a foothold in Italy.",
        "date": "06242015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Vivendi becomes top shareholder in Telecom Italia "
    },
    {
        "content": "MILAN  June 25 France's Vivendi does not rule out increasing its stake in Telecom Italia  after becoming the group's largest investor with 14.9 percent  CEO Arnaud de Puyfontaine was quoted as saying on Thursday.",
        "date": "06252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "REFILE-UPDATE 1-Vivendi CEO does not rule out raising Telecom Italia stake further -paper "
    },
    {
        "content": "The following factors could affect Italian markets on Thursday.",
        "date": "06252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Italy - Factors to watch on June 25 "
    },
    {
        "content": "MILAN  June 25 France's Vivendi does not rule out increasing its stake in Telecom Italia  after becoming the group's biggest investor with 14.9 percent  CEO Arnaud de Puyfontaine told daily Corriere della Sera in an interview on Thursday.",
        "date": "06252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Vivendi CEO does not rule out raising Telecom Italia stake further "
    },
    {
        "content": "The following Spanish stocks may be affected by newspaper reports and other factors on Thursday. Reuters has not verified the newspaper reports  and cannot vouch for their accuracy:",
        "date": "06252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spanish stocks - Factors to watch on Thursday "
    },
    {
        "content": "MADRID  June 12 Spanish group Telefonica's  revenues in its home market rose in May compared with a year ago for the first time in six years  the chairman said on Friday  after a prolonged economic downturn and a tariff hike last month.",
        "date": "06122015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica sees domestic revenues rise for 1st time since 2009 in May "
    },
    {
        "content": "* Says domestic revenues rose year-on-year for the first time since 2009 in May",
        "date": "06122015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica's May domestic revenues rise for first time since 2009 "
    },
    {
        "content": "* Telefonica and Bouygues Telecom create Telefonica Global Solutions France  a joint venture to meet needs of multinationals   Further company coverage:    (Reporting By Andrew Callus)",
        "date": "06032015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica  Bouygues Telecom create French joint venture for corporate solutions "
    },
    {
        "content": "MEXICO CITY  May 27 Mexican fixed-line operator Axtel said on Wednesday it had reached an agreement with Telefonica SA's Mexico unit to end disputes related to interconnection services from between 2005 and 2011.",
        "date": "05272015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Axtel reaches interconnection truce with Telefonica Mexico "
    },
    {
        "content": "* Says has entered a limited partnership with venture capital firm Coral Group to form investment platform centred on digital innovation",
        "date": "05182015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica to invest up to $200 mln in tech innovations "
    },
    {
        "content": "* Says has entered into strategic partnerships with HP  Microsoft and Telefonica to create IT infrastructure and workplace environment",
        "date": "05082015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Nokia signs IT infrastructure deal with HP  Microsoft and Telefonica "
    },
    {
        "content": "MADRID  May 14 Spain's Telefonica on Thursday said it was not yet at a turning point in its home market  acknowledging a return to domestic revenue growth would need more efforts and may have to wait another few quarters.",
        "date": "05142015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica says not yet at turning point in Spain "
    },
    {
        "content": "HONG KONG Hutchison Whampoa Ltd  said it plans to sell a one-third stake in its British mobile phone business for $4.3 billion to five investors - a move that will help the Hong Kong ports-to-telecoms group fund its boldest bet in Europe yet.",
        "date": "05082015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison to sell one-third stake in UK mobile unit for $4.3 billion "
    },
    {
        "content": "MADRID  May 14 Telefonica posted higher first-quarter sales and core profits on Thursday thanks to growth abroad  a sign that an expected turnaround at the Spanish company is underway even though its home market shrank again.",
        "date": "05142015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "CORRECTED-UPDATE 1-First-quarter boost for Telefonica despite Spanish market "
    },
    {
        "content": "* Deal could grow by $500 mln to meet more Telefonica payments",
        "date": "05082015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Hutchison to sell one-third stake in UK mobile unit for $4.3 bln "
    },
    {
        "content": "MADRID  May 14 Spanish telecoms group Telefonica  on Thursday posted a 7.7 percent rise in first-quarter core profit  beating analysts' forecast  as a bigger German unit offset a still contracting domestic market and subdued activity in Brazil.",
        "date": "05142015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica Q1 core profit up 7.7 pct  but domestic market lags "
    },
    {
        "content": "MADRID  April 29 Telefonica's move to hike prices in Spain is a bold bet that could finally draw a line under a six-year slump  cut the firm's reliance on Latin America and give it a leg up over rivals on the lucrative premium telecoms market  sources and analysts say.",
        "date": "04292015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Spain's Telefonica bets on price hikes to end six-year slump "
    },
    {
        "content": "VALENCIA  Spain  April 21 Bailed-out Spanish lender Bankia said on Tuesday it would ask a court to freeze the assets of former boss Rodrigo Rato  also an ex-International Monetary Fund chief  as it grapples with the fallout of its ill-fated 2011 listing.",
        "date": "04212015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "UPDATE 1-Spain's Bankia to ask court to freeze Rato assets "
    },
    {
        "content": "* The rights issue was to help fund the purchase of Vivendi's Brazilian unit GVT   Source text for Eikon:  Further company coverage:    (Reporting By Tomas Cobos; Writing by Paul Day)",
        "date": "04172015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica finalises 3 bln euro rights issue "
    },
    {
        "content": "MADRID  April 14 Spain's Telefonica is open to offering its rivals rights to premium television content at low prices to ease anti-trust concerns over its planned acquisition of pay-per-view platform Canal+  a source close to the company said on Tuesday.",
        "date": "04142015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica to offer TV rights to clinch Canal+ deal - source "
    },
    {
        "content": "* Accenture and Alcatel-Lucent announce four-year agreement with Telefonica to deploy Alcatel-Lucent's motive customer experience management software",
        "date": "04072015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Alcatel-Lucent and Accenture announce four-year agreement with Telefonica "
    },
    {
        "content": "* Comptel has won deal with New Telefonica Group Customer in South America",
        "date": "04022015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Comptel wins deal with New Telefonica Group Customer in South America "
    },
    {
        "content": "* says in prospectus for 3 billion euro ($3.27 billion) rights issue that underwriters will get fees of 45.7 million euros",
        "date": "03262015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica rights issue underwriters to get 45.7 mln eur in fees - prospectus "
    },
    {
        "content": "* Chief Financial Officer Angel Vila says on investor conference call that proceeds from the sale of O2 in the UK will go to strengthening balance sheet  rewarding shareholders and potential non-organic growth  Further company coverage:    (Reporting By Andres Gonzalez  Editing by Sarah White)",
        "date": "03262015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-O2 UK sale proceeds will strengthen Telefonica balance sheet- CFO "
    },
    {
        "content": "ALICANTE  Spain Volvo Ocean Race's six-strong fleet  already battered by the Southern Ocean  sails in to the toughest part of the nine-month marathon offshore challenge over the next two days.",
        "date": "03282015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Cape Horn  bergs and a storm await battered global race fleet "
    },
    {
        "content": "MADRID  March 27 Spanish telecoms group Telefonica could see 2015 earnings hit by up to 437 million euros ($473 million) from a tax fine in Peru  the company said in a prospectus  adding that it could still appeal the ruling.",
        "date": "03272015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Spain's Telefonica says may appeal 437 mln eur tax bill in Peru "
    },
    {
        "content": "MADRID  March 26 Spain's Telefonica  announced on Wednesday it would raise 3.0 billion euros ($3.29 billion) in a rights issue to help fund the purchase of Vivendi's Brazilian unit GVT",
        "date": "03252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica to fund GVT buy with new share issue at 10.84 euros/each "
    },
    {
        "content": "* Telefonica says rights issue subscription period March 28 to April 12",
        "date": "03262015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica rights issue subscription period March 28 to April 12 "
    },
    {
        "content": "NEW YORK  March 25 Telefonica Brasil SA  plans to raise up to $4 billion in fresh capital through a rights issue that will be announced as early as Thursday  two sources with direct knowledge of the deal told Reuters.",
        "date": "03252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica Brasil preps $4 bln rights issue for Thursday -sources "
    },
    {
        "content": "Hutchison Whampoa Ltd  is expected to finalize a deal to buy Telefonica SA's  British mobile unit O2 for 10.5 billion pounds ($15.70 billion) as early as Tuesday morning  the Financial Times reported.",
        "date": "03232015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Hutchison and Telefonica set to close O2 deal for $15.7 billion: FT "
    },
    {
        "content": "BRASILIA  March 25 An official at Brazilian antitrust watchdog Cade said on Wednesday that Telefonica SA  had offered to sell its stake in Telecom Italia SpA  within 4 months of signing an accord with the agency.",
        "date": "03252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Brazil agency says Telefonica offers to sell Telecom Italia stake "
    },
    {
        "content": "British mobile-banking software maker Monitise Plc said it was no longer looking to sell itself and that its founder and co-CEO Alastair Lukies would step down  handing over full executive control to Elizabeth Buse.",
        "date": "03252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Monitise ends sale process  Buse to become sole CEO "
    },
    {
        "content": "* Will improve under-performing businesses  exit non-core areas",
        "date": "03252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 2-Monitise ends sale process  Buse to become sole CEO "
    },
    {
        "content": "March 23 Hutchison Whampoa Ltd is expected to finalize a deal to buy Telefonica SA's  British mobile unit O2 for 10.5 billion pounds ($15.70 billion) as early as Tuesday morning  the Financial Times reported.",
        "date": "03232015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison and Telefonica set to close O2 deal for $15.7 bln -FT "
    },
    {
        "content": "* Announces that Stephen Shurrock has been appointed as a non-executive director of company with immediate effect",
        "date": "03252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Monitise appoints Telefonica  Santander backed Shurrock as non-exec director "
    },
    {
        "content": "LONDON Spain's Telefonica  said it had finalised a deal to sell its British mobile business O2 to Li Ka-shing's Hutchison Whampoa  for 10.25 billion pounds ($15.2 billion)  confirming details announced earlier this year.",
        "date": "03242015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica finalizes $15 billion sale of UK unit to Hutchison "
    },
    {
        "content": "LONDON  March 24 Spain's Telefonica  said it had finalised a deal to sell its British mobile business O2 to Li Ka-shing's Hutchison Whampoa for 10.25 billion pounds ($15.2 billion)  confirming details announced earlier this year.",
        "date": "03242015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica finalises $15 bln sale of UK unit to Hutchison "
    },
    {
        "content": "* Definitive agreement has been reached after completion of due diligence over O2 uk.",
        "date": "03242015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica to sell O2 to Hutchison for 10.25 bln stg "
    },
    {
        "content": "* Says has reached definitive agreement to sell its British O2 unit to Hutchison Whampoa for 10.25 billion pounds ($15.24 billion)  after preliminary deal outlined in January",
        "date": "03242015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica reaches sale deal with Hutchison on O2 "
    },
    {
        "content": "March 19 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "03192015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LONDON  March 19 Spanish telecoms firm Telefonica has lined up nine banks to run its 3 billion-euro ($3.2 billion) capital increase in connection with its purchase of Vivendi's Brazilian unit GVT  a source familiar with the matter said on Thursday.",
        "date": "03192015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica lines up nine banks for 3 bln-euro capital hike- source "
    },
    {
        "content": "NEW YORK  March 19 (IFR) - Peru and Ecuador pulled the trigger on bond trades on Thursday to take advantage of a narrowing issuance window as oil and currencies remained under pressure.",
        "date": "03192015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Market tone remains mixed as Peru  Ecuador announce deals "
    },
    {
        "content": "NEW YORK  March 18 (IFR) - LatAm credit markets were off to a mixed start Wednesday as investors squared positions ahead of the FOMC statement later in the day.",
        "date": "03182015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Mixed start for Latin America credit before FOMC "
    },
    {
        "content": "* Ericsson and Telefonica extend co-operation for network virtualization",
        "date": "03042015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Ericsson and Telefonica extend co-operation on network virtualization "
    },
    {
        "content": "PARIS Europe's big telecom firms are back to rude financial health after years of poor results and regulatory pressure  drawing crowds of new investors and protests from rivals who worry the formerly state-owned companies may rebuild their monopolies.",
        "date": "02272015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Europe's big telecoms roar back to health  worrying rivals "
    },
    {
        "content": "* CEO says he assumes the company will have to make wholesale TV packages available to competitors after acquiring pay-per-view platform Canal+  Further company coverage:    (Reporting By Andres Gonzalez  writing by Paul Day)",
        "date": "02252015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "CORRECTED-BRIEF-Telefonica says will make TV contents available to competitors "
    },
    {
        "content": "* Devaluation of Venezuelan bolivar hurts profits   (Adds investor comment  detail  updates shares)",
        "date": "02252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 3-Telefonica upbeat on sales after Venezuela hits results "
    },
    {
        "content": "* Says on conference call with analysts expects to complete sale of O2 in first half of 2016  pending regulatory approval",
        "date": "02252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica expects completion of O2 sale in H1 2016 "
    },
    {
        "content": "* At 0802 GMT  shares in Telefonica fall 0.88 to 13.4 euros  ($15) per share  Further company coverage:   ($1 = 0.8794 euros)   (Reporting By Paul Day; Editing by Tomas Cobos)",
        "date": "02252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Shares in Telefonica fall 0.88 pct after full year earnings "
    },
    {
        "content": "* Says to raise up to 3 billion euros ($3.41 billion) through rights issue in connection with acquisition of Brazil's GVT  Source text for Eikon: [ID:http://bit.ly/1JKotCS] Further company coverage:   ($1 = 0.8811 euros)   (Reporting By Tomas Cobos; Writing by Paul Day)",
        "date": "02252015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica to raise up to 3 bln euros through rights issue "
    },
    {
        "content": "MADRID  Feb 19 Spain's Telefonica said on Thursday it had signed a 2.5 billion euro ($2.9 billion) 5-year syndicated debt deal with international and domestic banks with an option to extend the deal to 7 years.",
        "date": "02192015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica signs 2.5 bln euro syndicated debt deal "
    },
    {
        "content": "* Says will use \"SICAD II\" exchange rate to consolidate operations in Venezuela",
        "date": "02162015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica changes exchange rate used in Venezuela  earnings to be hit "
    },
    {
        "content": "* FTSEurofirst falls 0.2 pct     * Greek shares volatile; traders upbeat on chances of a deal     * Telecoms hindered by Orange  Telefonica     * Danish jewellery maker Pandora surges after earnings beat   (Recasts  adds detail)     By Alistair Smout     LONDON  Feb 17 Athens stocks fell in choppy trade on Tuesday to hinder European shares after debt talks between Greece and euro zone finance ministers broke down  putting the country's future in the euro zone at risk.     The main At",
        "date": "02172015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "European shares dip in choppy trade after Greek debt talks break down "
    },
    {
        "content": "LONDON French startup Sigfox has raised $115 million from seven heavyweight investors to help it build new networks globally to connect everything from washing machines to smart meters to the Internet.",
        "date": "02112015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "France's Sigfox raises $115 million for 'Internet of Things' network "
    },
    {
        "content": "LONDON BT  has reached agreement with Orange  and Deutsche Telekom ‎ to buy their UK mobile network operator EE and a deal could be announced as early as Thursday morning  a person familiar with the situation said.",
        "date": "02042015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BT finalizes deal to buy EE: source "
    },
    {
        "content": "* Says grants Tecnocom two-year information technology contract worth over 10.5 million euros ($12.01 million)   Further company coverage:  ($1 = 0.8740 euros)   (Reporting By Paul Day; Editing by Tomas Cobos)",
        "date": "02042015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Telefonica grants Tecnocom 10.5 mln euro IT contract "
    },
    {
        "content": "LONDON Some of the world's biggest sovereign wealth funds are in talks to provide financial backing for Hutchison Whampoa's acquisition of Telefonica's British mobile business  the Telegraph newspaper reported  citing unidentified sources.",
        "date": "02022015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Sovereign wealth funds in talks to back $15 billion O2 deal: report "
    },
    {
        "content": "MADRID  Feb 2 Spanish telecoms group Telefonica has no plans to carry out a large capital increase beyond a 3.4-billion-euro ($4 billion)  capital raising announced last year to finance the acquisition of GVT in Brazil  Chief Financial Officer Angel Vila told Reuters.",
        "date": "02032015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica has no plans to hike capital beyond GVT financing - CFO "
    },
    {
        "content": "LONDON  Feb 2 Some of the world's biggest sovereign wealth funds are in talks to provide financial backing for Hutchison Whampoa's acquisition of Telefonica's  British mobile business  the Telegraph newspaper reported  citing unidentified sources.",
        "date": "02022015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Sovereign wealth funds in talks to back $15 bln O2 deal - report "
    },
    {
        "content": "* Telefonica buys a 3 percent stake in Indra on Wednesday  according to a source familiar with the situation   Source text for Eikon:  Further company coverage:    (Reporting By Paul Day; editing by Elisabeth O'Leary)",
        "date": "01292015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Spain's Indra up 8 percent after Telefonica stake buy "
    },
    {
        "content": "* Buys a 3 percent stake in Spanish technology company Indra  according to a source familiar with the situation",
        "date": "01282015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "BRIEF-Telefonica buys 3 pct stake in Spain's Indra "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  January 27 (Fitch) The planned sale of Telefonica's O2 UK operations to  Hutchison Whampoa could be credit positive for the Spanish group  and for other  UK network operators  Fitch Ratings says. The sale is in line with Telefonica's strategy of focussing on Latin America and  other countries where there is potential for it to develop a strong market  position. The UK business is performing well and contributes to geographic  di",
        "date": "01272015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Fitch: Hutchison Deal Positive for Telefonica  Other UK Networks "
    },
    {
        "content": "MADRID Telefonica  has agreed to sell its British unit O2 to Hutchison Whampoa Ltd  in a deal valued at more than 10 billion pounds ($15 billion)  a source with direct knowledge of the operation said on Thursday.",
        "date": "01222015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica to sell British unit to Hutchison for $15 billion: source "
    },
    {
        "content": "MADRID/HONG KONG (Reuters Breakingviews) - Telefonica's  British Plan B has worked out. The Spanish telecoms operator is in talks to sell its local mobile unit  O2  to Hutchison Whampoa for up to 10.3 billion pounds. That's a good price for the debt-laden seller  left out last month when fixed-line giant BT opted to pursue a deal with the bigger EE instead.",
        "date": "01232015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Breakingviews: Telefonica's British Plan B comes good "
    },
    {
        "content": "MADRID  Jan 23 Telefonica has agreed to sell its British unit O2 to Hutchison Whampoa Ltd in a deal valued at more than 10 billion pounds ($15 billion)  a source with direct knowledge of the operation said on Thursday.",
        "date": "01222015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 1-Telefonica to sell British unit to Hutchison for $15 bln -source "
    },
    {
        "content": "MADRID/HONG KONG Li Ka-shing's Hutchison Whampoa Ltd has agreed to buy Telefonica's British mobile unit O2 for up to 10.25 billion pounds ($15.4 billion)  hastening the consolidation of Britain's telecoms industry.",
        "date": "01232015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison to buy Telefonica UK unit for $15.4 bln "
    },
    {
        "content": "MADRID  Jan 22 Telefonica has agreed to sell its British unit O2 to Hutchison Whampoa in a deal valued at more than 10 billion pounds  a source with direct knowledge of the operation said on Thursday.",
        "date": "01222015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica agrees to sell British unit to Hutchison - source "
    },
    {
        "content": "MADRID/HONG KONG Li Ka-shing's Hutchison Whampoa Ltd  has agreed to buy Telefonica's  British mobile unit O2 for up to 10.25 billion pounds ($15.4 billion)  hastening the consolidation of Britain's telecoms industry.",
        "date": "01232015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison to buy Telefonica UK unit for $15.4 billion "
    },
    {
        "content": "Jan 22 Telefonica SA is set to agree to a cash deal of 10 billion pounds ($15 billion) to sell 02  its British mobile company  to Hong Kong tycoon Li Ka-shing's Hutchison Whampoa Ltd  the Financial Times reported on Thursday.",
        "date": "01222015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Telefonica to sell 02 for 10 bln pounds to Hutchison Whampoa - FT "
    },
    {
        "content": "LONDON Hutchison Whampoa   owner of Britain's fourth-largest mobile operator Three  is in talks with Telefonica  about buying its O2 network  the Sunday Times reported  citing unnamed city sources.",
        "date": "01182015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Hutchison in talks over deal for Britain's O2: Sunday Times "
    },
    {
        "content": "MEXICO CITY  Jan 14 The Mexican unit of Spanish telecoms company Telefonica is not in talks to buy assets belonging to tycoon Carlos Slim's America Movil  Telefonica Mexico's chairman Francisco Gil Diaz told Reuters on Wednesday.",
        "date": "01152015",
        "name": "Telefonica SA",
        "news_type": "topStory",
        "symbol": "TEF",
        "title": "Telefonica's Mexico unit not in talks to buy America Movil assets "
    },
    {
        "content": "* Consolidation heats up in UK telecoms sector   (Adds more details on UK consolidation  Telefonica)",
        "date": "01232015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "UPDATE 5-Hutchison to buy Telefonica UK unit for $15.4 bln "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG  January 23 (Fitch) Fitch Ratings said that Hutchison Whampoa  Limited's (Hutchison; A-/Stable/F2) ratings are not immediately affected by its  potential acquisition of O2 UK  a telecommunications company.  Hutchison is still conducting due diligence on O2 UK and the acquisition remains  subject to the two sides agreeing on final terms and signing definitive  agreements and obtaining the required corporate and regulatory appro",
        "date": "01232015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Fitch: Hutchison's Ratings Not Immediately Affected by Potential O2 UK Acquisition "
    },
    {
        "content": "LONDON  Jan 18 Hutchison Whampoa  owner of Britain's fourth-largest mobile operator Three  is in talks with Telefonica about buying its O2 network  the Sunday Times reported  citing unnamed city sources.",
        "date": "01182015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison in talks over deal for Britain's O2 -Sunday Times "
    },
    {
        "content": "HONG KONG  Jan 23 Hutchison Whampoa Ltd  group finance director Frank Sixt said on Friday the company is in talks with private equity firms among others to offer a minority stake in its planned bid for Telefonica's British unit O2.",
        "date": "01232015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Hutchison looks to bring in minority partners for Telefonica's UK unit deal "
    },
    {
        "content": "* Rise 2 percent  at 13 euros per share  after deal to sell British unit O2 to Hutchison Whampoa   Source text for Eikon:  Further company coverage:    (Reporting By Julien Toyer)",
        "date": "01232015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "BRIEF-Shares in Telefonica rise 2 percent after deal to sell British unit "
    },
    {
        "content": "Jan 23 The following corporate finance-related stories were reported by media:",
        "date": "01232015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "RPT-Market Chatter- Corporate finance press digest "
    },
    {
        "content": "Jan 22 The following corporate finance-related stories were reported by media:",
        "date": "01232015",
        "name": "Telefonica SA",
        "news_type": "normal",
        "symbol": "TEF",
        "title": "Market Chatter- Corporate finance press digest "
    }
]