[
    {
        "content": "* TE connectivity announces fourth quarter and full year results for fiscal year 2017",
        "date": "11012017",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "BRIEF-TE Connectivity Q4 adjusted earnings per share $1.25 "
    },
    {
        "content": "* Voxx International corporation announces definitive agreement with TE connectivity to sell its Hirschmann car communication antenna and tuner business",
        "date": "06262017",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "BRIEF-Voxx International to sell its Hirschmann car communication antenna and tuner business "
    },
    {
        "content": "* Te connectivity reports second quarter 2017 financial results",
        "date": "04262017",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "BRIEF-TE Connectivity Q2 adjusted EPS $1.19 "
    },
    {
        "content": "April 26 TE Connectivity Ltd  a Switzerland-based manufacturer of electronics and sensors  reported a higher-than-expected increase in second-quarter revenue  driven by demand in China  Japan and South Korea.",
        "date": "04262017",
        "name": "TE Connectivity Ltd",
        "news_type": "normal",
        "symbol": "TEL",
        "title": "TE Connectivity tops revenue estimates  raises forecast "
    },
    {
        "content": "* TE Connectivity announces financial results for first quarter 2017",
        "date": "01252017",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "BRIEF-TE Connectivity Q1 adjusted earnings per share $1.15 "
    },
    {
        "content": "* Unit TE SubCom  along with Facebook  Google  and PLDC  announced that they will co-build Pacific Light Cable Network  Source text for Eikon:  Further company coverage:",
        "date": "10122016",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "BRIEF-TE Connectivity unit TE SubCom to co-build Pacific Light Cable Network with Facebook  Google and PLDC "
    },
    {
        "content": "* Lynch will continue as executive chairman of board after transition",
        "date": "10032016",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "BRIEF-TE Connectivity Terrence Curtin will succeed CEO Tom Lynch "
    },
    {
        "content": "* Company's net cash payment was $140 million during q2 of fiscal 2016  representing company's share of total amount payable to irs",
        "date": "05312016",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "BRIEF-TE Connectivity was reimbursed $305 million by Tyco International and Covidien pursuant to their indemnifications for pre-separation tax matters "
    },
    {
        "content": "* TE Connectivity posts solid fiscal 2016 second quarter results",
        "date": "04202016",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "BRIEF-TE Connectivity reports Q2 adjusted earnings per share $0.90 "
    },
    {
        "content": "TE Connectivity Ltd  a Swiss-based manufacturer of electronics and sensors  said it would buy Creganna Medical Group for $895 million  expanding in the fast-growing business of making equipment used in minimally invasive procedures.",
        "date": "02022016",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "TE Connectivity pushes into medical devices with Creganna buy "
    },
    {
        "content": "* TE Connectivity's shares fall 3 pct   (Adds executive comment from conference call  shares)",
        "date": "02022016",
        "name": "TE Connectivity Ltd",
        "news_type": "normal",
        "symbol": "TEL",
        "title": "UPDATE 2-TE Connectivity pushes into medical devices with Creganna buy "
    },
    {
        "content": "Feb 2 Communication equipment maker TE Connectivity Ltd said it would buy Ireland-based medical device maker Creganna Medical group for $895 million in cash.",
        "date": "02022016",
        "name": "TE Connectivity Ltd",
        "news_type": "normal",
        "symbol": "TEL",
        "title": "TE Connectivity to buy Creganna Medical Group for $895 mln "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 26 (Fitch) Fitch Ratings affirms the ratings for TE  Connectivity Ltd. (NYSE:TEL; TE Connectivity) and its wholly owned subsidiary   Tyco Electronics Group S.A. (TEGSA). The Rating Outlook is Stable. Fitch also  assigns an 'A-' rating to the company's new $350 million 10-year unsecured  notes. The ratings affect $3.7 billion of total funded debt  excluding the $500 million  floating rate notes due Jan. 29  2016  which ",
        "date": "01262016",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "Fitch Affirms TE Connectivity at 'A-/F2'; Outlook Stable "
    },
    {
        "content": "BRUSSELS  June 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "06232015",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "EU mergers and takeovers (June 23) "
    },
    {
        "content": "Swiss electronics company TE Connectivity Ltd is said to be nearing a deal to sell its network equipment unit to CommScope Holding Co Inc for about $3 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "01262015",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "TE Connectivity nears deal to sell network business to CommScope: WSJ "
    },
    {
        "content": "Jan 27 The following corporate finance-related stories were reported by media:",
        "date": "01272015",
        "name": "TE Connectivity Ltd",
        "news_type": "topStory",
        "symbol": "TEL",
        "title": "REFILE-Market Chatter- Corporate finance press digest "
    },
    {
        "content": "Telecom equipment maker CommScope Holding Co Inc  said it would buy nearly all of Swiss electronics firm TE Connectivity's  network gear business for about $3 billion to expand in Europe and Asia.",
        "date": "01282015",
        "name": "TE Connectivity Ltd",
        "news_type": "normal",
        "symbol": "TEL",
        "title": "CommScope to buy most of TE Connectivity's network business "
    },
    {
        "content": "Jan 26 Swiss electronics company TE Connectivity Ltd is said to be nearing a deal to sell its network equipment unit to CommScope Holding Co Inc for about $3 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "01262015",
        "name": "TE Connectivity Ltd",
        "news_type": "normal",
        "symbol": "TEL",
        "title": "TE Connectivity nears deal to sell network business to CommScope -WSJ "
    },
    {
        "content": "Jan 28 Telecom equipment maker CommScope Holding Co Inc said it would buy nearly all of Swiss electronics firm TE Connectivity's network gear business for about $3 billion to expand in Europe and Asia.",
        "date": "01282015",
        "name": "TE Connectivity Ltd",
        "news_type": "normal",
        "symbol": "TEL",
        "title": "UPDATE 1-CommScope to buy most of TE Connectivity's network business "
    },
    {
        "content": "Jan 28 Telecom equipment maker CommScope Holding Co Inc said it will buy Swiss electronics firm TE Connectivity's network equipment business for about $3 billion in cash to expand in Europe and Asia.",
        "date": "01282015",
        "name": "TE Connectivity Ltd",
        "news_type": "normal",
        "symbol": "TEL",
        "title": "CommScope to buy TE Connectivity's network business for $3 bln "
    }
]