[
    {
        "content": "BUENOS AIRES  Nov 14 Argentina likely will authorize telephone service providers to offer satellite television services as part of their packages by the end of the year  a source at the country's Enacom telecoms regulator said on Tuesday.",
        "date": "11142017",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "topStory",
        "symbol": "TEO",
        "title": "UPDATE 1-Argentina to allow telecom companies to provide satellite TV -source "
    },
    {
        "content": "BUENOS AIRES  Nov 14 Argentina will likely issue a rule allowing telephone service providers to offer satellite television services as part of their packages by the end of the year  a source at the country's Enacom telecoms regulator said on Tuesday.",
        "date": "11142017",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "Argentina to allow telecom companies to provide satellite TV -source "
    },
    {
        "content": "BUENOS AIRES  Sept 1 Shareholders in Telecom Argentina SA approved a planned merger with cable TV provider Cablevision SA during a meeting on Thursday  the company said in a letter to Argentina's securities regulator on Friday.",
        "date": "09012017",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "Telecom Argentina shareholders approve merger with Cablevision "
    },
    {
        "content": "BUENOS AIRES  July 2 Argentina's Telecom Argentina SA and cable TV provider Cablevisión SA reached a merger agreement enabling them to offer so-called quadruple play services  a result of President Mauricio Macri's telecom sector reforms.",
        "date": "07022017",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "Telecom Argentina  Cablevision agree to merge amid telecoms reform "
    },
    {
        "content": "BUENOS AIRES Telecom Argentina SA and cable TV provider Cablevision SA will have to return broadcast airwaves spectrum to the Argentine government if a proposed merger between the two companies is to be approved  a source with the country's Enacom communications regulator told Reuters on Friday.",
        "date": "07082017",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "topStory",
        "symbol": "TEO",
        "title": "Exclusive: Argentina's Telecom/Cablevision would have to return airwaves "
    },
    {
        "content": "* Files for offering of up to 58.2 million common shares in form of ADSS by selling shareholder - SEC filing  Source text: [http://bit.ly/2nSXE7d] Further company coverage:",
        "date": "03222017",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "topStory",
        "symbol": "TEO",
        "title": "BRIEF-Telecom Argentina SA files for offering of up to 58.2 mln common shares "
    },
    {
        "content": "MILAN  Feb 3 Telecom Italia on Friday posted a better-than-expected 14.4 percent rise in full-year core earnings  helped by cost cuts and strong results from its domestic operations.",
        "date": "02032017",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "CORRECTED-(OFFICIAL)-Telecom Italia 2016 core earnings beat forecasts with 14 pct rise "
    },
    {
        "content": "BUENOS AIRES  Sept 23 Even though new rules have not yet been implemented  telecom companies in Argentina are preparing for a more competitive market as the government expects reforms to attract $20 billion in investments over four years.",
        "date": "09232016",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "Argentina says telecom reforms to draw $20 bln; companies prepare "
    },
    {
        "content": "* Said on Tuesday it had appointed Ignacio Cruz Moran as new chief financial officer (CFO)",
        "date": "05112016",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "topStory",
        "symbol": "TEO",
        "title": "BRIEF-Telecom Argentina appoints Ignacio Cruz Moran as CFO "
    },
    {
        "content": "MILAN  March 4 Shares in Telecom Italia  rose 1.9 percent on Friday after the Argentine regulator was said to have approved the Italian phone group's sale of a stake in Telecom Argentina and  speculation abounded its CEO may be at risk.",
        "date": "03042016",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "topStory",
        "symbol": "TEO",
        "title": "Telecom Italia shares up as Argentina sale said to have been cleared "
    },
    {
        "content": "The following factors could affect Italian markets on Friday.",
        "date": "03042016",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "Italy - Factors to watch on March 4 "
    },
    {
        "content": "BUENOS AIRES  March 3 Argentina's new telecoms regulator on Thursday approved Telecom Italia's sale of its controlling stake in Telecom Argentina to investment firm Fintech  a source at the regulator said.",
        "date": "03042016",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "UPDATE 1-Argentine regulator okays sale of controlling stake in Telecom Italia unit "
    },
    {
        "content": "BUENOS AIRES  March 3 Argentina's ENACOM telecoms regulator on Thursday approved Telecom Italia's  sale of its controlling stake in Telecom Argentina  to investment firm Fintech  a source at the regulator said.",
        "date": "03042016",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "Argentina okays Fintech purchase of controlling stake in Telecom Italia unit "
    },
    {
        "content": "MILAN  March 8 Telecom Italia said on Tuesday it had completed the much-anticipated sale of its stake in Telecom Argentina TEC2.BA to investment group Fintech  with the total amount generated by the disposal confirmed at over $960 million.",
        "date": "03082016",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "topStory",
        "symbol": "TEO",
        "title": "RPT-Telecom Italia concludes sale of Argentine unit to Fintech "
    },
    {
        "content": "MILAN  March 8 Telecom Italia said on Tuesday it had completed the much-anticipated sale of its stake in Telecom Argentina to investment group Fintech  with the total amount generated by the disposal confirmed at over $960 million.",
        "date": "03082016",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "Telecom Italia concludes sale of Argentine unit to Fintech "
    },
    {
        "content": "BUENOS AIRES  Feb 23 Investment firm Fintech launched a bid on Tuesday for Class B shares of Telecom Italia's Argentine unit listed on the Buenos Aires Merval stock exchange  the company said in a statement.",
        "date": "02242016",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "topStory",
        "symbol": "TEO",
        "title": "Fintech launches bid for Telecom Argentina Class B shares "
    },
    {
        "content": "* Savings share conversion  conversion of mandatory convertible  sale of mast assets and Telecom Argentina are operations that can raise over 3 billion euros to bolster the balance sheet in 2016",
        "date": "11232015",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "topStory",
        "symbol": "TEO",
        "title": "BRIEF-Telecom Italia to raise over 3 bln euros in 2016 from series of ops "
    },
    {
        "content": "BUENOS AIRES  Oct 15 Argentina's telecoms regulator on Thursday nixed the sale of a 68 percent stake in Telecom Argentina holding company Sofora to investment firm Fintech  the regulator AFTIC said in a statement.",
        "date": "10152015",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "topStory",
        "symbol": "TEO",
        "title": "UPDATE 1-Argentina regulator nixes telecoms sale to Fintech "
    },
    {
        "content": "BUENOS AIRES  Oct 15 Argentina's telecoms regulator on Thursday nixed the sale of a 68 percent stake in Telecom Argentina holding company Sofora to investment firm Fintech  the regulator AFTIC said in a statement.",
        "date": "10152015",
        "name": "Telecom Argentina Stet - France Telecom SA",
        "news_type": "normal",
        "symbol": "TEO",
        "title": "REFILE-Argentina regulator nixes telecoms sale to Fintech "
    }
]