[
    {
        "content": "* Terex announces aerial agreement during presidential trade mission in China",
        "date": "11132017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex announces aerial agreement during presidential trade mission in China "
    },
    {
        "content": "* Says it signs strategic framework agreement with Terex Corp's Terex Utilities Inc during Trump visit",
        "date": "11092017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Xuzhou Handler Special Vehicle signs agreement with Terex during Trump visit "
    },
    {
        "content": "* Q3 adjusted earnings per share $0.50 from continuing operations",
        "date": "10312017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex reports Q3 earnings per share $0.63 from continuing operations "
    },
    {
        "content": "NEW YORK Hedge fund manager Mick McGuire on Tuesday said that crane maker Terex Corp's share price could more than triple as the company focuses on its core business and pursues a disciplined capital allocation plan.",
        "date": "09122017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Marcato's McGuire sees Terex's share price more than tripling "
    },
    {
        "content": "* Terex Corp - ‍its board of directors authorized a new share repurchase program of up to $225 million​ Source text for Eikon: Further company coverage:",
        "date": "09062017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex authorizes new share repurchase program "
    },
    {
        "content": "* BLOCK TRADE- TEREX CORPORATION COMPLETES SALE OF 5.15 MILLION SHARES OF KONECRANES PLC",
        "date": "09052017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex Corp completes sale of 5.15 mln shares of Konecranes "
    },
    {
        "content": "* : ANNOUNCES INTENTION TO SELL REMAINDER OF ITS SHARES IN KONECRANES PLC  UP TO 5.15 MILLION CLASS A SHARES AND 6.54% OF TSO",
        "date": "09052017",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Terex to sell remainder of its shares in Konecranes "
    },
    {
        "content": "* Konecranes says Terex Corp has announced its intention to sell shares in Konecranes in an accelerated book-building process and Konecranes has waived certain transfer restrictions",
        "date": "09052017",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Konecranes says Terex to sell its shares in company "
    },
    {
        "content": "* Terex Corp files for potential mixed shelf; size not disclosed - SEC filing Source text: (http://bit.ly/2wbH3Qz) Further company coverage:",
        "date": "08252017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex Corp files for potential mixed shelf "
    },
    {
        "content": "* DEMAG OF KONECRANES GROUP SIGNED A MAJOR SERVICE CONTRACT WITH DAIMLER AG IN GERMANY",
        "date": "05092017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Demag of Konecranes group signed major service contract with daimler AG "
    },
    {
        "content": "* Q1 adjusted earnings per share $0.05 from continuing operations excluding items",
        "date": "05022017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex reports Q1 loss per share $0.57 from continuing operations "
    },
    {
        "content": "* Terex Corporation authorizes new share repurchase program and increases quarterly dividend",
        "date": "02212017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex authorizes new share repurchase program "
    },
    {
        "content": "* Terex announces fourth quarter and full year 2016 results and provides 2017 guidance",
        "date": "02212017",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Terex Corp reports Q4 loss per share $2.96 "
    },
    {
        "content": "* Terex corp says intention to sell up to 9.5% of total shares outstanding of konecranes plc  corresponding to up to 7.45 million class a konecranes shares",
        "date": "02142017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex says intention to sell up to 9.5% of total shares outstanding of KoneCranes Plc "
    },
    {
        "content": "* Sheehan will assume his duties as Chief Financial Officer of Terex on February 27  2017",
        "date": "02132017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex names John Sheehan  Chief Financial Officer "
    },
    {
        "content": "* PZENA INVESTMENT MANAGEMENT LLC REPORTS A 5.57 PERCENT PASSIVE STAKE IN TEREX CORP AS OF DECEMBER 31  2016 - SEC FILING  Source text - http://bit.ly/2l1KXJ5 Further company coverage:",
        "date": "02032017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-PZENA INVESTMENT MANAGEMENT LLC REPORTS A 5.57 PERCENT PASSIVE STAKE IN TEREX CORP "
    },
    {
        "content": "* Terex Corp says hepler is currently a partner at Marcato Capital Management L.P.  Source text for Eikon:  Further company coverage:",
        "date": "02032017",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Terex announces board appointment "
    },
    {
        "content": "* Manitex International  Inc. Announces strategic alternatives being considered for A.S.V.  LLC",
        "date": "01232017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Manitex says considering strategic alternatives for JV with Terex "
    },
    {
        "content": "* Terex Corporation announces pricing of senior notes offering",
        "date": "01182017",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex Corp announces pricing of senior notes offering "
    },
    {
        "content": "* Q3 adjusted earnings per share $0.19 from continuing operations excluding items",
        "date": "10312016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex Q3 adjusted EPS $0.19 from continuing operations excluding items "
    },
    {
        "content": "Activist investor Richard McGuire said on Thursday that crane maker Terex Corp has room to slash costs and sell assets  in his first public statement about his plans for the company.",
        "date": "10062016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Terex can cut costs  sell assets  investor Marcato says "
    },
    {
        "content": "Oct 6 Activist investor Richard McGuire said on Thursday that crane maker Terex Corp has room to slash costs and sell assets  in his first public statement about his plans for the company.",
        "date": "10062016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 1-Terex can cut costs  sell assets  investor Marcato says "
    },
    {
        "content": "Oct 6 The founder of Marcato Capital Management said on Thursday he sees opportunities for crane maker Terex Corp. to sell assets and that shares of Buffalo Wild Wings could triple over a four-year period.",
        "date": "10062016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Marcato sees Terex asset sales and big upside in Buffalo Wild Wings "
    },
    {
        "content": "* On September 30  2016  co and certain of its units entered into Amendment No. 2 to Credit Agreement dated as of August 13  2014",
        "date": "10052016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex  its units entered into amendment to credit agreement dated August 13  2014 - SEC filing "
    },
    {
        "content": "* Terex corporation announces receipt of requisite consents for consent solicitation and credit agreement amendment",
        "date": "10032016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex  announces receipt of requisite consents for consent solicitation  credit agreement amendment "
    },
    {
        "content": "* Deutz Corporation based in Georgia in the United States and Terex  have concluded to expand their relationship to the field of reconditioning",
        "date": "10052016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-DEUTZ supplies Terex with Xchange engines "
    },
    {
        "content": "* Terex corporation announces commencement of consent solicitation",
        "date": "09222016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex Corporation announces commencement of consent solicitation "
    },
    {
        "content": "FRANKFURT  Sept 6 Finnish crane maker Konecranes  is launching the sale of its German unit Stahl  which it has to divest to get regulatory clearance for the acquisition of the crane and container handling segment of U.S.-based Terex   sources familiar with the matter said.",
        "date": "09062016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Konecranes launches sale of German unit Stahl - sources "
    },
    {
        "content": "* Konecranes has received approval from the European Commission for its pending acquisition of Terex's MHPS business",
        "date": "08082016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Konecranes: European Commission approves proposed acquisition of Terex's MHPS business "
    },
    {
        "content": "BRUSSELS  Aug 8 Finnish crane maker Konecranes  has gained the conditional approval of the European Commission for the acquisition of the crane and container handling segment of U.S.- based Terex  the EU executive said on Monday in a statement.",
        "date": "08082016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Konecranes wins EU conditional approval for Terex's crane business buy "
    },
    {
        "content": "BOSTON Activist hedge fund Marcato Capital Management announced its second big investment in a week on Thursday  saying it snapped up a 5.1 percent stake in crane and heavy equipment manufacturer Terex Corp .",
        "date": "07282016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Marcato makes second investment in a week with Terex stake "
    },
    {
        "content": "BOSTON  July 28 Activist hedge fund Marcato Capital Management announced its second big investment in a week on Thursday  saying it snapped up a 5.1 percent stake in crane and heavy equipment manufacturer Terex Corp.",
        "date": "07282016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 1-Marcato makes second investment in a week with Terex stake "
    },
    {
        "content": "BOSTON  July 28 Activist hedge fund Marcato Capital Management said on Thursday it has bought a 5.1 percent stake in crane manufacturer Terex Corp  marking its second big investment in a week.",
        "date": "07282016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Activist hedge fund Marcato buys 5.1 pct stake in Terex "
    },
    {
        "content": "* Marcato Capital Management LP reports 5.1 pct stake in Terex as of July 27  2016 - SEC Filing",
        "date": "07282016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Marcato Capital Management LP reports 5.1 pct stake in Terex "
    },
    {
        "content": "BRUSSELS  July 19 - Finnish crane maker Konecranes  has offered concessions in efforts to secure EU antitrust approval for its 1.1-billion-euro ($1.22 billion) takeover bid for U.S. peer Terex Corp's cranes business.",
        "date": "07192016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Konecranes seeks EU approval with concessions over Terex deal "
    },
    {
        "content": "* Finnish crane maker Konecranes said on Wednesday it has offered to sell Germany-based crane component maker Stahl to win EU approval for its proposed $1.3 billion euro acquisition of Terex Corp's cranes business for ports and factories.",
        "date": "07202016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "UPDATE 1-Konecranes offers divestiture as it seeks EU approval for Terex deal "
    },
    {
        "content": "* On June 21  2016  entered into amendment to stock and asset purchase agreement with Konecranes PLC",
        "date": "06242016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex to get $595 mln  EUR200 mln from sale of Material Handling and Port Solutions business "
    },
    {
        "content": "* Announces sale of German compact construction equipment business to Yanmar Holdings Co",
        "date": "06212016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex announces sale of German compact construction equipment business to Yanmar Holdings "
    },
    {
        "content": "* Terex Corp CFO Kevin Bradley reports open market sale of 12 000 shares of company at average price of $20.74 per share - SEC filing  Source text - http://1.usa.gov/1UdKJFk Further company coverage:",
        "date": "06172016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex CFO Bradley reports open market sale of 12 000 shares at avg price of $20.74/shr- SEC filing "
    },
    {
        "content": "BEIJING China's foreign exchange regulator said on Wednesday that Zoomlion Heavy Industry Science and Technology Co Ltd's bid for  U.S. crane maker Terex Corp did not have to face any foreign currency hurdle.",
        "date": "06012016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "China says Zoomlion's bid for Terex did not face any forex hurdle "
    },
    {
        "content": "* Deal lapsed on failure to agree on price - Zoomlion to Xinhua",
        "date": "06012016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 1-China says Zoomlion's bid for Terex did not face any forex hurdle "
    },
    {
        "content": "BEIJING  June 1 China's foreign exchange regulator said on Wednesday that Zoomlion Heavy Industry Science and Technology Co Ltd's bid for  U.S. crane maker Terex Corp did not have to clear foreign currency hurdles.",
        "date": "06012016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "China says there was no foreign currency hurdle in Zoomlion's bid for Terex "
    },
    {
        "content": "HONG KONG/HELSINKI China's Zoomlion Heavy Industry Science and Technology Co Ltd  has abandoned its $3.4 billion bid for U.S. crane maker Terex Corp   clearing the way for a smaller deal between Terex and Finland's Konecranes .",
        "date": "05272016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Konecranes-Terex deal to proceed as China's Zoomlion drops rival bid "
    },
    {
        "content": "* Konecranes shares rise  Zoomlion fall   (Adds latest Zoomlion statement)",
        "date": "05272016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 5-Konecranes-Terex deal to proceed as China's Zoomlion drops rival bid "
    },
    {
        "content": "* Agreement to sell Material Handling & Port Solutions business to Konecranes to proceed",
        "date": "05272016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Terex says talks with Zoomlion terminated "
    },
    {
        "content": "HELSINKI  May 27 Finnish crane maker Konecranes  on Friday said its proposed deal with U.S. Terex is set to go forward after China's Zoomlion dropped its rival bid.",
        "date": "05272016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Finland's Konecranes says Terex deal to go forward  shares rise "
    },
    {
        "content": "HONG KONG  May 27 Zoomlion Heavy Industry Science and Technology Co Ltd said on Friday it has terminated stake sale talks with U.S. crane maker Terex Corp   the latest blow to corporate China's growing ambitions to acquire U.S. assets.",
        "date": "05272016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "China's Zoomlion abandons talks with U.S. crane maker Terex "
    },
    {
        "content": "* If Konecranes shareholder approval is not obtained  Konecranes will need to pay Terex transaction-related expenses up to $20 million  Source (http://bit.ly/1sCESCQ) Further company coverage:",
        "date": "05192016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex says Konecranes will have to pay $20 mln termination fee if shareholders don't approve deal "
    },
    {
        "content": "HELSINKI Finland's Konecranes  has agreed to buy Terex Corp's  cranes business for ports and factories for 1.1 billion euros ($1.3 billion)  in a move that cancels a planned full merger and allows the U.S. firm to pursue talks with a rival suitor.",
        "date": "05162016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Konecranes to buy Terex unit  full merger scrapped "
    },
    {
        "content": "* Konecranes shares jump 19 pct   (Adds Breakingviews link  updates share price)",
        "date": "05162016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 3-Konecranes to buy Terex unit  full merger scrapped "
    },
    {
        "content": "* Says continuing discussions with Zoomlion regarding a potential acquisition of Terex with or without MHPS",
        "date": "05162016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Terex hopeful of CFIUS approval on Konecranes  Zoomlion deals - Conf Call "
    },
    {
        "content": "HELSINKI  May 16 Finnish crane maker Konecranes  said on Monday it has agreed to buy U.S. Terex Corp's  Material Handling & Port Solutions unit for 1.1 billion euros ($1.24 billion) in cash and shares.",
        "date": "05162016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Finland's Konecranes to buy Terex unit for $1.2 bln  full merger cancelled "
    },
    {
        "content": "* Agreed with Konecranes Plc to mutually terminate business combination agreement co entered into without payment of a fee by either party",
        "date": "05162016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Terex Corp to terminate agreement with Konecranes Plc "
    },
    {
        "content": "* Sees fy 2016 earnings per share $1.30 to $1.60 excluding items",
        "date": "04262016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Terex q1 loss per share $0.68 from continuing operations "
    },
    {
        "content": "* Company should reconsider Terex takeover after loss -analyst",
        "date": "04252016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "UPDATE 1-China Zoomlion's record Q1 loss raises questions on Terex deal funding "
    },
    {
        "content": "HELSINKI  April 27 Finnish crane maker Konecranes said it expects lower tax benefits than previously estimated from its proposed merger with U.S. Terex Corp  further undermining a deal already challenged by a rival bid.",
        "date": "04272016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Konecranes  pressured by rival bid  sees lower tax benefits from Terex merger "
    },
    {
        "content": "* Konecranes and Terex Corporation announced in August 2015 their respective Boards of Directors unanimously approved a definitive agreement to combine their businesses in a merger of equals",
        "date": "04272016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "REFILE-BRIEF-Konecranes expects lower synergies from proposed Terex merger "
    },
    {
        "content": "BEIJING  March 30 China's Zoomlion Heavy Industry Science and Technology Co Ltd   which is bidding to buy U.S. crane maker Terex Corp for about $3.4 billion  on Wednesday reported its lowest annual profit in 15 years.",
        "date": "03302016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "UPDATE 1-Zoomlion  bidding for Terex  says 2015 earnings hit 15-yr low "
    },
    {
        "content": "* Shares fall 5.8 percent after increased rival bid from Zoomlion to buy Terex",
        "date": "03242016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Konecranes shares fall after increased rival bid from Zoomlion to buy Terex\u007f\u007f "
    },
    {
        "content": "March 23 U.S. crane maker Terex Corp  said it had received a higher non-binding proposal from China's Zoomlion Heavy Industry Science and Technology Co Ltd  to buy the company for $31 per share.",
        "date": "03232016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Terex says received higher offer from China's Zoomlion "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Thursday:",
        "date": "03242016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "NORDIC STOCKS - Factors to watch on March 24 "
    },
    {
        "content": "* says notes press release from Terex corporation on Zoomlion offer",
        "date": "03242016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Konecranes says continues to pursue Terex merger despite rival bid "
    },
    {
        "content": "March 23 U.S. crane maker Terex Corp  said it had received a higher bid from China's Zoomlion Heavy Industry Science and Technology Co Ltd to buy the company for $31 per share.",
        "date": "03232016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 1-Terex says received higher offer from China's Zoomlion "
    },
    {
        "content": "China's Zoomlion Heavy Industry Science & Technology Co Ltd  has raised its bid for U.S. crane maker Terex Corp   according to people familiar with the matter  as it challenges Terex's merger with Finland's Konecranes .",
        "date": "03152016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "China's Zoomlion sweetens offer for U.S. crane maker Terex: sources "
    },
    {
        "content": "WASHINGTON  Feb 29 Three U.S. lawmakers are urging the U.S. Treasury Department to conduct a rigorous national security review of any deal that China's Zoomlion  makes to buy U.S. crane maker Terex Corp.",
        "date": "02292016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "U.S. lawmakers urge caution on potential Chinese deal to buy U.S. crane maker "
    },
    {
        "content": "U.S. crane maker Terex Corp  has told Chinese peer Zoomlion  to sweeten its $3.3 billion offer in order for it to abandon its merger agreement with Finland's Konecranes   according to people familiar with the matter.",
        "date": "02242016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Exclusive: Terex asks Zoomlion to improve its $3.3 billion offer: sources "
    },
    {
        "content": "HELSINKI  Feb 22 Konecranes Oyj still expects a planned merger with U.S. crane maker Terex Corp  to go ahead though it may take longer than hoped to close  the Finnish firm's chairman said after a rival Chinese bid emerged for Terex.",
        "date": "02222016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Konecranes still sees Terex merger  though timetable may slip "
    },
    {
        "content": "China's Zoomlion Heavy Industry Science and Technology Co Ltd confirmed on Wednesday it had made an offer for U.S. crane maker Terex Corp  a proposal that was opposed by at least one U.S. congressman on national security concerns.",
        "date": "02172016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "China's Zoomlion bids for Terex  stokes U.S. national security fears "
    },
    {
        "content": "Terex Corp   the U.S. crane maker that has received a $3.3 billion acquisition offer from China's Zoomlion   said on Friday it had halted all work on its integration with Finland's Konecranes Abp .",
        "date": "02192016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Exclusive: Terex stops Konecranes merger integration work "
    },
    {
        "content": "Feb 17 China's Zoomlion Heavy Industry Science and Technology Co Ltd  confirmed on Wednesday it had made an offer for U.S. crane maker Terex Corp   a proposal that was opposed by at least one U.S. congressman on national security concerns.",
        "date": "02172016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 2-China's Zoomlion bids for Terex  stokes U.S. national security fears "
    },
    {
        "content": "HONG KONG  Feb 17 China's Zoomlion Heavy Industry Science and Technology Co confirmed on Wednesday it had made an offer for Terex Corp that values the U.S. crane maker at about $3 billion.",
        "date": "02172016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Zoomlion confirms offer for U.S crane maker Terex "
    },
    {
        "content": "NEW YORK/WASHINGTON Terex Corp's sale discussions with China's Zoomlion are continuing despite concerns a deal could be blocked by the Committee on Foreign Investment in the United States (CFIUS)  according to people familiar with the matter.",
        "date": "01292016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Terex sale talks with Zoomlion continue despite worry U.S. may block: sources "
    },
    {
        "content": "NEW YORK/WASHINGTON  Jan 29 Terex Corp's  sale discussions with China's Zoomlion are continuing despite concerns a deal could be blocked by the Committee on Foreign Investment in the United States (CFIUS)  according to people familiar with the matter.",
        "date": "01292016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Terex sale talks with Zoomlion continue despite worry U.S. may block -sources "
    },
    {
        "content": "* Merger between Konecranes and Terex remains subject to approval by both Terex and Konecranes shareholders  regulatory approvals and other closing conditions",
        "date": "02032016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "BRIEF-Konecranes: update on pending merger between Konecranes and Terex "
    },
    {
        "content": "Terex Corp  received an unsolicited offer from China's Zoomlion Heavy Industry Science and Technology Co   the U.S. crane maker confirmed  valuing the company at about $3.28 billion.",
        "date": "01262016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Terex gets unsolicited offer from China's Zoomlion "
    },
    {
        "content": "HELSINKI Konecranes  plans to push ahead with a deal with U.S. crane maker Terex  after China's Zoomlion Heavy Industry Science and Technology Co  made a rival offer for it.",
        "date": "01272016",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "Finland's Konecranes undeterred by rival bid for Terex "
    },
    {
        "content": "Jan 26 Terex Corp received an unsolicited offer from China's Zoomlion Heavy Industry Science and Technology Co  the U.S. crane maker confirmed  valuing the company at about $3.28 billion.",
        "date": "01262016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 2-Terex gets unsolicited offer from China's Zoomlion "
    },
    {
        "content": "HELSINKI  Jan 27 Konecranes plans to push ahead with a deal with U.S. crane maker Terex after China's Zoomlion Heavy Industry Science and Technology Co  made a rival offer for it.",
        "date": "01272016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 1-Finland's Konecranes undeterred by rival bid for Terex "
    },
    {
        "content": "Jan 26 U.S. crane and mining equipment maker Terex Corp received a takeover approach from China's Zoomlion Heavy Industry Science and Technology Co that it rebuffed  Bloomberg reported.",
        "date": "01262016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Terex rebuffs takeover offer from China's Zoomlion-Bloomberg "
    },
    {
        "content": "Jan 27 Zoomlion Heavy Industry Science and Technology Co Ltd",
        "date": "01272016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Zoomlion was in talks with Terex  though unable to confirm any deal "
    },
    {
        "content": "HELSINKI  Jan 27 Konecranes said China's Zoomlion is unlikely to buy Terex  the U.S. company which the Finnish crane maker has agreed to merge with  its chairman told local newspaper.",
        "date": "01272016",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "Finland's Konecranes sees Zoomlion-Terex deal unlikely - report "
    },
    {
        "content": "* Sees China sales at 10-15 pct of total by 2018 vs 5-10 pct now",
        "date": "09212015",
        "name": "Terex Corporation",
        "news_type": "topStory",
        "symbol": "TEX",
        "title": "U.S. crane maker Terex sees China sales growth amid shrinking industry "
    },
    {
        "content": "HELSINKI  Aug 11 U.S. crane maker Terex  and Finland's Konecranes have agreed on an all-share merger to complement their businesses and achieve cost savings  the companies said on Tuesday.",
        "date": "08112015",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "U.S. crane maker Terex to merge with Finland's Konecranes "
    },
    {
        "content": "* Konecranes shares jump 25 percent to record high   (Adds analyst  company comments  detail  background  shares)",
        "date": "08112015",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "UPDATE 2-US crane maker Terex to merge with Finland's Konecranes "
    },
    {
        "content": "* shares rise about 18 percent after Terex merger announcement  Source text for Eikon:  Further company coverage:    (Reporting By Jussi Rosendahl)",
        "date": "08112015",
        "name": "Terex Corporation",
        "news_type": "normal",
        "symbol": "TEX",
        "title": "BRIEF-Konecranes shares jump on Terex merger announcement "
    }
]