[
    {
        "content": "CHICAGO  Nov 16 Wal-Mart Stores Inc reported better-than-expected U.S. comparable sales on Thursday  as customers stocked up on food and other supplies ahead of hurricanes and online purchases soared  sending its shares up more than 8.5 percent.",
        "date": "11162017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-Wal-Mart shares jump on strong U.S. sales growth "
    },
    {
        "content": "Target Corp's  holiday-quarter profit forecast fell short of analyst expectations  sending its shares down 10 percent on Wednesday as hopes faded that the retailer would make a shopping season comeback. | Video ",
        "date": "11152017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target signals another weak holiday quarter  shares tumble "
    },
    {
        "content": "* Indexes down: Dow 0.41 pct  S&P 0.36 pct  Nasdaq 0.35 pct (Updates to early afternoon)",
        "date": "11152017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "US STOCKS-Wall St lower as weak oil prices pull down energy stocks "
    },
    {
        "content": "Nov 15 Target Corp's holiday-quarter profit forecast fell short of analyst expectations  sending its shares down 10 percent on Wednesday as hopes faded that the retailer would make a shopping season comeback.",
        "date": "11152017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-Target signals another weak holiday quarter  shares tumble "
    },
    {
        "content": "* Indexes down: Dow 0.45 pct  S&P 0.45 pct  Nasdaq 0.44 pct (Changes comment  updates prices )",
        "date": "11152017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "US STOCKS-Wall St down as energy stocks hit by oil slide "
    },
    {
        "content": "Nov 15 Target Corp reported a better-than-expected 0.9 percent rise in comparable sales  as price cuts on several everyday items helped drive traffic at its stores and website.",
        "date": "11152017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target's quarterly comparable sales beat estimates "
    },
    {
        "content": "* Target Corp - ‍Q3 GAAP EPS from continuing operations of $0.87​",
        "date": "11152017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target reports qtrly ‍adjusted EPS of $0.91​ "
    },
    {
        "content": "* Target - All hourly team members who work some shifts on Thanksgiving  Black Friday  weekends leading up to Christmas to get additional compensation",
        "date": "11062017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target reveals deep Black Friday discounts "
    },
    {
        "content": " (This Oct 29 story corrects fourth paragraph to show Target will roll out 12 more in-house brands before the end of next year  not this year  after Barron's corrected its story.)",
        "date": "10302017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target's new changes could boost stock: Barron's "
    },
    {
        "content": "Oct 29 Target Corp's growing focus on online sales and other changes at the U.S. retailer could reward investors  propelling its stock to $75-$80 during the next two years  returning 20 percent to 30 percent  Barron's reported on Sunday.",
        "date": "10302017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "OFFICIAL CORRECTION-Target's new changes could boost stock - Barron's "
    },
    {
        "content": "NEW YORK Target Corp  said on Monday it would start free shipping beginning in November and that most of its gift assortment had been priced at under $15  as the retailer gets ready to take on Amazon.com  and Wal-Mart  in the most crucial shopping season of the year.",
        "date": "10232017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target gears up for holidays with free shipping and gifts under $15 "
    },
    {
        "content": "* Target Corporation announces final results of any and all tender offers Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target reports results of any and all tender offers "
    },
    {
        "content": "NEW YORK  Oct 23 Target Corp said on Monday it would start free shipping beginning in November and that most of its gift assortment had been priced at under $15  as the retailer gets ready to take on Amazon.com and Wal-Mart in the most crucial shopping season of the year.",
        "date": "10232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "CORRECTED-Target gears up for holidays with free shipping and gifts under $15 "
    },
    {
        "content": "* Will unveil new brands and thousands of exclusive gifts under $15 for holiday season",
        "date": "10232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target to unveil new brands  thousands of exclusive gifts under $15 for holiday season "
    },
    {
        "content": "SAN FRANCISCO Whole Foods Market met a new foe this summer during talks to lease a top retail space in a San Francisco mall: the Target next door. | Video ",
        "date": "10242017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Amazon rivals turn to legal fine print to stem Whole Foods strategy "
    },
    {
        "content": " (Repeats to additional customers with no changes to text)     By Jeffrey Dastin     SAN FRANCISCO  Oct 24 Whole Foods Market met a new foe this summer during talks to lease a top retail space in a San Francisco mall: the Target next door.     As City Center mall's largest tenant  Target Corp         had a say over changes to the property. According to people familiar with the lease discussions  Target balked at sharing the mall with Whole Foods because it feared competition from the",
        "date": "10242017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "RPT-INSIGHT-Amazon rivals turn to legal fine print to stem Whole Foods strategy "
    },
    {
        "content": "    By Jeffrey Dastin     SAN FRANCISCO  Oct 24 Whole Foods Market met a new foe this summer during talks to lease a top retail space in a San Francisco mall: the Target next door.     As City Center mall's largest tenant  Target Corp         had a say over changes to the property. According to people familiar with the lease discussions  Target balked at sharing the mall with Whole Foods because it feared competition from the grocery chain's new owner  Amazon.com Inc         .     Ea",
        "date": "10242017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "INSIGHT-Amazon rivals turn to legal fine print to stem Whole Foods strategy "
    },
    {
        "content": "* Target Corporation announces pricing of pending any and all Tender Offers",
        "date": "10202017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target Corp announces pricing of pending any and all Tender Offers "
    },
    {
        "content": "* Target opens 12 new stores across the country  expands plans for remodels and Target restock",
        "date": "10192017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target opens 12 new stores across U.S.  expands plans for remodels and Target Restock "
    },
    {
        "content": "NEW YORK  Oct 19 Sales per square foot at Target Corp's 44 small-format stores are \"easily double\" that at traditional stores  Target Chief Executive Brian Cornell said on Thursday  after the retailer announced 11 new small-format stores opening this week.",
        "date": "10192017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target CEO says small-format stores twice as productive as traditional "
    },
    {
        "content": "* Files prospectus supplement related to a potential offering of notes due 2047 - SEC filing‍​ Source text : (http://bit.ly/2ynzNlH) Further company coverage:",
        "date": "10162017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target files prospectus supplement related to a potential offering of notes due 2047‍​ "
    },
    {
        "content": "* Target Corporation announces tender offers for any and all of certain outstanding debt securities",
        "date": "10162017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target announces tender offers "
    },
    {
        "content": "LOS ANGELES  Oct 3 Trader Joe's and Sprouts Farmers Market Inc have been hit hardest by customer defections since Amazon.com Inc cut prices at Whole Foods  a data analytics firm said on Tuesday.",
        "date": "10032017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Whole Foods price cuts hit hardest at Trader Joe's  Sprouts -study "
    },
    {
        "content": "CHICAGO  Sept 25 Target Corp said on Monday it would increase its minimum hourly wage this year by a dollar to $11  vowing to raise this by the end of 2020 to $15 an hour -- the so-called \"living wage\" labor advocates across the United States are campaigning for.",
        "date": "09252017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target raises minimum hourly wage to $11  pledges $15 by end of 2020 "
    },
    {
        "content": "* Sets quarterly dividend of $0.62 per share Source text for Eikon: Further company coverage:",
        "date": "09212017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target Corp declares regular quarterly dividend "
    },
    {
        "content": "* Plans to raise minimum hourly wage for all team members to $11 in October",
        "date": "09252017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target plans to raise minimum hourly wage to $11 in October "
    },
    {
        "content": "* ‍Kaiser Permanente -Co  Target announced will launch 31 additional Kaiser Permanente-staffed retail clinics in Target stores across Southern California​ Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Kaiser Permanente and Target to open 31 more retail clinics in Southern California "
    },
    {
        "content": "Target Corp  said on Wednesday it would hire 100 000 workers for the holiday season  up 43 percent from last year  as the retailer pulls out all the stops to build on its recent uptick in sales. | Video ",
        "date": "09132017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target to hire 100 000 for holiday season rush "
    },
    {
        "content": "Sept 13 Target Corp said on Wednesday it would hire 100 000 workers for the holiday season  up 43 percent from last year  as the retailer pulls out all the stops to build on its recent uptick in sales.",
        "date": "09132017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Target to hire 100 000 for holiday season rush "
    },
    {
        "content": "* Target recalls room essentials 4-drawer dressers due to tip-over and entrapment hazards",
        "date": "09132017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target recalls room essentials 4-drawer dressers due to tip-over and entrapment hazards "
    },
    {
        "content": "Sept 13 Target Corp said on Wednesday it would hire about 100 000 workers for the holiday season  a 43 percent increase from last year  after keeping seasonal hiring flat for the last four years.",
        "date": "09132017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to hire 100 000 workers for holiday season "
    },
    {
        "content": "Sept 7 Merger and acquisition dealmakers make their livings advising companies on mergers  sales and spinoffs. But this time  investment bankers at JPMorgan Chase & Co are working on an internal deal of their own.",
        "date": "09072017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "JPMorgan creates joint venture for retail  internet banking -memo "
    },
    {
        "content": "Sept 8 Target Corp said on Friday that it lowered prices on thousands of items  from cereal to baby formula  further  hurting retail stocks already pressured by Kroger Co's  disappointing quarterly results spurred by price cuts.",
        "date": "09082017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target slashes prices on thousands of items  shares falter "
    },
    {
        "content": "* Target names Minsok Pak as company's Chief Strategy and Innovation Officer",
        "date": "08232017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target names Minsok Pak as company's Chief Strategy and Innovation Officer "
    },
    {
        "content": "Target Corp  on Wednesday reported an increase in second-quarter comparable-store sales after four straight negative quarters  driven by improved online traffic and demand across all businesses except groceries. | Video ",
        "date": "08162017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target sales  profit boosted by online traffic; raises outlook "
    },
    {
        "content": "Aug 16 Target Corp on Wednesday reported an increase in second-quarter comparable-store sales after four straight negative quarters  driven by improved online traffic and demand across all businesses except groceries.",
        "date": "08162017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Target sales  profit boosted by online traffic; raises outlook "
    },
    {
        "content": "* Qtrly comparable digital channel sales increased 32 percent",
        "date": "08162017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target Corp Q2 ‍adjusted EPS $1.23​ "
    },
    {
        "content": "CHICAGO Target Corp  said on Monday it has hired two former executives from Wal-Mart Inc  and General Mills Inc  to join its food and beverage business  as the retailer seeks to revamp its grocery aisles.",
        "date": "08142017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target appoints Walmart  General Mills executives to shore up grocery business "
    },
    {
        "content": "Aug 16 Target Corp reported a 1.3 percent rise in quarterly comparable sales  after a year of declines  helped by higher customer visits to its stores and website.",
        "date": "08162017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target posts higher quarterly comp sales after a year of declines "
    },
    {
        "content": "CHICAGO  Aug 14 Target Corp said on Monday it has hired two former executives from Wal-Mart Inc and General Mills Inc to join its food and beverage business  as the retailer seeks to revamp its grocery aisles.",
        "date": "08142017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target appoints Walmart  General Mills execs to shore up grocery business "
    },
    {
        "content": "Target Corp  forecast sales to increase for the first time in five quarters  thanks to improved customer traffic and sales trends  sending its shares up as much as 4.4 percent and pushing retail stocks higher. | Video ",
        "date": "07132017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target's upbeat forecast drives retail stocks higher "
    },
    {
        "content": "* Sees 2nd-quarter profit above forecast range of $0.95-$1.15/shr",
        "date": "07132017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-Target's upbeat forecast drives retail stocks higher "
    },
    {
        "content": "July 13 Target Corp said on Thursday it expects a \"modest\" increase in comparable sales for the second quarter ended July  citing improved traffic and sales trends through the first two months of the quarter.",
        "date": "07132017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target estimates rise in 2nd-qtr comparable sales  higher profit "
    },
    {
        "content": "* Target Corp - Q2 GAAP EPS is expected to reflect 2 to 3 cents of pressure related to unfavorable resolution of tax matters​",
        "date": "07132017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target updates second quarter 2017 guidance "
    },
    {
        "content": "* Sets quarterly dividend of $0.62 per share Source text for Eikon: Further company coverage:",
        "date": "06142017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target corporation announces 3.3 percent dividend increase "
    },
    {
        "content": "* SAID ON MONDAY ITS SHAREHOLDERS WILL VOTE AT THE EXTRAORDINARY MEETING ON JULY 3 ON THE MERGER OF THE COMPANY WITH TWO OF ITS WHOLLY OWNED UNITS  CENTRUM MEDYCZNE \"MEDYK\" SP. Z O.O. AND \"Q-MED\" SP. Z O.O. (TARGET COMPANIES)",
        "date": "06062017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-EMC Instytut Medyczny plans merger with wholly owned units "
    },
    {
        "content": "May 23 Retailer Target Corp reached an $18.5 million settlement with 47 states and the District of Columbia over a massive data breach in late 2013.",
        "date": "05232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target in $18.5 mln multi-state settlement over data breach "
    },
    {
        "content": "WASHINGTON The chief executive officers of two major American companies - retailer Target Corp and agribusiness Archer Daniels Midland Co - offered opposing views in a hearing before U.S. lawmakers on Tuesday on a proposed border adjustment tax.",
        "date": "05232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "CEOs of Target  ADM offer differing views on U.S. border tax at hearing "
    },
    {
        "content": "Target Corp on Tuesday agreed to pay $18.5 million to settle claims by 47 states and the District of Columbia and resolve a multi-state investigation into the retailer's massive data breach in late 2013.",
        "date": "05232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target in $18.5 million multi-state settlement over data breach "
    },
    {
        "content": "WASHINGTON  May 23 The chief executive officers of two major American companies - retailer Target Corp and agribusiness Archer Daniels Midland Co - offered opposing views in a hearing before U.S. lawmakers on Tuesday on a proposed border adjustment tax.",
        "date": "05232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-CEOs of Target  ADM offer differing views on U.S. border tax at hearing "
    },
    {
        "content": "May 23 Target Corp on Tuesday agreed to pay $18.5 million to settle claims by 47 states and the District of Columbia and resolve a multi-state investigation into the retailer's massive data breach in late 2013.",
        "date": "05232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Target in $18.5 mln multi-state settlement over data breach "
    },
    {
        "content": "May 23 New York Attorney General Eric T. Schneiderman:",
        "date": "05232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-NY Attorney General announces $18.5 mln multi-state settlement with Target over 2013 Data Breach "
    },
    {
        "content": "WASHINGTON  May 23 The chief executive officers of two major American companies - retailer Target Corp and agribusiness Archer Daniels Midland Co - will offer countering views in a hearing before U.S. lawmakers on Tuesday on a proposed border adjustment tax.",
        "date": "05232017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "CEOs of Target  ADM to square off on U.S. border tax at hearing "
    },
    {
        "content": "Target Corp  reported higher-than-expected quarterly profit and sales and set an optimistic tone for the year  saying its full-year profit could come in at the higher end of its forecast.",
        "date": "05172017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target optimistic on full-year forecast after profit beat "
    },
    {
        "content": "May 17 Target Corp reported higher-than-expected quarterly profit and sales and set an optimistic tone for the year  saying its full-year profit could come in at the higher end of its forecast.",
        "date": "05172017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Target optimistic on full-year forecast after profit beat "
    },
    {
        "content": "* CEO on conf call- \"our results are not where we want them to be\"",
        "date": "05172017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target CEO on conf call- in early stages of implementing efforts to reestablish everyday price credibility "
    },
    {
        "content": "May 17 Target Corp reported a smaller-than-expected drop in quarterly comparable sales on Wednesday  as sales picked up in March after a slow start to the quarter.",
        "date": "05172017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target posts smaller-than-expected drop in comp sales  shares up "
    },
    {
        "content": "May 8 Target Corp plans to test a next-day home delivery service called Target Restock in the Minneapolis area  the company said in a blog post on Monday.",
        "date": "05092017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to test next-day delivery service in Minneapolis "
    },
    {
        "content": "* Target plans to test a next-day essentials delivery service in the minneapolis area Source text - http://bit.ly/2pVzSum Further company coverage:",
        "date": "05082017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target to test a next-day essentials delivery service in Minneapolis area "
    },
    {
        "content": "* Q1 GAAP earnings per share $1.22 from continuing operations",
        "date": "05172017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target says Q1 same store sales fell 1.3 percent "
    },
    {
        "content": "A federal appeals court on Friday dismissed a store clerk's claims against Target Corp and a staffing company  holding that he failed to show there was a hostile work environment at the mobile phone kiosk in a Minnesota Target store where he worked.",
        "date": "05052017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Appeals court dismisses Palestinian immigrant's job bias lawsuit against Target "
    },
    {
        "content": "May 1 Target Corp's Chief Executive Brian Cornell took a sharp cut in compensation after the company failed to meet financial goals in a year marred by declines in sales and share price.",
        "date": "05012017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target slashes CEO pay package after bleak year "
    },
    {
        "content": "May 1 Target Corp's Chief Executive Brian Cornell took a sharp cut in compensation after the company failed to meet financial goals in a year marred by declines in sales and share price.",
        "date": "05012017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Target slashes CEO pay package after bleak year "
    },
    {
        "content": "* Target corp - ceo brian c. Cornell's 2016 total compensation was $11.3 million versus $16.9 million in 2015 - sec filing",
        "date": "05012017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target Corp says CEO Brian Cornell's 2016 total compensation was $11.3 mln versus $16.9 mln in 2015 - SEC Filing "
    },
    {
        "content": "* Avery Dennison announces global radio frequency identification (RFID) partnership agreement with Target Corp Source text for Eikon: Further company coverage:",
        "date": "04032017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Avery Dennison announces global radio frequency identification partnership agreement with Target Corp "
    },
    {
        "content": "March 20 Target Corp on Monday named Kroger Co veteran Jeff Burt its senior vice president of grocery  fresh food and beverage  replacing Anne Dament.",
        "date": "03202017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target names Kroger veteran Jeff Burt new grocery chief "
    },
    {
        "content": "March 20 Target Corp on Monday named Kroger Co veteran Jeff Burt its senior vice president of grocery  fresh food and beverage  as the retailer makes a renewed push to overhaul the business amid an intensifying price war.",
        "date": "03202017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Target names Kroger veteran Jeff Burt new grocery chief "
    },
    {
        "content": "* Target names Jeff Burt senior vice president  grocery  fresh food and beverage",
        "date": "03202017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target names Jeff Burt senior vice president  grocery  fresh food and beverage "
    },
    {
        "content": "* Target announces first Midtown Manhattan store at Empire State Realty Trust's 112 West 34th Street location  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target announces first Midtown Manhattan store "
    },
    {
        "content": "* Sets quarterly dividend of $0.60 per share  Source text for Eikon:  Further company coverage:",
        "date": "03092017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target sets quarterly dividend of 60 cents/shr "
    },
    {
        "content": "* Says it expects capital expenditures in 2017 to increase to about $2.0 billion to $2.5 billion - SEC filing",
        "date": "03082017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target expects capital expenditures in 2017 to increase to about $2.0 billion to $2.5 billion - SEC filing "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 01 (Fitch) Fitch Ratings has affirmed the Long-term Issuer  Default Rating (IDR) on Target Corporation (Target) at 'A-' and the Short-term  IDR at 'F2'. The Rating Outlook has been revised to Negative from Positive. The Outlook revision acknowledges the accelerated impact of changes in consumer  shopping preferences on Target's near-term results and the significant  investments required to stabilize market share over the ",
        "date": "03012017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Fitch Affirms Target Corporation at 'A-'; Outlook Revised to Negative "
    },
    {
        "content": "NEW YORK Target Corp  said on Tuesday it will rely more on low prices to compete with rivals like Wal-Mart and Amazon  admitted many of its stores needed freshening up  and told Wall Street its sales and profit estimates for 2017 are too high. | Video ",
        "date": "02282017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target shares dive on earnings outlook  price cut plans "
    },
    {
        "content": "* Target to cut prices  launch brands  spend on stores and online",
        "date": "02282017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 9-Target shares dive on earnings outlook  price cut plans "
    },
    {
        "content": "* Target corp says Q4 comparable digital channel sales increased 34 percent",
        "date": "02282017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target Q4 adjusted EPS of $1.45 "
    },
    {
        "content": "Feb 28 Target Corp reported a steeper-than-expected decline in quarterly same-store sales on Tuesday  highlighting the retailer's struggles in the holiday season.",
        "date": "02282017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target Q4 same-store sales drop more than expected "
    },
    {
        "content": "WASHINGTON  Feb 15 U.S. President Donald Trump on Wednesday called tax code revisions a critical way to boost the nation's economy as he kicked off a White House meeting with chief executive officers of Target Corp  Best Buy Co Inc  and six other major retailers.",
        "date": "02152017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Trump meets with retail CEOs to talk taxes  imports "
    },
    {
        "content": "Feb 17 A Florida man has been charged with plotting to plant bombs in at least 10 Target Corp stores and then profit when the blasts caused the company's stock price to fall  federal prosecutors have said.",
        "date": "02172017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Florida man charged with plotting to bomb Target stores "
    },
    {
        "content": "WASHINGTON  Feb 15 U.S. President Donald Trump will welcome the chief executive officers of Target Corp   Best Buy Co Inc and six other major retailers to the White House on Wednesday morning to discuss tax reform and infrastructure.",
        "date": "02152017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Trump to meet with retail CEOs who oppose border tax "
    },
    {
        "content": " ",
        "date": "01262017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target revamps chemical use policy  asks suppliers to list ingredients "
    },
    {
        "content": "WASHINGTON  Jan 31 Days before a group of Republican lawmakers were due to discuss their party's controversial proposal to tax all imports  Toyota Motor Corp  sent an urgent message to its U.S. dealers - tell the politicians the tax would seriously hurt car buyers.",
        "date": "01312017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "RPT-INSIGHT-How Toyota  Target  Best Buy are fighting back against Republican border tax push "
    },
    {
        "content": "WASHINGTON  Jan 31 Days before a group of Republican lawmakers were due to discuss their party's controversial proposal to tax all imports  Toyota Motor Corp  sent an urgent message to its U.S. dealers - tell the politicians the tax would seriously hurt car buyers.",
        "date": "01312017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "INSIGHT-How Toyota  Target  Best Buy are fighting back against Republican border tax push "
    },
    {
        "content": "Target Corp  became the latest U.S. brick-and-mortar chain to report disappointing results for the holiday season  cutting its quarterly earnings forecast after sales for the crucial November-December period came in lower than expected.",
        "date": "01182017",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target cuts earnings forecast due to weak holiday sales "
    },
    {
        "content": "CHICAGO  Jan 24 Target Corp said on Tuesday it plans to launch its own mobile payment service this year in stores  which would allow customers to pay for goods using an app on their mobile phones.",
        "date": "01242017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to launch mobile payment service in U.S. stores this year "
    },
    {
        "content": "Jan 19 Target Corp on Thursday appointed Rick Gomez as its chief marketing officer  replacing Jeff Jones  who had left the retail chain to join Uber Technologies Inc .",
        "date": "01192017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target names Rick Gomez as marketing chief "
    },
    {
        "content": "(Updates shares  adds fresh company comment  background)     By Nandita Bose and Aravind K     Jan 18 Target Corp became the latest U.S. brick-and-mortar chain to report disappointing results for the holiday season  cutting its quarterly earnings forecast after sales for the crucial November-December period came in lower than expected.     The news on Wednesday sent Target shares down nearly 6 percent.     A sharp rise in holiday digital sales failed to offset declines at Target s",
        "date": "01182017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-Target cuts earnings forecast due to weak holiday sales "
    },
    {
        "content": "* Target names Rick Gomez as company's chief marketing officer",
        "date": "01192017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target names Rick Gomez as chief marketing officer "
    },
    {
        "content": "Jan 18 Target Corp lowered its comparable store sales and earnings forecasts for the fourth quarter  citing softer-than-expected holiday sales.",
        "date": "01182017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target cuts Q4 forecast due to weak holiday sales "
    },
    {
        "content": "* Target reports November/December sales and updates fourth quarter 2016 guidance",
        "date": "01182017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target reports November/December sales and updates fourth quarter 2016 guidance "
    },
    {
        "content": "* Target announces major push into soccer in the U.S.; becomes official partner of major league soccer and Minnesota United FC  Source text for Eikon:  Further company coverage:",
        "date": "01192017",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target announces major push into soccer in the U.S. "
    },
    {
        "content": "* \"We had a record-breaking day on target.com and traffic to our stores was strong\"  Source text for Eikon:  Further company coverage:",
        "date": "11252016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target Reports Strong Start to Black Friday in Stores "
    },
    {
        "content": "* Co is offering 15 percent off nearly everything online & in stores for two days  from Sunday  Nov. 27  through Cyber Monday  Nov. 28  Source text for Eikon:  Further company coverage:",
        "date": "11232016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target to offer 15 pct off in online & in stores for 2 days "
    },
    {
        "content": "CHICAGO Target Corp  on Wednesday reported a much higher-than-expected quarterly profit after benefiting from a strong back-to-school shopping season and increased online sales  and it gave an optimistic outlook for the all-important holiday period. | Video ",
        "date": "11162016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target expresses confidence about holiday sales; shares rise "
    },
    {
        "content": "CHICAGO  Nov 16 Target Corp on Wednesday reported a much higher-than-expected quarterly profit after benefiting from a strong back-to-school shopping season and increased online sales  and it gave an optimistic outlook for the all-important holiday period.",
        "date": "11162016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 5-Target expresses confidence about holiday sales; shares rise "
    },
    {
        "content": "* Target Corp - Target returned $1.2 billion to shareholders in Q3 through dividends and share repurchases.",
        "date": "11162016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target Corp qtrly adjusted EPS of $1.04 "
    },
    {
        "content": "CHICAGO  Nov 16 Target Corp reported a nearly 11 percent increase in quarterly profit on Wednesday  helped by a strong back-to-school shopping season  sending its shares up 6 percent in pre-market trade.",
        "date": "11162016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target Corp's net earnings rise nearly 11 percent "
    },
    {
        "content": "CHICAGO  Nov 2 Target Corp said on Wednesday its grocery chief is stepping down  as the retailer struggles to overhaul a key business and attract more shoppers to visit its grocery aisles.",
        "date": "11032016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target's leadership shakeup continues  grocery chief steps down "
    },
    {
        "content": "NEW YORK  Oct 25 Target Corp will offer more deal-driven promotions and extend its free shipping window to January this holiday season as it looks to turn around performance in what has so far been a lackluster year for the retailer.",
        "date": "10252016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to offer more deals  extend free shipping until January "
    },
    {
        "content": "NEW YORK  Oct 25 Target Corp will offer more deal-driven promotions and extend its free shipping window to January this holiday season as it looks to turn around performance in what has so far been a lackluster year for the retailer.",
        "date": "10252016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Target to offer more deals  extend free shipping until January "
    },
    {
        "content": "LOS ANGELES  Oct 17 Two of America's biggest commercial brands - discount retailer Target and fast-food chain McDonald's - have taken steps to tamp down hysteria stemming from a recent spate of creepy clown sightings in the run-up to Halloween at the end of this month.",
        "date": "10172016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target  McDonald's react to U.S. creepy clown sightings "
    },
    {
        "content": "Oct 18 John Stumpf resigned from the boards of Chevron Corp and Target Corp a week after he quit Wells Fargo & Co as chief executive bowing to pressure over its sales tactics.",
        "date": "10182016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Wells Fargo ex-CEO John Stumpf resigns from Chevron  Target boards "
    },
    {
        "content": "* Target Corp - on October 17  2016  Target Corporation was notified by John G. Stumpf that he has resigned from board of directors of Target Corporation",
        "date": "10182016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target says John Stumpf resigned from board "
    },
    {
        "content": "HOUSTON  Oct 3 Chevron Corp on Monday said it stands behind John Stumpf  a member of its board and the chief executive of bank Wells Fargo & Co  despite growing concerns about his leadership during a customer service scandal.",
        "date": "10042016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 1-Chevron supports director Stumpf despite Wells Fargo morass "
    },
    {
        "content": "* Target corp says entered into a five-year credit agreement with certain lenders - sec filing",
        "date": "10052016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target Corp entered into 5 year credit agreement for $2.5 Bln with certain lenders "
    },
    {
        "content": "CHICAGO Target Corp  said on Friday its chief digital officer has left the company amid a company overhaul of its e-commerce operations to boost online sales and better compete with larger rivals such as Amazon.com Inc .",
        "date": "09242016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target shakes up online leadership with eye on rivals "
    },
    {
        "content": "CHICAGO  Sept 23 Target Corp said on Friday its chief digital officer has left the company amid a company overhaul of its e-commerce operations to boost online sales and better compete with larger rivals such as Amazon.com Inc.",
        "date": "09242016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Target shakes up online leadership with eye on rivals "
    },
    {
        "content": "Target Corp  on Wednesday announced a new $5 billion share buyback plan.",
        "date": "09222016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target to buy back $5 billion shares "
    },
    {
        "content": "* Target announced its board of directors has declared a quarterly dividend of 60 cents per common share",
        "date": "09212016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target's board declares a quarterly dividend of 60 cents per common share "
    },
    {
        "content": "Sept 22 Yahoo Inc said on Thursday that at least 500 million of its accounts were hacked in 2014 by what it believed was a state-sponsored actor  a theft that appeared to be the world's biggest known cyber breach by far.",
        "date": "09222016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-Yahoo says hackers stole data from 500 mln accounts in 2014 "
    },
    {
        "content": "Sept 21 Target Corp on Wednesday announced a new $5 billion share buyback plan.",
        "date": "09212016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to buy back $5 bln shares "
    },
    {
        "content": "Department store operator Kohl's Corp  said on Monday it would hire more than 69 000 extra workers in the United States this holiday shopping season  about the same as last year  echoing larger retailer Target Corp's  decision to keep seasonal hiring around last year's level.",
        "date": "09192016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Kohl's to keep seasonal hiring little changed at about 69 000 "
    },
    {
        "content": "Sept 19 Department store operator Kohl's Corp  said on Monday it would hire more than 69 000 extra workers in the United States this holiday shopping season  about the same as last year  echoing larger retailer Target Corp's  decision to keep seasonal hiring around last year's level.",
        "date": "09192016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Kohl's to keep seasonal hiring little changed at about 69 000 "
    },
    {
        "content": "MINNEAPOLIS  Sept 15 Target Corp Chief Executive Brian Cornell on Thursday urged the company's employees to focus on delivering a better in-store and online experience for shoppers in an attempt to turnaround its performance before the crucial holiday season.",
        "date": "09162016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target urges employees to help turn around performance ahead of holidays "
    },
    {
        "content": "Uber Technologies Inc [UBER.UL] has plucked a top executive from U.S. retailer Target to help lead the growing ride-services company and reshape its image.",
        "date": "08302016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Uber hires senior Target executive to lead global operations "
    },
    {
        "content": "Aug 30 Uber Technologies Inc has plucked a top executive from U.S. retailer Target to help lead the growing ride-services company and reshape its image.",
        "date": "08302016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Uber hires senior Target executive to lead global operations "
    },
    {
        "content": "* On August 24  Jeffrey J. Jones II notified that he will resign as executive VP and chief marketing officer  effective September 9  2016  Source text (http://bit.ly/2bXKToU) Further company coverage:",
        "date": "08302016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target says on August 24  Jeffrey J. Jones II notified of intention to resign as executive VP  chief marketing officer "
    },
    {
        "content": " ",
        "date": "08232016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 5-Best Buy profit beats estimates; shares surge "
    },
    {
        "content": "Aug 22 U.S. retailer Target Corp will focus on technologies that enhance customers' store experience and on other digital efforts  Chief Information Officer Mike McNamara said.",
        "date": "08222016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Retailer Target to focus on digital efforts  CIO says "
    },
    {
        "content": "MUMBAI  Aug 22 Shares in Welspun India   one of the world's largest textile manufacturers  fell by their maximum daily limit of 20 percent on Monday after Target Corp said it was severing ties with the company over a cotton supply dispute.",
        "date": "08222016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Welspun India shares slump after Target severs ties with co "
    },
    {
        "content": "* Target severs ties with Welspun over Egyptian-cotton dispute- Bloomberg",
        "date": "08192016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target severs ties with Welspun over Egyptian-cotton dispute- Bloomberg "
    },
    {
        "content": "Target Corp reported a drop in demand for Apple Inc's products that hurt the retail chain's electronics sales in the second quarter  but said it is working with the iPhone maker to capitalize on new product launches during the second half. | Video ",
        "date": "08172016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target says low demand for Apple products hurts electronics sales "
    },
    {
        "content": "* Shares fall as much as 4.25 pct   (Adds CFO comment  updates shares)",
        "date": "08192016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Estee Lauder's forecast takes hit on global uncertainties "
    },
    {
        "content": "Aug 17 Target Corp reported a drop in demand for Apple Inc's products that hurt the retail chain's electronics sales in the second quarter  but said it is working with the iPhone maker to capitalize on new product launches during the second half.",
        "date": "08172016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 5-Target says low demand for Apple products hurts electronics sales "
    },
    {
        "content": "* Q2 GAAP EPS from continuing operations of $1.07 and adjusted EPS of $1.23",
        "date": "08172016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target Q2 comparable sales decrease 1.1 pct "
    },
    {
        "content": "Aug 17 Target Corp reported a nearly 10 percent fall in quarterly profit on Wednesday  hurt by a slump in demand for apparel.",
        "date": "08172016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target's quarterly profit falls nearly 10 percent "
    },
    {
        "content": "* Ben Cook joins the company July 24 and will relocate to Minneapolis",
        "date": "07202016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target names Ben Cook Senior Vice President  Global Logistics  Inventory Allocation and Replenishment "
    },
    {
        "content": "BOSTON  July 15 A widening criminal probe casts new light on a bitter defeat hedge fund activist Bill Ackman suffered in his 2009 bid for board seats at U.S. retailer Target Corp.",
        "date": "07152016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Criminal probe casts 2009 Ackman-Target boardroom brawl in new light "
    },
    {
        "content": "* Target names Don Liu as executive vice president  chief legal officer and general counsel",
        "date": "07142016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target names Don Liu as executive vice president "
    },
    {
        "content": "July 12 An Amazon.com Inc shopping event that the online retailer billed as its largest ever had a bumpy start on Tuesday  with some customers unable to add discounted items to their shopping carts and rival retailers aiming for a cut of the buying frenzy.",
        "date": "07122016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-Amazon's Prime Day shoppers encounter checkout snafus "
    },
    {
        "content": "By David Randall     NEW YORK  July 12 Amazon's long shadow is falling on retailers previously thought immune to the threat of e-commerce  forcing U.S. fund managers to rethink their approach to consumer stocks by focusing on companies whose businesses cannot be upended by the online giant.     At the core of the problem: Amazon.com Inc  once thought of as a place to buy books and household goods  is on track to become the largest apparel retailer in the United States by 2017  accord",
        "date": "07122016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "U.S. fund managers on hunt for companies that won't be 'Amazon'ed' away "
    },
    {
        "content": "By Dena Aubin Retailing giant Target Corp has been hit with a proposed class action accusing it of saddling customers with unexpected fees on its store-branded \"REDcards.\"",
        "date": "07052016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Lawsuit says Target misled customers about its debit cards "
    },
    {
        "content": "June 9 U.S. burger chain operator Wendy's Co  said it had discovered additional instances of unusual credit card activity at some of its franchise-operated restaurants  widening the scope of an earlier cyber attack on the company.",
        "date": "06092016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Wendy's says it finds more unusual card activity at restaurants "
    },
    {
        "content": "* Target corporation announces 7.1 percent dividend increase  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06082016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target announces 7.1 pct dividend increase "
    },
    {
        "content": "CHICAGO U.S retailer Target Corp  is asking many suppliers to take on up to an extra 3-5 percent of the cost of promotions and price cuts after slow sales so far this year.",
        "date": "06072016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target charges suppliers more to help offload unsold inventory "
    },
    {
        "content": "CHICAGO  June 7 U.S retailer Target Corp  is asking many suppliers to take on up to an extra 3-5 percent of the cost of promotions and price cuts after slow sales so far this year.",
        "date": "06072016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "CORRECTED-Target charges suppliers more to help offload unsold inventory "
    },
    {
        "content": "Warehouse club retailer Costco Wholesale Corp  on Wednesday reported no growth in quarterly comparable sales at U.S. stores for the first time in more than six years  hurt by weak sales in April.",
        "date": "05262016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Costco posts flat comparable U.S. sales for first time in six years "
    },
    {
        "content": "May 25 Warehouse club retailer Costco Wholesale Corp on Wednesday reported no growth in quarterly comparable sales at U.S. stores for the first time in more than six years  hurt by weak sales in April.",
        "date": "05262016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Costco posts flat comparable U.S. sales for first time in 6 yrs "
    },
    {
        "content": "CHICAGO  May 20 A pile-up of unsold inventory across U.S. retail chains is likely to squeeze profits further as stores struggle to make up for a weak first quarter marred by weak sales and share declines.",
        "date": "05202016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Unsold U.S. retail inventory a challenge after dismal earnings season "
    },
    {
        "content": "* Q1 adjusted earnings per share $1.29; Q1 earnings per share $1.05; Q1 sales $16.2 billion  down 5.4 percent",
        "date": "05182016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target Q1 earnings per share $1.05 "
    },
    {
        "content": "Lowe's Cos Inc  followed larger rival Home Depot Inc  in reporting better-than-expected quarterly sales as strength in the U.S. housing market and favorable weather powered demand for building and home renovation products.",
        "date": "05182016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Lowe's sales beat estimates; shares hit record high "
    },
    {
        "content": "* Shares touch record high   (Adds analyst comment  details; updates shares)",
        "date": "05182016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 5-Lowe's sales beat estimates; shares hit record high "
    },
    {
        "content": "CHICAGO  May 18 Target Corp on Wednesday reported a higher-than-expected quarterly profit  but sales at established stores came in below analysts' estimates.",
        "date": "05182016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target quarterly comparable sales miss estimates "
    },
    {
        "content": "* Jason Goldberger will assume newly created role of chief digital officer and president  Target.com",
        "date": "05172016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "BRIEF-Target names Jason Goldberger as chief digital officer and president "
    },
    {
        "content": "Big-box retailer Target Corp  appointed Nordstrom Inc  executive Mark Tritton its chief merchandising officer  nearly a year after Kathryn Tesija left the position.",
        "date": "05172016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target hires Nordstrom exec as chief merchandising officer "
    },
    {
        "content": "May 17 Big-box retailer Target Corp  appointed Nordstrom Inc executive Mark Tritton its chief merchandising officer  nearly a year after Kathryn Tesija left the position.",
        "date": "05172016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Target hires Nordstrom exec as chief merchandising officer "
    },
    {
        "content": "May 17 Big-box retailer Target Corp  appointed Nordstrom Inc executive Mark Tritton its chief merchandising officer.",
        "date": "05172016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target hires Nordstrom's Mark Tritton as chief merchandising officer "
    },
    {
        "content": "CHICAGO Discount retailer Target Corp  is cracking down on suppliers as part of a multi-billion dollar overhaul to speed up its supply chain and better compete with rivals including Wal-Mart Stores Inc  and Amazon.com Inc . | Video ",
        "date": "05042016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Exclusive: Target gets tough with vendors to speed up supply chain "
    },
    {
        "content": "CHICAGO  April 22 The conservative American Family Association is urging its members to boycott Target Corp  for the retailer's decision to allow transgender employees and customers to use bathrooms that correspond with their gender identity.",
        "date": "04222016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "U.S. conservative group boycotts Target over transgender policy "
    },
    {
        "content": "CHICAGO Discount retailer Target Corp has started raising employee wages to a minimum of $10 an hour  its second hike in a year  pressured by a competitive job market and labor groups calling for higher wages at retail chains  sources said.",
        "date": "04192016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Exclusive: Target increases minimum wage to $10 an hour - sources "
    },
    {
        "content": "CHICAGO Discount retailer Target Corp  has started raising employee wages to a minimum of $10 an hour  its second hike in a year  pressured by a competitive job market and labor groups calling for higher wages at retail chains  sources said.",
        "date": "04182016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target increases minimum wage to $10 an hour -sources "
    },
    {
        "content": "Teva Pharmaceuticals and Target Corp have asked the U.S. Supreme Court to overturn an Illinois appeals court decision they say conflicts with its own rulings that hold generic drugmakers cannot be liable solely for keeping an allegedly dangerous product on the market.",
        "date": "04112016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Case to Watch: Teva  Target ask SCOTUS to squash Illinois preemption ruling "
    },
    {
        "content": "SYDNEY  April 8 The managing director of Wesfarmers Ltd's Target department stores  Stuart Machin  resigned on Friday amid an investigation into whether the retailer inflated earnings by bringing forward supplier rebates.",
        "date": "04082016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target Australia chief resigns amid probe into rebate scheme "
    },
    {
        "content": "NEW YORK  April 4 For much of the last three years  investors have been willing to pay more for expected profit at Walgreens than for competitor CVS  but the pharmacy chain may be losing that edge on Wall Street.",
        "date": "04042016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Walgreens' Wall Street edge fades against rival CVS as earnings near "
    },
    {
        "content": "CHICAGO  March 29 Target Corp has been accused in a lawsuit of failing to pay overtime to workers with low-level management responsibilities at its warehouses in New York state.",
        "date": "03292016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Lawsuit accuses Target of not paying overtime to some warehouse workers "
    },
    {
        "content": "SAN FRANCISCO Amazon.com Inc has sued a veteran logistics executive hired by Target Corp as its chief supply chain and logistics officer to prevent him from revealing trade secrets.",
        "date": "03222016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Amazon sues veteran exec hired by Target "
    },
    {
        "content": "SAN FRANCISCO  March 22 Amazon.com Inc  has sued a veteran logistics executive hired by Target Corp  as its chief supply chain and logistics officer to prevent him from revealing trade secrets.",
        "date": "03222016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Amazon sues veteran exec hired by Target "
    },
    {
        "content": "March 16 U.S. drug distributor McKesson Corp  said on Wednesday it cut 1 600 jobs  or about 4 percent of its U.S. workforce  to slash costs after the company lost some key customers.",
        "date": "03172016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-McKesson cuts 1 600 jobs to trim costs "
    },
    {
        "content": "NEW YORK Target Corp  said on Wednesday it will invest $2-$2.5 billion annually starting 2017  mainly to upgrade its supply chain and technology infrastructure  as it races to reduce stock shortages and pushes for online growth.",
        "date": "03022016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target to invest billions to improve supply chain  ramp up online growth "
    },
    {
        "content": "NEW YORK  March 2 Target Corp said on Wednesday it will invest $2-$2.5 billion annually starting 2017  mainly to upgrade its supply chain and technology infrastructure  as it races to reduce stock shortages and pushes for online growth.",
        "date": "03022016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Target to invest billions to improve supply chain  ramp up online growth "
    },
    {
        "content": "Target Corp's  quarterly sales at established stores topped analysts' estimates as its initiatives around higher-profit items drove traffic  showing that the company's turnaround efforts under CEO Brian Cornell were gaining traction.",
        "date": "02242016",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target comp sales beat shows turnaround efforts gaining traction "
    },
    {
        "content": "* Shares rise as much as 4 pct   (Adds details from conference call  updates shares)",
        "date": "02242016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Target comp sales beat shows turnaround efforts gaining traction "
    },
    {
        "content": "* Q4 GAAP earnings per share from continuing operations $2.31; Q4 adjusted earnings per share from continuing operations $1.52; Q4 sales $21.63 billion versus $21.75 billion",
        "date": "02242016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target posts Q4 GAAP earnings per share from cont ops $2.31 "
    },
    {
        "content": "Feb 24 Target Corp reported quarterly comparable sales above analysts' estimates  helped by strong demand for its signature high-margin categories  which include products for children and health and wellness items.",
        "date": "02242016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target's comparable sales beat on demand for high-margin goods "
    },
    {
        "content": "* Lowe's made unsolicited offer more than three years ago   (Adds Breakingviews link)",
        "date": "02032016",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 6-Lowe's wins over Canada's Rona with renewed takeover offer "
    },
    {
        "content": "CHICAGO/NEW YORK  Dec 24 Retailers are struggling to meet even modest forecasts for the holiday shopping season this year after the \"Super Saturday\" before Christmas failed to live up to its nickname  industry research groups said.",
        "date": "12242015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "U.S. retailers at risk of missing modest holiday sales goals "
    },
    {
        "content": "Target Corp is in the early stages of developing its own mobile wallet  three people familiar with the matter said  joining Wal-Mart Stores Inc in posing a threat to recent entrants like Apple Pay.",
        "date": "12182015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Exclusive: Target in initial development of own mobile wallet - sources "
    },
    {
        "content": "* Jarden shares trade well below $60/share offer   (Adds details  analysts comment; updates shares)",
        "date": "12142015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Newell Rubbermaid to buy Jarden to create consumer durables giant "
    },
    {
        "content": "NEW YORK  Dec 10When health insurer Humana Inc reported worse-than-expected quarterly earnings in late 2014 - including a 21 percent drop in net income - it softened the blow by immediately telling investors it would make a $500 million share repurchase.",
        "date": "12102015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "SPECIAL REPORT-Buybacks enrich the bosses even when business sags "
    },
    {
        "content": "Dec 2 Target Corp has agreed to pay $39.4 million to resolve claims by banks and credit unions that said they lost money because of the retailer's late 2013 data breach.",
        "date": "12032015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 4-Target in $39.4 mln settlement with banks over data breach "
    },
    {
        "content": "Discount retailer Target Corp's website was down due to heavy traffic on Cyber Monday.",
        "date": "11302015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target website down on Cyber Monday traffic "
    },
    {
        "content": "Target Corp has agreed to pay $39.4 million to resolve claims by banks and credit unions that said they lost money because of the retailer's late 2013 data breach.",
        "date": "12022015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target in $39.4 mln settlement with banks over data breach "
    },
    {
        "content": "CHICAGO/PITTSBURGH  Nov 27 America's annual Black Friday shopping extravaganza was short on fireworks this year as U.S. retailers' discounts on electronics  clothing and other holiday gifts failed to draw big crowds to stores and shopping malls.",
        "date": "11272015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Black Friday crowds thin in subdued start to U.S. holiday shopping "
    },
    {
        "content": "* Shares down about 1 pct   (Adds Target response  details  background)",
        "date": "11302015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Target website down on Cyber Monday traffic "
    },
    {
        "content": "Nov 30 Target Corp's website was down due to heavy traffic on Cyber Monday.",
        "date": "11302015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target website down on Cyber Monday due to heavy traffic "
    },
    {
        "content": "Target Corp has agreed to pay $39.4 million to resolve claims by banks and credit unions that said they lost money because of the retailer's late 2013 data breach.",
        "date": "12022015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target in $39.4 million settlement with banks over data breach "
    },
    {
        "content": "Dec 2 Target Corp has agreed to pay $39.4 million to resolve claims by banks and credit unions that said they lost money because of the retailer's late 2013 data breach.",
        "date": "12022015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Target in $39.4 mln settlement with banks over data breach "
    },
    {
        "content": "Dec 2 Target Corp has reached a roughly $39 million settlement to resolve claims by banks seeking to recoup money they spent reimbursing fraudulent charges and issuing new credit and debit cards because of the retailer's late 2013 data breach.",
        "date": "12022015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target in $39 mln settlement with banks over data breach "
    },
    {
        "content": "NEW YORK/CHICAGO  Nov 24 Target Corp's  10 percent discount on a $30.49 pair of embroidered curtains was not nearly enough to entice Valerie Jenkins  shopping in Chicago the weekend before Thanksgiving.",
        "date": "11242015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "CORRECTED-UPDATE 1-U.S. consumers and stores face off over depth of holiday discounts "
    },
    {
        "content": "NEW YORK/CHICAGO  Nov 24 Target Corp's  10 percent discount on a $30.49 pair of embroidered curtains was not nearly enough to entice Valerie Jenkins  shopping in Chicago the weekend before Thanksgiving.",
        "date": "11242015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "U.S. consumers and stores face off over depth of holiday discounts "
    },
    {
        "content": "CHICAGO Target Corp  faces margin pressure and will not meet its fiscal-year forecast for online sales growth  which slowed in the latest quarter  the discount retailer said on Wednesday  sending its shares down more than 5 percent.",
        "date": "11182015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target's online sales growth slows; margins pressured "
    },
    {
        "content": "Nov 17 Wal-Mart Stores Inc reported slightly stronger-than-expected quarterly earnings on Tuesday as it booked its fifth straight gain in U.S. same-store sales  sending its shares up more than 4 percent.",
        "date": "11172015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Wal-Mart earnings beat expectations; shares up "
    },
    {
        "content": "CHICAGO  Nov 18 Target Corp faces margin pressure and will not meet its fiscal-year forecast for online sales growth  which slowed in the latest quarter  the discount retailer said on Wednesday  sending its shares down more than 5 percent.",
        "date": "11182015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-Target's online sales growth slows; margins pressured "
    },
    {
        "content": "Nov 18 U.S. retailer Target Corp  reported stronger-than-expected same-store sales for the third quarter and raised its full-year earnings forecast for the second time in three months.",
        "date": "11182015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target raises full-year profit forecast for second time "
    },
    {
        "content": "Bruce Dayton  co-founder of Target Corp  died on Friday in Orono  Minnesota  the state's governor's office said.",
        "date": "11132015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target co-founder Bruce Dayton dies at 97 "
    },
    {
        "content": "Nov 13 Bruce Dayton  co-founder of Target Corp   died on Friday in Orono  Minnesota  the state's governor's office said.",
        "date": "11132015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Target co-founder Bruce Dayton dies at 97 "
    },
    {
        "content": "Nov 5 Target Corp has lost another round in its attempt to prevent pharmacy workers at a New York City store forming what would be the first union in the retailer's 113-year history after a U.S. labor agency declined to review its objections to the plan.",
        "date": "11052015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target loses latest round in effort to prevent pharmacy workers from forming union "
    },
    {
        "content": "CHICAGO Target Corp  said on Monday it will launch its Black Friday promotions five days early  with 10 days of deals on electronics  toys and apparel in stores and online starting Nov. 22.",
        "date": "11092015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target to start Black Friday deals five days early "
    },
    {
        "content": "CHICAGO  Nov 9 Target Corp said on Monday it will launch its Black Friday promotions five days early  with 10 days of deals on electronics  toys and apparel in stores and online starting Nov. 22.",
        "date": "11092015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to start Black Friday deals 5 days early "
    },
    {
        "content": "BOSTON  Oct 30    Some big U.S. retailers are stepping up efforts to use personal identification numbers  or PINs  with new credit cards embedded with computer chips in a bid to prevent counterfeit card fraud.",
        "date": "10302015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "US retailers push banks to use PINs on credit cards as confusion reigns "
    },
    {
        "content": "NEW YORK Target Corp  said it will drop shipping fees for all online orders during the holiday shopping season for a second year in a row  ratcheting up competition with rivals including Wal-Mart Stores Inc  and Amazon.com .",
        "date": "10292015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target to offer free U.S. shipping  strikes global shipping deal "
    },
    {
        "content": "NEW YORK  Oct 29 Target Corp said it will drop shipping fees for all online orders during the holiday shopping season for a second year in a row  ratcheting up competition with rivals including Wal-Mart Stores Inc  and Amazon.com.",
        "date": "10292015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Target to offer free U.S. shipping  strikes global shipping deal "
    },
    {
        "content": "NEW YORK  Oct 29 Target Corp said it will offer free shipping for all online orders in the U.S. and has struck a new deal to ship products to 200 countries during the holidays.",
        "date": "10292015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to offer free U.S. shipping  strikes deal to ship products to 200 countries "
    },
    {
        "content": "* Shares up 8.5 pct after-hours   (Adds details and comments from conference call)",
        "date": "10212015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-EBay's profit beat shows there's life after PayPal "
    },
    {
        "content": "Target Corp said it will match online prices of 29 of its rivals including Amazon.com and Wal-Mart Stores Inc  as the race to grab shoppers intensifies ahead of the  holiday season.",
        "date": "09302015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target to match online prices with over two dozen online rivals "
    },
    {
        "content": "Sept 30 Target Corp said it will match online prices of 29 of its rivals including Amazon.com  and Wal-Mart Stores Inc  as the race to grab shoppers intensifies ahead of the  holiday season.",
        "date": "09302015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Target to match online prices with over two dozen online rivals "
    },
    {
        "content": "Sept 30 Target Corp will match its online prices with more than two dozen online competitors including Amazon.com and Wal-Mart Stores Inc  from Thursday  the Associated Press reported.",
        "date": "09302015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to match online prices with over two dozen online rivals-AP "
    },
    {
        "content": "CHICAGO  Sept 24 Target Corp on Thursday appointed Anu Gupta to a newly created operational role that is expected to help the retailer  anticipate customer needs quickly.",
        "date": "09242015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target appoints new operations leader to identify customer needs faster "
    },
    {
        "content": "CHICAGO A group of pharmacy workers within Target Corp's store in Brooklyn  New York  have won a vote to form a microunion  making it the first unionized store at the retailer since its inception in 1902.",
        "date": "09162015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target pharmacy workers form union  first in company's history "
    },
    {
        "content": "CHICAGO  Sept 16 A group of pharmacy workers within Target Corp's store in Brooklyn  New York have won a vote to form a microunion within the store  according to a filing on the National Labor Relations Board's website and union officials.",
        "date": "09162015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Pharmacy workers in Target's New York store win right to form microunion "
    },
    {
        "content": "CHICAGO A group of pharmacy workers within Target Corp's store in Brooklyn  New York  have won a vote to form a microunion  making it the first unionized store at the retailer since its inception in 1902.",
        "date": "09172015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Exclusive: Target pharmacy workers form union  first in company's history "
    },
    {
        "content": "CHICAGO A group of pharmacy workers within Target Corp's store in Brooklyn  New York have won a vote to form a microunion within the store  according to a filing on the National Labor Relations Board's website and union officials.",
        "date": "09172015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Pharmacy workers in Target's New York store win right to form microunion "
    },
    {
        "content": "NEW YORK  Sept 15 A U.S. judge on Tuesday certified a class action against Target Corp brought by several banks over the retailer's massive data breach in 2013.",
        "date": "09152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "U.S. judge certifies class action over Target Corp data breach "
    },
    {
        "content": " ",
        "date": "09152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-U.S. judge certifies class action over Target Corp data breach "
    },
    {
        "content": "CHICAGO  Sept 15 Target Corp said on Tuesday it has partnered with Instacart Inc to deliver groceries for as little as $3.99 per order  as it overhauls its food business and competes with Amazon.com Inc's grocery delivery service.",
        "date": "09152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target challenges Amazon  enters grocery delivery with Instacart "
    },
    {
        "content": "Sept 10 Apparel retailer Cherokee Global Brands  said Target Corp elected not to renew the license of the Cherokee brand in the United States  sending the company's shares tumbling 33 percent in extended trading.",
        "date": "09102015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to drop Cherokee brand products in U.S. from 2017 "
    },
    {
        "content": "Aug 24 Target Corp has agreed to pay $2.8 million to settle a U.S. Equal Employment Opportunity Commission (EEOC) charge that it used hiring tests that disproportionately screened out candidates for various professional positions based on race and gender.",
        "date": "08242015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target settles with U.S. on charge of race  gender bias in hiring "
    },
    {
        "content": "CHICAGO  Aug 19 Two days after being promoted to the new position of Target Corp's Chief Operating Officer  John Mulligan's big job is clear: fix a supply chain that the company blamed for shortages of goods that are undermining sales growth.",
        "date": "08202015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "RPT-New Target COO's headache: Too few goods to keep shelves filled "
    },
    {
        "content": "Target Corp said it has reached an agreement with Visa Inc card issuers to reimburse up to $67 million in costs related to a data breach at the retailer in 2013  according to a source familiar with the matter.",
        "date": "08182015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target reaches agreement with Visa over data breach "
    },
    {
        "content": "CHICAGO Target Corp  forecast disappointing sales for this quarter and said it expected consumer demand to remain choppy  causing its shares to give up early gains. | Video ",
        "date": "08192015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target's quarterly sales outlook disappoints; shares dip "
    },
    {
        "content": "CHICAGO  Aug 19 Two days after being promoted to the new position of Target Corp's Chief Operating Officer  John Mulligan's big job is clear: fix a supply chain that the company blamed for shortages of goods that are undermining sales growth.",
        "date": "08202015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "New Target COO's headache: Too few goods to keep shelves filled "
    },
    {
        "content": "Aug 18 Target Corp said it has reached an agreement with Visa Inc card issuers to reimburse up to $67 million in costs related to a data breach at the retailer in 2013  according to a source familiar with the matter.",
        "date": "08182015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Target reaches agreement with Visa over data breach "
    },
    {
        "content": "CHICAGO  Aug 19 Target Corp forecast disappointing sales for this quarter and said it expected consumer demand to remain choppy  causing its shares to give up early gains.",
        "date": "08192015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Target's quarterly sales outlook disappoints; shares dip "
    },
    {
        "content": "* Q2 GAAP earnings per share from continuing operations $1.21",
        "date": "08192015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target Q2 adjusted earnings per share $1.22 "
    },
    {
        "content": "Target Corp  promoted Chief Financial Officer John Mulligan to the newly created role of chief operating officer  and appointed Express Scripts Holding Co's  CFO  Cathy Smith  as his replacement.",
        "date": "08172015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target promotes CFO John Mulligan to newly created COO role "
    },
    {
        "content": "Aug 18 Target Corp has reached an agreement with Visa Inc to reimburse up to $67 million to card issuers for the costs they took after a data breach at Target in 2013  the Wall Street Journal reported. (http://on.wsj.com/1K3REzC)",
        "date": "08182015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target reaches agreement with Visa over data breach - WSJ "
    },
    {
        "content": "Aug 19 Retailer Target Corp raised its full-year earnings forecast for the second time and reported its sixth straight rise in quarterly sales  driven by demand for home products and apparel.",
        "date": "08192015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target raises 2015 earnings forecast for second time "
    },
    {
        "content": "Aug 17 Target Corp promoted Chief Financial Officer John Mulligan to the newly created role of chief operating officer  and appointed Express Scripts Holding Co's CFO  Cathy Smith  as his replacement.",
        "date": "08172015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "CORRECTED-UPDATE 1-Target promotes CFO John Mulligan to newly created COO role "
    },
    {
        "content": "Aug 17 Target Corp promoted Chief Financial Officer John Mulligan to the newly created role of chief operating officer  and appointed Express Scripts Holding Co's CFO Cathy Smith as his replacement.",
        "date": "08172015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target promotes CFO Mulligan to COO "
    },
    {
        "content": "Aug 14 Retailer Target Corp said its vice president in charge of household supplies  electronics and sporting goods was leaving as the company narrows its focus to products such as apparel  wellness products and children's items.",
        "date": "08142015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target Corp merchandising executive Jose Barra to leave "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)       WEEK AHEAD      The stragglers for the earnings season - Home Depot  Wal-Mart and a few others - will report results to close out the quarter next week  with expectations that retailers would see decent sales after recent revisions show better",
        "date": "08142015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "What to Watch in the Week Ahead and on Monday  Aug. 17 "
    },
    {
        "content": "MINNEAPOLIS It is too early to tell how a recent round of tax hikes and a minimum wage increase will play out in Minnesota  a state where liberal and conservative forces have often swapped control and policies.",
        "date": "07102015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Minnesota banks on higher taxes  minimum wage as script for growth "
    },
    {
        "content": "CHICAGO Target Corp's  sale of its in-store pharmacies to CVS Health Corp  may encourage large supermarket chains with struggling pharmacies to look for professional drug store partners of their own.",
        "date": "06152015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "CVS-Target deal could spur supermarkets to find pharmacy partners "
    },
    {
        "content": "Drugstore operator CVS Health Corp  will buy Target Corp's  pharmacies and clinics in a $1.9 billion deal that should help it bargain with drug makers for lower prices  while freeing Target from a costly business where it struggled to make a profit. | Video ",
        "date": "06152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "CVS Health to buy Target's pharmacy business for $1.9 billion "
    },
    {
        "content": "* All new Target stores with pharmacies to include CVS pharmacy",
        "date": "06152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-CVS Health to buy Target's pharmacy business for $1.9 bln "
    },
    {
        "content": "June 15 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Monday:",
        "date": "06152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "June 9 Target Corp said it would double its share buyback program to $10 billion and boost its quarterly dividend by 7.7 percent  confirming the contents of a statement it published inadvertently and took off its website earlier on Tuesday.",
        "date": "06102015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 3-Target announces share buyback  dividend boost after disclosure snafu "
    },
    {
        "content": "June 15 Drugstore operator CVS Health Corp  said it will acquire Target Corp's pharmacy and clinic businesses for about $1.9 billion.",
        "date": "06152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "CVS to buy Target's pharmacy  clinic businesses for $1.9 bln "
    },
    {
        "content": "June 9 Target Corp took down a release from its website on Tuesday that said the company would raise its share buyback program by $5 billion and boost its quarterly dividend by 7.7 percent to 56 cents per share.",
        "date": "06092015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 2-Target pulls announcement on share buyback  dividend from website "
    },
    {
        "content": "The cost of data breaches is rising for companies around the world as sophisticated thieves target valuable financial and medical records  according to a study released on Wednesday.",
        "date": "05272015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Cost of data breaches increasing to average of $3.8 million  study says "
    },
    {
        "content": "May 27 The cost of data breaches is rising for companies around the world as sophisticated thieves target valuable financial and medical records  according to a study released on Wednesday.",
        "date": "05272015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Cost of data breaches increasing to average of $3.8 mln  study says "
    },
    {
        "content": "A proposed $19 million settlement between MasterCard Inc and Target Corp over the retailer's 2013 data breach fell through after not enough banks accepted the deal  the credit card company said on Thursday.",
        "date": "05222015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "MasterCard  Target data breach settlement falls apart "
    },
    {
        "content": "NEW YORK Small U.S. food manufacturers once toiled for decades to develop a critical mass of fans for their products. Now  an increasing number of privately-held players are going from garage to grocery store in fewer than five years thanks to an erosion of barriers to entry within the food industry.",
        "date": "05212015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Small food makers on fast path to U.S. store shelves  threatening big producers "
    },
    {
        "content": "Target Corp  on Wednesday reported a larger-than-expected rise in quarterly profit  citing robust online sales and strong demand for products at the center of its growth plan.",
        "date": "05202015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target profit tops estimates on healthy sales growth "
    },
    {
        "content": "May 22 A proposed $19 million settlement between MasterCard Inc and Target Corp over the retailer's 2013 data breach fell through after not enough banks accepted the deal  the credit card company said on Thursday.",
        "date": "05222015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-MasterCard  Target data breach settlement falls apart "
    },
    {
        "content": "NEW YORK  May 21 Small U.S. food manufacturers once toiled for decades to develop a critical mass of fans for their products. Now  an increasing number of privately-held players are going from garage to grocery store in fewer than five years thanks to an erosion of barriers to entry within the food industry.",
        "date": "05212015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "INSIGHT-Small food makers on fast path to US store shelves  threatening big producers "
    },
    {
        "content": "May 20 Target Corp on Wednesday reported a larger-than-expected rise in quarterly profit  citing robust online sales and strong demand for products at the center of its growth plan.",
        "date": "05202015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Target profit tops estimates on healthy sales growth "
    },
    {
        "content": "WASHINGTON - Many officials at the U.S. Federal Reserve's April policy meeting said it would be premature to raise interest rates in June and that a bump in inflation was being offset by a weaker labor market and softer data  according to minutes from the meeting. (USA-FED/MINUTES (UPDATE 1)  moving shortly  490 words)",
        "date": "05202015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "REUTERS BUSINESS NEWS SCHEDULE AT 1830 GMT/2:30 PM ET "
    },
    {
        "content": "Retailer Target Corp  has informed top suppliers of packaged foods  such at Kraft Foods Group Inc   that it plans to put less money into promoting their products in favor of fresher  healthier foods  the Wall Street Journal reported on Sunday.",
        "date": "05172015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target to give less priority to top packaged food suppliers: WSJ "
    },
    {
        "content": "May 22 MasterCard Inc  the world's No. 2 debit and credit card company  said it failed to reach a settlement with Target Corp over claims related to the 2013 data breach at the retailer as a key condition was not met.",
        "date": "05222015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "MasterCard  Target fail to reach settlement on 2013 data breach "
    },
    {
        "content": "May 20 Target Corp will likely continue to buy back its own shares in the current quarter and beyond  and will review with the board the need to increase its authorization for repurchasing shares  its chief financial officer said.",
        "date": "05202015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target CFO: to keep buying back shares  may need to up authorization "
    },
    {
        "content": "* Futures: Dow up 8 pts  S&P down 0.25 pts  Nasdaq up 2.75 pts   (Adds details  comment  updates prices)",
        "date": "05202015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "US STOCKS-Wall St set to open little changed as investors await Fed minutes "
    },
    {
        "content": "May 20 Target Corp on Wednesday reported a larger-than-expected increase in first-quarter profit on healthy revenue growth and raised the low end of its full-year earnings forecast range.",
        "date": "05202015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target Q1 profit beats estimates on healthy sales growth "
    },
    {
        "content": "Labor expenses will be a key focus during retailers' earnings conference calls in the coming weeks  with many companies under pressure to boost workers' wages at a time when low U.S. unemployment levels have given workers more leverage.",
        "date": "05092015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Wage increases in focus ahead of retail earnings "
    },
    {
        "content": "Labor expenses will be a key focus during retailers' earnings conference calls in the coming weeks  with many companies under pressure to boost workers' wages at a time when low U.S. unemployment levels have given workers more leverage.",
        "date": "05082015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Wage increases in focus ahead of retail earnings "
    },
    {
        "content": "A federal judge has rejected a bid from a group of banks and credit unions suing Target Corp over its 2013 data breach to block the company's proposed $19 million settlement with MasterCard Inc.",
        "date": "05082015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target-MasterCard settlement moves ahead despite judge's doubts "
    },
    {
        "content": "May 6 Retailer Canadian Tire Corp Ltd  said it would buy leases for 12 properties previously held by the Canadian unit of Target Corp for $17.7 million.",
        "date": "05062015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 1-Canadian Tire to buy 12 Target property leases in Canada "
    },
    {
        "content": "NEW YORK/CHICAGO  May 8 A federal judge has rejected a bid from a group of banks and credit unions suing Target Corp over its 2013 data breach to block the company's proposed $19 million settlement with MasterCard Inc .",
        "date": "05082015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target-MasterCard settlement moves ahead despite U.S. judge's doubts "
    },
    {
        "content": "May 6 Retailer Canadian Tire Corp said it would buy real estate leases for 12 properties previously held by the Canadian unit of Target Corp for $17.7 million.",
        "date": "05062015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Canadian Tire to buy 12 Target property leases in Canada "
    },
    {
        "content": "May 8 Wal-Mart Stores Inc's Canadian unit said it would buy some store leases and other assets formerly held by the Canadian arm of Target Corp and renovate them for about C$350 million ($289 million).",
        "date": "05082015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Wal-Mart buys some former Target Canada stores "
    },
    {
        "content": "May 8 Wal-Mart Stores Inc's Canadian unit said it would buy some store leases and other assets formerly held by the Canadian arm of Target Corp and renovate them for about C$350 million ($289.4 million).",
        "date": "05082015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Wal-Mart to buy some former Target stores in Canada "
    },
    {
        "content": "April 22 A group of small banks and credit unions suing Target Corp over its massive data breach in 2013 are moving to block the retailer's proposed $19 million settlement with MasterCard Inc  calling it a \"sweetheart deal\" aimed at undercutting their own claims for losses.",
        "date": "04222015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Banks seek to block Target's deal with MasterCard over data breach "
    },
    {
        "content": "Metro Inc  said it was interested in some of the stores being sold by Target Corp   becoming the second Canadian retailer to look at the stores the U.S. retailer leaves behind  after its exit from Canada.",
        "date": "04222015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Canadian grocer Metro interested in Target stores "
    },
    {
        "content": "April 22 Metro Inc said it was interested in some of the stores being sold by Target Corp   becoming the second Canadian retailer to look at the stores the U.S. retailer leaves behind  after its exit from Canada.",
        "date": "04222015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Canadian grocer Metro interested in Target stores "
    },
    {
        "content": "Target Corp said it had agreed to reimburse about $19 million to financial institutions that had issued MasterCard-branded cards that were a part of the massive data breach at the retailer in 2013.",
        "date": "04162015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target announces $19 mln data breach settlement with MasterCard "
    },
    {
        "content": "April 15 Target Corp said it had agreed to reimburse about $19 million to financial institutions who had issued MasterCard-branded cards that were a part of the massive data breach at the retailer in 2013.",
        "date": "04152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target announces $19 mln data breach settlement with MasterCard "
    },
    {
        "content": "Target Corp is nearing a settlement with MasterCard Inc to reimburse financial institutions about $20 million for costs incurred from the retailer's massive data breach in 2013  the Wall Street Journal reported.",
        "date": "04142015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target nears $20 million MasterCard data breach settlement: WSJ "
    },
    {
        "content": "New York's attorney general has sent letters to 13 national retailers  including Gap Inc  Target Corp and JC Penney Co Inc  about \"on-call shifts\" in which workers are told whether to report to work a day or less before a scheduled shift.",
        "date": "04132015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "New York questions big retailers over 'on-call' staffing "
    },
    {
        "content": "April 14 Target Corp is nearing a settlement with MasterCard Inc to reimburse financial institutions about $20 million for costs incurred from the retailer's massive data breach in 2013  the Wall Street Journal reported.",
        "date": "04142015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target nears $20 million MasterCard data breach settlement -WSJ "
    },
    {
        "content": "Target Corp said it had agreed to reimburse about $19 million to financial institutions that had issued MasterCard-branded cards that were a part of the massive data breach at the retailer in 2013.",
        "date": "04152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target announces $19 million data breach settlement with MasterCard "
    },
    {
        "content": "April 15 Target Corp said it had agreed to reimburse about $19 million to financial institutions that had issued MasterCard-branded cards that were a part of the massive data breach at the retailer in 2013.",
        "date": "04152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Target announces $19 mln data breach settlement with MasterCard "
    },
    {
        "content": "NEW YORK A group of 14 state attorneys general on Thursday asked the U.S. Congress to investigate the herbal supplements industry after a New York probe of the products turned up ingredients that were not listed on labels and raised safety concerns.",
        "date": "04062015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "States ask U.S. Congress to launch inquiry of herbal supplements "
    },
    {
        "content": "NEW YORK  April 2 A group of 14 state attorneys general on Thursday asked the U.S. Congress to investigate the herbal supplements industry after a New York probe of the products turned up ingredients that were not listed on labels and raised safety concerns.",
        "date": "04022015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "States ask U.S. Congress to launch inquiry of herbal supplements "
    },
    {
        "content": "April 1 Target Corp's Canadian unit said it would close the last of its 133 retail stores on April 12.",
        "date": "04012015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to close Canadian stores by April 12 "
    },
    {
        "content": "* NY AG test also confirms GNC's products meet FDA guidelines",
        "date": "03302015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 2-GNC Holdings settles herbal supplements dispute with NY Attorney General "
    },
    {
        "content": "TORONTO  March 26 Toronto-Dominion Bank    Canada's second-largest lender  said on Thursday it is open to doing small acquisitions in the U.S. market that would allow it to accelerate its branch rollout  especially in the southeastern part of the country.",
        "date": "03262015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Canada's TD Bank eyeing small acquisitions in U.S. market "
    },
    {
        "content": "CHICAGO  March 20 Some labor groups looking to broaden their push for minimum wage hikes after success at big U.S. retailers including Target Corp  are preparing to take on drugstore chains.",
        "date": "03202015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "After Target wage hike  labor groups turn to drugstore chains "
    },
    {
        "content": "Target Corp next month will raise the minimum wage for all of its workers to $9 an hour  matching moves made by rivals including Wal-Mart Stores Inc and TJX Cos  a source familiar with the matter said.",
        "date": "03182015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target to lift minimum wage to $9 an hour  matching rivals "
    },
    {
        "content": "WASHINGTON Target Corp  has agreed to pay $10 million in a proposed settlement of a class-action lawsuit related to a huge 2013 data breach that consumers say compromised their personal financial information  court documents show. | Video ",
        "date": "03192015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target agrees to pay $10 million to settle lawsuit from data breach "
    },
    {
        "content": "March 18 Target Corp next month will raise the minimum wage for all of its workers to $9 an hour  matching moves made by rivals including Wal-Mart Stores Inc  and TJX Cos  a source familiar with the matter said.",
        "date": "03182015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Target to lift minimum wage to $9 an hour  matching rivals "
    },
    {
        "content": "March 18 Target Corp. will raise the minimum wage for all of its workers to $9 an hour  matching moves made by rivals such as Wal-Mart Stores Inc and TJX Cos  Dow Jones reported on Wednesday.",
        "date": "03182015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target To lift minimum wage to $9 an hour -Dow Jones "
    },
    {
        "content": "WASHINGTON Target Corp has agreed to pay $10 million in a proposed settlement of a class-action lawsuit related to a huge 2013 data breach that consumers say compromised their personal financial information  court documents show.",
        "date": "03192015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target agrees to pay $10 mln to settle lawsuit from data breach "
    },
    {
        "content": "WASHINGTON  March 18 Target Corp has agreed to pay $10 million in a proposed settlement of a class-action lawsuit related to a huge 2013 data breach that consumers say compromised their personal financial information  court documents show.",
        "date": "03192015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Target agrees to pay $10 mln to settle lawsuit from data breach "
    },
    {
        "content": "WASHINGTON  March 18 Target Corp has agreed to pay $10 million in a proposed settlement of a class-action lawsuit related to a huge 2013 data breach  CBS News reported on Wednesday  citing a company spokeswoman.",
        "date": "03192015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target agrees to pay $10 mln to settle lawsuit from data breach -CBS "
    },
    {
        "content": "Target Corp next month will raise the minimum wage for all of its workers to $9 an hour  matching moves made by rivals including Wal-Mart Stores Inc and TJX Cos  a source familiar with the matter said.",
        "date": "03192015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to lift minimum wage to $9 an hour  matching rivals "
    },
    {
        "content": "March 18 Target Corp next month will raise the minimum wage for all of its workers to $9 an hour  matching moves made by rivals including Wal-Mart Stores Inc  and TJX Cos  a source familiar with the matter said.",
        "date": "03192015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-Target to lift minimum wage to $9 an hour  matching rivals "
    },
    {
        "content": "March 3 U.S. retailer Target Corp  which has been battling back after a massive data breach and sluggish performance  on Tuesday said it will eliminate several thousand jobs  mainly from headquarters locations in the United States and India  as it aims to cut $2 billion in costs over two years.",
        "date": "03052015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "CORRECTED-UPDATE 2-Target to cut thousands of jobs as seeks to cut costs by $2 bln "
    },
    {
        "content": "March 3 U.S. retailer Target Corp  which has been battling back after a massive data breach and sluggish performance  on Tuesday said it will eliminate several thousand jobs  mainly from headquarters locations in the United States and India  as it aims to cut $2 billion in costs over two years.",
        "date": "03042015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "CORRECTED-UPDATE 2-Target to cut thousands of jobs as seeks to cut costs by $2 bln "
    },
    {
        "content": "March 3 DuPont on Tuesday rejected a push to let shareholders split their votes between company-backed directors and those nominated by activist investors in an escalating proxy battle with Nelson Peltz.",
        "date": "03042015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "DuPont rejects activist request to change how directors are elected "
    },
    {
        "content": "March 3 U.S. retailer Target Corp  which has been battling back after a massive data breach and sluggish performance  on Tuesday said it will eliminate several thousand jobs  mainly from headquarters locations in the United States and India  as it aims to cut $2 billion in costs over two years.",
        "date": "03032015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 2-Target to cut thousands of jobs as seeks to cut costs by $2 bln "
    },
    {
        "content": "U.S. retailer Target Corp on Tuesday said it planned to cut several thousand jobs  mainly from headquarters locations  as part of a restructuring that will cut $2 billion in costs over two years.",
        "date": "03032015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to cut thousands of jobs  eyes $2 billion in cost cuts "
    },
    {
        "content": "March 3 Target Corp said it would cut several thousand positions over the next two years  mainly from headquarters locations  as part of a restructuring aimed at cutting $2 billion in costs.   (Reporting by Nathan Layne; Editing by Chris Reese)",
        "date": "03032015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target says to cut several thousand positions at headquarters "
    },
    {
        "content": "March 3 U.S. retailer Target Corp on Tuesday forecast a rise in profit and sales this fiscal year and said it would have the capacity to buy back $2 billion worth of its shares this year.",
        "date": "03032015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target forecasts fiscal-year profit growth  $2 billion for share buybacks "
    },
    {
        "content": "March 2 Target Corp has zeroed in on seven grocery categories  including granola  yogurt and craft beer  to attract younger shoppers  urban dwellers  and Hispanics  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "03032015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target to revamp groceries to focus on younger shoppers - WSJ "
    },
    {
        "content": "U.S. retailer Target Corp  reported a stronger-than-expected jump in fourth-quarter sales and profits and forecast modest growth this quarter in a sign that its online business strategy and focus on promoting select categories is working.",
        "date": "02252015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target beats and sales forecasts in sign strategy working "
    },
    {
        "content": "Feb 25 U.S. retailer Target Corp  reported a stronger-than-expected jump in fourth-quarter sales and profits and forecast modest growth this quarter in a sign that its online business strategy and focus on promoting select categories is working.",
        "date": "02252015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Target beats and sales forecasts in sign strategy working "
    },
    {
        "content": "Feb 25 Target Corp will disclose plans for investments and cost-cuts to fund them at an analyst meeting next week  chief financial officer John Mulligan told an earnings call on Wednesday.",
        "date": "02252015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target says to outline investments  cost-cuts next week "
    },
    {
        "content": "Target Corp halved the size of online orders eligible for free shipping to $25  undercutting Amazon.com Inc and traditional rival Wal-Mart Stores Inc as it focuses on its online business.",
        "date": "02232015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "Target halves order size for free shipping to $25 "
    },
    {
        "content": "Feb 19 Wal-Mart Stores Inc's wage hike will likely trigger a rethink on pay across the retail and fast-food sectors  with Target Corp one of the low-wage employers facing pressure to follow suit and pay workers more.",
        "date": "02202015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "RPT-Wal-Mart wage hike seen pressuring Target  fast-food "
    },
    {
        "content": "Feb 25 U.S. retailer Target Corp  reported a stronger-than-expected jump in same-store sales and profits for the key fourth quarter  helped by its expanding online business  and forecast modest earnings growth in the current quarter.",
        "date": "02252015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target beats Q4 sales forecast  sees first quarter growth "
    },
    {
        "content": "Feb 23 Target Corp halved the size of online orders eligible for free shipping to $25  undercutting Amazon.com Inc and traditional rival Wal-Mart Stores Inc as it focuses on its online business.",
        "date": "02232015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 1-Target halves order size for free shipping to $25 "
    },
    {
        "content": "Feb 19 Wal-Mart Stores Inc's wage hike will likely trigger a rethink on pay across the retail and fast-food sectors  with Target Corp one of the low-wage employers facing pressure to follow suit and pay workers more.",
        "date": "02202015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Wal-Mart wage hike seen pressuring Target  fast-food "
    },
    {
        "content": "Feb 23 Target Corp cut its eligibility for free-shipping of online orders by half to $25 as the company focuses more on its online division to better compete against Amazon.com Inc and traditional rival Wal-Mart Stores Inc.",
        "date": "02232015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target cuts free-shipping eligibility to $25 for online orders "
    },
    {
        "content": "Walgreens Boots Alliance Inc   Wal-Mart Stores Inc   GNC Holdings Inc  and Target Corp  agreed to remove certain dietary supplements off their shelves in New York after receiving a threat of legal action from the state's attorney general  the New York Times reported.",
        "date": "02122015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Four retailers pull some dietary aids off shelves after probe: NYT "
    },
    {
        "content": "Feb 12 Walgreens Boots Alliance Inc  Wal-Mart Stores Inc  GNC Holdings Inc and Target Corp agreed to remove certain dietary supplements off their shelves in New York after receiving a threat of legal action from the state's attorney general  the New York Times reported.",
        "date": "02122015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Four retailers pull some dietary aids off shelves after probe -NYT "
    },
    {
        "content": "Feb 3 Target Corp on Tuesday named former Tesco PLC executive Mike McNamara as chief information officer to replace Bob DeRodes  who was hired in May to bolster the retailer's cybersecurity following a massive data breach in late 2013.",
        "date": "02032015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 1-Target replaces cybersecurity chief with Tesco veteran "
    },
    {
        "content": "Feb 3 U.S. retailer Target Corp on Tuesday named Mike McNamara  a former executive at British retailer Tesco PLC  its new chief information officer.",
        "date": "02032015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target picks former Tesco executive McNamara as new CIO "
    },
    {
        "content": "WASHINGTON  Jan 13 President Barack Obama on Tuesday renewed a push to beef up U.S. cybersecurity laws after recent headline-grabbing hacking attacks against companies like Sony Pictures  Home Depot and Target.",
        "date": "01132015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 2-Obama seeks enhanced cybersecurity laws to fight hackers "
    },
    {
        "content": "Jan 12 Discount chain Dollar Tree Inc  said it expects to divest fewer than 300 stores to satisfy U.S. regulators scrutinizing its proposed takeover of Family Dollar Stores Inc  and had already identified potential buyers.",
        "date": "01122015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Dollar Tree expects to shed less than 300 stores to buy Family Dollar "
    },
    {
        "content": "NEW YORK/TORONTO  Jan 16 Target Corp was scrambling for ways to fix its failing Canadian expansion and considering closing just the weakest locations  but a pre-holiday visit to several stores by CEO Brian Cornell helped seal the decision for a full retreat.",
        "date": "01162015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Thin crowds during CEO's visit helped seal Target Canada's demise "
    },
    {
        "content": "TORONTO Target Corp  will exit the Canadian market after less than two years in a surprise retreat that will throw more than 17 000 employees out of work and trigger a $5.4 billion quarterly loss. | Video ",
        "date": "01152015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "In surprise move  Target exits Canada and takes $5.4 billion loss "
    },
    {
        "content": "WASHINGTON  Jan 13 President Barack Obama sent a bill to Congress on Tuesday to strengthen U.S. cybersecurity laws to protect government  businesses and consumers while protecting privacy  after recent hacking attacks against Sony Pictures  Home Depot Inc and Target Corp   and on Monday the federal government itself.",
        "date": "01142015",
        "name": "Target Corporation",
        "news_type": "topStory",
        "symbol": "TGT",
        "title": "UPDATE 3-Obama seeks enhanced cybersecurity laws to fight hackers "
    },
    {
        "content": "* Family Dollar seeks Jan. 22 vote   (Adds details on FTC wanting Dollar General divestitures)",
        "date": "01122015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 3-Dollar Tree expects to shed less than 300 stores to buy Family Dollar "
    },
    {
        "content": "Jan 15 Target Corp's exit from Canada means Chief Executive Brian Cornell will have to rely solely on the saturated U.S. market for growth  the success of which could hinge on a shift towards smaller and urban-based stores.",
        "date": "01152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "After Canada exit  Target thinks small with U.S. expansion plans "
    },
    {
        "content": "* Family Dollar seeks Jan. 22 vote   (Adds analysts' comments  details)",
        "date": "01122015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 2-Dollar Tree expects to shed less than 300 stores to buy Family Dollar "
    },
    {
        "content": "TORONTO/MONTREAL  Jan 15 Target Corp's  abrupt decision to withdraw from Canada is troubling news for many mall owners  as the most obvious potential buyer of property assets - Wal-Mart - is expected to cherry-pick from Target's 133 locations.",
        "date": "01152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Target's exit from Canada to pressure commercial property market "
    },
    {
        "content": "TORONTO  Jan 15 Target Corp will exit the Canadian market after less than two years in a surprise retreat that will throw more than 17 000 employees out of work and trigger a $5.4 billion quarterly loss.",
        "date": "01152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "UPDATE 4-In surprise move  Target exits Canada and takes $5.4 bln loss "
    },
    {
        "content": "CALGARY  Jan 15 The decision by Target Corp  to shut its Canadian operations is a private corporate decision that should not have broader implications  Canadian Finance Minister Joe Oliver said on Thursday.",
        "date": "01152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Canada's Oliver: Target store closure is private sector decision "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 15 (Fitch) Fitch Ratings has affirmed the Long-term Issuer  Default Rating (IDR) on Target Corporation (Target) at 'A-' and the Short-term IDR at 'F2'. The  Rating Outlook is Stable. A full list of ratings follows at the end of this  release. KEY RATING DRIVERS As anticipated  Target announced today that it will be discontinuing its  Canadian operations. Cash costs associated with exiting the business are  expected to t",
        "date": "01152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "Fitch Affirms Target's 'A-' IDR Following Announcement of Canada "
    },
    {
        "content": "* Target Corporation announces plans to discontinue Canadian operations",
        "date": "01152015",
        "name": "Target Corporation",
        "news_type": "normal",
        "symbol": "TGT",
        "title": "BRIEF-Target Corp plans to discontinue Canadian operations "
    }
]