[
    {
        "content": "* The Hanover reports third quarter net income and operating income of $0.26 and $0.11 per diluted share  respectively  despite heavy industry catastrophe activity; combined ratio of 104.8%; combined ratio excluding catastrophes of 88.9%",
        "date": "11012017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-The Hanover reports third quarter net income "
    },
    {
        "content": "* The Hanover Insurance Group appoints John C. Roche chief executive officer; Joseph M. Zubretsky to pursue healthcare opportunity",
        "date": "10102017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance Group appoints John Roche CEO "
    },
    {
        "content": "* The hanover estimates the impact of third quarter catastrophes",
        "date": "10052017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover estimates Q3 catastrophe losses to be in range of $185 mln-$225 mln "
    },
    {
        "content": "* Scout Security signs partnership deal with Hanover Insurance Group",
        "date": "09132017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Scout Security signs partnership deal with Hanover Insurance Group "
    },
    {
        "content": "* The Hanover reports second quarter net income and operating income (1) of $1.83 and $1.69 per diluted share  respectively; combined ratio of 95.6%  including catastrophe impact of 4.8 points; operating return on equity (2) of 10.6%",
        "date": "08022017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance Q2 earnings per share $1.83 "
    },
    {
        "content": "* The Hanover Insurance Group Inc and Chaucer announce acquisition of SLE Holdings",
        "date": "07032017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance Group says Chaucer  co's international specialty insurance group  has acquired SLE Holdings "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 05 (Fitch) Fitch Ratings has affirmed the 'A' Insurer Financial Strength (IFS) rating of The Hanover Insurance Company  the principal operating subsidiary of The Hanover Insurance Group (NYSE: THG). Fitch has also affirmed THG's Issuer Default Rating (IDR) at 'BBB+' and its senior unsecured notes at 'BBB'. The Rating Outlook is Stable. A full list of ratings follows at the end of this press release. The ratings affirmation",
        "date": "05052017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "Fitch Affirms The Hanover Insurance Group's Ratings; Outlook Stable "
    },
    {
        "content": "* Net premiums written were $362.1 million in quarter  up 7.4% from prior-year quarter",
        "date": "05032017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance Group records $1.05 EPS in Q1 "
    },
    {
        "content": "* Net premiums written were $1.18 billion in quarter  up 3.7 percent from prior-year quarter",
        "date": "05042017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover insurance group Q1 earnings per share $1.05 "
    },
    {
        "content": "* Says  plans to expand its specialty business  leveraging its existing capabilities in U.S. and internationally",
        "date": "02232017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-The Hanover Insurance Group announces organizational changes "
    },
    {
        "content": "* Net premiums written for commercial lines were $530.0 million in quarter  up 3.3% from prior-year quarter",
        "date": "02022017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance Group says Q4 loss per share $0.32 "
    },
    {
        "content": "* Book value per share of $67.40  up 1.8 pct from December 31  2015",
        "date": "02022017",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "normal",
        "symbol": "THG",
        "title": "BRIEF-Hanover reports Q4 loss per share $0.32 "
    },
    {
        "content": "* Says Q3 book value per share of $72.08  up 2.1% from june 30",
        "date": "11032016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance reports Q3 oper earnings per share $1.83 "
    },
    {
        "content": "* Hanover Insurance Group Inc appoints Jeffrey M. Farber executive vice president and chief financial officer",
        "date": "09222016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance Group names Jeffrey Farber CFO  executive VP "
    },
    {
        "content": "* Says net premiums written were $395.3 million in quarter  up 4.5% from prior-year quarter",
        "date": "07282016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance Group Q2 operating earnings per share $1.24 "
    },
    {
        "content": "* The Hanover estimates the impact of global catastrophe  large loss and other activity on its Chaucer segment",
        "date": "07142016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance estimates impact of global catastrophe  other activity on its Chaucer segment "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 01 (Fitch) Fitch Ratings has upgraded to 'A' from 'A-' the Insurer  Financial Strength (IFS) rating of The Hanover Insurance Company  the principal  operating subsidiary of The Hanover Insurance Group (NYSE: THG). Fitch has also  upgraded the following ratings for THG: --Issuer Default Rating (IDR) to 'BBB+' from 'BBB'; --Senior unsecured notes to 'BBB' from 'BBB-'.  The Rating Outlook is Stable. A full list of ratings fol",
        "date": "06012016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "Fitch Upgrades The Hanover Insurance Group's Ratings; Outlook Stable "
    },
    {
        "content": "* The Hanover Insurance Group names Joseph Zubretsky president and Chief Executive Officer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "05162016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance names Joseph Zubretsky President and CEO "
    },
    {
        "content": "U.S. property and casualty insurance company Hanover Insurance Group Inc  has hired former health insurer Aetna Inc  chief financial officer Joseph Zubretsky as its new chief executive officer  people familiar with the matter said.",
        "date": "05162016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "normal",
        "symbol": "THG",
        "title": "Exclusive: Hanover Insurance taps Zubretsky as new CEO - sources "
    },
    {
        "content": "* The Hanover reports first quarter net income of $1.80 per diluted share; record first quarter operating income(1) of $1.64 per diluted share; combined ratio of 95.0%  including catastrophe impact of 2.7 points",
        "date": "05042016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance Group Q1 earnings per share $1.80 "
    },
    {
        "content": "* The Hanover Insurance Group  Inc. prices a $375 million senior notes offering",
        "date": "04052016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-The Hanover Insurance Group prices $375 mln senior notes offering "
    },
    {
        "content": "* Files for potential mixed shelf; size not disclosed - sec filing  Source text:  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "03222016",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "BRIEF-Hanover Insurance Group files for potential mixed shelf "
    },
    {
        "content": "* Piech's vision of multi-brand auto-group on show at AGM   (Adds board member comment on June strategy meeting)",
        "date": "05052015",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "UPDATE 4-VW aims to find new chairman quickly and return focus to business "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 20 (Fitch) Fitch Ratings has affirmed the 'A-' Insurer Financial  Strength (IFS) rating of The Hanover Insurance Company  the principal operating  subsidiary of The Hanover Insurance Group (NYSE: THG). Fitch has also affirmed  the following ratings for THG: --Issuer Default Rating (IDR) at 'BBB'; --Senior unsecured notes at 'BBB-'.  The Rating Outlook is revised to Positive from Stable. A full list of ratings  follows at ",
        "date": "03202015",
        "name": "The Hanover Insurance Group Inc",
        "news_type": "topStory",
        "symbol": "THG",
        "title": "Fitch Affirms The Hanover Insurance Group's Ratings; Outlook to Positive "
    }
]