[
    {
        "content": "ISTANBUL  Nov 10 Russia's Alfa Telecom is interested in increasing its stake in mobile operator Turkcell by buying out Turkish firm Cukurova  which missed a recent debt repayment and could consider offers  two sources close to the matter told Reuters.",
        "date": "11102017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "UPDATE 1-Russia's Alfa interested in buying Cukurova's Turkcell stake - sources "
    },
    {
        "content": "ISTANBUL  Nov 10 Russia's Alfa Telecom is interested in increasing its stake in mobile operator Turkcell by buying out Turkish firm Cukurova  which missed a recent debt repayment and could consider offers  two sources close to the matter told Reuters.",
        "date": "11102017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Russia's Alfa interested in buying Cukurova's Turkcell stake - sources "
    },
    {
        "content": "* INTENDS TO BE POTENTIAL INVESTOR IN TURKEY'S AUTOMOTIVE PROJECT",
        "date": "11022017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell intends to be potential investor in Turkey's Automotive Project "
    },
    {
        "content": "JOHANNESBURG MTN said on Tuesday that a $4.2 billion claim by Turkcell in a South African court over a disputed Iranian mobile phone license was \"opportunistic\" and \"baseless\"  issuing the statement after filing a defense plea.",
        "date": "10312017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "MTN to defend 'opportunistic' $4.2 billion suit in South African court "
    },
    {
        "content": "JOHANNESBURG  Oct 31 MTN said on Tuesday that a $4.2 billion claim by Turkcell in a South African court over a disputed Iranian mobile phone licence was \"opportunistic\" and \"baseless\"  issuing the statement after filing a defence plea.",
        "date": "10312017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "UPDATE 1-MTN to defend \"opportunistic\" $4.2 bln suit in South African court "
    },
    {
        "content": "JOHANNESBURG  Oct 31 MTN sees a $4.2 billion claim by Turkcell in a South African court over a disputed Iranian mobile phone licence as \"opportunistic\" and \"baseless\"  the company said on Tuesday after filing a defence plea.",
        "date": "10312017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "MTN to defend 'opportunistic' $4.2 bln suit in South African court "
    },
    {
        "content": "* Q3 NET PROFIT OF 600.0 MILLION LIRA VERSUS 181.7 MILLION LIRA YEAR AGO",
        "date": "10252017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell Q3 net profit jumps to 600.0 million lira "
    },
    {
        "content": "ISTANBUL  Oct 25 Leading Turkish mobile phone operator Turkcell's process of exiting its Eurasian wireless business  Fintur  is continuing well and it aims to complete the move by the end of this year  its chief executive Kaan Terzioglu said on Wednesday.",
        "date": "10252017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Turkcell CEO says plans to exit Fintur by end-2017 "
    },
    {
        "content": "* BOARD OF DIRECTORS APPROVES INCORPORATION OF A COMPANY IN TURKISH REPUBLIC OF NORTHERN CYPRUS‍​",
        "date": "09292017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell to establish a internet service provider company in Northern Cyprus "
    },
    {
        "content": "Sept 19 Nordic telecom operator Telia Company said on Tuesday said it had sold a 7 percent stake in Turkish mobile operator Turkcell in a deal generating proceeds of about 4.1 billion Swedish crowns ($516 million).",
        "date": "09192017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "UPDATE 1-Telia sells 7 pct stake in Turkcell for SEK 4.1 bln "
    },
    {
        "content": "* Says following completion of placing and sale  Telia Company will own 24.0 percent of issued share capital of Turkcell through its ownership in Turkcell Holding",
        "date": "09192017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Telia sells 153.5 mln Turkcell shares in placing "
    },
    {
        "content": "* : BOOKRUNNER - BOOKS WILL CLOSE AT 6.15PM UK TIME Further company coverage: (Bengaluru Newsroom)",
        "date": "09182017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Bookrunner says orders not at TRY11.60 in Turkcell ABB "
    },
    {
        "content": "* BLOCK TRADE - BOOKRUNNER SAYS PRICE GUIDANCE OF TRY11.55-11.60  COVERED THROUGHOUT THE RANGE  BOOKS WILL CLOSE AT 6.15PM UK TIME IN TURKCELL ABB Further company coverage: (Bengaluru Newsroom)",
        "date": "09182017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Bookrunner says books covered throughout the range in Turkcell ABB "
    },
    {
        "content": "Sept 18 Nordic telecom group Telia Company launched on Monday an offer to sell its remaining direct stake in Turkish operator Turkcell to institutional investors as part of a bid to focus on core markets.",
        "date": "09182017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "UPDATE 1-Telia to sell remaining 7 pct direct stake in Turkcell "
    },
    {
        "content": "* BOOKS EXPECTED TO CLOSE AT SHORT NOTICE THIS EVENING Further company coverage:",
        "date": "09182017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Books for Turkcell offer are covered -bookrunner "
    },
    {
        "content": "* ‍VISIBILITY ON POTENTIAL INVESTOR INTEREST IN EXCESS OF DEAL SIZE  FROM A LIMITED MARKET SOUNDING EXERCISE​",
        "date": "09182017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Investor interest in Turkcell ‍offer exceeds deal size :bookrunner "
    },
    {
        "content": "* Telia company announces proposed sale of part of its stake in Turkcell",
        "date": "09182017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Sweden's Telia says to sell 7 pct stake in Turkcell "
    },
    {
        "content": "STOCKHOLM  July 14 Nordic telecom operator Telia Company said on Friday it expected a negative impact of 1.2 billion crowns ($144 million) on its second-quarter operating profit in continuing operations due capital losses and other one-off items.",
        "date": "07142017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Telia says one-off items to impact Q2 earnings "
    },
    {
        "content": "* SIGNS AGREEMENT WITH TURKCELL UNIT SUPERONLINE ILETISIM HIZMETLERI WORTH $21.6 MILLION",
        "date": "06122017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Alcatel Lucent Teletas signs contract worth $21.6 mln "
    },
    {
        "content": "ISTANBUL/JOHANNESBURG Turkcell's  $4.2 billion lawsuit against South Africa's MTN  over a disputed Iran license will go ahead in a South African court after years of delay  the Turkish mobile operator said on Thursday.",
        "date": "06012017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Turkey's Turkcell says $4.2 billion suit against South Africa's MTN to go to trial "
    },
    {
        "content": "* RESTRUCTURES THE PARTICIPATING CURRENCY SWAP TRANSACTION FOR THE  10-YEAR  LOAN  WITH  AN AMOUNT OF EUR500 MILLION FROM CHINA DEVELOPMENT BANK DATED 01.07.2016 IN ORDER TO MANAGE ITS FOREIGN CURRENCY RISK",
        "date": "05292017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell restructures EUR 500 mln swap transaction from China Development Bank "
    },
    {
        "content": "* MTN shares down  Turkcell shares weaker (Recasts  adds context  Turkcell lawyer)",
        "date": "06012017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "UPDATE 2-Turkey's Turkcell says $4.2 bln suit against S.Africa's MTN to go to trial "
    },
    {
        "content": "JOHANNESBURG  June 1 Turkcell's $4.2 billion lawsuit against South Africa's MTN Group could go to court towards the end of next year  a lawyer for the Turkish mobile phone operator said on Thursday.",
        "date": "06012017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Turkcell's MTN lawsuit could go to trial towards end-2018 -lawyer "
    },
    {
        "content": "JOHANNESBURG  June 1 South Africa's MTN Group said on Thursday a $4.2 billion lawsuit filed by Turkcell over a disputed Iranian mobile phone licence had no legal merit.",
        "date": "06012017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "South Africa's MTN says Turkcell lawsuit has no legal merit "
    },
    {
        "content": "ISTANBUL  June 1 Turkish mobile operator Turkcell said on Thursday its $4.2 billion lawsuit against South Africa's MTN over an Iran licence would go ahead in a South African court  after years of delays.",
        "date": "06012017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Turkey's Turkcell says $4.2 bln suit against S.Africa's MTN to go to trial "
    },
    {
        "content": "* TO SET UP A COMPANY IN UKRAINE  WHOSE FIELD OF OPERATION WILL BE FINANCIAL SERVICES  THROUGH UNIT LIFECELL LLC IN UKRAINE  WITH A PAID-IN CAPITAL OF USD 2.0 MILLION (OR EQUIVALENT IN OTHER CURRENCIES)",
        "date": "05262017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell's unit Lifecell to set up a financial services company in Ukraine "
    },
    {
        "content": "* Turkcell general assembly meeting approved dividends proposal",
        "date": "05262017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Telia says Turkcell general assembly meeting approved dividends proposal "
    },
    {
        "content": "* Turkcell: bookrunner says deal will price at TL 11.45 Further company coverage: (Bengaluru Newsroom)",
        "date": "05032017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell deal will price at TL 11.45 - Bookrunner "
    },
    {
        "content": "* Turkcell: Bookrunner says price guidance for bookbuild at tl 11.42 - tl 11.45",
        "date": "05032017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell's bookbuild pricing guidance of TL 11.42-11.45- bookrunner "
    },
    {
        "content": "STOCKHOLM  May 3 Nordic telecoms firm Telia said on Wednesday it was aiming to sell part of its stake in Turkey's Turkcell to institutional investors as part of its strategy to focus on its Nordic and Baltic operations.",
        "date": "05032017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Telia seeks to cut Turkcell stake as it focuses on Nordics  Baltics "
    },
    {
        "content": "* turkcell: Bookrunner says books covered  price guidance to follow (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "05032017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Bookrunner says Turkcell bookbuild books covered  price guidance to follow "
    },
    {
        "content": "* Turkcell: bookrunner says visibility on potential investor interest for c.90 pct of the deal size  from a limited market sounding exercise",
        "date": "05032017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Bookrunner says price guidance on Turkcell bookbuild is with reference to market "
    },
    {
        "content": "* Telia Company announces proposed sale of part of its stake in Turkcell",
        "date": "05032017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Telia announces proposed sale of part of its stake in Turkcell "
    },
    {
        "content": "* Says has agreed to sell an aggregate of 155 million ordinary shares in Turkcell at a price of TRY11.45 per ordinary share  raising gross proceeds of TRY1 775 million (equivalent to approximately SEK 4 426 million)",
        "date": "05042017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-RPT-Telia says places 155 mln Turkcell shares for SEK 4.4 bln "
    },
    {
        "content": "* Q1 net profit of 458.57 million lira ($128.08 million) versus 563.09 million lira year ago",
        "date": "04262017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell Q1 net profit down at 458.57 mln lira "
    },
    {
        "content": "* Says has agreed to sell an aggregate of 155 million ordinary shares in turkcell at a price of TRY11.45 per ordinary share  raising gross proceeds of TRY1 775 million (equivalent to approximately SEK 4 426 million)",
        "date": "05042017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Telia says places 155 mln Turkcell shares for SEK 4.4 bln "
    },
    {
        "content": "* Proposes to pay total net 0.6919773 lira ($0.1931) dividend per share for FY 2016 in three installments Source text for Eikon:",
        "date": "04262017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell proposes to pay net 0.6919773 lira/shr FY dividend in 3 installments "
    },
    {
        "content": "* TeleSoneria and Turkcell are planning to complete exiting process from Fintur in 2017 -CEO Kaan Terzioglu",
        "date": "02162017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell plans to complete exit from Fintur in 2017 - CEO Terzioglu "
    },
    {
        "content": "* FY 2016 net profit of 1.51 billion lira ($410.29 million)versus 2.07 billion lira year ago",
        "date": "02152017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell FY 2016 net profit down at 1.51 bln lira "
    },
    {
        "content": "* 100 percent owned unit Turktell Bilisim to make the application to EMRA for permission to operate following the completion of the incorporation of a company with an initial capital of 2.0 million lira ($544 499.20)",
        "date": "02172017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "CORRECTED-BRIEF-Turkcell unit Turktell Bilisim will apply to EMRA to operate in energy trade and sales "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  February 01 (Fitch) Fitch Ratings has affirmed Turkcell Iletisim  Hizmetleri A.S's (TCELL) Long-Term Issuer Default Rating (IDR) and senior  unsecured rating at 'BBB-'. The Outlook on the IDR is Negative.  TCELL has a stronger underlying business  operating and financial profile than  reflected in its 'BBB-' rating. Constraints include potential further material  FX depreciation  and expectations of leverage rising to management",
        "date": "02012017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Fitch Affirms Turkcell at 'BBB-'; Outlook Negative "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  January 16 (Fitch) Fitch Ratings has affirmed Turkcell Iletisim  Hizmetleri A.S's (TCELL) Long-term Issuer Default Rating (IDR) and senior  unsecured rating at 'BBB-'. The Outlook on the IDR is Negative.  TCELL has a stronger underlying business  operating and financial profile than  would otherwise be reflected in its 'BBB-' rating. Constraints include the  potential for further material FX depreciation  sovereign correlation a",
        "date": "01162017",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Fitch Affirms Turkcell at 'BBB-'; Outlook Negative "
    },
    {
        "content": "ISTANBUL  Nov 29 The decade-long struggle over control of Turkcell  Turkey's top mobile network operator  took another turn on Tuesday when Russian billionaire Mikhail Fridman said he was unable to buy a disputed stake from his Turkish rival.",
        "date": "11292016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "UPDATE 2-Turkcell deadlock 'back to square one' after Russian tycoon fails to secure stake "
    },
    {
        "content": "ISTANBUL  Nov 29 Turkey's Cukurova and Russia's Alfa are \"back to square one\" in a longstanding dispute over a stake in Turkish mobile carrier Turkcell  a source familiar with Cukurova's thinking said on Tuesday.",
        "date": "11292016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Turkey's Cukurova  Alfa \"back to square one\" with Turkcell deadlock - source "
    },
    {
        "content": "ISTANBUL  Nov 29 Russian billionaire Mikhail Fridman has no legal means to end a longstanding dispute over Turkish mobile carrier Turkcell  as he is unable to purchase shares from a rival shareholder due to a legal injunction  one of his companies said on Tuesday.",
        "date": "11292016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Russian tycoon says blocked from taking control of Turkcell "
    },
    {
        "content": "ISTANBUL Russian billionaire Mikhail Fridman could take control of Turkcell  after fellow shareholder Cukurova failed to declare an intent to buy a disputed 13.2 percent stake by a court deadline  a source close to the matter said on Monday.",
        "date": "11212016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Russian tycoon could take control of Turkcell: source "
    },
    {
        "content": "ISTANBUL  Nov 21 Russian billionaire Mikhail Fridman could take control of Turkcell after fellow shareholder Cukurova failed to declare an intent to buy a disputed 13.2 percent stake by a court deadline  a source close to the matter said on Monday.",
        "date": "11212016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "UPDATE 1-Russian tycoon could take control of Turkcell -source "
    },
    {
        "content": "ISTANBUL  Nov 21 Turkish holding company Cukurova did not declare an intent to buy a 13.22 percent stake in Turkcell from Russia's Alfa Telecom by a Nov. 18 court deadline  a source close to the matter told Reuters on Monday.",
        "date": "11212016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Russia's Alfa has right to buy Turkcell stake after Cukurova deadline passes - source "
    },
    {
        "content": "MOSCOW  Nov 7 Russian bank VTB said on Monday it had reached an agreement with Alfa Group about a joint investment in Turkey's top mobile operator Turkcell.",
        "date": "11072016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Russia's VTB says agrees with Alfa on Turkcell joint investment "
    },
    {
        "content": "* Unit Turkcell Finansman applies to Capital Markets Board (CMB) for issuing up to 1.5 billion lira ($472.01 million)debt instruments  Source text for Eikon:",
        "date": "11072016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell unit Turkcell Finansman to issue up to 1.5 bln lira debt instruments "
    },
    {
        "content": "* To pay 130.0 million lira ($41.87 million)  by Nov. 30 after resturcturing 455 million lira tax liability and penalties and 20 million lira other public payables  Source text for Eikon:",
        "date": "10272016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell to pay 130 mln lira resturcturing tax liabilities and other payables "
    },
    {
        "content": "* Q3 net profit of 181.7 million lira ($58.33 million) versus 631.3 million lira year ago",
        "date": "11022016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell Q3 net profit shrinks to 181.7 million lira "
    },
    {
        "content": "ISTANBUL  Oct 24 Turkish mobile operator Turkcell will postpone a planned $121 million floation of its Global Tower unit  it said on Monday  citing market uncertainty and marking another setback for initial public offerings (IPOs) in Istanbul.",
        "date": "10242016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "UPDATE 1-Turkcell postpones Global Tower listing  in latest setback for IPO market "
    },
    {
        "content": "* Q3 EBITDA  excluding non-recurring items  decreased 1.5 percent to sek 6 850 million (6 957)",
        "date": "10212016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Telia Q3 core operating profit in line with forecasts "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  October 13 (Fitch) Fitch Ratings has assigned Turkcell Finansman A.S  (TFS) 'BB+' Foreign and Local Currency Long-Term Issuer Default Ratings (IDRs)  and 'AA(tur)' National Long-Term Rating. The Outlook on the IDRs is Negative  while the Outlook on the National Rating is Stable. A full list of rating actions is available at the end of this rating action  commentary.  KEY RATING DRIVERS  TFS was created as a separate entity out o",
        "date": "10132016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Fitch Rates Turkcell Finansman A.S. 'BB+'; Outlook Negative "
    },
    {
        "content": "* Global Tower IPO price to be between 3.82 lira-4.46 lira  ($1.25- $1.46) per share",
        "date": "10102016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell offers 25 pct in Global Tower IPO at 3.82 lira-4.46 lira/shr "
    },
    {
        "content": "ISTANBUL  Sept 23 A London court has pushed back the deadline to resolve a decade-long legal battle between two top shareholders of Turkish mobile operator Turkcell  according to a regulatory filing on Friday  a decision likely to frustrate other investors.",
        "date": "09232016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "London court delays deadline in Turkcell tussle -filing "
    },
    {
        "content": "ISTANBUL  Aug 1 An arbitration tribunal in London has dismissed claims against Russian billionaire Mikhail Fridman's investment vehicle Letter One from Turkish holding company Cukurova  Fridman's company said on Monday  marking a potential breakthrough in a decade-long ownership battle over mobile phone company Turkcell.",
        "date": "08012016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Letter One says tribunal decision forces Cukurova to decide on Turkcell "
    },
    {
        "content": "* Said on Friday that its unit Turkcell Sat\u007fs ve Dagitim has signed a protocol for a total project amount of approximately 500 million lira ($164.16 million) with Ronesans Isletme Hizmetleri",
        "date": "07252016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell unit Turkcell Satis signs protocol at c.500 mln lira "
    },
    {
        "content": "* Considers to buyback shares in accordance with Capital Markets Board (CMB) decision",
        "date": "07222016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell considers to buyback shares "
    },
    {
        "content": "ISTANBUL  April 28 Turkey's top mobile operator Turkcell  said on Thursday it plans to float its Global Tower subsidiary.",
        "date": "04282016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Turkey's Turkcell says to float Global Tower subsidiary "
    },
    {
        "content": "* Says 2015 dividend proposal was not passed at AGM  Source text for Eikon:  Further company coverage:    (Istanbul newsroom)",
        "date": "03292016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkey's Turkcell says 2015 dividend proposal was not passed at AGM "
    },
    {
        "content": "* Says no decision on dividend at Turkcell's ordinary general assembly",
        "date": "03292016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-Teliasonera says no decision on dividend at Turkcell's AGM "
    },
    {
        "content": "ISTANBUL Russia's Alfa Telecom said on Friday it was ready to sell a 13.22 percent indirect stake in Turkcell   to Turkey's Cukurova and Ziraat Bank for a total of around $2.7 billion  according to a statement to the Istanbul bourse.",
        "date": "03252016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Russia's Alfa Telecom says ready to sell Turkcell stake for $2.7 billion "
    },
    {
        "content": "ISTANBUL  March 25 Russia's Alfa Telecom said on Friday it was ready to sell a 13.22 percent indirect stake in Turkcell  to Turkey's Cukurova and Ziraat Bank for a total of around $2.7 billion  according to a statement to the Istanbul bourse.",
        "date": "03252016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Russia's Alfa Telecom says ready to sell Turkcell stake for $2.7 bln "
    },
    {
        "content": "* \u007fTo submit a binding offer Teliasonera's 24% direct stake in Kcell JSC operating in Kazakhstan\u007f",
        "date": "02262016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkey's Turkcell to submit binding offer for Teliasonera's Fintur stake "
    },
    {
        "content": "ANKARA  Feb 18 Turkey's biggest mobile operator Turkcell posted a 10.7 percent increase in its annual net profit to 2.07 billion lira ($698.10 million) in 2015.",
        "date": "02182016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Turkcell posts 10.7 percent increase in its net profit "
    },
    {
        "content": "* CEO says we have noted interest from Turkcell  to buy Fintur assets  there are also other interested parties in that discussion  Further company coverage:",
        "date": "01292016",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-TeliaSonera CEO: have noted Turkcell interest for Fintur  there are also other interested parties "
    },
    {
        "content": "Nov 25 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "11252015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "ANKARA  Nov 24 Turkey's largest telecoms operator Turkcell on Wednesday said it was making a non-binding indicative offer for Nordic firm TeliaSonera's  58.55 percent stake in its Eurasian unit Fintur.",
        "date": "11252015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Turkey's Turkcell to make offer for TeliaSonera's Eurasian Fintur "
    },
    {
        "content": "* Turkcell posts Q3 net profit of 631.3 million lira  versus 755.7 million lira year earlier  Source text for Eikon:  Further company coverage:    (Reporting By Nick Tattersall)",
        "date": "10272015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "BRIEF-Turkcell Q3 net profit falls to 631 million lira "
    },
    {
        "content": "ISTANBUL  Oct 28 Following are news  reports and events that may affect Turkish financial markets on Wednesday.",
        "date": "10282015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "UPDATE 1-Turkey - Factors to watch on Oct 28 "
    },
    {
        "content": "ISTANBUL  Oct 7 Turkey's largest mobile operator Turkcell borrowed $500 million through a 10-year eurobond on Wednesday at a yield of 5.95 percent  in an issue that was almost four times oversubscribed  bankers told Reuters.",
        "date": "10072015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Turkcell borrows $500 mln at 5.95 pct with 10-year eurobond - bankers "
    },
    {
        "content": "ISTANBUL  Oct 7 The final yield in the debut 10-year dollar-denominated eurobond issue by Turkey's largest mobile operator Turkcell is expected at around 6 percent and the firm is expected to borrow $500 million  bankers told Reuters on Wednesday.",
        "date": "10072015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Final guidance for Turkcell's 10-year eurobond issue around 6 pct - bankers "
    },
    {
        "content": "ISTANBUL  Oct 7 Price guidance in Turkey's largest mobile operator Turkcell's 10-year dollar-denominated debut eurobond issue will be between 6 to 6.125 percent  bankers told Reuters on Wednesday.",
        "date": "10072015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Price guidance for Turkcell's debut eurobond issue at 6-6.125 pct - bankers "
    },
    {
        "content": "ISTANBUL  Sept 29 Turkey's Turkcell  said on Tuesday it had signed an agreement with China Development Bank for a loan package worth up to 1.25 billion euros ($1.4 billion) to restructure the company's existing loans and to help finance procurement from China for infrastructure investments.",
        "date": "09292015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Turkey's Turkcell signs 1.25 bln euro loan with China Development Bank "
    },
    {
        "content": "ISTANBUL  Oct 7 The initial price target in Turkey's largest mobile operator Turkcell's 10-year dollar-denominated debut eurobond issue is expected at around 6.25 percent  bankers told Reuters on Wednesday.",
        "date": "10072015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Initial price target in Turkcell's debut eurobond issue around 6.25 pct - bankers "
    },
    {
        "content": "ISTANBUL  Sept 17 Turkcell  Turkey's largest mobile operator  said on Thursday it was considering acquiring some of the Eurasian assets of its shareholder TeliaSonera  after the Nordic telecom operator said it was looking at leaving seven markets.",
        "date": "09172015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Turkcell to consider acquiring some assets as TeliaSonera exits "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 18 (Fitch) Fitch Ratings has assigned Turkcell Iletisim  Hizmetleri A.S. (TCELL) a Long-term Issuer Default Rating (IDR) and a senior  unsecured rating of 'BBB-'. The Outlook on the IDR is Stable.  The ratings incorporate TCELL's strong domestic business profile  leading market  position and high-quality mobile business  well-positioned and growing fixed  line operations and sound financial performance. Limited diversi",
        "date": "09182015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Fitch Rates Turkcell 'BBB-'; Outlook Stable "
    },
    {
        "content": "ANKARA  Aug 26 Turkey's auction of 4G mobile phone frequencies lured a higher than expected 3.96 billion euros ($4.5 billion) worth of bids  the agency running the process said on Wednesday  showing the appeal of Turkey's youthful and growing market.",
        "date": "08262015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "UPDATE 3-Turkey's 4G tender outstrips predictions with bids of 4 bln euros "
    },
    {
        "content": "ISTANBUL  Aug 26 Top Turkish mobile phone operator Turkcell said it would consider buying back up to 10 percent of its outstanding shares to avoid any potential losses due to global economic turmoil.",
        "date": "08262015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "RPT-UPDATE 1-Turkcell to evaluate buyback of up to 10 pct of outstanding shares "
    },
    {
        "content": " ",
        "date": "08262015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "UPDATE 1-. "
    },
    {
        "content": "ANKARA  Aug 26 Britain's Vodafone and Turkish firms Avea and Turkcell were the highest bidders in tenders for Turkey's fourth-generation (4G) network  the tender commission chairman said on Wednesday.",
        "date": "08262015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "CORRECTED-UPDATE 1-Vodafone  Avea  Turkcell offer highest bids in Turkey's 4G tender "
    },
    {
        "content": "ISTANBUL  Aug 26 Turkey's leading mobile phone operator Turkcell said on Wednesday it would evaluate the buyback of up to 10 percent of its outstanding shares to avoid any potential losses due to global macroeconomic turmoil and its impact on Turkish markets.",
        "date": "08262015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Turkcell to evaluate buyback of up to 10 percent of outstanding shares "
    },
    {
        "content": "ISTANBUL  Aug 11 Turkcell is considering participating in a tender for management of a state-owned mobile network in Lebanon  the Turkish mobile company said on Tuesday.",
        "date": "08112015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Mobile operator Turkcell considering Lebanon tender "
    },
    {
        "content": "ISTANBUL  July 30 Turkish communications and technology services firm Turkcell on Thursday posted a net profit of 712.5 million lira ($255.74 million) in the second quarter  beating a Reuters poll forecast of 622 million lira.",
        "date": "07302015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Turkcell beats forecasts with 712.5 mln lira Q2 net profit "
    },
    {
        "content": "ISTANBUL  June 29 Leading Turkish mobile phone company Turkcell said it had signed a deal to buy the remaining 44.96 percent of its Netherlands-based unit Euroasia Telecommunications Holding for $100 million.",
        "date": "06292015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Turkcell buys remaining stake in Euroasia for $100 million "
    },
    {
        "content": "ISTANBUL  April 30 Turkey's biggest mobile operator Turkcell is seeking opportunities for regional expansion and may even increase its bet on conflict-torn Ukraine  its new chief executive said on Thursday.",
        "date": "04302015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "New Turkcell CEO plans regional growth  Ukraine in focus "
    },
    {
        "content": "ISTANBUL  April 1 Turkey's Cukurova Holding on Wednesday launched an attempt to buy out Russian billionaire Mikhail Fridman's indirect stake in Turkcell  the latest manoeuvre in a decade-long fight for control of the market-leading wireless operator.",
        "date": "04012015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "UPDATE 1-Turkey's Cukurova launches attempt to buy out Turkcell rival "
    },
    {
        "content": "ISTANBUL  March 26 Feuding shareholders of Turkish wireless carrier Turkcell called a truce on Thursday to pay themselves a $1.5 billion dividend  signalling a potential thaw in a protracted battle over the company.",
        "date": "03262015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "UPDATE 2-Turkcell shareholders call truce to approve rare dividend "
    },
    {
        "content": "ISTANBUL  March 26 Shareholders of wireless operator Turkcell have approved a dividend proposal  an investor who attended its general meeting on Thursday told Reuters  paving the way for the company's first pay-out in around five years.",
        "date": "03262015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Turkcell AGM votes for first dividend in five years -investor "
    },
    {
        "content": "ISTANBUL  March 26 Shareholders of Turkish wireless operator Turkcell convened an annual general meeting for the first time in five years on Thursday  signalling a potential thaw in a debilitating investor battle.",
        "date": "03262015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Turkcell shareholders start first AGM since 2010 "
    },
    {
        "content": "DUBAI  March 26 Here are some factors that may affect Middle East stock markets on Thursday. Reuters has not verified the press reports and does not vouch of their accuracy.",
        "date": "03262015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "MIDEAST STOCKS - Factors to watch - March 26 "
    },
    {
        "content": "ISTANBUL  March 25 A plan to push for a $1.5 billion dividend from Turkish mobile operator Turkcell  will not resolve deadlock among investors  shareholder Alfa Group said on Wednesday  adding its offer to buy shares in the company could resolve the problems.",
        "date": "03252015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Turkcell shareholder says dividend proposal does not resolve deadlock "
    },
    {
        "content": "Oslo  March 25 The following stocks may be affected by newspaper reports and other factors on day:",
        "date": "03252015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "NORDIC STOCKS - Factors to watch on March 25 "
    },
    {
        "content": "STOCKHOLM  March 25 TeliaSonera and the other shareholders in Turkcell Holding have agreed to propose a dividend for the first time in five years for Turkey's Turkcell  TeliaSonera said on Wednesday.",
        "date": "03252015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "TeliaSonera  other Turkcell Holding owners propose Turkcell dividend "
    },
    {
        "content": "* TeliaSonera and the other shareholders in Turkcell Holding have agreed on a dividend distribution proposal to the general assembly meeting of Turkcell",
        "date": "03252015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "BRIEF-TeliaSonera  other owners propose 3.9 bln TRY Turkcell dividend "
    },
    {
        "content": "ISTANBUL Russia's Alfa Telecom offered $2.8 billion on Tuesday to buy back a 13.8 percent stake in Turkcell   a move that would give billionaire Mikhail Fridman's group control of Turkey's top mobile operator.",
        "date": "03172015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "Russia's Alfa Telecom bids $2.8 billion to double stake in Turkcell "
    },
    {
        "content": "* Alfa might be seeking to force buyout of its own stake   (Recasts  adds analyst comments  changes slug for media clients)",
        "date": "03172015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "UPDATE 2-Russia's Alfa Telecom bids $2.8 bln to double stake in Turkcell "
    },
    {
        "content": "ISTANBUL  March 17 Russia's Alfa Telecom said on Tuesday it offered a total of $2.8 billion to buy a 13.76 percent stake in Turkey's biggest mobile operator Turkcell.",
        "date": "03172015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Russia's Alfa Telecom bids $2.8 bln for 13.76 pct stake in Turkcell "
    },
    {
        "content": "ISTANBUL  Feb 24 Businesses run by Turkish mobile operator Turkcell and Russia's VimpelCom  and MTS have been awarded 3G mobile licences in Ukraine  the companies said on Tuesday.",
        "date": "02242015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "topStory",
        "symbol": "TKC",
        "title": "CORRECTED-UPDATE 2-Turkcell  VimpelCom  MTS units win 3G mobile licences in Ukraine "
    },
    {
        "content": "ISTANBUL  Feb 24 Astelit  a subsidiary of Turkish mobile operator Turkcell  won a tender for a 3G UMTS mobile licence in Ukraine with a 3.35 billion Ukraine hryvnia ($118.4 million) bid  Turkcell said in a statement to the Istanbul stock exchange.",
        "date": "02242015",
        "name": "Turkcell Iletisim Hizmetleri AS",
        "news_type": "normal",
        "symbol": "TKC",
        "title": "Turkcell unit wins 3G mobile licence in Ukraine "
    }
]