[
    {
        "content": "* Thermo Fisher Scientific and Cellular Biomedicine Group announce strategic partnership to develop manufacturing processes",
        "date": "11062017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific and Cellular Biomedicine announce partnership to develop manufacturing processes "
    },
    {
        "content": "* Announced selection of Patheon division of Thermo Fisher Scientific as commercial manufacturing partner for Gimoti​",
        "date": "11092017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Evoke Pharma signs commercial agreement with Thermo Fisher Scientific "
    },
    {
        "content": "* Thermo Fisher Scientific Inc - ‍ expanded development of Oncomine Dx Target Test by entering into an agreement with Blueprint Medicines Corporation​",
        "date": "10312017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher enters agreement with Blueprint Medicines​ "
    },
    {
        "content": "Oct 25 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  on Wednesday reported a higher-than-expected quarterly profit  fueled by sales growth in all of its units and contributions from recent acquisitions.",
        "date": "10252017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher tops profit estimates; raises full-year forecast "
    },
    {
        "content": "* Q3 GAAP earnings per share $1.34; Q3 adjusted earnings per share $2.31",
        "date": "10252017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific reports Q3 Adj EPS of $2.31 "
    },
    {
        "content": "* TETRAPHASE PHARMACEUTICALS APPOINTS KAM UNNINAYAR AS CHIEF FINANCIAL OFFICER",
        "date": "10162017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-TETRAPHASE PHARMACEUTICALS APPOINTS KAM UNNINAYAR AS CFO "
    },
    {
        "content": "BRUSSELS  Aug 25 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08252017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "EU mergers and takeovers (Aug 25) "
    },
    {
        "content": "BRUSSELS  Aug 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08242017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "EU mergers and takeovers (Aug 24) "
    },
    {
        "content": "* Thermo Fisher Scientific announces receipt of all required regulatory approvals for proposed acquisition of patheon",
        "date": "08232017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific announces receipt of all required regulatory approvals for proposed acquisition of Patheon "
    },
    {
        "content": "BRUSSELS  Aug 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08232017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "EU mergers and takeovers (Aug 23) "
    },
    {
        "content": "* Appaloosa LP says cuts share stake in General Motors to 1.9 million shares from 5.2 million shares - SEC filing‍​",
        "date": "08142017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Appaloosa LP cuts share stake in GM  ups in Thermo Fisher "
    },
    {
        "content": "* Priced an offering of $1.5 billion aggregate principal amount",
        "date": "08102017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific prices an offering of $1.5 bln aggregate principal amount "
    },
    {
        "content": "* Thermo Fisher extends cash tender offer for all outstanding shares of Patheon to coordinate offer timing with two remaining regulatory approvals",
        "date": "08072017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher extends cash tender offer for all outstanding shares of Patheon "
    },
    {
        "content": "* Files preliminary prospectus supplement related to a potential two-part notes offering Source text: (http://bit.ly/2fuz7Wc) Further company coverage:",
        "date": "08102017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific files preliminary prospectus supplement related to a potential two-part notes offering "
    },
    {
        "content": "* Priced its underwritten public offering of 8 771 930 shares of common stock at a price of $171.00 per share Source text for Eikon: Further company coverage:",
        "date": "08092017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher prices offering of common stock at $171 per share "
    },
    {
        "content": "* Thermo Fisher Scientific - intends to use all of net proceeds of offering to fund a portion of consideration payable for its acquisition of Patheon N.V. Source text for Eikon: Further company coverage:",
        "date": "08072017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific announces $1.5 billion offering of common stock "
    },
    {
        "content": "* FDA issues emergency use authorization for Thermo Fisher Scientific's zika virus assay",
        "date": "08032017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-FDA issues emergency use authorization for Thermo Fisher Scientific's Zika virus assay "
    },
    {
        "content": "* Thermo Fisher Scientific Inc - announced successful CE-IVD registration of its QuantStudio 5 Dx Real-Time PCR system for sale in European countries",
        "date": "07312017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific Inc announced successful CE-IVD registration of its QuantStudio 5 Dx real-time PCR system for sale in European countries "
    },
    {
        "content": "* Q2 revenue grew 10 percent to $4.99 billion  versus $4.54 billion in Q2 2016",
        "date": "07262017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific Q2 adjusted earnings of $2.30 per share "
    },
    {
        "content": "July 26 Thermo Fisher Scientific Inc on Wednesday reported quarterly profit and revenue slightly ahead of analysts' estimates  helped by increased sales across its businesses  and raised its full-year earnings and revenue forecasts.",
        "date": "07262017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher quarterly results edge past estimates  ups forecast "
    },
    {
        "content": "* Thermo Fisher Scientific prices offering of euro-denominated senior notes",
        "date": "07182017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher prices offering of euro-denominated senior notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  July 18 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Thermo Fisher Scientific Inc.'s (Thermo Fisher) EUR2.6 billion senior notes offering. The proceeds will be used to partly finance the USD7.2 billion acquisition of Patheon N.V. The Rating Outlook is Stable. Thermo Fisher plans to finance the acquisition with $2 billion of equity and approximately $5.2 billion of unsecured notes and short-term debt. Free cash flow gen",
        "date": "07182017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Fitch Rates Thermo Fisher's EUR2.6B Senior Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.15 per share Source text for Eikon: Further company coverage:",
        "date": "07122017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo fisher Scientific sets quarterly cash dividend of $0.15 per share "
    },
    {
        "content": "* CELLINK SIGNS DISTRIBUTION AGREEMENT WITH THERMO FISHER SCIENTIFIC ANZ",
        "date": "07102017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Cellink signs distribution agreement with Thermo Fisher Scientific "
    },
    {
        "content": "* Thermo fisher scientific announces availability of two new immunoassays designed to maximize detection of synthetic cannabinoids",
        "date": "06282017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific announces availability of two new immunoassays "
    },
    {
        "content": "* FDA approves first companion diagnostic test to simultaneously screen for multiple non-small cell lung cancer therapies",
        "date": "06222017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-FDA approves Thermo fisher Scientific's companion diagnostic test to screen multiple non-small cell lung cancer therapies "
    },
    {
        "content": "* Opgen signs supply agreement to use thermo fisher scientific’s technology to advance acuitas® rapid test",
        "date": "06192017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-OpGen signs supply agreement to use Thermo Fisher Scientific’S technology "
    },
    {
        "content": "* Thermo fisher scientific expands access to genome editing with hands-on workshop Source text for Eikon: Further company coverage:",
        "date": "06152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher expands access to genome editing with workshop "
    },
    {
        "content": "* Thermo Fisher Scientific and Biognosys announce co-marketing agreement to create industry-leading data-independent acquisition workflows",
        "date": "06052017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific  Biognosys announce co-marketing agreement "
    },
    {
        "content": "* Patheon NV - under termination of deal in certain circumstances  co to be obligated to pay thermo fisher termination compensation of $203 million in cash Source text for Eikon: (http://bit.ly/2qGr8XK) Further company coverage:",
        "date": "05192017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Patheon says to be obligated to pay Thermo Fisher termination compensation of $203 million in cash "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.15per share Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher sets quarterly cash dividend of $0.15 per share "
    },
    {
        "content": "* Thermo Fisher Scientific signs development agreement with Agios Pharmaceuticals for next-generation sequencing oncology companion diagnostic in cholangiocarcinoma",
        "date": "05182017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific signs development agreement with Agios Pharmaceuticals "
    },
    {
        "content": "* Thermo Fisher Scientific's one lambda brand signs exclusive licensing agreement with Transcriptome Sciences Inc. for access to molecular microscope diagnostic system Source text for Eikon: Further company coverage:",
        "date": "05162017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific signs exclusive licensing agreement with Transcriptome Sciences "
    },
    {
        "content": "Thermo Fisher Scientific Inc said on Monday it would buy Patheon NV  a Dutch manufacturer of drugs for clinical trials  for $5.2 billion as it seeks to complement its offerings in production and services for the biopharma industry.",
        "date": "05152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Thermo Fisher to buy Patheon for $5.2 bln to expand biopharma services "
    },
    {
        "content": "Thermo Fisher Scientific Inc  said on Monday it would buy Patheon NV   a Dutch manufacturer of drugs for clinical trials  for $5.2 billion as it seeks to complement its offerings in production and services for the biopharma industry. | Video ",
        "date": "05152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher to buy Patheon for $5.2 billion to expand biopharma services "
    },
    {
        "content": "* Thermo Fisher is world's biggest maker of scientific instruments",
        "date": "05152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 4-Thermo Fisher to buy Patheon for $5.2 bln to expand biopharma services "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Thermo Fisher Scientific has started a new experiment with a pricey deal. The maker of electron microscopes  DNA-sequencing machines and other lab supplies is paying about $5.2 billion to buy Patheon  which produces drugs and the chemicals used in them. Cost savings don’t come close to covering the premium being paid. While the industry may be ready for consolidation  Thermo Fisher also has a lot to learn.",
        "date": "05152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher experiment starts with pricey deal "
    },
    {
        "content": "May 15 Dutch food supplement maker DSM will tender its stake in U.S. drug ingredient maker Patheon to Thermo Fisher Scientific  DSM said on Monday.",
        "date": "05152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "DSM to tender Patheon stake to Thermo Fisher "
    },
    {
        "content": "May 15 Dutch food supplement maker DSM will tender its stake in U.S. drug ingredient maker Patheon to Thermo Fisher Scientific  DSM said on Monday.",
        "date": "05152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 1-DSM to tender Patheon stake to Thermo Fisher "
    },
    {
        "content": "* BOARD OF DIRECTORS OF PATHEON N.V.  COMPANY IN WHICH DSM HOLDS APPROXIMATELY 48.7 MILLION ORDINARY SHARES  UNANIMOUSLY APPROVED ACQUISITION OF PATHEON BY THERMO FISHER SCIENTIFIC INC.",
        "date": "05152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-DSM announces Thermo Fisher will commence tender offer to acquire all shares of Patheon "
    },
    {
        "content": "May 15 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  said on Monday it would buy contract manufacturing company Patheon NV for about $5.2 billion in cash.",
        "date": "05152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher to buy Patheon for about $5.2 bln "
    },
    {
        "content": "* Thermo Fisher Scientific to acquire Patheon  a leading contract development and manufacturing organization (CDMO)",
        "date": "05152017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific to acquire Patheon for a purchase price of about $7.2 bln "
    },
    {
        "content": "April 26 Thermo Fisher Scientific Inc on Wednesday reported higher-than-expected first quarter profit on increased sales in all of its divisions and raised its full-year earnings and revenue forecasts.",
        "date": "04262017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher tops profit estimate  ups forecast "
    },
    {
        "content": "* Says raising 2017 revenue guidance to range of $19.51 billion to $19.71 billion versus original guidance of $19.38 billion to $19.62 billion",
        "date": "04262017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific posts Q1 adj earnings of $2.08/share "
    },
    {
        "content": "* SpeeDx and Thermo Fisher Scientific announce strategic partnership for FDA clearance of Molecular Diagnostic",
        "date": "04242017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-SpeeDx  Thermo Fisher announce partnership for FDA clearance of Molecular Diagnostic "
    },
    {
        "content": "* Thermo Fisher Scientific - Effective Jan 1  co transferred its plastics for cell culture and vaccines/biologics to life sciences solutions segment",
        "date": "04172017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific transferred plastics for cell culture and vaccines to life sciences solutions segment "
    },
    {
        "content": "* Says ceo Marc Casper's total 2016 compensation was $17.8 million versus $16.3 million in 2015 - SEC filing Source text for Eikon: Further company coverage:",
        "date": "04042017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo fisher scientific CEO Marc Casper's total 2016 compensation was $17.8 mln "
    },
    {
        "content": "* On March 16  2017  issued EUR 500 million aggregate principal amount of 1.450 pct senior notes due 2027",
        "date": "03162017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher issues 500 mln euro of certain senior notes due 2027 "
    },
    {
        "content": "* Thermo Fisher Scientific Inc - co and Cell And Gene Therapy Catapult collaborate to optimise advanced therapy supply chain  Source text for Eikon:  Further company coverage:",
        "date": "03212017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific and Cell And Gene Therapy Catapult collaborate "
    },
    {
        "content": "Feb 22 The U.S. Supreme Court on Wednesday cleared a subsidiary of biotech company Thermo Fisher Scientific Inc of infringing a genetic-testing kit patent held by Promega Corp  overturning a lower court's decision.",
        "date": "02222017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher did not infringe genetic-testing patent  U.S. top court says "
    },
    {
        "content": "* Asuragen Inc - Entered collaboration deal with Thermo Fisher scientific for development  commercialization of capillary electrophoresis-based in vitro diagnostics    Source text for Eikon:    Further company coverage:",
        "date": "02202017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Asuragen enters into collaboration deal with Thermo Fisher "
    },
    {
        "content": "Feb 22 The U.S. Supreme Court on Wednesday cleared a subsidiary of biotech company Thermo Fisher Scientific Inc of infringing a genetic-testing kit patent held by Promega Corp  overturning a lower court's decision.",
        "date": "02222017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 2-Thermo Fisher did not infringe genetic-testing patent  U.S. top court says "
    },
    {
        "content": "* Thermo Fisher Scientific receives early termination of Hart-Scott-Rodino waiting period for acquisition of Finesse Solutions Inc",
        "date": "02132017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific receives early termination of Hart-Scott-Rodino waiting period for acquisition of Finesse Solutions "
    },
    {
        "content": "* Thermo Fisher Scientific Inc sees FY 2017 revenue between $19.38 billion to $19.62 billion - Conf call",
        "date": "01312017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific sees FY'17 adj EPS bewteen $9.06 - $9.24 - Conf call "
    },
    {
        "content": "* Q4 Life Sciences Solutions segment revenue grew 10 percent to $1.34 billion  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific reports Q4 GAAP EPS of $1.59 "
    },
    {
        "content": "Jan 31 Thermo Fisher Scientific Inc  reported a slightly higher-than-expected fourth-quarter profit on Tuesday  helped by double-digit percentage sales growth in its life sciences solutions and analytical instruments divisions.",
        "date": "01312017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher quarterly profit tops Wall Street expectations "
    },
    {
        "content": "WASHINGTON U.S. Chief Justice John Roberts will no longer participate in a patent dispute at the Supreme Court involving a unit of Thermo Fisher Scientific Inc after he realized he owns about $175 000 of stock in the company  the court said on Wednesday.",
        "date": "01042017",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "U.S. chief justice steps aside in patent case over stock conflict "
    },
    {
        "content": "Shares of Thermo Fisher Scientific Inc  a top seller of laboratory gear  could rise another 30 percent over the coming two years  Barron's said in a report.",
        "date": "11132016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Thermo Fisher shares could rise 30 percent over the next two years: Barron's "
    },
    {
        "content": "Nov 13 Shares of Thermo Fisher Scientific Inc   a top seller of laboratory gear  could rise another 30 percent over the coming two years  Barron's said in a report.",
        "date": "11132016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher shares could rise 30 pct over the next 2 years -Barron's "
    },
    {
        "content": "* Thermo Fisher Scientific to distribute Biocartis' Idylla automated molecular diagnostics testing platform in US  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "11172016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher to distribute Biocartis' testing platform "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.15 per share  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific declares quarterly dividend "
    },
    {
        "content": "* \u007f\u007fRaising 2016 revenue  adjusted earnings per share guidance",
        "date": "10272016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific \u007f\u007freports Q3 \u007f\u007fGAAP earnings $1.19/share "
    },
    {
        "content": "Oct 27 Thermo Fisher Scientific Inc  the world's largest scientific instruments maker  raised its 2016 revenue and adjusted earnings forecasts  helped partly by its acquisition of microscope maker FEI Co.",
        "date": "10272016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher raises 2016 revenue  earnings forecasts "
    },
    {
        "content": "* Silver standard signs option agreement to explore Fisher Gold Project contiguous to Seabee Gold Operation",
        "date": "10062016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Silver Standard signs option agreement to explore Fisher Gold Project "
    },
    {
        "content": "* Priced offering of $1.2 billion aggregate principal amount of its 2.950% senior notes due 2026 at issue price of 98.787% of principal amount",
        "date": "09142016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher prices offering of senior notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 14 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Thermo Fisher Scientific Inc.'s (Thermo Fisher) new USD senior notes offering.  Fitch expects that the proceeds of the issue will be used to fund the early call  of the company's $900 million bond due February 2017 and for general corporate  purposes. The Rating Outlook is Stable. The ratings apply to approximately $15 billion of debt at June 30  2016. A full  ",
        "date": "09142016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Fitch Rates Thermo Fisher's USD Senior Notes Offering 'BBB'; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 07 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Thermo Fisher Scientific Inc.'s (Thermo Fisher) EUR1.6 billion senior notes  offering. Fitch expects that the proceeds of the issue will be used to finance  the planned acquisition of FEI Company. The Rating Outlook is Stable. The ratings apply to approximately $15 billion of debt at June 30  2016. A full  list of current ratings follows at the end of this rele",
        "date": "09072016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Fitch Rates Thermo Fisher's EUR1.6B Senior Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* Thermo Fisher Scientific prices offering of Euro-denominated senior notes",
        "date": "09082016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific priced offering of 1 bln euros aggregate principal amount of 0.75 percent senior notes due 2024 "
    },
    {
        "content": "* Fei shareholders approve acquisition by Thermo Fisher Scientific",
        "date": "08302016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-FEI shareholders approve acquisition by Thermo Fisher Scientific "
    },
    {
        "content": "* FEI CO says given pending merger with Thermo Fisher Scientific Inc.  company will no longer provide a forward outlook",
        "date": "08042016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-FEI reports Q2 earnings per share $0.60 "
    },
    {
        "content": "* Thermo fisher scientific (Finance I) B.V. issued EUR 600 million aggregate principal amount floating rate senior notes due 2018  Source text for Eikon:  Further company coverage:",
        "date": "08092016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific unit issued EUR 600 mln senior notes "
    },
    {
        "content": "* Thermo fisher scientific reports second quarter 2016 results",
        "date": "07282016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific reports Q2 GAAP earnings per share $1.30 "
    },
    {
        "content": "* Thermo fisher scientific declares quarterly dividend and authorizes $1.5 billion of share repurchases",
        "date": "07072016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific authorizes $1.5 bln of share repurchases "
    },
    {
        "content": "* On July 1  entered into $2.0 billion bridge credit agreement   $2.0 billion term loan agreement  and $2.5 billion revolving credit agreement  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07012016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher entered into $2 bln bridge credit agreement  $2 bln term loan agreement and $2.5 bln revolving credit agreement "
    },
    {
        "content": "* Adaptimmune announces commercial development and supply agreement for Thermo Fisher scientific's Dynabeads\u007f cd3/cd28 cell therapy system",
        "date": "06212016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Adaptimmune says enters commercial development and supply agreement with Thermo Fisher "
    },
    {
        "content": "Thermo Fisher Scientific Inc   the world's largest maker of scientific instruments  said on Friday it would buy FEI Co  for about $4.2 billion to gain access to the company's electron microscopy technology that helps study proteins.",
        "date": "05272016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Thermo Fisher to buy microscope maker FEI Co for about $4.2 billion "
    },
    {
        "content": "* FEI shares trade just below offer price   (Adds Breakingviews link)",
        "date": "05272016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 3-Thermo Fisher to buy microscope maker FEI Co for about $4.2 bln "
    },
    {
        "content": "May 27 Thermo Fisher Scientific Inc said it would buy FEI Co for about $4.2 billion to gain access to its signature electron microscopy technology.",
        "date": "05272016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "REFILE-Thermo Fisher to buy FEI Co for about $4.2 bln "
    },
    {
        "content": "* Deal expected to be immediately accretive to adjusted earnings per share",
        "date": "05272016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher to acquire FEI Company for $4.2 bln "
    },
    {
        "content": "* Settlement does not affect unit's action brought in federal district court in new haven  ct against life technologies' predecessors",
        "date": "05162016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Enzo Biochem reaches settlement with unit of Thermo Fisher "
    },
    {
        "content": "Thermo Fisher Scientific Inc  reported better-than-expected first-quarter revenue and profit  helped by strength in its life sciences unit  and the company raised its full-year forecast.",
        "date": "04282016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Thermo Fisher profit beats  raises forecast "
    },
    {
        "content": "April 28 Thermo Fisher Scientific Inc  reported better-than-expected first-quarter revenue and profit  helped by strength in its life sciences unit  and the company raised its full-year forecast.",
        "date": "04282016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 1-Thermo Fisher profit beats  raises forecast "
    },
    {
        "content": "* On April 13  co issued $1 billion aggregate principal amount of 3.000% senior notes due 2023 in a public offering",
        "date": "04132016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific issued $1 bln principal amount of senior notes on April 13 "
    },
    {
        "content": "* CEO Marc Casper's FY 2015 total compensation $16.3 million versus $17.4 million in FY 2014 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "04052016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific announces CEO's FY 2015 total compensation "
    },
    {
        "content": "March 28 Origin Technologies Corp  owned by Affymetrix Inc's former employees  withdrew its offer to buy the gene sequencing products maker  hours after Affymetrix said Origin's raised offer was not superior to Thermo Fisher Scientific Inc's proposal.",
        "date": "03282016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Origin withdraws offer to buy Affymetrix "
    },
    {
        "content": "March 28 Origin Technologies Corp  owned by Affymetrix Inc's former employees  withdrew its offer to buy the gene-sequencing products maker  hours after Affymetrix said on Monday that Origin's raised bid was not superior to Thermo Fisher Scientific Inc's proposal.",
        "date": "03282016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 2-Origin withdraws offer to buy Affymetrix "
    },
    {
        "content": "Gene sequencing products maker Affymetrix Inc  delayed a shareholder voting on its deal to be acquired by Thermo Fisher Scientific Inc   saying a raised offer from its former executives could be a superior proposal.",
        "date": "03232016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Affymetrix delays shareholder voting on Thermo Fisher offer "
    },
    {
        "content": "March 28 Gene sequencing products maker Affymetrix Inc said on Monday that a raised offer from its former executives does not constitute a superior proposal and backed its deal to be acquired by Thermo Fisher Scientific Inc.",
        "date": "03282016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Affymetrix backs Thermo Fisher deal "
    },
    {
        "content": "* Shares rise as much as 6.8 pct   (Adds analyst comments; updates shares)",
        "date": "03232016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 2-Affymetrix delays shareholder voting on Thermo Fisher offer "
    },
    {
        "content": "March 23 Gene testing provider Affymetrix Inc   which has agreed to be bought by Thermo Fisher Scientific Inc  said on Wednesday that a sweetened bid from a group of former executives could lead to a superior proposal.",
        "date": "03232016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Affymetrix says raised Origin offer could lead to superior proposal "
    },
    {
        "content": "Origin Technologies Corp Llc  owned by a group of former Affymetrix Inc  executives  sweetened its all cash offer to acquire the gene testing provider on Tuesday  after it was rebuffed for a competing proposal from Thermo Fisher Scientific Inc .",
        "date": "03222016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Origin Technologies raises offer for Affymetrix to $17 per share "
    },
    {
        "content": "* Special stockholder meeting on Thermo Fisher Scientific merger vote until march 31  2016",
        "date": "03232016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Affymetrix Inc says sweetened offer from Origin Technologies could lead to superior proposal "
    },
    {
        "content": "March 22 Origin Technologies Corp Llc  owned by a group of former Affymetrix Inc executives  sweetened its all cash offer to acquire the gene testing provider on Tuesday  after it was rebuffed for a competing proposal from Thermo Fisher Scientific Inc.",
        "date": "03222016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 1-Origin Technologies raises offer for Affymetrix to $17/shr "
    },
    {
        "content": "March 22 Thermo Fisher Scientific Inc  sent a letter to Affymetrix Inc shareholders on Tuesday  reiterating its argument that its $1.3 billion agreement to acquire the U.S. gene-testing company is superior to a bid from Origin Technologies Corp.",
        "date": "03222016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher  Origin Tech vie for Affymetrix shareholder votes "
    },
    {
        "content": "March 20 U.S. gene-testing company Affymetrix Inc's board on Sunday rejected a $1.5 billion bid by Origin Technologies Corp  saying it stood by a $1.3 billion merger deal with Thermo Fisher Scientific Inc.",
        "date": "03212016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Affymetrix rejects rival bid  supports Thermo Fisher merger "
    },
    {
        "content": "A group of former Affymetrix Inc  executives offered to buy the gene testing and analysis provider for about $1.5 billion  looking to derail the company's deal with Thermo Fisher Scientific Inc .",
        "date": "03182016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Former Affymetrix executives bid for co; challenge Thermo Fisher "
    },
    {
        "content": "* Ready to complete transaction upon shareholder approval - Thermo",
        "date": "03182016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 3-Former Affymetrix executives bid for co; challenge Thermo Fisher "
    },
    {
        "content": "* While board is reviewing unsolicited proposal  as of now board continues to recommend stockholders adoption of merger agreement with thermo fisher  Source text for Eikon:  Further company coverage:",
        "date": "03182016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "BRIEF-Affymetrix -board recommends stockholders adoption of Thermo Fisher merger "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 02 (Fitch) Fitch Ratings has affirmed Thermo Fisher Scientific's  (Thermo Fisher) ratings  including the 'BBB' Issuer Default Rating (IDR). The  Rating Outlook is Stable. The ratings apply to $12.5 billion of debt at Dec. 31   2015. A full list of rating actions follows at the end of this press release. KEY RATING DRIVERS --Thermo Fisher has demonstrated solid and consistently paced improvement in  credit metrics since i",
        "date": "03022016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Fitch Affirms Thermo Fisher's Ratings; Outlook Stable "
    },
    {
        "content": "Jan 28 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  reported slightly better-than-expected fourth-quarter results  helped by growth in its life sciences division.",
        "date": "01282016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher quarterly profit edges past Street estimates "
    },
    {
        "content": "Thermo Fisher Scientific Inc   the world's largest maker of scientific instruments  said it agreed to buy Affymetrix Inc  for $1.3 billion in cash  beefing up its genetic analysis products business.",
        "date": "01082016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Thermo Fisher to buy Affymetrix for $1.3 billion "
    },
    {
        "content": "Jan 8 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  said it agreed to buy Affymetrix Inc for $1.3 billion in cash  beefing up its genetic analysis products business.",
        "date": "01082016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 1-Thermo Fisher to buy Affymetrix for $1.3 bln "
    },
    {
        "content": "Jan 8 Scientific instruments maker Thermo Fisher Scientific Inc said it agreed to buy Affymetrix Inc  for $1.3 billion in cash  to add genetic analysis products serving research  clinical and applied markets.",
        "date": "01082016",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher to buy Affymetrix for $1.3 bln "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 30 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Thermo Fisher Scientific Inc.'s (Thermo Fisher) USD800 million 3- and 10-year  senior notes offering. The proceeds of the issue will be used to redeem the  outstanding $900 million aggregate principal amount of the company's 3.20%  senior notes due March 1  2016. The Rating Outlook is Stable. The ratings apply to $13.2 billion of debt at Sept. 26  2015. The rati",
        "date": "11302015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Fitch Rates Thermo Fisher's Senior Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* Q3 adjusted earnings per share $1.80; Q3 GAAP earnings per share $1.18; Q3 revenue $4.12 billion versus $4.17 billion",
        "date": "10212015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific reports Q3 adj earnings per share $1.80 "
    },
    {
        "content": "Oct 21 Thermo Fisher Scientific Inc on Wednesday reported a third-quarter profit that narrowly beat Wall Street expectations and raised the low end of its full-year earnings forecast to reflect the contribution of an acquisition.",
        "date": "10212015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher profit edges past Street estimates "
    },
    {
        "content": "* Grants non-exclusive license on double switch technology to Thermo Fisher Scientific",
        "date": "07212015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Sygnis signs non-exclusive worldwide license agreement with Thermo Fisher Scientific "
    },
    {
        "content": "Thermo Fisher Scientific Inc   the world's largest maker of scientific instruments  reported a better-than-expected quarterly profit  helped by lower costs and strength in its life sciences unit.",
        "date": "07222015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Thermo Fisher profit beats estimates; raises forecast "
    },
    {
        "content": "July 22 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  reported a better-than-expected quarterly profit  helped by lower costs and strength in its life sciences unit.",
        "date": "07222015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 1-Thermo Fisher profit beats estimates; raises forecast "
    },
    {
        "content": "July 22 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  reported an 84 percent rise in quarterly profit  helped by lower costs.",
        "date": "07222015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher profit jumps 84 pct "
    },
    {
        "content": "June 25 Specialty chemicals firm Johnson Matthey Plc said it would sell its research chemicals unit to Thermo Fisher Scientific Inc for 256 million pounds ($403 million) in cash.",
        "date": "06252015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Johnson Matthey sells research chemicals unit to Thermo Scientific "
    },
    {
        "content": "* Updating 2015 revenue and adjusted earnings per share guidance to reflect more unfavorable foreign currency exchange rates",
        "date": "04222015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "BRIEF-Thermo Fisher Scientific Q1 GAAP earnings per share $0.96 "
    },
    {
        "content": "April 22 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  on Wednesday lowered its full-year 2015 revenue outlook  citing adverse foreign exchange rates  but raised the lower end of its earnings forecast.",
        "date": "04222015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher trims 2015 revenue outlook  citing strong dollar "
    },
    {
        "content": "NEW YORK Short-term currency moves should not drive the Federal Reserve's policy decisions and  for now  the strong dollar and low global oil prices are a net positive for the U.S. economy  Dallas Fed President Richard Fisher said on Wednesday.",
        "date": "02112015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Strong dollar  low oil remain net positives: Fed's Fisher "
    },
    {
        "content": "NEW YORK  Feb 11 Short-term currency moves should not drive the Federal Reserve's policy decisions and  for now  the strong dollar and low global oil prices are a net positive for the U.S. economy  Dallas Fed President Richard Fisher said on Wednesday.",
        "date": "02112015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Strong dollar  low oil remain net positives -Fed's Fisher "
    },
    {
        "content": "Thermo Fisher Scientific Inc   the world's largest maker of scientific instruments  forecast 2015 sales and earnings below analysts' expectations  becoming the latest U.S. healthcare company to warn about a strengthening dollar.",
        "date": "01292015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "topStory",
        "symbol": "TMO",
        "title": "Thermo Fisher says strong dollar to hurt revenue  profit "
    },
    {
        "content": "Jan 29 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  forecast 2015 sales and earnings below analysts' expectations  becoming the latest U.S. healthcare company to warn about a strengthening dollar.",
        "date": "01292015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 1-Thermo Fisher says strong dollar to hurt revenue  profit "
    },
    {
        "content": "Jan 29 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  reported better-than-expected quarterly profit and sales  boosted by the contribution from the Life Technologies acquisition.",
        "date": "01292015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "Thermo Fisher Q4 results top expectations on Life Tech buy "
    },
    {
        "content": "* Builds on in-house CRISPR programme at drugmaker   (Adds further details on promise of new technology)",
        "date": "01292015",
        "name": "Thermo Fisher Scientific Inc",
        "news_type": "normal",
        "symbol": "TMO",
        "title": "UPDATE 2-AstraZeneca bets on \"genetic scissors\" for range of new drugs "
    }
]