[
    {
        "content": "Nov 16 The following bids  mergers  acquisitions and disposals were reported by 1400 GMT on Thursday:",
        "date": "11162017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "BARCELONA T-Mobile US will propose a \"significant\" share buyback that could start in December  CFO Braxton Carter said on Thursday  a sign that the third biggest carrier in the United States is confident in its outlook after the collapse of a merger with Sprint Corp.",
        "date": "11162017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile US to propose significant share buyback "
    },
    {
        "content": "* To roll out national U.S. 5G network by 2020 (Adds context)",
        "date": "11162017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 1-T-Mobile US to propose significant share buyback "
    },
    {
        "content": "BARCELONA  Nov 16 U.S. No.3 carrier T-Mobile US will propose a \"significant\" share buyback that could start in December  finance chief Braxton Carter said on Thursday  a sign of confidence after the collapse of its merger with Sprint Corp.",
        "date": "11162017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile US to propose significant share buyback - CFO "
    },
    {
        "content": "BARCELONA  Nov 16 T-Mobile US  the third-largest U.S. mobile operator  will roll out its fifth-generation network across the United States by 2020  Chief Technology Officer Neville Ray said on Thursday.",
        "date": "11162017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile to roll out U.S. 5G network by 2020 "
    },
    {
        "content": "BARCELONA Iliad   whose market launch in 2012 shook up the French telecoms industry  won over more customers in both its fixed and mobile businesses in the third-quarter and said it was on its way to finalizing a team to launch its business in Italy.",
        "date": "11162017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Iliad posts higher quarterly sales as it prepares Italian launch "
    },
    {
        "content": "FRANKFURT Deutsche Telekom  CEO Tim Hoettges said its T-Mobile US  unit was ideally positioned for an independent future after the failure of merger talks with Sprint Corp   but left the door open to consolidation.",
        "date": "11092017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Deutsche Telekom CEO: T-Mobile U.S. can stand alone but open to consolidation "
    },
    {
        "content": "FRANKFURT  Nov 9 Deutsche Telekom CEO Tim Hoettges said its T-Mobile US unit was ideally positioned for an independent future after the failure of merger talks with Sprint Corp  but left the door open to consolidation.",
        "date": "11092017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "D.Telekom CEO: T-Mobile US can stand alone but open to consolidation "
    },
    {
        "content": "FRANKFURT  Nov 9 Deutsche Telekom reported a gain of 3.3 percent in third-quarter core profits and raised its outlook for 2017 as it tries to move from the collapse of a merger between its T-Mobile US unit and Sprint Corp.",
        "date": "11092017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Deutsche Telekom raises guidance after collapse of U.S. deal "
    },
    {
        "content": "NEW YORK Sprint Corp's   shares fell more than 13 percent on Monday after the No. 4 U.S. wireless carrier called off merger talks with T-Mobile US Inc  and a wireless partnership with cable company Altice USA  failed to appease investors.",
        "date": "11062017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Sprint shares plunge after T-Mobile merger talks called off "
    },
    {
        "content": "FRANKFURT The collapse of the attempt by T-Mobile US to merge with Sprint Corp will underline its importance as a driver of growth when its main owner  Deutsche Telekom  reports quarterly results this week.",
        "date": "11052017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Growth without scale: Deutsche Telekom's T-Mobile headache "
    },
    {
        "content": "NEW YORK  Nov 6 Sprint Corp's  shares fell more than 13 percent on Monday after the No. 4 U.S. wireless carrier called off merger talks with T-Mobile US Inc and a wireless partnership with cable company Altice USA failed to appease investors.",
        "date": "11062017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 2-Sprint shares plunge after T-Mobile merger talks called off "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  Nov 4 Sprint Corp and T-Mobile US Inc said on Saturday they have called off merger talks to create a stronger U.S. wireless company to rival market leaders  leaving No. 4 provider Sprint to engineer a turnaround on its own.",
        "date": "11042017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "UPDATE 4-Sprint  T-Mobile call off merger after months of talks "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK Sprint Corp  and T-Mobile US Inc  said on Saturday they have called off merger talks to create a stronger U.S. wireless company to rival market leaders  leaving No. 4 provider Sprint to engineer a turnaround on its own. | Video ",
        "date": "11052017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Sprint  T-Mobile call off merger after months of talks "
    },
    {
        "content": "FRANKFURT  Nov 7 Deutsche Telekom ended talks on a merger between its T-Mobile US business and Sprint Corp because it would not have created value  CEO Tim Hoettges told staff after the deal collapsed at the weekend.",
        "date": "11072017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile-Sprint merger would not have created value-D.Telekom CEO "
    },
    {
        "content": "NEW YORK  Nov 6 Sprint Corp's  wireless partnership with Altice USA   was not contingent on merger talks with T-Mobile US Inc failing  the chief financial officer of the No. 4 U.S. wireless carrier said on Monday.",
        "date": "11062017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Altice agreement 'not contingent' on T-Mobile talks failing - Sprint CFO "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  Nov 4 Sprint Corp and T-Mobile US Inc said on Saturday they have called off merger talks to create a stronger U.S. wireless to rival to market leaders  leaving No. 4 provider Sprint to engineer a turnaround on its own.",
        "date": "11042017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "CORRECTED-UPDATE 2-Sprint and T-Mobile call off merger after months of talks "
    },
    {
        "content": "FRANKFURT Deutsche Telekom shares dropped in early Monday trading after the collapse of the merger of its T-Mobile US unit with Sprint Corp  which would have created a strong No.3 player on the U.S. market.",
        "date": "11062017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Failure of U.S. deal hits Deutsche Telekom shares  growth prospects "
    },
    {
        "content": "FRANKFURT T-Mobile US  and Sprint  are working to salvage their $74 billion merger and could reach a deal within weeks  the Wall Street Journal reported  citing people familiar with the matter. | Video ",
        "date": "11032017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile and Sprint work to save merger talks: WSJ "
    },
    {
        "content": "FRANKFURT T-Mobile US  will pursue a growth strategy in the United States after ending merger talks with Sprint Corp  on Saturday  majority owner Deutsche Telekom  said.",
        "date": "11042017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile to pursue growth after Sprint talks end: Deutsche Telekom "
    },
    {
        "content": "FRANKFURT  Nov 6 Shares in Deutsche Telekom opened 2.9 percent lower on Monday after the attempt by its T-Mobile US unit to merge with Sprint Corp to create a strong No.3 player on the U.S. market collapsed at the weekend.",
        "date": "11062017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Deutsche Telekom shares down after U.S. deal collapses "
    },
    {
        "content": "FRANKFURT  Nov 3 T-Mobile US and Sprint are working to salvage their $74 billion merger and could reach a deal within weeks  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "11032017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 1-T-Mobile and Sprint work to save merger talks -WSJ "
    },
    {
        "content": "FRANKFURT  Nov 3 T-Mobile US and Sprint are working to salvage their $74 billion merger and could reach a deal within weeks  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "11032017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile and Sprint work to save merger talks -WSJ "
    },
    {
        "content": "FRANKFURT A strong No. 3 player in the U.S. wireless market would enhance competition  the chief of Deutsche Telekom  told a German newspaper  as T-Mobile US Inc  seeks to merge with Sprint Corp .",
        "date": "10282017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Telekom CEO argues for strong No. 3 player in U.S. wireless market: newspaper "
    },
    {
        "content": "FRANKFURT  Nov 4 T-Mobile US will pursue a growth strategy in the United States after ending merger talks with Sprint Corp on Saturday  majority owner Deutsche Telekom said.",
        "date": "11042017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile to pursue growth after Sprint talks end - Deutsche Telekom "
    },
    {
        "content": "FRANKFURT  Oct 29 A strong No. 3 player in the U.S. wireless market would enhance competition  the chief of Deutsche Telekom told a German newspaper  as T-Mobile US Inc seeks to merge with Sprint Corp.",
        "date": "10282017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Telekom CEO argues for strong No. 3 player in U.S. wireless market -newspaper "
    },
    {
        "content": "WASHINGTON AT&T Inc   Verizon Communications Inc  and T-Mobile US Inc  are being awarded a U.S. defense contract worth $199 million for wireless services and devices  the Pentagon said on Monday.",
        "date": "10302017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "AT&T  Verizon  T-Mobile win $994 million U.S. defense contract: Pentagon "
    },
    {
        "content": "TOKYO Softbank Group Corp  shares fell on Tuesday after sources said it reached an impasse with Deutsche Telekom AG  in their talks to merge Sprint Corp  and T-Mobile US Inc .",
        "date": "10312017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Softbank shares skid as Sprint  T-Mobile merger said to reach impasse "
    },
    {
        "content": "WASHINGTON  Oct 30 AT&T Inc  Verizon Communications Inc and T-Mobile US Inc are being awarded a U.S. defense contract worth $199 mln for wireless services and devices  the Pentagon said on Monday.",
        "date": "10302017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "AT&T  Verizon  T-Mobile win $994 mln U.S. defense contract -Pentagon "
    },
    {
        "content": "Oct 30 Japan's SoftBank Group Corp plans to break off negotiations of a merger between subsidiary Sprint Corp and T-Mobile US Inc amid a failure to agree on ownership of the combined company  Nikkei reported. (http://s.nikkei.com/2z03Bb0)",
        "date": "10302017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Japan's SoftBank calling off talks to merge Sprint  T-Mobile - Nikkei "
    },
    {
        "content": "NEW YORK  Oct 31 A hitch in a proposed merger of U.S. wireless carriers Sprint Corp and T-Mobile US has further boosted buoyant shares of cell tower stocks  which could benefit if there is no combined company to cut costs by reducing tower usage.",
        "date": "10312017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Buy signal blares for cell-tower stocks in 2017 "
    },
    {
        "content": "* BOJ's decision to keep ETF purchase unchanged relieves market - analyst",
        "date": "10312017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "REFILE-Nikkei flat as BOJ decision shows optimism but SoftBank's drop weighs "
    },
    {
        "content": "T-Mobile US Inc  and Sprint Corp  are laying the groundwork for special committees of their boards of directors to decide on a merger between the third and fourth largest U.S. wireless carriers  according to people familiar with the matter.",
        "date": "10252017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile  Sprint ready board committees to decide on merger: sources "
    },
    {
        "content": "NEW YORK Sprint Corp  reported a narrower quarterly loss on Wednesday than analysts estimated as it added subscribers  and the wireless carrier declined to hold a post-earnings conference call amid expectations of a merger with rival T-Mobile US Inc .",
        "date": "10252017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Sprint's quarterly loss narrower than estimated; merger expected "
    },
    {
        "content": "* T-Mobile delivers record financial results in Q3 2017  raises guidance for 2017 — once again",
        "date": "10232017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile delivers Q3 earnings per share of $0.63  raises guidance for 2017 — once again "
    },
    {
        "content": "NEW YORK  Oct 25 Sprint Corp reported a narrower quarterly loss on Wednesday than analysts estimated as it added subscribers  and the wireless carrier declined to hold a post-earnings conference call amid expectations of a merger with rival T-Mobile US Inc.",
        "date": "10252017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 3-Sprint's quarterly loss narrower than estimated; merger expected "
    },
    {
        "content": "NEW YORK  Oct 23    T-Mobile US Inc's quarterly profit topped Wall Street analyst estimates as the No. 3 U.S. wireless carrier raised the lower end of its expected range of customer additions for the year.",
        "date": "10232017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile quarterly profit tops estimates as subscribers grow "
    },
    {
        "content": "Oct 25 T-Mobile US Inc and Sprint Corp are laying the groundwork for special committees of their boards of directors to decide on a merger between the third and fourth largest U.S. wireless carriers  according to people familiar with the matter.",
        "date": "10252017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 1-T-Mobile  Sprint ready board committees to decide on merger-sources "
    },
    {
        "content": "NEW YORK  Oct 25 Sprint Corp's quarterly loss was narrower than Wall Street analyst estimates as the wireless carrier added subscribers  while the company declined to hold a post-earnings conference call amid speculation it would announce a merger with rival T-Mobile US Inc.",
        "date": "10252017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Sprint's quarterly loss narrower than estimates amid T-Mobile deal chatter "
    },
    {
        "content": "NEW YORK  Oct 23 T-Mobile US Inc's quarterly profit topped Wall Street analyst estimates and the No. 3 U.S. wireless carrier raised the lower end of its expected range of customer additions for the year but didn't elaborate on a potential deal with rival Sprint Corp.",
        "date": "10232017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 1-T-Mobile quarterly profit tops estimates as subscribers grow "
    },
    {
        "content": "Oct 25 T-Mobile US Inc and Sprint Corp are laying the groundwork for special committees of their board of directors to decide on a merger between the third and fourth largest U.S. wireless carriers  according to people familiar with the matter.",
        "date": "10252017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile  Sprint ready board committees to decide on merger - sources "
    },
    {
        "content": "* Softbank Group has reached a broad agreement to merge its Sprint unit with T-Mobile US - Nikkei Source text: (http://s.nikkei.com/2zllfmI) Further company coverage:",
        "date": "10132017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-Softbank reaches broad agreement to merge Sprint unit with T-Mobile US - Nikkei "
    },
    {
        "content": "T-Mobile U.S. Inc  and Sprint Corp  plan to announce a merger agreement without any immediate asset sales  as they seek to preserve as much of their spectrum holdings and cost synergies as they can before regulators ask for concessions  according to people familiar with the matter. | Video ",
        "date": "10162017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Exclusive: T-Mobile  Sprint plan merger without selling assets "
    },
    {
        "content": "* T-Mobile US Inc - ‍announced a partnership with Fox television stations to assist in repacking its 600 MHZ spectrum​",
        "date": "10102017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US ‍announces a partnership with Fox television stations to assist in repacking its 600 MHZ spectrum​ "
    },
    {
        "content": "FAJARDO  Puerto Rico  Oct 2 Puerto Ricans exasperated by the patchy U.S. relief response to their hurricane-blasted island are turning to a Mexican billionaire's mobile phone network they say has been faster to restore service.",
        "date": "10032017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "CORRECTED-UPDATE 2-Puerto Ricans desperate for cell service turn to Mexican carrier "
    },
    {
        "content": "* T-Mobile to acquire remaining interest in Iowa wireless from Aureon",
        "date": "09262017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile to acquire remaining interest in Iowa wireless from Aureon "
    },
    {
        "content": "WASHINGTON  Sept 26 A divided Federal Communications Commission on Tuesday approved a report that found for the first time since 2009 there is \"effective competition\" in the wireless market  a finding that could help Sprint Corp and T-Mobile US Inc to merge.",
        "date": "09262017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "FCC finds 'effective competition' in U.S. wireless market "
    },
    {
        "content": "WASHINGTON  Sept 22 Sprint Corp hired a lobbying firm with close ties to U.S. President Donald Trump's administration on Sept. 1  adding to its stable of federal lobbyists as it nears a deal to merge with wireless rival T-Mobile US Inc  according to disclosures filed with the U.S. Congress this week.",
        "date": "09222017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Sprint hired Trump-connected lobbyist in early September -filing "
    },
    {
        "content": "Sept 22 T-Mobile US Inc is close to agreeing tentative terms on a deal to merge with Sprint Corp   people familiar with the matter said on Friday  a major breakthrough in efforts to merge the third and fourth largest U.S. wireless carriers.",
        "date": "09222017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "EXCLUSIVE-T-Mobile  Sprint close to agreeing deal terms -sources "
    },
    {
        "content": "T-Mobile US Inc  is close to agreeing tentative terms on a deal to merge with Sprint Corp   people familiar with the matter said on Friday  a major breakthrough in efforts to merge the third and fourth largest U.S. wireless carriers. | Video ",
        "date": "09232017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Exclusive: T-Mobile  Sprint close to agreeing on deal terms - sources "
    },
    {
        "content": "Sept 22 T-Mobile US Inc is close to agreeing tentative terms on a deal to merge with peer Sprint Corp  people familiar with the matter said  a major breakthrough in efforts to merge the third and fourth largest U.S. wireless carriers.",
        "date": "09222017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "EXCLUSIVE-T-Mobile  Sprint close to agreeing deal terms-sources "
    },
    {
        "content": "U.S. wireless carrier T-Mobile US Inc is exploring taking over rival Sprint Corp in an all-stock deal  after SoftBank Group Corp offered to give up its majority ownership of Sprint  a person familiar with the matter said.",
        "date": "09202017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile U.S. explores takeover of Sprint: source "
    },
    {
        "content": "Sept 19 U.S. wireless carrier T-Mobile US Inc is exploring taking over rival Sprint Corp in an all-stock deal  after SoftBank Group Corp offered to give up its majority ownership of Sprint  a person familiar with the matter said.",
        "date": "09192017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "UPDATE 3-T-Mobile US explores takeover of Sprint-source "
    },
    {
        "content": "Sept 19 U.S. wireless carriers T-Mobile US Inc and Sprint Corp are said to be in active merger talks  CNBC reported   citing sources.",
        "date": "09192017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-mobile  Sprint in merger talks - CNBC "
    },
    {
        "content": "* T-Mobile executive says looking at stock buybacks as a unique opportunity - Goldman Sachs conf Further company coverage:",
        "date": "09142017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile executive says looking at stock buybacks as a unique opportunity "
    },
    {
        "content": "* T-Mobile US Inc - T-Mobile will offer Apple's latest products starting on September 22‍​",
        "date": "09122017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US says will offer Apple's latest products starting on Sept 22‍​ "
    },
    {
        "content": "* T-Mobile CFO says \"we will be in a position that we can start returning capital to our shareholders\" - Goldman Sachs conf (removes extraneous words)",
        "date": "09142017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile executive says co \"looking\" good in Q3 "
    },
    {
        "content": "* T-Mobile US INC ‍announced it will offer new generation iPhone 8 and iPhone 8 Plus  and Apple Watch Series 3​",
        "date": "09142017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US Inc will offer new generation iPhone 8 and iPhone 8 Plus  and Apple Watch Series 3​ "
    },
    {
        "content": "T-Mobile US Inc  said on Wednesday it will offer a free subscription to video streaming service Netflix Inc  with its unlimited data family plans in a push to lure more subscribers.",
        "date": "09062017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile US to offer free Netflix with family plan "
    },
    {
        "content": "Sept 6 T-Mobile US Inc said on Wednesday it will offer a free subscription to video streaming service Netflix Inc with its unlimited data family plans in a push to lure more subscribers.",
        "date": "09062017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 3-T-Mobile US to offer free Netflix with family plan "
    },
    {
        "content": "* Announces exclusive partnership with Netflix; T-Mobile ONE family plans will now come with Netflix at no extra charge",
        "date": "09062017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile offers free Netflix to some family plan customers "
    },
    {
        "content": "Sept 6 T-Mobile US Inc  the No. 3 U.S. wireless carrier  said on Wednesday it would offer Netflix Inc's video subscription service to some of its family plan customers for free.",
        "date": "09062017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile offers free Netflix to some family plan customers "
    },
    {
        "content": "Aug 3 Deutsche Telekom Chief Financial Officer says",
        "date": "08032017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-Deutsche Telekom says waiting to see results of U.S. merger talks "
    },
    {
        "content": "July 28 Sprint Corp has proposed a merger with Charter Communications Inc as the wireless carrier seeks an alternative to a deal with T-Mobile US Inc that has so far not come to fruition  according to sources familiar with the matter.",
        "date": "07292017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "UPDATE 3-Sprint seeks alternatives to a merger with T-Mobile -sources "
    },
    {
        "content": "* T-Mobile US Inc- ‍On July 25  subsidiary amended terms of its $2 billion secured term loan due January 2024 - SEC Filing​",
        "date": "07272017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US says unit amended terms of its $2 bln secured term loan due Jan 2024 - SEC Filing​ "
    },
    {
        "content": "T-Mobile US Inc's quarterly results topped analysts' estimates as the No. 3 U.S. wireless carrier on Wednesday reported record low customer attrition and said it was considering a quarterly dividend.",
        "date": "07192017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile quarterly results top estimates as subscribers grow "
    },
    {
        "content": "July 19 T-Mobile US Inc's quarterly results topped analysts' estimates as the No. 3 U.S. wireless carrier on Wednesday reported record low customer attrition and said it was considering a quarterly dividend.",
        "date": "07192017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 4-T-Mobile quarterly results top estimates as subscribers grow "
    },
    {
        "content": "* T-Mobile delivers record results in Q2 2017  un-carrier performing at peak levels across the board",
        "date": "07192017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile Q2 earnings per share $0.67 "
    },
    {
        "content": "July 19 T-Mobile US Inc  the No. 3 U.S. wireless carrier  reported a 10 percent rise in quarterly revenue as its promotional offers helped win subscribers from larger rivals Verizon Communications Inc and AT&T Inc .",
        "date": "07192017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile's quarterly revenue rises 10 pct "
    },
    {
        "content": "Sprint Corp  shares jumped as much as 6 percent on Tuesday on news the carrier is in talks with Charter Communications Inc  and Comcast Corp  about a wireless partnership  a move that added a new dimension to speculation about possible telecom sector tie-ups. | Video ",
        "date": "06272017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Sprint shares jump on cable wireless talks  T-Mobile sinks "
    },
    {
        "content": "June 27 Sprint Corp shares jumped as much as 6 percent on Tuesday on news the carrier is in talks with Charter Communications Inc and Comcast Corp about a wireless partnership  a move that added a new dimension to speculation about possible telecom sector tie-ups.",
        "date": "06272017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 3-Sprint shares jump on cable wireless talks  T-Mobile sinks "
    },
    {
        "content": "COLOGNE  Germany Deutsche Telekom  is optimistic about the regulatory environment in the United States under the Trump administration.",
        "date": "05312017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Deutsche Telekom CEO says U.S. M&A regulations look good under Trump "
    },
    {
        "content": "NEW YORK T-Mobile US Inc has built a reputation as a scrappy underdog by offering cell service with no contracts and cheap prices. | Video ",
        "date": "06012017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile's expanded network has rivals - and suitors - taking notice "
    },
    {
        "content": "NEW YORK  June 1 T-Mobile US Inc has built a reputation as a scrappy underdog by offering cell service with no contracts and cheap prices.",
        "date": "06012017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "RPT-T-Mobile’s expanded network has rivals - and suitors - taking notice "
    },
    {
        "content": "NEW YORK T-Mobile US Inc  would benefit from greater scale in the industry if it were to combine with rival Sprint Corp    the chief financial officer of the No. 3 wireless carrier said at a conference on Thursday.",
        "date": "05182017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile sees benefits in merger with Sprint: CFO "
    },
    {
        "content": "* Paulson & Co Inc takes share stake of 3.5 million shares in Dish Network Corp",
        "date": "05152017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-Paulson & Co Inc takes share stake in Dish Network  Monsanto "
    },
    {
        "content": "NEW YORK  May 18 T-Mobile US Inc would benefit from greater scale in the industry if it were to combine with rival Sprint Corp   the chief financial officer of the No. 3 wireless carrier said at a conference on Thursday.",
        "date": "05182017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile sees benefits in merger with Sprint -CFO "
    },
    {
        "content": "FRANKFURT Sprint and its controlling shareholder SoftBank have started preliminary conversations to merge with T-Mobile US  Bloomberg reported on Friday  citing people familiar with the matter.",
        "date": "05122017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Sprint  SoftBank start early deal talks over T-Mobile: BBG "
    },
    {
        "content": "FRANKFURT  May 12 Sprint and its controlling shareholder SoftBank have started preliminary conversations to merge with T-Mobile US   Bloomberg reported on Friday  citing people familiar with the matter.",
        "date": "05122017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Sprint  SoftBank start early deal talks over T-Mobile - BBG "
    },
    {
        "content": "TOKYO Japan's SoftBank Group Corp  said it had notched up its second-best annual profit on cost cuts and a rise in subscribers at Sprint Corp   adding that it was eager to discuss potential M&A for the loss-making U.S. wireless unit.",
        "date": "05102017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "SoftBank logs second-best annual profit  talks up T-Mobile deal potential "
    },
    {
        "content": "FRANKFURT T-Mobile US will very likely be part of merger talks in the United States and its strong position there should give it time to find the best fit  its parent Deutsche Telekom said on Thursday.",
        "date": "05112017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile US set to take part in U.S. merger talks: Deutsche Telekom "
    },
    {
        "content": "* 700 mln euro charge on BT stake weighs on net profit (Rewrites to lead on M&A in U.S.  updates shares)",
        "date": "05112017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 3-T-Mobile US set to take part in U.S. merger talks - Deutsche Telekom "
    },
    {
        "content": "* CEO says including expected cash expenditure for this year we will have invested over $40 billion in the past 5 years in t-mobile us",
        "date": "05112017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-Deutsche Telekom CEO says T-Mobile US growth sets high bar for alternatives to independent course "
    },
    {
        "content": "T-Mobile US Inc said on Tuesday it plans to begin rolling out a fifth-generation network (5G) in the United States in 2019  helped by the airwaves it bought in the U.S. government's spectrum auction last month.",
        "date": "05022017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile to begin rolling out 5G in U.S. in 2019 "
    },
    {
        "content": "May 2 T-Mobile US Inc  the No.3 U.S. wireless carrier  said on Tuesday it plans to roll out fifth-generation network (5G) in the United States in 2019.",
        "date": "05022017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile to roll out 5G in US in 2019 "
    },
    {
        "content": "* T-Mobile U.S. Inc - will use a portion of its $8 billion  low-band 600 mhz spectrum to deliver 5G coverage",
        "date": "05022017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile announces plans for real nationwide mobile 5G "
    },
    {
        "content": "* Says CEO John Legere's FY 2016 total compensation was $20.1 million versus $24.5 million in FY 2015 - sec filing",
        "date": "04272017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile CEO John Legere's FY 2016 total compensation was $20.1 mln vs $24.5 mln "
    },
    {
        "content": "T-Mobile US Inc  is open to merger talks after a federal ban expires this week  the No. 3 U.S. wireless carrier said on Monday  as it reported stronger-than-expected subscriber growth in the first quarter.",
        "date": "04242017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile open to merger talks  new subscribers top estimates "
    },
    {
        "content": "April 24 T-Mobile US Inc is open to merger talks after a federal ban expires this week  the No. 3 U.S. wireless carrier said on Monday  as it reported stronger-than-expected subscriber growth in the first quarter.",
        "date": "04242017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 3-T-Mobile open to merger talks  new subscribers top estimates "
    },
    {
        "content": "* Q1 earnings per share view $0.36 -- Thomson Reuters I/B/E/S",
        "date": "04242017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile reports Q1 earnings per share of $0.80 "
    },
    {
        "content": "April 24 T-Mobile US Inc  the No. 3 U.S. wireless carrier  reported a rise in quarterly profit and revenue as it continued to win customers despite tough competition  with all its bigger rivals now offering unlimited plans.",
        "date": "04242017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile reports rise in quarterly profit and revenue "
    },
    {
        "content": "* T-Mobile US Inc - signed a long-term agreement for up to 160 MW from new Red Dirt wind project in Oklahoma",
        "date": "04182017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile signed an agreement for new Red Dirt wind project in Oklahoma "
    },
    {
        "content": "In 10 days  the U.S. Federal Communications Commission (FCC) will lift a ban on telecoms companies engaging in merger talks  and Wall Street is betting on T-Mobile US Inc   Sprint Corp  and Dish Network Corp  to be the first ones out of the gate.",
        "date": "04172017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "U.S. telecoms industry set for M&A negotiations frenzy "
    },
    {
        "content": "NEW YORK T-Mobile US Inc  bid $8 billion and Dish Network Corp  $6.2 billion to win the bulk of broadcast airwaves spectrum for sale in a government auction  the U.S. Federal Communications Commission said on Thursday.",
        "date": "04132017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile  Dish bid combined $14 billion in U.S. airwaves auction: FCC "
    },
    {
        "content": "NEW YORK  April 13 T-Mobile US Inc bid $8 billion and Dish Network Corp $6.2 billion to win the bulk of broadcast airwaves spectrum for sale in a government auction  the U.S. Federal Communications Commission said on Thursday.",
        "date": "04132017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 3-T-Mobile  Dish bid combined $14 bln in U.S. airwaves auction -FCC "
    },
    {
        "content": "NEW YORK  April 13 The U.S. Federal Communications Commission said on Thursday that T-Mobile US Inc   Comcast Corp  Dish Network Corp and U.S. Cellular Corp were among the largest buyers of spectrum in an $19.8 billion broadcast airwaves auction.",
        "date": "04132017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "REFILE-T-Mobile  Comcast  Dish acquire spectrum in airwaves auction -FCC "
    },
    {
        "content": "NEW YORK The U.S. Federal Communications Commission may announce the winners of the government's $19.8 billion spectrum auction as early as Thursday  industry officials told Reuters.",
        "date": "04132017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "FCC could announce spectrum results as early as Thursday: industry "
    },
    {
        "content": "PARIS/LONDON/MILAN French telecoms company Iliad  is aiming to grab a quarter of the Italian mobile market using the same cut-throat prices and straightforward contracts that conquered France  two sources familiar with its plan told Reuters.",
        "date": "04042017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Exclusive: French mobile maverick aims for quarter of Italian market "
    },
    {
        "content": "* T-Mobile US Inc says on March 28  2017  entered into an amended and restated employment agreement with John Legere",
        "date": "03282017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US entered into an amended and restated employment agreement with John Legere "
    },
    {
        "content": "* T-Mobile agrees to sell $500.0 million 4.000% senior notes due 2022  $500.0 million 5.125% senior notes due 2025 and $500.0 million 5.375% senior notes due 2027",
        "date": "03142017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile agrees to sell $500 mln 4.000% senior notes due 2022  $500 mln 5.125% senior notes due 2025 and $500 mln 5.375% senior notes due 2027 "
    },
    {
        "content": "* T-Mobile announces proposed public offering of senior notes",
        "date": "03132017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile announces proposed public offering of senior notes "
    },
    {
        "content": "BONN  Germany  March 2 Deutsche Telekom  is keen for its T-Mobile US subsidiary to take part in a consolidation of the U.S. mobile market and is open to being either a buyer or a seller  its chief executive said on Thursday.",
        "date": "03022017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Deutsche Telekom CEO says keen on U.S. mobile consolidation "
    },
    {
        "content": "* Says every T-mobile customer with at least 2 voice lines can get additional line for free after bill credits  Source text for Eikon:  Further company coverage:",
        "date": "02272017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile U.S. says T-mobile customers with 2 voice lines can get additional line for free "
    },
    {
        "content": "* Now deploying LTE-U technology in LTE network  following FCC certification of equipment from strategic partners Ericsson and Nokia  Source text: (http://t-mo.co/2mcF219) Further company coverage:   (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "02222017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile says now deploying LTE-U technology in LTE network "
    },
    {
        "content": "TOKYO Shares in SoftBank Group Corp  rose nearly 3 percent in morning trade on Monday after a Reuters report that the Japanese company is prepared to cede control of Sprint Corp  to T-Mobile US Inc  to clinch a merger of the two U.S. wireless carriers.",
        "date": "02202017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "SoftBank shares up; sources say company willing to cede control of Sprint "
    },
    {
        "content": "NEW YORK Japan's SoftBank Group Corp  is prepared to give up control of Sprint Corp  to Deutsche Telekom AG's  T-Mobile US Inc  to clinch a merger of the two U.S. wireless carriers  according to people familiar with the matter. | Video ",
        "date": "02182017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Exclusive: SoftBank willing to cede control of Sprint to entice T-Mobile - sources "
    },
    {
        "content": "TOKYO  Feb 20 Japanese shares fell for a third consecutive session on Monday as the yen's gains and uncertainty about U.S. economic policies prompted profit-taking.",
        "date": "02202017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Nikkei slips on yen  uncertainty on Trump policies "
    },
    {
        "content": "* Paulson & Co dissolves share stake in T-Mobile US - SEC filing",
        "date": "02142017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-Paulson & Co dissolves stake in T-Mobile US - SEC filing "
    },
    {
        "content": "T-Mobile US Inc  the No.3 U.S. wireless carrier  reported quarterly profit and revenue above estimates as promotional offers helped add more subscribers.",
        "date": "02142017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile U.S. quarterly revenue  profit beat estimates "
    },
    {
        "content": "Feb 14 T-Mobile US Inc  the No.3 U.S. wireless carrier  reported quarterly profit and revenue above estimates as promotional offers helped add more subscribers.",
        "date": "02142017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 4-T-Mobile US quarterly revenue  profit beat estimates "
    },
    {
        "content": "* T-Mobile separates itself from the competition for a third straight year  best customer growth and revenue growth in the industry",
        "date": "02142017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US reports Q4 earnings per share $0.45 "
    },
    {
        "content": "Feb 14 T-Mobile US Inc  the No. 3 U.S. wireless carrier  reported a 23.4 percent rise in quarterly revenue as it continued to win customers from bigger rivals AT&T Inc and Verizon Communications Inc.",
        "date": "02142017",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile's quarterly revenue jumps 23.4 pct "
    },
    {
        "content": "* T-Mobile us-T-Mobile USA inc entered $4 billion secured term loan facility with Deutsche Telekom AG  its majority stockholder",
        "date": "01252017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile enters $4 bln secured term loan facility with Deutsche Telekom "
    },
    {
        "content": "U.S. telecom sector could be on the brink of a major consolidation under President Donald Trump's likely more merger-friendly administration  said JP Morgan Securities  which now sees a 90 percent chance of T-Mobile US being involved in a strategic transaction in the next five years.",
        "date": "01232017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "JP Morgan sees U.S. telecom sector consolidation  T-Mobile deal "
    },
    {
        "content": "* T-Mobile permanently increases 4G LTE capacity in DC by nearly 1 000 pct ahead of the inauguration  Source text for Eikon:  Further company coverage:",
        "date": "01122017",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile permanently increases 4G LTE capacity in DC by nearly 1 000 pct ahead of the inauguration "
    },
    {
        "content": "* T-Mobile US Inc says dividend will be paid at a rate of $0.6875 per share of preferred stock.  Source text for Eikon:  Further company coverage:",
        "date": "11172016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile announces quarterly preferred stock dividend "
    },
    {
        "content": "* CFO says we have to look at strategic options as they come up  we are no longer just a target  Further company coverage:",
        "date": "11172016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US is no longer just a takeover target - CFO "
    },
    {
        "content": "BARCELONA  Nov 16 Deutsche Telekom is 'not in the mood' to sell T-Mobile US  its chief executive said on Wednesday  although it is watching for any change in the U.S. regulatory environment under Donald Trump's administration.",
        "date": "11162016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Deutsche Telekom CEO plays it cool on T-Mobile US "
    },
    {
        "content": "* On October 28 T-Mobile USA Inc extended commitment periods under $4bln of note purchase facilities",
        "date": "11022016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile extends commitment periods under $4bln of note purchase facilities on Oct. 28 "
    },
    {
        "content": "T-Mobile US Inc  raised its forecast for customer additions for the year and Chief Executive John Legere said AT&T Inc's  proposed plan to buy Time Warner Inc  could help T-Mobile to carve out more market share.",
        "date": "10242016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile raises forecast; sees 'upside' from AT&T-Time Warner deal "
    },
    {
        "content": "* Shares touch 9-year high at $50.41   (Adds CEO and analyst comments  updates shares)",
        "date": "10242016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 3-T-Mobile raises forecast; sees \"upside\" from AT&T-Time Warner deal "
    },
    {
        "content": "* T-Mobile US-  \"It's a bold move and certainly a long road to go before it is completed \"  CEO on AT&T - Time Warner deal   -conf call",
        "date": "10242016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US CEO says AT&T-Time Warner deal \" a bold move and certainly a long road to go before it is completed \" - Conf call "
    },
    {
        "content": "* T-Mobile US Inc - during quarter ended and subsequent to Sept 30  a handset OEM announced recalls on certain of its smartphone devices",
        "date": "10242016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US says an OEM announced recalls on some of its smartphones "
    },
    {
        "content": "Oct 24 T-Mobile US Inc  the No. 3 U.S. wireless carrier  reported a 17.8 percent rise in quarterly revenue as promotions helped attract more subscribers.",
        "date": "10242016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile reports 17.8 pct jump in quarterly revenue "
    },
    {
        "content": "* Mobile US Inc - \"quadrupling speeds for mobile hotspot data on T-mobile One Plan and introducing new 24 hour high-definition (HD) day passes\"  Source text for Eikon:  Further company coverage:",
        "date": "08292016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile quadrupling speeds for mobile hotspot "
    },
    {
        "content": "NEW YORK  Aug 18 Wireless providers T-Mobile US Inc and Sprint Corp on Thursday introduced revamped plans that offer unlimited data  as wireless carriers step up efforts to woo customers.",
        "date": "08182016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile  Sprint roll out revamped unlimited data plans "
    },
    {
        "content": "* Ups share stake in Valeant Pharmaceuticals International Inc by 43.6 pct to 19.1 mln shares - SEC filing",
        "date": "08152016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-Paulson & Co raises share stake in Valeant  Facebook - SEC filing "
    },
    {
        "content": "* Cuts share stake in American Airlines Group Inc by 67.6 pct to 296 018 shares - SEC filing",
        "date": "08152016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-Soros Fund Management dissolves share stake in T-Mobile US  Starbucks "
    },
    {
        "content": "* Confirms 2016 outlook for adj. EBITDA of 21 bln euros   (Adds detail  background)",
        "date": "08112016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "UPDATE 1-Deutsche Telekom Q2 in line as US makes up for German investments "
    },
    {
        "content": "T-Mobile US Inc reported quarterly results that beat analysts' estimates and raised its full-year subscriber growth forecast  as the No.3 U.S. wireless carrier posted customer gains that surpassed expectations.",
        "date": "07272016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Subscriber additions drive T-Mobile's profit beat  forecast "
    },
    {
        "content": "* Stock hits 9-year high   (Adds updated stock price  executive quotes)",
        "date": "07272016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 4-Subscriber additions drive T-Mobile's profit beat  forecast "
    },
    {
        "content": "* Says \"We had the lowest churn rate ever this quarter\" - Conf Call  Source - http://investor.t-mobile.com/ Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07272016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US says \"We had the lowest churn rate ever this quarter\" - Conf Call "
    },
    {
        "content": "* Narrowing adjusted ebitda target to $9.8 to $10.1 billion from $9.7 to $10.2 billion for fy 2016",
        "date": "07272016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US Q2 earnings per share $0.25 "
    },
    {
        "content": "July 27 T-Mobile US Inc  the No.3 U.S. wireless carrier  reported a 12.8 percent rise in quarterly revenue as its promotional offerings attracted subscribers.",
        "date": "07272016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile's quarterly revenue rises 12.8 pct "
    },
    {
        "content": "* \"Urge\" Deutsche Telekom Management board to support T-Mobile US' executive compensation clawback policy - SEC filing",
        "date": "06092016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-CTW Investment Group asks T-Mobile shareholder to support compensation clawback policy - SEC filing "
    },
    {
        "content": "* T-Mobile US - amended  restated terms of Nov 18  2015 revolving securitization facility of unsecured handheld device installment plan receivables",
        "date": "06082016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US amended  restated terms of Nov 18  2015 revolving securitization facility "
    },
    {
        "content": "T-Mobile US Inc   the No. 3 U.S. wireless provider  wants to turn its monthly subscribers into shareholders by offering them a share in the company's stock for free  it said on Monday.",
        "date": "06062016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile offers a share of itself to customers  launches gift app "
    },
    {
        "content": "June 6 T-Mobile US Inc  the No. 3 U.S. wireless provider  wants to turn its monthly subscribers into shareholders by offering them a share in the company's stock for free  it said on Monday.",
        "date": "06062016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 2-T-Mobile offers a share of itself to customers  launches gift app "
    },
    {
        "content": "June 6 T-Mobile US Inc said on Monday it will give a share of the wireless company's stock to customers who hold a postpaid or monthly account for free to turn its customers into shareholders.",
        "date": "06062016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "CORRECTED-UPDATE 1-T-Mobile offers a share of itself to customers  launches gift app "
    },
    {
        "content": "June 6 T-Mobile US Inc said on Monday it will give a full share of the wireless company's stock to every primary postpaid account holder to turn its customers into shareholders.",
        "date": "06062016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile to give each customer one share  launches gift app "
    },
    {
        "content": "COLOGNE  Germany  May 25 Deutsche Telekom  expects the results of an auction of wireless airwaves in the United States in the second half of the year  its chief executive told shareholders on Wednesday.",
        "date": "05252016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Deutsche Telekom sees results U.S. wireless spectrum auction in H2 "
    },
    {
        "content": "* Signed an interconnect and roaming agreement with Empresa De Telecomunicaciones De Cuba  S.A.  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05092016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile inks roaming deal with Empresa De Telecomunicaciones De Cuba "
    },
    {
        "content": "* CFO says will look to help T-Mobile US financially on a case-by-case basis",
        "date": "05042016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-Deutsche Telekom remains open to strategic combinations for T-Mobile US "
    },
    {
        "content": "* Mobile US Inc files for potential debt shelf; size not disclosed - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04252016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile US Inc files for potential debt shelf "
    },
    {
        "content": "T-Mobile US Inc  on Tuesday swung to a profit and raised its 2016 forecast for customer additions  as competitively priced plans and free video streaming options helped it add over 1 million new monthly subscribers for the seventh consecutive quarter. | Video ",
        "date": "04262016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile swings to a profit driven by customer gains "
    },
    {
        "content": "April 26 T-Mobile US Inc on Tuesday swung to a profit and raised its 2016 forecast for customer additions  as competitively priced plans and free video streaming options helped it add over 1 million new monthly subscribers for the seventh consecutive quarter.",
        "date": "04262016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 4-T-Mobile swings to a profit driven by customer gains "
    },
    {
        "content": "* Mobile us inc says 'binge on' video service one of key reasons for customers shifting to t-mobile - Earnings conf call  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04262016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile says 'binge on' video service a key reason for customers shifting to T-Mobile "
    },
    {
        "content": "April 26 T-Mobile US Inc reported a 10.6 percent rise in quarterly revenue as heavy discounts helped the No.3 wireless carrier attract more customers.",
        "date": "04262016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile revenue jumps 10.6 pct "
    },
    {
        "content": "* Files for senior notes offering of up to $1.0 billion - sec filing  Source text : http://1.usa.gov/1PCZIVW Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "03292016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile USA files for senior notes offering of up to $1.0 bln "
    },
    {
        "content": "* Says company is back as an official partner of Major League Baseball  Source text (http://t-mo.co/1WqcX1F) Further company coverage:",
        "date": "03162016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "BRIEF-T-Mobile back as official partner of Major League Baseball "
    },
    {
        "content": "(The following statement was released by the rating agency) MOSCOW/LONDON  March 11 (Fitch) Deutsche Telekom's (DT) departure from its  self-funding strategy of T-Mobile US with debt that is non-recourse to the  parent  implies closer strategic and legal ties across the group  and reduces  headroom for additional leverage within DT's current rating of 'BBB+'  said  Fitch Ratings. Also  we believe this move may suggest a stronger appetite for  bidding in the forthcoming 600 MHz US spectrum auctio",
        "date": "03112016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Fitch: T-Mobile US Loan Flags Risk to Deutsche Telekom Rating from US Spectrum "
    },
    {
        "content": "March 7 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "03072016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "FRANKFURT T-Mobile US  said it can issue $2 billion in senior notes and sell them to its 65-percent shareholder Deutsche Telekom   giving a potential boost to its financial firepower ahead of an auction of low-frequency airwaves.",
        "date": "03072016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile US secures $2 billion boost ahead of spectrum auction "
    },
    {
        "content": "FRANKFURT  March 7 T-Mobile US said it can issue $2 billion in senior notes and sell them to its 65-percent shareholder Deutsche Telekom  giving a potential boost to its financial firepower ahead of an auction of low-frequency airwaves.",
        "date": "03072016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile US secures $2 bln boost ahead of spectrum auction "
    },
    {
        "content": "FRANKFURT Deutsche Telekom  has put the sale of T-Mobile US  on hold to deal with an upcoming auction of radio airwaves  giving potential suitors time to wait for a more favorable political environment toward telecoms mergers  two sources said.",
        "date": "03012016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Deutsche Telekom puts sale of T-Mobile US on hold: sources "
    },
    {
        "content": "* Deutsche Telekom shares pare gains  up 0.2 pct   (Adds sources  background  shares)",
        "date": "03012016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 1-Deutsche Telekom puts sale of T-Mobile US on hold - sources "
    },
    {
        "content": "FRANKFURT  March 1 Deutsche Telekom  has put the sale of T-Mobile US on ice as an auction of radio airwaves will keep it busy for most of the year and potential suitors are expected to wait for a more favourable political environment towards telecoms mergers  two sources said on Tuesday.",
        "date": "03012016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Deutsche Telekom puts sale of T-Mobile US on ice - sources "
    },
    {
        "content": "NEW YORK A few months ago  T-Mobile US Inc looked set to dominate a race for airwaves reserved for smaller  emerging players in an upcoming U.S. auction  a feat that would help it compete with U.S. wireless heavyweights Verizon Communications and AT&T Inc.",
        "date": "02162016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "Analysis: T-Mobile could face crush of competition in crucial U.S. airwaves auction "
    },
    {
        "content": "T-Mobile US Inc  nearly tripled its profit in the fourth quarter as its \"Binge On\" video streaming service and lower-priced plans helped it add more than 2 million subscribers.",
        "date": "02172016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile profit nearly triples  adds 2.1 million customers "
    },
    {
        "content": "Feb 17 T-Mobile US Inc nearly tripled its profit in the fourth quarter as its \"Binge On\" video streaming service and lower-priced plans helped it add more than 2 million subscribers.",
        "date": "02172016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "UPDATE 4-T-Mobile profit nearly triples  adds 2.1 mln customers "
    },
    {
        "content": "Feb 17 T-Mobile US Inc  the No.3 U.S. wireless carrier  said its quarterly profit nearly tripled as aggressive discounts helped it add more subscribers.",
        "date": "02172016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "T-Mobile profit nearly triples "
    },
    {
        "content": "FRANKFURT/NEW YORK  Jan 7 Deutsche Telekom  is facing growing pressure from investors and lawmakers to ensure proper treatment of workers at its American business T-Mobile US.",
        "date": "01072016",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Deutsche Telekom under scrutiny over working conditions at U.S. arm T-Mobile "
    },
    {
        "content": "T-Mobile US Inc added more postpaid subscribers in 2015 than it had projected as its lower-priced plans helped attract monthly users away from competitors.",
        "date": "01062016",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile beats 2015 target for postpaid subscriber additions "
    },
    {
        "content": "NEW YORK  Nov 10 T-Mobile US Inc will let customers stream video services such as Netflix Inc   Dish Network Corp's Sling TV  Hulu and HBO Now on their mobile devices without having it count against their data allotment  Chief Executive John Legere said on Tuesday.",
        "date": "11102015",
        "name": "T-Mobile US Inc",
        "news_type": "topStory",
        "symbol": "TMUS",
        "title": "T-Mobile users can stream video services without using up data allotment "
    },
    {
        "content": "Nov 10  Experian Plc  the world's biggest credit data company  said it had received a number of class actions related to the theft of T-Mobile US Inc  customer data at one of its servers.",
        "date": "11102015",
        "name": "T-Mobile US Inc",
        "news_type": "normal",
        "symbol": "TMUS",
        "title": "Experian says receives class actions related to T-Mobile breach "
    }
]