[
    {
        "content": "Contributed to by David Lubin  Constellation Research and Technology  and Timothy Nixon  Thomson Reuters",
        "date": "11142017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Top 100 Global Energy Leaders Focus: Total S.A. "
    },
    {
        "content": "SAO PAULO  Nov 7 Brazil's state-run oil company Petroleo Brasileiro SA said a federal court lifted an injunction related to the sale of its stakes in projects on the Iara and Lapa oil exploration areas  according to a statement on Tuesday.",
        "date": "11072017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Brazil's Petrobras says court lifted injunction blocking stake sales to Total "
    },
    {
        "content": "RIO DE JANEIRO A consortia led by Royal Dutch Shell Plc  and including French major Total SA  won the right to explore Brazil's pre-salt oil block  named Sul de Gato do Mato  during an auction on Friday.",
        "date": "10272017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Consortia with Shell  Total win pre-salt block in Brazil "
    },
    {
        "content": "CALGARY  Alberta  Oct 26 Suncor Energy  Canada's second-largest energy producer  said on Thursday it has made progress in resolving a commercial dispute with joint venture partner Total SA over funding for the new Fort Hills oil sands mining project.",
        "date": "10262017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Suncor says makes progress in oil sands project dispute with Total "
    },
    {
        "content": "* French oil major Total paid $200 million in the third quarter to settle a tax issue in Angola  its Chief Financial Officer Patrick de La Chevardiere told analysts during a call on Friday.",
        "date": "10272017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "BRIEF-Total says paid $200 million to settle tax issue in Angola "
    },
    {
        "content": "CALGARY  Alberta  Oct 26 Suncor Energy  Canada's second-largest energy producer  said on Thursday it has made progress in resolving a commercial dispute with joint venture partner Total SA over funding for the new Fort Hills oil sands mining project.",
        "date": "10262017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Suncor says makes progress in oil sands project dispute with Total "
    },
    {
        "content": "* CEO says company has made progress towards resolving commercial dispute with Fort Hills partner Total SA",
        "date": "10262017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "BRIEF-Suncor expects Fort Hills project to operate at 90 pct capacity by Q4 2018 "
    },
    {
        "content": "CALGARY  Alberta Suncor Energy Inc  Canada's second-largest energy producer  reported a higher-than-expected third-quarter profit on Wednesday due to record production and strong refinery output.",
        "date": "10262017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Suncor reports better-than-expected third-quarter profit "
    },
    {
        "content": "CALGARY  Alberta  Oct 25 Suncor Energy Inc   Canada's second-largest energy producer  reported a higher-than-expected third-quarter profit on Wednesday due to record production and strong refinery output.",
        "date": "10262017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Suncor reports better-than-expected third-quarter profit "
    },
    {
        "content": "BEIRUT  Oct 13 The only bidder in Lebanon's first tender for five offshore energy blocks was a consortium made up of France's Total  Italy's ENI and Russia's Novatek  Minister of Energy and Water Cesar Abi Khalil said on Friday.",
        "date": "10132017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Total-ENI-Novatek consortium bids for Lebanon offshore blocks "
    },
    {
        "content": "SAO PAULO A Brazilian federal court has blocked part of a $2.2 billion deal signed earlier this year by Petróleo Brasileiro SA and French oil major Total SA.",
        "date": "10112017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Brazil court blocks part of Petrobras' $2.2 billion deal with Total "
    },
    {
        "content": "HOUSTON  Sept 26 Total SA expects production soon from its 225 500-barrel-per-day (bpd) Port Arthur  Texas  refinery  which has been shut since an Aug. 30 power outage during Tropical Storm Harvey  a company spokeswoman said on Tuesday.",
        "date": "09262017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 3-Total says expects Port Arthur  Texas refinery output to return soon "
    },
    {
        "content": "CALGARY  Alberta  Sept 19 More than 120 birds in Canada's oil heartland of Alberta were killed after getting caught in a pond of oil sands byproducts operated by the country's largest producer  Suncor Energy Inc  the local regulator said on Tuesday.",
        "date": "09192017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-More than 120 birds dead at Suncor-owned Canada oil sands mine "
    },
    {
        "content": "CALGARY  Alberta  Sept 19 More than 120 birds in Canada's oil heartland of Alberta were killed after getting caught in a pond of oil sands byproducts operated by the country's largest producer Suncor Energy Inc  the local regulator said on Tuesday.",
        "date": "09192017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "More than 120 birds dead at Suncor-owned Canada oil sands mine "
    },
    {
        "content": "HOUSTON Total SA's 225 500-barrel-per-day Port Arthur  Texas  refinery may be shut for weeks because an Aug. 30 power outage during Tropical Storm Harvey caused crude oil to plug a key pipeline  Gulf Coast market sources said on Monday.",
        "date": "09122017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total Port Arthur refinery may be shut for weeks by plugged pipe: sources "
    },
    {
        "content": "HOUSTON Total SA plans to restart the 225 500 barrel per day (bpd) Port Arthur  Texas  refinery \"soon \" Gulf Coast market sources said on Sunday.",
        "date": "09032017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total plans to restart Port Arthur refinery 'soon': sources "
    },
    {
        "content": "HOUSTON Total SA expects water within its 225 500 barrel per day (bpd) Port Arthur  Texas  refinery to recede by the weekend  sources familiar with plant operations said.",
        "date": "08302017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total's Port Arthur  Texas  refinery expects water to recede by weekend: sources "
    },
    {
        "content": "HOUSTON Total SA  has cut production to 53 percent of capacity at its 225 500-barrel-per-day Port Arthur  Texas  refinery  Gulf Coast market sources said on Tuesday.",
        "date": "08302017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total Port Arthur refinery production down to 53 percent: sources "
    },
    {
        "content": "BRASILIA Brazil's environmental regulator Ibama said on Tuesday it has rejected Total SA's environmental study on drilling in the Foz do Amazonas basin  warning it needs more information or it will suspend the French oil firm's license application.",
        "date": "08292017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Brazil regulator rejects Total study on drilling at Amazon River basin "
    },
    {
        "content": "BRASILIA  Aug 29 Brazil's environmental regulator Ibama said on Tuesday it has rejected Total SA's environmental study on drilling in the Foz do Amazonas basin  warning it needs more information or it will suspend the French oil firm's license application.",
        "date": "08292017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 3-Brazil regulator rejects Total study on drilling at Amazon River basin "
    },
    {
        "content": "BRASILIA  Aug 28 Brazil environmental regulator Ibama said late on Monday that it needed more information from French oil major Total SA before issuing an environmental license for the firm to explore blocks in the Foz do Amazonas basin.",
        "date": "08292017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Brazil requests more information from Total for Foz do Amazonas drilling "
    },
    {
        "content": "SAO PAULO A Brazilian federal court on Monday temporarily halted Petróleo Brasileiro SA's  sale of a 50 percent stake in thermal power station operator TermoBahia to France's Total SA  following a lawsuit.",
        "date": "08222017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Brazil court freezes Petrobras' sale of TermoBahia stake to Total "
    },
    {
        "content": "SAO PAULO  Aug 21 A Brazilian federal court on Monday temporarily halted Petróleo Brasileiro SA's sale of a 50 percent stake in thermal power station operator TermoBahia to France's Total SA following a lawsuit.",
        "date": "08222017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Brazil court freezes Petrobras' sale of TermoBahia stake to Total "
    },
    {
        "content": "PARIS/COPENHAGEN Total  is buying Maersk's oil and gas business in a $7.45 billion deal which the French major said would strengthen its operations in the North Sea and raise its output to 3 million barrels per day by 2019. | Video ",
        "date": "08212017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total deepens North Sea exposure with $7.5 billion Maersk Oil deal "
    },
    {
        "content": "* Maersk holds reserves around 1 billion BOE (Adds details after Total CEO's call with analysts  background)",
        "date": "08212017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 3-Total deepens North Sea exposure with $7.5 billion Maersk Oil deal "
    },
    {
        "content": "COPENHAGEN Denmark's A.P. Moller-Maersk  said Monday it had agreed to sell its oil and gas division  Maersk Oil  to French oil major Total SA for $7.45 billion.",
        "date": "08212017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Maersk agrees to sell oil unit to Total in $7.45 billion deal "
    },
    {
        "content": "(The following statement was released by the rating agency) Link to Fitch Ratings' Report: Malta - Rating Action Report https://www.fitchratings.com/site/re/902365 LONDON  August 11 (Fitch) Fitch Ratings has upgraded Malta's Long-Term Foreign- and Local-Currency Issuer Default Ratings (IDR) to 'A+' from 'A'. The Outlooks are Stable. The issue ratings on Malta's senior unsecured foreign- and local-currency bonds have also been upgraded to 'A+' from 'A'. The Country Ceiling has been affirmed at 'A",
        "date": "08112017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Fitch Upgrades Malta to 'A+'; Outlook Stable "
    },
    {
        "content": "* SAYS FAIRFAX FINANCIAL HOLDINGS LTD PROPOSES EUR 215.7 MILLION FOR THE  ACQUISITION OF THE TOTAL COMPANY'S SHARES",
        "date": "08042017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-Grivalia says Fairfax proposes EUR 215.7 million for its acquisition "
    },
    {
        "content": "SAO PAULO  Aug 2 Alesat Combustíveis SA  a Brazilian fuel distribution company  whose takeover was blocked by antitrust regulators on Wednesday  is pondering how best to accelerate domestic expansion  including bringing in a partner to help close the gap with lager rivals  its chief executive officer said.",
        "date": "08022017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Brazil's Alesat ponders ways to fund expansion after takeover blocked-CEO "
    },
    {
        "content": "CALGARY  Alberta/PARIS Canada's Suncor Energy Inc is in a dispute with Total SA after the French company said it would not provide any more funding for the Fort Hills oil sands project in northern Alberta  the two companies said on Thursday.",
        "date": "07272017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Suncor  Total SA argue over cost of Fort Hills project "
    },
    {
        "content": "CALGARY  Alberta/PARIS  July 27 Canada's Suncor Energy Inc is in a dispute with Total SA after the French company said it would not provide any more funding for the Fort Hills oil sands project in northern Alberta  the two companies said on Thursday.",
        "date": "07272017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 2-Suncor  Total SA argue over cost of Fort Hills project "
    },
    {
        "content": "CALGARY  Alberta  July 27 Canada's Suncor Energy Inc is in the early stages of a commercial dispute with France's Total SA over funding for the Fort Hills oil sands project in northern Alberta  Suncor said on Thursday.",
        "date": "07272017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Suncor Energy in commercial dispute with Total SA over Fort Hills project "
    },
    {
        "content": "* Says in early stages of commercial dispute with Fort Hills project partner Total SA over project funding.",
        "date": "07272017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "BRIEF-Suncor Energy in commercial dispute with Total SA over Fort Hills project "
    },
    {
        "content": "* TOTAL AND WORLDLINE SIGNED BINDING TECHNOLOGICAL  COMMERCIAL AND FINANCING AGREEMENTS WITH AFRICAN FINTECH INTOUCH ON JULY 13  2017‍​",
        "date": "07242017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-Total and Worldline partner and get stake in African Fintech InTouch "
    },
    {
        "content": "BUENOS AIRES Argentina's state-run oil firm YPF SA  France's Total SA  Wintershall Energía SA and BP unit Pan American Energy LLC announced a $1.15 billion joint investment on Tuesday to increase shale gas production.",
        "date": "07182017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total  BP unit  YPF boost investment in Argentina's Vaca Muerta "
    },
    {
        "content": "BUENOS AIRES  July 18 Argentina's state-run oil firm YPF SA  France's Total SA  Wintershall Energía SA and BP unit Pan American Energy LLC announced a $1.15 billion joint investment on Tuesday to increase shale gas production.",
        "date": "07182017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 2-Total  BP unit  YPF boost investment in Argentina's Vaca Muerta "
    },
    {
        "content": "COPENHAGEN  June 8 France's Total SA is looking to invest in gas and power infrastructure projects in Morocco and South Africa as it seeks to open new markets  the company's head of gas said on Thursday.",
        "date": "06082017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total looks at downstream in Morocco  S.Africa to spur gas demand "
    },
    {
        "content": "OIAPOQUE  Brazil - Deep beneath the waters of the Atlantic off Brazil's most northern coast  French major Total SA  is hunting for what it hopes will be Latin America's next big oil discovery. | Video ",
        "date": "05122017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total's plans for Brazil's new oil frontier snagged on Amazon reef "
    },
    {
        "content": "JAKARTA Total E&P Indonesie  a unit of French major Total   and Japan's Inpex Corp  have proposed taking a 39 percent stake in the new production sharing contract (PSC) for the Mahakam block  an Indonesian government official said on Friday.",
        "date": "05122017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total  Inpex propose taking 39 percent stake in Indonesia's Mahakam block: government official "
    },
    {
        "content": "* Sunpower - in 15 business days of receiving notice from co certifying co encountered liquidity support event  total SA to provide guaranty of payment obligations",
        "date": "05092017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-Sunpower - in 15 business days of receiving notice from co certifying co encountered liquidity support event  total sa to provide guaranty of payment obligations "
    },
    {
        "content": "PARIS  May 5 French oil and gas company Total said on Friday it was gradually shutting down production at its 117 000 barrels-per-day Feyzin refinery and petrochemical platform near Lyon in the east of France due to a strike.",
        "date": "05052017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total halts production at Feyzin refinery in France due to strike "
    },
    {
        "content": "PARIS/DAKAR Total has signed an agreement to explore for oil and gas off Senegal's Atlantic coast  boosting the prospect of major oil developments in the West African country.",
        "date": "05022017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total to explore offshore Senegal for oil and gas "
    },
    {
        "content": "PARIS/DAKAR  May 2 Total has signed an agreement to explore for oil and gas off Senegal's Atlantic coast  boosting the prospect of major oil developments in the West African country.",
        "date": "05022017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Total to explore offshore Senegal for oil and gas "
    },
    {
        "content": "OSLO Norway's Statoil  posted significantly better-than-expected quarterly results on Thursday  helped by a rise in output and higher crude prices  year-on-year.",
        "date": "05042017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Statoil first-quarter results handily beat estimates "
    },
    {
        "content": "MELBOURNE  April 27 Australia's conservative government unveiled a radical plan on Thursday to restrict exports of liquefied natural gas (LNG) at times when domestic shortages push up local prices  aiming to ease soaring energy costs for local manufacturers.",
        "date": "04272017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 2-Australia plans LNG export limits to help ease local price pain "
    },
    {
        "content": "SEOUL/OSLO  May 1 Six people died and more than 20 were injured when a crane collapsed at a Samsung Heavy Industries shipyard in South Korea on Monday  Yonhap News Agency said.",
        "date": "05012017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Six killed in crane collapse at Samsung shipyard in South Korea "
    },
    {
        "content": "May 1 Five people died and about 20 were injured when a crane collapsed at a Samsung Heavy Industries shipyard in South Korea during construction of an oil platform for French energy company Total  the two companies said on Monday.",
        "date": "05012017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Five killed in crane accident at Samsung shipyard in South Korea "
    },
    {
        "content": "PARIS Oil prices could fall again by the end of the year due to a rapid increase in U.S. shale production  the chief executive of French oil and gas giant Total said on Thursday.",
        "date": "04202017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Oil prices could tumble again on U.S. shale influx: Total CEO "
    },
    {
        "content": "* Govt still concerned about supply to households  businesses",
        "date": "04192017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Australian govt \"encouraged\" by steps to avert gas crunch  but says more to be done "
    },
    {
        "content": "PARIS  April 12 French oil and gas company Total said on Wednesday that its South Korean joint venture with Hanwha will invest $450 million in the group's refining and petrochemicals platform to expand capacity in order to meet growing demand from China.",
        "date": "04122017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total-Hanwha venture to invest $450 million on refining and petrochemicals platform "
    },
    {
        "content": "CHIBA  April 4 The liquefied natural gas (LNG) industry will face a shortfall in supply in about five years because low prices have kept producers from making new investments in production  Total SA Chairman and CEO Patrick Pouyanne said on Tuesday.",
        "date": "04042017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "LNG industry facing \"lack of supply in five years\" from reduced investment -TOTAL CEO "
    },
    {
        "content": "* Large volume  long-term contracts now \"more difficult\" -Shell",
        "date": "04052017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "LNG producers turn to trading  risk taking to maintain market share "
    },
    {
        "content": "PARIS French oil and gas major Total  said it aims to become a major player in the U.S. polyethylene market as it announced a $1.7 billion joint venture on Monday with Austria's Borealis and Canada's Nova Chemical.",
        "date": "03272017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total targets U.S. polyethylene market with $1.7 billion investment "
    },
    {
        "content": "* Total SA - co's partnership with PSA Group covers Peugeot  Citroën and DS Marques Further company coverage:",
        "date": "03292017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-PSA Group and Total renew partnership "
    },
    {
        "content": "* Fy net income group share 10.2 million euros ($10.9 million) versus 5.8 million euros year ago",
        "date": "03302017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-Epc Groupe FY net income group share up at 10.2 million euros "
    },
    {
        "content": "SABETTA  Yamal  Russia  March 30 The chief executive of French energy firm Total  Patrick Pouyanne  said on Thursday that his company was interested in future cooperation with Russia's Novatek on projects involving liquefied natural gas. (Reporting by Olesya Astakhova; Writing by Maria Tsvetkova; Editing by Alexander Winning)",
        "date": "03302017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total CEO says interested in Novatek's LNG projects in Russia "
    },
    {
        "content": "PARIS Total is seeking a 50 percent stake in a $4 billion project in Iran's giant South Pars gas field  the French energy firm said in a regulatory filing on Friday detailing talks held with Iranian officials on several projects in 2016.",
        "date": "03172017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "France's Total seeks stake in $4 billion Iranian gas field project "
    },
    {
        "content": "PARIS  March 16 French oil and gas company Total  plans to appoint Mark Cutifani  chief executive of mining group Anglo American  and Carlos Tavares  chairman of French carmaker Peugeot  as independent directors.",
        "date": "03162017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Peugeot's Tavares and Anglo American's Cutifani to join Total board "
    },
    {
        "content": "PARIS  March 15 French oil major Total has started up production from the Moho Nord site off the coast of the Republic of Congo  with the facility set to have a production capacity of 100 000 barrels of oil equivalent per day.",
        "date": "03152017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Oil major Total starts up production at Congo's Moho Nord site "
    },
    {
        "content": "MILAN/PARIS Total  is in talks to buy a multi-billion dollar stake in Iran's partly-built liquefied natural gas (LNG) export facility  Iran LNG  seeking to unlock vast gas reserves.",
        "date": "02272017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total in talks to buy Iranian LNG project: sources "
    },
    {
        "content": "SAO PAULO Petróleo Brasileiro SA and France's Total SA have signed final terms of a $2.25 billion joint venture involving the sale of assets as well as stakes in oilfields and two thermal power stations.",
        "date": "03012017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Petrobras  Total sign $2.25 billion oil production venture "
    },
    {
        "content": "SAO PAULO  March 1 Petróleo Brasileiro SA  and France's Total SA have signed final terms of a $2.25 billion joint venture involving the sale of assets as well as stakes in oilfields and two thermal power stations.",
        "date": "03012017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Petrobras  Total sign $2.25 bln oil production venture "
    },
    {
        "content": "DUBAI  Feb 15 Iran's oil minister has criticised French oil company Total for its decision to delay signing a contract to develop a gas field in southern Iran  saying that the reasons given by Total's chief executive were \"unacceptable\" to Tehran.",
        "date": "02152017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Iran berates Total for delaying gas field development deal "
    },
    {
        "content": "LONDON  Feb 13 (IFR) - Total could lose the equity credit on €9.2bn of hybrid debt after the company's CEO said it could buy back the debt in the next two or three years  potentially falling foul of S&P's strict criteria for these bonds.",
        "date": "02132017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total's hybrids equity credit under threat "
    },
    {
        "content": "* Says scouting for opportunities to snap up assets   (Adds details  peer comparison  background)",
        "date": "02092017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 2-Total on hunt for deals after outperforming rivals "
    },
    {
        "content": "PARIS  Feb 9 French oil major Total said it is hunting out opportunities to buy plumb assets from struggling rivals after it reported better-than-expected fourth quarter net profits  thanks to costs savings that enabled it to raise its dividend.",
        "date": "02092017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Oil major Total looking to buy assets  as costs savings lift its profits "
    },
    {
        "content": "PARIS Container shipping group CMA CGM [CMACG.UL] has signed an agreement with Total under which the oil and gas major will supply lower emission fuels in line with stricter environmental regulations in the shipping sector.",
        "date": "02012017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "CMA CGM  Total sign partnership on lower emission shipping fuel "
    },
    {
        "content": "PARIS French oil and gas giant Total is planning a network of electric vehicle charging points at its petrol stations across France  the company's Chief Executive Patrick Pouyanne said on Tuesday.",
        "date": "01312017",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total planning EV charging points at its French stations: CEO "
    },
    {
        "content": "PARIS  Jan 31 French oil and gas giant Total  is planning a network of electric vehicle charging points at its petrol stations across France  the company's Chief Executive Patrick Pouyanne said on Tuesday.",
        "date": "01312017",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total planning EV charging points at its French stations - CEO "
    },
    {
        "content": "RIO DE JANEIRO Petroleo Brasileiro SA said on Wednesday it will sell $2.2 billion worth of assets to France's Total SA  including stakes in oilfields and two thermal power stations.",
        "date": "12212016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Petrobras to sell Total $2.2 billion worth of assets  including oilfields "
    },
    {
        "content": "PARIS French oil and gas major Total said on Tuesday it will buy a 23 percent stake in Tellurian Investments  a private U.S. gas projects operator  for $207 million as it pursues its drive to secure more downstream gas market share.",
        "date": "12202016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "France's Total buys stake in U.S. gas projects group Tellurian "
    },
    {
        "content": "PARIS An agreement to cut global oil production is possible  but would only happen if countries that do not belong to the Organization of the Petroleum Exporting Countries (OPEC) also agree to cut output  Total's chief executive said on Thursday.",
        "date": "11242016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total CEO says OPEC deal possible only if Russia participates "
    },
    {
        "content": "PARIS  Nov 9 The election of Donald Trump as the President of the United States will not have an impact on the investments of French oil and gas company Total in Iran  the firm's head of gas  renewables and power said on Wednesday.",
        "date": "11092016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total says Trump's election will not have an impact on Iran gas deal "
    },
    {
        "content": "PARIS France's Total has signed a deal with Iran to further develop its part of the world's largest gas field  becoming the first western energy company to sign a major deal with Tehran since the lifting of international sanctions earlier this year.",
        "date": "11082016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total signs first post-sanctions Western energy deal with Iran "
    },
    {
        "content": "BEIRUT  Nov 8 France's Total and China National Petroleum Corp (CNPC) signed a gas contract on Tuesday with National Iranian Oil Company (NIOC) for the second phase of the South Pars gas field  Iran's SHANA news agency said.",
        "date": "11082016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total and Iran sign a preliminary gas deal - state media "
    },
    {
        "content": "PARIS The boss of French oil and gas company Total said on Monday that it would be happy to be the first Western oil company to reach an agreement with Iran  but he said a deal had not yet been signed.",
        "date": "11072016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total says happy to be first Western oil firm to do Iran deal: CNN Money "
    },
    {
        "content": "PARIS  Nov 7 The boss of French oil and gas company Total said on Monday that it would be happy to be the first Western oil company to reach an agreement with Iran  but he said a deal had not yet been signed.",
        "date": "11072016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Total says happy to be first Western oil firm to do Iran deal - CNN Money "
    },
    {
        "content": "PARIS The boss of French oil and gas company Total  said on Monday that it would be happy to be the first western oil company to reach an agreement with Iran  but a deal is yet to be signed.",
        "date": "11072016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total says happy to be first western oil firm to do Iran deal - CNN Money "
    },
    {
        "content": "PARIS The global renewable solar industry is facing a new crisis due to over-capacity and low demand  Patrick Pouyanne  Chief Executive of French oil and gas giant Total said on Thursday.",
        "date": "11032016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total's Pouyanne says solar industry facing 'a new winter' "
    },
    {
        "content": "BEIRUT France's Total and China National Petroleum Corp (CNPC) will sign new contracts on Tuesday with National Iranian Oil Company (NIOC) concerning the second phase of the South Pars gas field  the Iranian oil ministry's SHANA news agency said on Monday.",
        "date": "11072016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total  CNPC to sign new gas contracts with Tehran: SHANA "
    },
    {
        "content": "PARIS  Nov 3 The global renewable solar industry is facing a new crisis due to over-capacity and low demand  Patrick Pouyanne  Chief Executive of French oil and gas giant Total said on Thursday.",
        "date": "11032016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total's Pouyanne says solar industry facing \"a new winter\" "
    },
    {
        "content": "* Interoil Corp - been advised by Total E&P PNG Ltd that it has begun drilling Antelope-7 appraisal well in Papua New Guinea",
        "date": "11022016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-InterOil Antelope-7 drilling underway "
    },
    {
        "content": "* Total Brazil CEO says has full confidence in Libra project   (Adds additional Total comment details of Total projects and partners)",
        "date": "10282016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Total Brasil to move beyond Libra with $300 mln 2017 drill plan "
    },
    {
        "content": "ATHENS  Oct 26 Greece named on Wednesday a consortium of France's Total  its biggest oil refiner Hellenic Petroleum and Italy's Edison as the preferred bidder for an offshore gas drilling block in the west of the country.",
        "date": "10262016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Greece names Total-led consortium preferred bidder for offshore gas drilling "
    },
    {
        "content": "RIO DE JANEIRO  Oct 28 French oil company Total SA plans to spend about $300 million exploring Brazil's Foz do Amazonas Basin in 2017  its first major step in the country since the discovery of the massive Libra area  its Brazil chief executive said on Friday.",
        "date": "10282016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total Brasil to move beyond Libra with $300 mln 2017 drill plan "
    },
    {
        "content": "PARIS France's Total  battled lower refining margins to beat third-quarter profit expectations on Friday helped by cost cuts  output from new projects and a strong contribution from its renewable energy ventures. | Video ",
        "date": "10282016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total beats third-quarter forecast helped by cost cuts  new projects and renewables "
    },
    {
        "content": "* Q3 net profit at 35.6 bln rbls vs forecast of 36.8 bln rbls",
        "date": "10262016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Russia's Novatek swings to third-quarter profit "
    },
    {
        "content": "* Shares down alongside broader market   (Adds details on New Energies  production  dividend)",
        "date": "10282016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 2-Total beats Q3 forecast helped by cost cuts  new projects and renewables "
    },
    {
        "content": "RIO DE JANEIRO  Oct 24 The chief executives of Brazil's Petroleo Brasileiro SA and France's Total SA  said on Monday they plan to team up in new exploration  distribution and power projects in Brazil and abroad.",
        "date": "10242016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Petrobras  Total team up for Brazil exploration  power projects "
    },
    {
        "content": "PARIS  Oct 24 French oil and gas company Total  said on Monday that a gas leak at its 247 000 barrels-per-day Gonfreville refinery in Normandy had caused an explosion that injured five workers.",
        "date": "10242016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Blast at Total's Gonfreville refinery injures five "
    },
    {
        "content": "LONDON  Oct 19 Exxon Mobil's boss Rex Tillerson and Saudi Arabia's energy minister on Wednesday took opposing views on declining investment in the oil sector setting the stage for a possible major supply crunch.",
        "date": "10192016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Exxon boss  Saudi minister differ on oil supply outlook "
    },
    {
        "content": "PARIS  Sept 22 French oil and gas company Total  is actively moving towards a final investment decision as early as end-2017 for its giant onshore oil project in Uganda  president for exploration and production Arnaud Breuillac told investors on Thursday.",
        "date": "09222016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total says actively moving towards Uganda FID as early as end-2017 "
    },
    {
        "content": "PARIS  Sept 16 Oil and gas giant Total  could start the second phase of its Incahuasi gas project in Bolivia as early as 2017 if the right market conditions and incentives for investments are in place  the company's director for the Americas said on Friday.",
        "date": "09162016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total looks beyond Bolivia's Incahuasi to regional gas market "
    },
    {
        "content": "PARIS  Sept 16 Total Energy Ventures  the venture capital arm of oil and gas company Total said on Friday has acquired an interest in Autogrid  a company that develops solutions to manage and energy supplied to and from power grids.",
        "date": "09162016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total's venture arm acquires stake in smart grids firm Autogrid "
    },
    {
        "content": "PARIS  Sept 14 French oil and gas company Total  is considering the sale of some of its 51 pct stake in the Martin Linge oil and gas field in Norway where it is the operator  Bloomberg reported.",
        "date": "09142016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "MEDIA - Total considering sale of stake in Norway's Martin Linge - Bloomberg "
    },
    {
        "content": "PARIS  Sept 12 French oil and gas company Total  has shut down some units at its 247 000 barrels-per-day Gonfreville refinery in northern France following a technical incident  a spokesman said on Monday.",
        "date": "09122016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total halts some units at Gonfreville refinery following incident "
    },
    {
        "content": "PARIS French oil and gas company Total  will increase its exposure to U.S. shale gas by buying 75 percent of Barnett Shale assets from Chesapeake   taking advantage of a far lower price than it paid for its original 25 percent holding.",
        "date": "09092016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total sees bargain buy in Chesapeake's Barnett Shale assets "
    },
    {
        "content": "PARIS  Sept 9 French oil and gas company Total  will increase its exposure to U.S. shale gas by buying 75 percent of Barnett Shale assets from Chesapeake  taking advantage of a far lower price than it paid for its original 25 percent holding.",
        "date": "09092016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "REFILE-UPDATE 1-Total sees bargain buy in Chesapeake's Barnett Shale assets "
    },
    {
        "content": "DAKAR  Sept 5 Gabon's sole oil refinery in Port Gentil has been shut since last Wednesday because of violence following the disputed Aug. 27 presidential elections  a union official told Reuters on Monday.",
        "date": "09052016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Gabon's Sogara oil refinery shut due to post-election violence "
    },
    {
        "content": "HOUSTON Total SA shut a reformer  sulfur recovery unit and a pressure swing adsorption unit at the company's 225 500 barrel per day (bpd) Port Arthur  Texas  refinery after a small fire was extinguished on Tuesday  said sources familiar with plant operations.",
        "date": "08162016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total's Port Arthur refinery reformer  SRU shut by fire: sources "
    },
    {
        "content": "FRANKFURT  Aug 4 France's oil giant Total  has invited chemicals Sinochem and a few private equity firms to prepare final offers for German surface finishing and metal plating company Atotech  people close to the matter said.",
        "date": "08042016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Sinochem  private equity groups in second round of bidding for Atotech - sources "
    },
    {
        "content": "PARIS French oil and gas major Total said on Thursday it had met its cost saving target ahead of schedule as increased output and an oil price rebound produced a better-than-expected rise in second quarter net profit.",
        "date": "07282016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total hits costs target early as oil rebound lifts profit "
    },
    {
        "content": "PARIS  July 28 French oil and gas company Total  said it had met its cost saving target ahead of schedule as it reported a better-than-expected rise in second quarter net profit led by increased output and a rebound in oil prices.",
        "date": "07282016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "RPT-Total meets costs savings target early as oil rebound helps Q2 profits "
    },
    {
        "content": "PARIS  July 27 French oil and gas company Total  said it had met its cost saving target ahead of schedule as it reported a better-than-expected rise in second quarter net profit led by increased output and a rebound in oil prices.",
        "date": "07282016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total meets costs savings target early as oil rebound helps Q2 profits "
    },
    {
        "content": "FRANKFURT Chemicals groups Umicore  and Sinochem  are among the groups interested in German surface finishing and metal plating company Atotech  put on the block by France's oil giant Total   people close to the matter said.",
        "date": "07252016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Umicore  Sinochem expected to bid for Total's Atotech: sources "
    },
    {
        "content": "FRANKFURT  July 25 Chemicals groups Umicore  and Sinochem are among the groups interested in German surface finishing and metal plating company Atotech  put on the block by France's oil giant Total  people close to the matter said.",
        "date": "07252016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Umicore  Sinochem expected to bid for Total's Atotech - sources "
    },
    {
        "content": "MELBOURNE Total SA  is unlikely to challenge ExxonMobil  in a bidding war for explorer InterOil Corp   the French firm's partner in a gas field in Papua New Guinea  analysts said on Wednesday.ExxonMobil this week topped an offer from Oil Search which was backed by Total.",
        "date": "07202016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total seen unlikely to fight ExxonMobil over South Pacific gas "
    },
    {
        "content": "MELBOURNE  July 20 Total SA is unlikely to challenge ExxonMobil in a bidding war for explorer InterOil Corp  the French firm's partner in a gas field in Papua New Guinea  analysts said on Wednesday.",
        "date": "07202016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Total seen unlikely to fight ExxonMobil over South Pacific gas "
    },
    {
        "content": "* ExxonMobil takes on Total in bid to expand in Papua New Guinea",
        "date": "07182016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-ExxonMobil launches bidding war for InterOil in PNG gas push "
    },
    {
        "content": "* ExxonMobil to acquire Interoil in transaction worth more than $2.5 billion",
        "date": "07212016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-ExxonMobil to buy Interoil for about $2.5 bln "
    },
    {
        "content": "PARIS  July 20 French oil and gas company Total  said on Wednesday it was analysing a competing offer made by rival U.S oil giant ExxonMobil's for explorer InterOil Corp  its partner in a gas field in Papua New Guinea.",
        "date": "07202016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total says analysing ExxonMobil's competing offer for InterOil "
    },
    {
        "content": "CAIRO  July 21 African football's top club and national team competitions are to be sponsored by French oil and gas company Total  the Confederation of African Football (CAF) announced on Thursday.",
        "date": "07212016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Soccer-Total agree eight-year African football sponsorship deal "
    },
    {
        "content": "RIO DE JANEIRO Brazil on Tuesday said it will sell four areas in its prolific subsalt region by mid-2017 to speed up development of offshore oil and gas discoveries blocked by nationalist energy policies and state-run Petrobras' debt and financial woes.",
        "date": "07062016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Brazil 2017 subsalt oil rights sale to unlock stalled fields "
    },
    {
        "content": "* Subsalt sale key to develop giant  delayed Carcará area -partner",
        "date": "07062016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Brazil 2017 subsalt oil rights sale to unlock stalled fields "
    },
    {
        "content": "* Amended and extended terms of its existing credit support agreement with total S.A through 2018.",
        "date": "07072016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-SunPower amends and extends terms of existing credit support agreement with TOTAL S.A "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total targets gas  renewables and power expansion "
    },
    {
        "content": "BRUSSELS  July 5 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07052016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "EU mergers and takeovers (July 5) "
    },
    {
        "content": "JAKARTA  June 29 Indonesia's president on Wednesday ordered an expansion of offshore oil exploration and commercial fishing in the waters near the Natuna Islands  the latest in a new campaign to assert sovereignty over the area in the South China Sea.",
        "date": "06292016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Indonesia to step up oil exploration  fishing in South China Sea waters "
    },
    {
        "content": "DUBAI/LONDON  June 27 Oil minister Bijan Zanganeh has handed the running of Iran's national oil company to a trusted ally in a push to agree long-awaited deals with global oil majors  which could be derailed by next year's presidential polls.",
        "date": "06272016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Iran oil chief shakes up oil firm in bid to strike pre-election deals "
    },
    {
        "content": "DOHA Total  has won a 30 percent stake in a new 25-year contract to operate Qatar's largest offshore oilfield  officials said on Monday  in the second major upstream development deal for the French oil firm in the Gulf region in as many years.",
        "date": "06282016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "France's Total wins stake in Qatar's Al-Shaheen oilfield "
    },
    {
        "content": "DOHA  June 27 Total has won a 30 percent stake in a new 25-year contract to operate Qatar's largest offshore oilfield  officials said on Monday  in the second major upstream development deal for the French oil firm in the Gulf region in as many years.",
        "date": "06282016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "REFILE-UPDATE 2-France's Total wins stake in Qatar's Al-Shaheen oilfield "
    },
    {
        "content": "NEW YORK Total SA has decided not to sell a 50 percent stake in its Port Arthur  Texas  refinery almost a year after it retained investment bank Lazard to advise on the deal  according to three people familiar with the matter.",
        "date": "06152016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total no longer seeking buyer for Texas refinery stake: sources "
    },
    {
        "content": "NEW YORK  June 15 Total SA has decided not to sell a 50 percent stake in its Port Arthur  Texas  refinery almost a year after it retained investment bank Lazard to advise on the deal  according to three people familiar with the matter.",
        "date": "06152016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total no longer seeking buyer for Texas refinery stake -sources "
    },
    {
        "content": "PARIS  June 16 French oil and gas company Total  said it had been in talks in the last year with potential investors for the logistics side of its Port Arthur refinery in the United States.",
        "date": "06162016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Total explores partnership for Port Arthur refinery logistics assets "
    },
    {
        "content": "PARIS  June 14 Total plans to take over Lampiris  Belgium's third-largest natural gas and renewable power vendor  as the French oil and gas major continues its expansion in renewable power.",
        "date": "06142016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Total acquires Belgian renewable power provider Lampiris "
    },
    {
        "content": "PARIS  June 16 French oil and gas company Total  said on Thursday that it was exploring a partnership deal for the logistics part of its 225 000 barrels-per-day Port Arthur refinery in the United States and had been in talks in the last year with potential investors.",
        "date": "06162016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total explores partnership for Port Arthur refinery logistics assets "
    },
    {
        "content": "* Total acquires Lampiris to expand its gas and power distribution activities  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06142016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "BRIEF-Total buys Lampiris to expand its gas and power distribution "
    },
    {
        "content": "PARIS  June 14 French oil and gas company Total  plans to take over Belgium's third-largest largest residential supplier of natural gas and renewable power Lampiris  the company said on Tuesday as it expands its presence in the renewable energy market.",
        "date": "06142016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total says to acquire Belgian renewable power provider Lampiris "
    },
    {
        "content": "PARIS French oil and gas company Total plans to buy Belgian green energy provider Lampiris  Belgian daily De Standaard reported on Tuesday  citing unnamed sources.",
        "date": "06142016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total to buy Belgian green energy provider Lampiris - De Standaard "
    },
    {
        "content": "PARIS Strikes at five French refineries will continue until Friday  the start of the Euro 2016 soccer tournament hosted by France  in order to maintain pressure on the government to withdraw a contested labor reform  a CGT union official said.",
        "date": "06072016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "French refinery strikes to keep pressure on government ahead of Euro: CGT "
    },
    {
        "content": "Total says it has begun restart operations at three refineries that have been shuttered by labor strikes since late May.",
        "date": "06062016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Factbox: Strikes hit French oil refinery network "
    },
    {
        "content": "PARIS  June 3 French oil and gas company Total  said on Friday that 62 percent of 340 workers who participated in a ballot at its Grandpuits refinery in France agreed to end a two-week strike.",
        "date": "06032016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total says majority OF workers at Grandpuits refinery vote to end strike "
    },
    {
        "content": "MELBOURNE  June 6 Australian contractor UGL Ltd  warned on Monday it may have to book a provision of up to A$200 million ($146 million) for losses on its work for the Ichthys liquefied natural gas (LNG) project  knocking its shares down 35 percent.",
        "date": "06062016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Australia's UGL faces more provisions on work for Ichthys LNG "
    },
    {
        "content": "* CEO promised to invest  make refineries profitable by end-2016",
        "date": "05242016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Total says strikes could jeopardise its investments in France "
    },
    {
        "content": "PARIS  May 24 French oil and gas company Total  will \"seriously reconsider\" its investment plans in France due to strikes in the oil sector that forced the company to shut down refineries  iTele television reported Total's chief executive as saying on Tuesday.",
        "date": "05242016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total CEO says will \"seriously reconsider\" investments in France due to strikes - iTele "
    },
    {
        "content": "PARIS Europe needs an independent carbon market regulator with clear objectives rather than the current mix of state administrators and the European Commission that has complicated the market  the chief executive of Total said on Wednesday.",
        "date": "05182016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Europe needs independent carbon market regulator: Total's CEO "
    },
    {
        "content": "SYDNEY Papua New Guinea may challenge the $2.2 billion merger between Oil Search Ltd and InterOil Corp if they fail to comply with anti-competition procedures  the country's corporate watchdog said Tuesday.",
        "date": "05242016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Oil Search  InterOil should seek competition approvals for merger: PNG watchdog "
    },
    {
        "content": "SYDNEY  May 24 Papua New Guinea may challenge the $2.2 billion merger between Oil Search Ltd and InterOil Corp if they fail to comply with anti-competition procedures  the country's corporate watchdog said Tuesday.",
        "date": "05242016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Oil Search  InterOil should seek competition approvals for merger -PNG watchdog "
    },
    {
        "content": "LONDON  May 11 (IFR) - Total SA is set to price a \u007f1.75bn hybrid bond issue on Wednesday at a yield of 3.875%  according to a market source.",
        "date": "05112016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total to price \u007f1.75bn hybrid bond "
    },
    {
        "content": "LONDON  May 11 (IFR) - Total SA has set the yield for its euro-denominated hybrid bond issue at 3.875%  as demand surpassed \u007f5.5bn  according to a banker on the deal.",
        "date": "05112016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total sets yield on hybrid bond at 3.875% "
    },
    {
        "content": "LONDON  May 11 (IFR) - Total SA has started marketing a perpetual non-call six-year euro benchmark hybrid bond at yield of 4% area  according to a lead bank.",
        "date": "05112016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total starts marketing euro benchmark hybrid bond "
    },
    {
        "content": "PARIS French oil and gas producer Total  plans to sell its specialty chemicals and equipment division Atotech  its chief executive told Le Figaro newspaper after the company announced on Monday it would buy battery maker Saft.",
        "date": "05092016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total plans to sell specialty chemicals subsidiary Atotech: Le Figaro "
    },
    {
        "content": "PARIS Total  said on Monday it has agreed to buy France based battery manufacturer Saft Groupe  for 950 million euros  ($1.1 billion)  as it seeks to expand its renewable energies business and complement the acquisition in 2011 of a majority stake in U.S. solar power systems maker SunPower .",
        "date": "05092016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total to acquire battery maker Saft for $1.1 billion "
    },
    {
        "content": "LONDON  May 9 (IFR) - Total SA will meet with investors from May 10 for a potential euro-denominated hybrid bond transaction  according to a lead bank on the deal.",
        "date": "05092016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total plans euro hybrid "
    },
    {
        "content": " ",
        "date": "05042016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "A "
    },
    {
        "content": "May 4 Please ignore the alert on Convergint Technologies acquiring Total Recall as it was wrongly coded to Total SA  an unrelated company.",
        "date": "05042016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Alert on Total Recall wrongly coded Total SA "
    },
    {
        "content": "* Operation should be finizaled in Q3 2016  Source text for Eikon: http://bit.ly/1SWKDDH Further company coverage:    (Gdynia Newsroom:)",
        "date": "05032016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-Emova Group in exclusive talks to buy Groupe au Nom de la Rose "
    },
    {
        "content": "* Sees potential Uganda project FID next year   (Adds CFO quotes  Tullow comment on Uganda  background)",
        "date": "04272016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Total in final stage of $4 bln Yamal LNG financing deal with Russian banks - CFO "
    },
    {
        "content": "PARIS  April 27 French oil and gas company Total  is in the final stage of negotiating a $4 billion financing arrangement with Russian banks to fund the Yamal LNG project  the company's Chief Finance Officer told analysts on Wednesday.",
        "date": "04272016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total in final stage of $4 bln Yamal LNG financing deal with Russian banks - CFO "
    },
    {
        "content": "PARIS  April 27 French oil and gas major Total  reported a better that expected net profit in the first quarter of the 2016 as high output and a strong performance in refining and chemicals helped limit the impact of a prolonged fall in oil prices.",
        "date": "04272016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total Q1 beats forecasts on high output  strong margins "
    },
    {
        "content": "PARIS French oil and gas company Total announced the creation of a gas  renewables and power division on Tuesday  which it said will help drive its ambition to become a top renewables and electricity trading player within 20 years.",
        "date": "04192016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total targets gas  renewables and power expansion "
    },
    {
        "content": "PARIS  April 13 French oil and gas company Total  said on Wednesday that it signed an agreement with Korea Gas to extend the cooperation in their liquefied natural gas (LNG) businesses.",
        "date": "04132016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "France's Total to broaden LNG cooperation with Korea Gas "
    },
    {
        "content": "LONDON  April 8 Oil refineries are shifting into high gear to produce as much gasoline as possible for the world's fuel-hungry drivers - kicking the problem of a worsening diesel glut further down the road.",
        "date": "04082016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Worst yet to come for diesel  casting refinery profits in doubt "
    },
    {
        "content": "PAU  France  April 5 Oil and gas companies must make further serious cost cuts and should work together to generate further savings to weather the current difficult downturn  Total's executive Arnaud Breuillac said on Tuesday.",
        "date": "04052016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total says costs still unacceptably high in oil and gas "
    },
    {
        "content": "* Signed contract with AB Groupe to renew its satellites capacities  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "03302016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-Eutelsat signed contract with AB Groupe "
    },
    {
        "content": "HOUSTON Total SA began shutting a 60 000 barrel per day (bpd)coking unit on Monday at the company's 225 500 bpd Port Arthur  Texas  refinery for a planned overhaul that could last up to 60 days  said sources familiar with plant operations.",
        "date": "03282016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total Port Arthur refinery shutting units for work: sources "
    },
    {
        "content": "LONDON French oil company Total has held talks to buy all or part of domestic rival Engie's exploration and production (E&P) activities  worth about 5 billion euros ($5.6 billion)  sources familiar with the situation said.",
        "date": "03232016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Exclusive: Total eyes Engie's 5 billion euro upstream activities - sources "
    },
    {
        "content": "PARIS  March 24 French oil and gas firm Total  has signed a confidential agreement with Tehran to develop Iran's South Azadegan oil field which it shares with Iraq  state-run Press TV reported on Thursday  quoting Oil Minister Bijan Zangeneh.",
        "date": "03242016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total and Iran sign South Azadegan agreement - Press TV "
    },
    {
        "content": "LONDON Iranian oil flows to Europe have begun to pick up from a slow start after sanctions were lifted in January  but trading sources say a lack of access to storage part-owned by Tehran's Gulf Arab rivals now looms large on a list of obstacles.",
        "date": "03242016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Iran's oil storage struggle holds back exports to Europe "
    },
    {
        "content": "* ISE group  Total and Sunpower Corporation to build solar power plant in Japan",
        "date": "03242016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "BRIEF-ISE group  Total and Sunpower Corporation to build solar power plant in Japan "
    },
    {
        "content": "LONDON Total's Chief Executive Patrick Pouyanne received remuneration of 3 million euros in 2015  his first full year at the helm of the French oil and gas company  a filing to the stock exchange showed on Wednesday.",
        "date": "03162016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total CEO received 3.05 million euros in remuneration in 2015 "
    },
    {
        "content": "PARIS A Paris court fined Total  750 000 euros ($825 000) on Friday for corrupting foreign officials  overturning an earlier acquittal over the French oil giant's role in the United Nations' Iraqi oil-for-food program.",
        "date": "02272016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total fined by French court in Iraq oil-for-food case "
    },
    {
        "content": "Feb 22 Standard & Poor's cut its corporate credit ratings on BP  Total SA and Statoil ASA   citing the Europe-based oil and gas companies' persistent weak debt coverage measures over 2015-2017.",
        "date": "02222016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "S&P cuts rating on BP  Total and Statoil "
    },
    {
        "content": "PARIS/LONDON France's Total  beat quarterly earnings expectations powered by high production and refining margins on Thursday but said it plans fresh spending cuts and asset sales in response to one of the worst market downturns in a decade.",
        "date": "02112016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total beats fourth-quarter expectations but oil rout to drive deeper cuts "
    },
    {
        "content": "* To pay 0.61 euro per share Q4 dividend in cash  shares   (Adds CEO comments to analysts  investors)",
        "date": "02112016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 3-Total beats Q4 expectations but oil rout to drive deeper cuts "
    },
    {
        "content": "PARIS  Jan 28 France and Iran hailed the sale of Airbus planes and the renewal of a decades-old carmaking venture as symbols of thawing relations on Thursday while protesters in Paris tried to get human rights onto the agenda.",
        "date": "01282016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 4-Protesters march  France eyes business deals as Iran's Rouhani visits "
    },
    {
        "content": "PARIS  Jan 19 French energy company Total  expects a drop in 2015 results but does not plan to cut jobs as peer BP has done to weather currently low oil prices  its chief executive said in a radio interview on Tuesday.",
        "date": "01192016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 2-Total takes oil price hit but will not cut jobs -CEO "
    },
    {
        "content": "DUBAI Oil majors Total and Shell have sent executives to Tehran ahead of the expected lifting of international sanctions  Iran's Mehr news agency said on Saturday.",
        "date": "01162016",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total  Shell executives arrive in Tehran ahead of sanctions relief - Mehr "
    },
    {
        "content": "DUBAI  Jan 16 Oil majors Total and Shell have sent executives to Tehran ahead of the expected lifting of international sanctions  Iran's Mehr news agency said on Saturday.",
        "date": "01162016",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total  Shell executives arrive in Tehran ahead of sanctions relief-Mehr "
    },
    {
        "content": "LUANDA  Dec 23 France's Total has signed an memorandum of understanding with Angola's Sonangol  a first step to opening fuel stations in the southern African nation  Total told Reuters on Wednesday.",
        "date": "12232015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "France's Total eyes fuel stations in Angola  signs MOU "
    },
    {
        "content": "RIO DE JANEIRO  Dec 11 Brazil's Petroleo Brasileiro SA  or Petrobras  is not considering selling a 10 percent stake in its giant Libra offshore oil prospect at this time  the state-run oil company said on Friday.",
        "date": "12112015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Brazil's Petrobras says not considering Libra area sale "
    },
    {
        "content": "RIO DE JANEIRO  Dec 11 Brazil's Petroleo Brasileiro SA  or Petrobras  is not considering selling a 10 percent stake in its giant Libra offshore oil prospect at this time  the state-run oil company said on Friday.",
        "date": "12112015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Brazil's Petrobras says not considering Libra area sale "
    },
    {
        "content": "A North American unit of French oil company Total SA and a trader agreed to pay $3.6 million to settle charges of attempted manipulation of the U.S. natural gas market  the U.S. Commodity Futures Trading Commission said on Monday.",
        "date": "12072015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total agrees to pay $3.6 million to settle CFTC manipulation charge "
    },
    {
        "content": "Dec 7 A North American unit of French oil company Total SA and a trader agreed to pay $3.6 million to settle charges of attempted manipulation of the U.S. natural gas market  the U.S. Commodity Futures Trading Commission (CFTC) said on Monday.   (Reporting by Scott DiSavino; Editing by Steve Orlofsky)",
        "date": "12072015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total agrees to pay $3.6 mln to settle CFTC manipulation charge "
    },
    {
        "content": "Dec 7 A North American unit of French oil company Total SA and a trader agreed to pay $3.6 million to settle charges of attempted manipulation of the U.S. natural gas market  the U.S. Commodity Futures Trading Commission said on Monday.",
        "date": "12072015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 2-Total agrees to pay $3.6 mln to settle CFTC manipulation charge "
    },
    {
        "content": "Dec 2 Offshore driller Vantage Drilling Co  said it reached a support agreement with lenders and noteholders holding more than $1.6 billion in debt to reduce interest expense but one of its units will file for U.S. bankruptcy on Dec. 3.",
        "date": "12032015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Vantage says reaches deal with lenders  unit to file for bankruptcy "
    },
    {
        "content": "PARIS French oil and gas company Total's reported better than expected third-quarter profit on Thursday after high margins in its European refining business and increased production softened the blow of prolonged low oil prices.",
        "date": "10292015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total beats expectations thanks to record refining margins "
    },
    {
        "content": "* Sector earnings hit by prolonged low oil prices   (Recasts  adds quote after analyst call  sector rivals)",
        "date": "10292015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Total beats expectations thanks to record refining margins "
    },
    {
        "content": "PARIS  Oct 21 Total's boss is known as a fixer; a straight-talking cost cutter who has emerged as the right person to steer the French oil and gas company through one of the industry's worst downturns in decades.",
        "date": "10212015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total's trenchant new boss fits era of oil austerity "
    },
    {
        "content": "U.S. federal energy regulators extended their years-long effort to crack down on a contested form of market manipulation on Tuesday  alleging that French firm Total SA and two of its traders rigged southwestern natural gas prices for years.",
        "date": "09222015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "U.S. regulators allege Total rigged natgas market for three years "
    },
    {
        "content": "Sept 22 U.S. federal energy regulators extended their years-long effort to crack down on a contested form of market manipulation on Tuesday  alleging that French firm Total SA and two of its traders rigged southwestern natural gas prices for years.",
        "date": "09222015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 3-U.S. regulators allege Total rigged natgas market for 3 years "
    },
    {
        "content": "U.S. federal energy regulators on Tuesday alleged traders at the U.S. arm of French energy company Total SA manipulated the natural gas market in the southwestern United States between June 2009 and June 2012.",
        "date": "09222015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "U.S. regulators allege Total manipulated natgas market for 3 years "
    },
    {
        "content": "HOUSTON A Texas district judge issued temporary restraining orders on Tuesday to preserve evidence in the death of a bulldozer operator at Total SA's Port Arthur  Texas  refinery on Saturday  according to court documents.",
        "date": "09092015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Texas judge issues restraining orders in Port Arthur refinery death "
    },
    {
        "content": "HOUSTON  Sept 8 A Texas district judge issued temporary restraining orders on Tuesday to preserve evidence in the death of a bulldozer operator at Total SA's Port Arthur  Texas  refinery on Saturday  according to court documents.",
        "date": "09082015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Texas judge issues restraining orders in Port Arthur refinery death "
    },
    {
        "content": "HOUSTON  Sept 6 Total SA's Port Arthur  Texas  refinery is running at about half of its 225 500 barrel per day (bpd) capacity as coker throughput is minimal following a fatal accident at the unit on Saturday  sources familiar with plant operations said on Sunday.",
        "date": "09062015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Total Port Arthur refinery operating at 50 pct capacity -sources "
    },
    {
        "content": "HOUSTON  Sept 8 A Texas district judge issued temporary restraining orders on Tuesday to preserve evidence in the death of a bulldozer operator at Total SA's Port Arthur  Texas  refinery on Saturday  according to court documents.",
        "date": "09092015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 1-Texas judge issues restraining orders in Port Arthur refinery death "
    },
    {
        "content": "HOUSTON Total SA reduced production at its 225 500 barrel per day (bpd) Port Arthur  Texas  refinery on Saturday after a contract worker was killed when the bulldozer he was driving in a pit beneath a refining unit flipped over in petroleum coke dust and scalding water  said sources familiar with plant operations.",
        "date": "09052015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total reduces Port Arthur refinery output after worker killed: sources "
    },
    {
        "content": "HOUSTON  Sept 5 Total SA reduced production at its 225 500 barrel per day (bpd) Port Arthur  Texas  refinery on Saturday after a contract worker was killed when the bulldozer he was driving in a pit beneath a refining unit flipped over in petroleum coke dust and scalding water  said sources familiar with plant operations.",
        "date": "09052015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 4-Total reduces Port Arthur refinery output after worker killed -sources "
    },
    {
        "content": "HOUSTON  Sept 5 Total SA cut production at its Port Arthur  Texas  refinery on Saturday after a contract worker was killed when the bulldozer he was driving in a pit beneath a giant refining unit flipped over in petroleum coke and coarse dust  said sources familiar with plant operations.",
        "date": "09052015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "CORRECTED-UPDATE 3-Total Port Arthur refinery cuts production after worker killed -sources "
    },
    {
        "content": "* Announces start-up of production from Surmont 2 oil sand project in Canada",
        "date": "09012015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-Total announces production start-up at Canadian oil sand project "
    },
    {
        "content": "PARIS  Aug 27 French oil major Total  has agreed to sell some of its gas pipeline assets in the UK's North Sea to North Sea Midstream Partners  an affiliate of U.S.-based private equity firm ArcLight Capital  for 585 million pounds ($907 million).",
        "date": "08272015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total sells North Sea gas pipelines for $907 mln "
    },
    {
        "content": "PARIS French oil company Total posted higher than expected second-quarter profit on Wednesday  helped by increased refining margins in Europe and accelerated cost cuts to adjust to a low oil price environment. | Video ",
        "date": "07292015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total beats profit forecast  cost cuts to exceed targets "
    },
    {
        "content": "HOUSTON A sulfur recovery unit was back to normal operations after tripping out of production on Saturday at Total SA's 225 500-barrel-per-day Port Arthur  Texas  refinery  sources familiar with plant operations said on Monday.",
        "date": "07132015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total Port Arthur SRU operating normally after upset: sources "
    },
    {
        "content": "* 3 462 449 new ordinary shares issued by Viel et Compagnie SA will be listed on the market Euronext Paris as of July 13",
        "date": "07092015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-3 462 449 new Viel et Compagnie shares to be listed - Euronext "
    },
    {
        "content": "PARIS  May 29 Total's chief executive said on Friday the French oil major saw no reason currently to sell its Hutchinson rubber unit and that the group will explain in due time what its plans are for the business.",
        "date": "05292015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total CEO says no reason to sell Hutchinson currently "
    },
    {
        "content": "BRUSSELS  May 28 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05282015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "EU mergers and takeovers (May 28) "
    },
    {
        "content": "* Says achieves milestone of producing cumulative 2 billion barrels of oil from its deep offshore Block 17 site  150 kilometres off the coast of Angola  Further company coverage:",
        "date": "05272015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-Total says achieves 2 bln barrels of production at Angola offshore site "
    },
    {
        "content": "* Companies urge goal of \"net zero\" emissions well before 2100",
        "date": "05212015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Top EU companies urge drastic cuts in greenhouse gas emissions "
    },
    {
        "content": "RABAT  May 2 Total Maroc   owned by France's Total  plans to raise between 612 million dirhams and 720 million dirhams ($74.48 million) in an initial public share offer  Moroccan bourse watchdog CDVM said in a statement on Saturday.",
        "date": "05022015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "France Total's Moroccan unit to raise up to $75 mln in IPO "
    },
    {
        "content": "LONDON  May 1 Top oil firms Royal Dutch Shell  and Total are bringing their refining and trading operations closer together  seeking alternative ways to drive profits as oil prices fall and independent trading houses expand into their territory.",
        "date": "05042015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Shell  Total align trading and refining units to drive profit growth "
    },
    {
        "content": "LONDON  May 1 Top oil firms Royal Dutch Shell  and Total are bringing their refining and trading operations closer together  seeking alternative ways to drive profits as oil prices fall and independent trading houses expand into their territory.",
        "date": "05012015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Shell  Total align trading and refining units to drive profit growth "
    },
    {
        "content": "HOUSTON  April 21 Conflicts between Sunni and Shi'ite Muslims in Yemen threaten to spread throughout the Middle East and further destabilize the region  Total SA  Chief Executive Patrick Pouyanné said on Tuesday.",
        "date": "04212015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "CERAWEEK-Total CEO worried Yemen unrest could spread through Middle East "
    },
    {
        "content": "BEIJING  April 22 First shipments from a new liquefied natural gas (LNG) project in Papua New Guinea operated by French oil major Total SA is expected in 2021  a top executive at a partner in the project told Reuters on Wednesday.",
        "date": "04222015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "UPDATE 1-Total-led LNG project in Papua New Guinea targets first gas in 2021 - InterOil VP "
    },
    {
        "content": "PARIS/LONDON French oil major Total and British rival BP are under no pressure to make acquisitions after the recent takeover of BG Group by Anglo-Dutch rival Shell  they said on Thursday.",
        "date": "04162015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total  BP say feel no M&A pressures after Shell deal "
    },
    {
        "content": "PARIS/LONDON  April 16 French oil major Total  and British rival BP are under no pressure to make acquisitions after the recent takeover of BG Group by Anglo-Dutch rival Shell  they said on Thursday.",
        "date": "04162015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 2-Total  BP say feel no M&A pressures after Shell deal "
    },
    {
        "content": "* CEO says other players need to do more   (Adds details  quotes  analyst)",
        "date": "04162015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "UPDATE 3-Total to halt crude refining near Marseille  bets on biofuels "
    },
    {
        "content": "PARIS  April 8 Total's chief executive will travel this week to northwest Siberia to visit Russia's showcase $27 billion Yamal gas project in which the French oil major owns a 20 percent stake  a Total spokeswoman said.",
        "date": "04082015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "CORRECTED-Total's CEO to visit Russia's Yamal LNG project "
    },
    {
        "content": "* FTSEurofirst 300 up 0.2 pct  energy sector index up 5.5 pct",
        "date": "04082015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "European stocks rise as energy shares rally on Shell-BG deal "
    },
    {
        "content": "* Has received a notification from Guy Paquot/Fingaren/Entreprises et Chemins de Fer en Chine S.A. that a 50 percent threshold being crossed",
        "date": "03262015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "BRIEF-Guy Paquot holds 50.13 pct of Compagnie du Bois Sauvage's voting rights "
    },
    {
        "content": "* Total seeks up to $1.5 bln for Laggan-Tormore field - sources",
        "date": "03112015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "France's Total puts prime North Sea field on the block - sources "
    },
    {
        "content": "LONDON  Feb 13 (IFR) - Total SA has appointed banks to arrange a European roadshow ahead of a potential multi-tranche euro-denominated hybrid bond issue.",
        "date": "02132015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total names banks for multi-tranche hybrid bond issue "
    },
    {
        "content": "PARIS/LONDON Total  will cut capacity and jobs at its Lindsey refinery in Britain  the French oil major said on Thursday  as the group adapts to weak demand for fuel in Europe and rising competition from overseas.",
        "date": "02122015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total to halve capacity and cut jobs at Lindsey refinery in UK "
    },
    {
        "content": "FRANKFURT/LONDON Europe's second-biggest oil company Total  is preparing for the sale or listing of its rubber and insulation unit Hutchinson that could be worth up to 4 billion euros ($4.6 billion)  sources told Reuters.",
        "date": "02042015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Exclusive: Total preparing for sale or listing of $4.6 billion rubber unit Hutchinson - sources "
    },
    {
        "content": "PARIS  Feb 4 French oil company Total  said on Wednesday it had been informed of an armed attack at the al-Mabrook oilfield in Libya this week and that it had no company personnel at the site.",
        "date": "02042015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Total says informed of attack at Libyan oilfield "
    },
    {
        "content": "PARIS  Jan 30 Total's new chief said in a newspaper interview that the French oil company aimed to cut exploration spending by 30 percent in 2015 to cope with falling oil prices.",
        "date": "01302015",
        "name": "Total SA",
        "news_type": "topStory",
        "symbol": "TOT",
        "title": "Total to cut exploration costs by 30 pct in 2015-Le Monde "
    },
    {
        "content": "DUBAI  Jan 19 Plunging oil prices could prompt Gulf Arab sovereign wealth funds to pull tens of billions of dollars out of global markets this year  with much of the money expected to come out of U.S. dollar debt and deposits with banks abroad.",
        "date": "01192015",
        "name": "Total SA",
        "news_type": "normal",
        "symbol": "TOT",
        "title": "Oil's plunge to siphon Gulf petrodollars from global markets "
    }
]