[
    {
        "content": "WASHINGTON  Nov 16 The U.S. Federal Communications Commission on Thursday voted to remove key roadblocks to increased consolidation among media companies  potentially unleashing new deals among TV  radio and newspaper owners as they seek to better compete with online media.",
        "date": "11162017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "UPDATE 2-U.S. regulator votes to loosen media ownership rules "
    },
    {
        "content": "Nov 9 Wall Street Journal owner News Corp reported a better-than-expected quarterly profit on Thursday  driven by a tight control on expenses and growth in revenue across all its businesses.",
        "date": "11102017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "CORRECTED-UPDATE 2-News Corp profit beats on digital real estate unit strength "
    },
    {
        "content": "* q3 revenue $450.5 million versus I/B/E/S view $461.1 million",
        "date": "11082017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune media company reports Q3 EPS of $0.31 "
    },
    {
        "content": "* Bruce Karsh stepping down from Tribune Media Company board of directors",
        "date": "10312017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media says Bruce Karsh to step down from board "
    },
    {
        "content": "WASHINGTON  Nov 3 Four state attorneys general urged the Federal Communications Commission to reject Sinclair Broadcast Group Inc's proposed $3.9 billion acquisition of Tribune Media Co  marking the latest hurdle for the controversial tie-up.",
        "date": "11032017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Four U.S. states urge regulator to reject Sinclair Tribune deal "
    },
    {
        "content": "WASHINGTON  Oct 30 Telecommunications provider CenturyLink Inc on Monday won anti-trust approval from the U.S. Federal Communications Commission for its purchase of Level 3 Communications Inc  the agency said.",
        "date": "10312017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "UPDATE 4-U.S. regulator approves CenturyLink's $24 bln Level 3 acquisition "
    },
    {
        "content": "* Tribune media - ‍more than 99 percent of votes cast by co's Class A stockholders and Class B stockholders voted to approve merger with Sinclair Broadcast Source text for Eikon: Further company coverage:",
        "date": "10192017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media stockholders approve Sinclair Merger "
    },
    {
        "content": "WASHINGTON  Oct 18 The Federal Communications Commission said on Wednesday it would allow the public to submit additional comments on Sinclair Broadcast Group's proposed $3.9 billion acquisition of Tribune Media Co that has drawn fire from across the political spectrum.",
        "date": "10182017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "U.S. FCC extends comment period for Sinclair Tribune deal "
    },
    {
        "content": "* Tribune Media - Co  members of board  Sinclair Broadcast Group entered MOU to resolve individual claims asserted by 4 purported Tribune shareholders​",
        "date": "09152017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media  members of board  and Sinclair Broadcast Group enters MOU "
    },
    {
        "content": "* Sinclair Broadcast Group and Tribune Media announce filing of fcc response",
        "date": "08232017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Sinclair Broadcast Group and Tribune Media announce filing of FCC response "
    },
    {
        "content": "U.S. broadcaster Tribune Media Co   which agreed to be bought by Sinclair Broadcast Group Inc   reported a lower-than-expected quarterly profit  hurt by higher programming costs.",
        "date": "08092017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Tribune Media's profit misses as programming costs rise "
    },
    {
        "content": "WASHINGTON  Aug 7 Dish Network Corp has joined forces with conservative media  trade and liberal advocacy groups in urging U.S. authorities to reject Sinclair Broadcast Group's proposed $3.9 billion acquisition of Tribune Media.",
        "date": "08082017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Dish Network  trade groups and others oppose Sinclair Tribune deal "
    },
    {
        "content": "Aug 9 U.S. broadcaster Tribune Media Co   which agreed to be bought by Sinclair Broadcast Group Inc  reported a lower-than-expected quarterly profit  hurt by higher programming costs.",
        "date": "08092017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "UPDATE 1-Tribune Media's profit misses as programming costs rise "
    },
    {
        "content": "* Q2 revenue $469.5 million versus I/B/E/S view $475.9 million",
        "date": "08092017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media Q2 adjusted earnings per share $0.36 "
    },
    {
        "content": "* Federal Communications Commission denies motion for extension and additional information in Sinclair-Tribune merger",
        "date": "08072017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Sinclair says FCC denies motion for extension  additional information in Sinclair-Tribune merger "
    },
    {
        "content": "Aug 9 U.S. broadcaster Tribune Media Co   which agreed to be bought by Sinclair Broadcast Group Inc in May  reported a 2.1 percent fall in quarterly revenue  hurt by slower growth in its television and entertainment business.",
        "date": "08092017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Tribune Media's quarterly revenue falls 2.1 pct "
    },
    {
        "content": "* ‍On Aug 2  co received a request for additional information and documentary material  from U.S. Department of Justice ​",
        "date": "08032017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Sinclair Broadcast Group says receives request for additional info from U.S. DOJ​ "
    },
    {
        "content": "* Tribune Media sells majority of its ownership stake in CareerBuilder",
        "date": "07312017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media sells majority of its ownership stake in CareerBuilder "
    },
    {
        "content": "* Tribune Media Company announces successful consent solicitation with respect to its 5.875% senior notes due 2022 Source text for Eikon: Further company coverage:",
        "date": "06222017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media announces successful consent solicitation to its 5.875 pct senior notes "
    },
    {
        "content": "* Tribune Media Co - expects to receive $157 million in cash  retain an approximate 8 percent ownership stake in CareerBuilder on a fully-diluted basis",
        "date": "06192017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media announces expected share of proceeds as result of CareerBuilder sale "
    },
    {
        "content": "WASHINGTON A U.S. court on Thursday declined to block the Federal Communications Commission from easing Obama-era limits on local television ownership  which could have prevented Sinclair Broadcast Group Inc from buying assets of Tribune Media Co  one of the largest U.S. TV station operators.",
        "date": "06152017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "U.S. appeals court declines to block TV ownership rule change "
    },
    {
        "content": "WASHINGTON  June 15 A U.S. court on Thursday declined to block the Federal Communications Commission from easing Obama-era limits on local television ownership  which could have prevented Sinclair Broadcast Group Inc from buying assets of Tribune Media Co  one of the largest U.S. TV station operators.",
        "date": "06152017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "UPDATE 2-U.S. appeals court declines to block TV ownership rule change "
    },
    {
        "content": "WASHINGTON  June 15 A federal appeals court on Thursday declined to issue an emergency order blocking the U.S. Federal Communications Commission from changing its local television ownership rules  which could have blocked Sinclair Broadcast Group Inc from buying assets of Tribune Media Co one of the largest U.S. television station operators.",
        "date": "06152017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Appeals court won't issue order blocking TV ownership rule "
    },
    {
        "content": "* Tribune Media Company announces consent solicitation with respect to its 5.875 pct senior notes due 2022 Source text for Eikon: Further company coverage:",
        "date": "06132017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media Company announces consent solicitation with respect to its 5.875 pct senior notes "
    },
    {
        "content": "U.S. broadcaster Tribune Media Co   reported a quarterly loss on Wednesday  compared with a profit a year earlier  hurt in part by lower ad revenue from its TV and entertainment business and as it took an impairment charge.",
        "date": "05102017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "U.S. broadcaster Tribune posts surprise quarterly loss "
    },
    {
        "content": "May 10 U.S. broadcaster Tribune Media Co   reported a quarterly loss on Wednesday  compared with a profit a year earlier  hurt in part by lower ad revenue from its TV and entertainment business and as it took an impairment charge.",
        "date": "05102017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "UPDATE 1-U.S. broadcaster Tribune posts surprise quarterly loss "
    },
    {
        "content": "May 10 U.S. broadcaster Tribune Media Co   which agreed to be bought by Sinclair Broadcast Group Inc  reported a loss in the first quarter  compared to a profit a year earlier  hurt partly by lower ad revenue from its TV and entertainment business.",
        "date": "05102017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Tribune reports 1st-qtr loss versus year-ago profit "
    },
    {
        "content": "* Q1 revenue $439.9 million versus I/B/E/S view $447.8 million",
        "date": "05102017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media Company reports Q1 adj loss per share $0.07 "
    },
    {
        "content": "Sinclair Broadcast Group Inc  said on Monday it would buy Tribune Media Co   one of the largest U.S. television station operators  for about $3.9 billion  giving Sinclair a greater foothold in big broadcast markets like New York and Chicago.",
        "date": "05082017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Sinclair Broadcast to buy Tribune Media for about $3.9 billion "
    },
    {
        "content": "May 8 Sinclair Broadcast Group Inc said on Monday it would buy Tribune Media Co  one of the largest U.S. television station operators  for about $3.9 billion  giving Sinclair a greater foothold in big broadcast markets like New York and Chicago.",
        "date": "05082017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "UPDATE 2-Sinclair Broadcast to buy Tribune Media for about $3.9 bln "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Sinclair's $3.9 billion deal for Tribune Media is putting Fox in a hole. The U.S. broadcaster is paying a 26 percent premium for its rival after the Trump administration relaxed a wave of regulations. Tribune gives Sinclair more heft to mount a challenge to Rupert Murdoch’s Fox News. But it’s going to cost the buyer more than just the headline price tag.",
        "date": "05082017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Sinclair $3.9 bln Tribune deal puts Fox in a hole "
    },
    {
        "content": "* Sinclair broadcast group to acquire tribune media company for approximately $3.9 billion",
        "date": "05082017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Sinclair Broadcast to buy Tribune Media for about $3.9 bln "
    },
    {
        "content": "May 8 Broadcaster Sinclair Broadcast Group Inc said on Monday it would buy Tribune Media Co for about $3.9 billion cash and stock and assume about $2.7 billion in debt.",
        "date": "05082017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Sinclair Broadcast to buy Tribune Media for about $3.9 bln "
    },
    {
        "content": "Sinclair Broadcast Group Inc  is nearing a deal to acquire Tribune Media Co  for close to $4 billion after prevailing in an auction for one of the largest U.S. television station operators  according to people familiar with the matter.",
        "date": "05082017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Sinclair Broadcast nears deal for Tribune Media "
    },
    {
        "content": "May 7 Sinclair Broadcast Group Inc is nearing a deal to acquire Tribune Media Co for close to $4 billion after prevailing in an auction for one of the largest U.S. television station operators  according to people familiar with the matter.",
        "date": "05082017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "UPDATE 4-Sinclair Broadcast nears deal for Tribune Media "
    },
    {
        "content": "* 21st Century Fox is in talks with Blackstone to launch a joint bid for Tribune Media - FT  citing sources Source text  - http://on.ft.com/2pkKKlo Further company coverage: (Bengaluru Newsroom)",
        "date": "04302017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-21st Century Fox is in talks with Blackstone to launch a joint bid for Tribune Media - FT  citing sources "
    },
    {
        "content": "* Tribune Media Co - on April 24  compensation committee of board of directors of co approved amendments to employment agreements of CFO Chandler Bigelow",
        "date": "04282017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media board compensation committee approve amendments to CFO employment agreements "
    },
    {
        "content": "NEW YORK Twenty-First Century Fox Inc  is in talks with Blackstone Group LP  about submitting an offer to buy Tribune Media Co   one of the largest U.S. television station operators  sources familiar with the matter said on Sunday.",
        "date": "05012017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Twenty-First Century Fox in talks with Blackstone to buy Tribune "
    },
    {
        "content": "* Dow up 0.10 pct  S&P up 0.22 pct; Nasdaq hits record high (Adds details  changes comment  updates prices)",
        "date": "05012017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "US STOCKS-Wall St moves higher as tech gains offset weak economic data "
    },
    {
        "content": "* Indexes up: Dow 0.06 pct  S&P 0.18 pct  Nasdaq 0.35 pct (Updates to open)",
        "date": "05012017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "US STOCKS-Wall St opens higher after govt shutdown averted "
    },
    {
        "content": "WASHINGTON  April 20 The U.S. Federal Communications Commission voted 2-1 on Thursday to reverse a 2016 decision that limits the number of television stations some broadcasters can buy.",
        "date": "04202017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "UPDATE 2-FCC votes to allow some broadcasters to buy more TV stations "
    },
    {
        "content": "* Futures up: Dow 40 pts  S&P 5.75 pts  Nasdaq 17.25 pts (Adds details  comment  updates prices)",
        "date": "05012017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "US STOCKS-Wall St set to open higher after govt shutdown averted "
    },
    {
        "content": "NEW YORK  April 30 Twenty-First Century Fox Inc is in talks with Blackstone Group LP about submitting an offer to buy Tribune Media Co  one of the largest U.S. television station operators  sources familiar with the matter said on Sunday.",
        "date": "05012017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "UPDATE 1-Twenty-First Century Fox in talks with Blackstone to buy Tribune "
    },
    {
        "content": "* Former president  and CEO Peter Liguori's fy 2016 total compensation was $7.7 million versus $8.1 million in fy 2015 - sec filing  Source text: [http://bit.ly/2nQNG9F] Further company coverage:",
        "date": "03242017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media CEO Peter Liguori's 2016 total compensation was $7.7 mln "
    },
    {
        "content": "* Starboard value lp reports 4.4 percent stake in tribune media co as of march 13 versus 6.6 percent stake as of february 10 - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "03152017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Starboard Value reports 4.4 pct stake in Tribune Media as of March 13 "
    },
    {
        "content": "NEW YORK  March 5 Shares of Tribune Media Co  look attractive amid the discount at which the U.S. broadcaster's stock trades relative to its net asset value  according to an article in Barron's.",
        "date": "03052017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Tribune Media shares look attractive -Barron's "
    },
    {
        "content": "Sinclair Broadcast Group Inc has approached rival U.S. broadcaster Tribune Media Co to discuss a potential combination  people familiar with the matter said on Wednesday  a deal that would hinge on existing regulations being relaxed.",
        "date": "03012017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Exclusive: Sinclair approaches Tribune Media about possible deal - sources "
    },
    {
        "content": "* Tribune media company reports fourth quarter and full-year 2016 results",
        "date": "03012017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media reports Q4 earnings per share $0.81 from continuing operations "
    },
    {
        "content": "Tribune Media Co   one of the largest U.S. television station operators  said on Tuesday that activist investor Starboard Value LP had taken a 6.6 percent stake in the company.",
        "date": "02212017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Starboard takes 6.6 percent stake in Tribune Media "
    },
    {
        "content": "Feb 21 Tribune Media Co  one of the largest U.S. television station operators  said on Tuesday that activist investor Starboard Value LP had taken a 6.6 percent stake in the company.",
        "date": "02212017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "UPDATE 1-Starboard takes 6.6 pct stake in Tribune Media "
    },
    {
        "content": "Feb 21 Tribune Media Co  one of the largest U.S. television station operators  said on Tuesday that activist investor Starboard Value LP had taken a 6.6 percent stake in the company.    Tribune's shares were up nearly 2.5 percent at $34.54 in trading after the bell. (http://bit.ly/2lJwGRe)   (Reporting by Rishika Sadam in Bengaluru; Editing by Anil D'Silva)",
        "date": "02212017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Starboard takes 6.6 pct stake in Tribune Media "
    },
    {
        "content": "* Starboard Value LP reports 6.6 pct stake in Tribune Media Co as of Feb 10 - SEC filing",
        "date": "02212017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Starboard Value reports 6.6 pct stake in Tribune Media "
    },
    {
        "content": "* Tribune Media completes sale of Gracenote for $560 million  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media completes sale of Gracenote for $560 million "
    },
    {
        "content": "Jan 25 Tribune Media Co  one of the largest U.S. TV station operators  said on Wednesday Chief Executive Peter Liguori would step down in March.",
        "date": "01252017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Tribune Media CEO to step down in March "
    },
    {
        "content": "* Tribune Media Co - Tribune Media's board of directors will conduct a search working with Korn Ferry to identify a new CEO.",
        "date": "01252017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune media president and ceo peter liguori to step down "
    },
    {
        "content": " ",
        "date": "01102017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Tribune Co shareholders' legal woes over 2007 buyout near end "
    },
    {
        "content": "CHICAGO A New York federal judge has shot down an effort by creditors of the former Tribune Co to claw back $8 billion from shareholders who sold stock in the publisher's 2007 buyout  bringing a long-running legal battle sparked by its bankruptcy closer to an end.",
        "date": "01092017",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Tribune Co shareholders' legal woes over 2007 buyout near end "
    },
    {
        "content": "* Exploring possible maturity extension amendment for all  or a portion  of company' outstanding $2 349 million of term loan indebtedness",
        "date": "01092017",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media exploring possible maturity extension amendment "
    },
    {
        "content": "Advertising tracking company Nielsen Holdings Plc  said it would buy Tribune Media Co's  media data unit  Gracenote  for $560 million.",
        "date": "12202016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Nielsen to buy Tribune's media data business for $560 million "
    },
    {
        "content": "* Tribune will distribute and monetize ATTN: Video content across its television and digital properties",
        "date": "11162016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media and ATTN: Announce strategic partnership and investment "
    },
    {
        "content": "* Tribune Media Co - Expect to continue our cost reduction initiatives into 2017",
        "date": "11092016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media Company reports third quarter 2016 results "
    },
    {
        "content": "* Scripps Networks Interactive and Tribune Media extend food network partnership agreement",
        "date": "10282016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Scripps Networks and Tribune Media extend food network partnership agreement "
    },
    {
        "content": "* Peter M. Kern appointed to Tribune Media Company board of directors",
        "date": "10132016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media Company appoints Peter M. Kern to board "
    },
    {
        "content": "* Closed sale of its Tribune Tower  Los Angeles Times Square and Olympic Plant properties this week",
        "date": "09282016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media closes major real estate sales "
    },
    {
        "content": "* Tribune Broadcasting renews affiliation agreement with Fox Broadcasting Company",
        "date": "09132016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune renews affiliation agreement with Fox Broadcasting Company "
    },
    {
        "content": "* On Sept 14  2016  Tribune Media entered into a settlement agreement with commissioner of U.S. internal revenue service",
        "date": "09152016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media enters settlement agreement with U.S. internal revenue service "
    },
    {
        "content": "* To sell Tribune Tower in Chicago to CIM Group for $205 million paid in cash at closing",
        "date": "08302016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media agrees to sell Tribune Tower to CIM Group "
    },
    {
        "content": "* Q2 revenue $526.1 million versus I/B/E/S view $538.7 million",
        "date": "08092016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media Q2 adjusted EPS $0.42 "
    },
    {
        "content": "NEW YORK  Aug 3 Dish Network Corp  struck a new carriage agreement with the National Football League's NFL Network and NFL Redzone channels  ending a dispute over distribution fees  the satellite TV operator said on Wednesday.",
        "date": "08032016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "UPDATE 1-NFL  Dish reach new carriage deal  ending fee dispute "
    },
    {
        "content": "* Tribune Broadcasting names Kerry Oslund VP  strategy and business development",
        "date": "07142016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Broadcasting names Kerry Oslund VP  strategy and business development "
    },
    {
        "content": "* Responded to Tribune Broadcasting's rejection of proposal to restore blacked-out channels to Dish subscribers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06172016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Dish responds to Tribune's rejection of proposal to restore blacked-out channels "
    },
    {
        "content": "Tribune Media Co  one of the largest U.S. TV station operators  has launched an auction to divest its digital and data business in a sale it hopes will fetch at least $800 million  according to three people familiar with the matter.",
        "date": "06142016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Tribune Media launches auction of digital  data business: sources "
    },
    {
        "content": "June 13 Tribune Media Co chose to take off its television channels from Dish Network Corp's  distribution systems across the United States on Sunday night after they failed to renew their contract  the companies said.",
        "date": "06132016",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Tribune channels taken off Dish network after failure to reach deal "
    },
    {
        "content": "June 14 Tribune Media Co  one of the largest U.S. TV station operators  has launched an auction to divest its digital and data business in a sale it hopes will fetch at least $800 million  according to three people familiar with the matter.",
        "date": "06142016",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Tribune Media launches auction of digital  data business-sources "
    },
    {
        "content": "* Tribune's 42 local stations and cable net wgn america forced off dish",
        "date": "06132016",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune's 42 Local Stations and Cable Net WGN America forced off dish "
    },
    {
        "content": "June 2 Gannett Co Inc seized on a vote on board director nominees by Tribune Publishing Co  shareholders on Thursday to claim that the publisher of the Los Angeles Times and Chicago Tribune should engage with it in acquisition talks.",
        "date": "06022016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "UPDATE 3-Gannett takes heart from Tribune Publishing shareholder vote "
    },
    {
        "content": "* Gannett \"urges\" Tribune stockholders to \"withhold\" votes in connection with Tribune annual meeting",
        "date": "05262016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Gannett \"urges\" Tribune stockholders to \"withhold\" votes from election of Tribune directors "
    },
    {
        "content": "* Soon-Shiong to hold 12.9 pct stake in Tribune   (Adds details on ISS report  information on non-disclosure agreements)",
        "date": "05242016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "UPDATE 3-Tribune gets $70.5 mln investment  rejects Gannett offer "
    },
    {
        "content": "* The CW network and Tribune broadcasting reach long-term affiliation agreement",
        "date": "05232016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-The CW network and Tribune broadcasting reach long-term affiliation agreement "
    },
    {
        "content": "* Omega Advisors Inc ups share stake in Tribune Media Co by 7.6 percent to 3.97 million Class A shares",
        "date": "05162016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Omega Advisors Inc ups share stake in Tribune Media Co "
    },
    {
        "content": "* Q1 earnings per share view $0.27 -- Thomson Reuters I/B/E/S",
        "date": "05102016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "BRIEF-Tribune Media Co reports adj. earnings $0.18/shr "
    },
    {
        "content": "NEW YORK Tribune Publishing Co  said on Wednesday its board unanimously rejected Gannett Co Inc's  unsolicited takeover offer and will proceed instead with a strategic plan to revive its print business and tap growth in digital content.",
        "date": "05042016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "Tribune Publishing rejects Gannett's unsolicited takeover bid "
    },
    {
        "content": "* Tribune Broadcasting renews NBC television affiliation agreement",
        "date": "05042016",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "BRIEF-Press release - tribune broadcasting renews nbc television affiliation agreement "
    },
    {
        "content": "SAN FRANCISCO  April 13 A U.S. judge sentenced journalist Matthew Keys to two years in prison for helping members of the Anonymous hacking collective gain access to a former employer's computers  a spokeswoman for the U.S. Department of Justice said on Wednesday.",
        "date": "04132016",
        "name": "Tribune Media Company",
        "news_type": "topStory",
        "symbol": "TRCO",
        "title": "UPDATE 2-Journalist sentenced to two years for aiding computer hackers "
    },
    {
        "content": "March 29 A U.S. appeals court dismissed a closely watched creditor lawsuit on Tuesday that stemmed from the 2008 bankruptcy of Tribune Co  a day after it took the unusual step of withdrawing a nearly identical opinion because it had been published in error.",
        "date": "03292016",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Court again dismisses creditors' case from Tribune Co bankruptcy "
    },
    {
        "content": "Aug 19 A federal appeals court on Wednesday refused to undo a central component of Tribune Co's bankruptcy plan in a defeat for  prominent hedge fund Aurelius Capital Management LP  which claimed it was short-changed by the reorganization.",
        "date": "08192015",
        "name": "Tribune Media Company",
        "news_type": "normal",
        "symbol": "TRCO",
        "title": "Tribune survives Aurelius court challenge to bankruptcy plan "
    }
]