[
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit:",
        "date": "11162017",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Emerging stocks rally can continue in 2018 - Aviva's Fitzgerald "
    },
    {
        "content": "HONG KONG  Sept 27 A Macau company and Thailand-based firm are looking to raise more than $300 million through what would be the world's largest crypto currency initial coin offering (ICO)  according to a document seen by Reuters  to fund the construction of a floating casino hotel.",
        "date": "09272017",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "UPDATE 1-Macau company in tie-up with Thai firm on $300 mln initial coin offering "
    },
    {
        "content": "HONG KONG  July 28 The China Investment Corp sovereign wealth fund is arranging a 6.8 billion euro ($7.96 billion) loan to fund its acquisition of European warehouse firm Logicor  people with direct knowledge of the matter told Thomson Reuters publication Basis Point.",
        "date": "07282017",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "China's CIC raising $8 bln loan for Logicor acquisition -Basis Point "
    },
    {
        "content": "(Reuters Health) - Non-drug approaches that work best at relieving cancer-related fatigue may differ during and after cancer treatment  according to an analysis of past trials.",
        "date": "06132017",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "Several non-drug options help with fatigue during  after cancer treatment "
    },
    {
        "content": "LONDON  March 31 Syndicated lending in Europe  the Middle East and Africa (EMEA) of US$203bn in the first quarter was 4% higher than the US$196bn in the same period of 2016 as a number of early year acquisition financings helped keep volumes stable  according to Thomson Reuters LPC data.",
        "date": "03312017",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "LPC-EMEA syndicated lending steady at US$203bn in first quarter "
    },
    {
        "content": "Today  Reuters Global Head of Video  Pictures and S.L.E. John Pullman announced new leadership of the Reuters Pictures team. Rickey Rogers has been named Global Head of Reuters Pictures  and Yannis Behrakis takes on the newly-created position of Senior Editor  Special Projects. Read more below:",
        "date": "01122017",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "New Reuters Pictures Leadership "
    },
    {
        "content": "SINGAPORE  Nov 18 Asian bond investors must brace for more volatility at least through the first quarter of 2017 when they are likely get more clarity on whether U.S. President-elect Donald Trump's policies will reflect his anti-globalisation campaign rhetoric  according to State Street Global Advisors.",
        "date": "11182016",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Asian bond markets to stay volatile through Q1  says State Street GA "
    },
    {
        "content": "* Sees extra 2 Fed hikes in next 12-18 mths vs what market expects",
        "date": "11172016",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-GAM's Hatheway says Fed likely to tighten faster than market expects "
    },
    {
        "content": "NEW YORK  Nov 16 Kathleen Gaffney  co-director of investment-grade fixed income at $343 billion investment firm Eaton Vance  said on Wednesday that she was looking to buy high-yield bonds in the cyclical sector after a potential selloff and that she was bullish on high-yield energy names on the view that oil prices would stay within a range of $45 to $60 a barrel.",
        "date": "11162016",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Eaton Vance's Gaffney looking to buy cyclical high-yield bonds "
    },
    {
        "content": "NEW YORK  Nov 16 Protege Partners is planning to provide funding to new hedge funds next year at a time many investors are pulling away from the industry and new managers are eager for cash to start their businesses.",
        "date": "11172016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Protege Partners eyes new deals with hedge funds in 2017 "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit:",
        "date": "11162016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Investec predicts euro to reach parity with dollar in 2017 "
    },
    {
        "content": "HONG KONG  Nov 16 The direction of the dollar  which has surged since the U.S. presidential election  will determine the outlook for Asian equities in the near to medium term  the head of emerging at JPMorgan Asset Management said.",
        "date": "11162016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Dollar direction to dictate Asian equities outlook - JPMorgan Asset Management "
    },
    {
        "content": " ",
        "date": "11142016",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Omega's Einhorn sees Trump's policies boosting stocks "
    },
    {
        "content": "NEW YORK  Nov 15 Financial and healthcare stocks have room to climb significantly  U.S. hedge fund manager Jason Karp said on Tuesday  as he banked on Donald Trump's presidency to lay the groundwork for a favorable stock-picking environment.",
        "date": "11162016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Fund manager Karp: Trump to make stock pickers great again "
    },
    {
        "content": "NEW YORK  Nov 14 Hedge fund Omega Advisors plans to keep managing money for outside clients and expects to post stronger returns even as assets have shrunk after the U.S. government charged its billionaire founder with insider trading two months ago.",
        "date": "11142016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REFILE-REUTERS SUMMIT-Hedge fund Omega to stick with managing money for clients "
    },
    {
        "content": "NEW YORK  Nov 15 U.S. municipal debt investors putting fresh capital to work  should look to short duration bonds while President-elect Donald Trump's new administration works out new tax and fiscal policies  UBS Wealth Management said on Tuesday.",
        "date": "11152016",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Short-term muni bonds to ride out Trump-induced volatility -UBS "
    },
    {
        "content": "NEW YORK  Nov 15 Gregory Peters  senior investment officer at Prudential Fixed Income  on Tuesday said the steep selloff in U.S. bonds following last week's surprise election of Donald Trump to the White House and the Republican sweep of Congress was overdone.",
        "date": "11152016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Prudential's Peters calls U.S. bond selloff overdone "
    },
    {
        "content": "NEW YORK  Nov 15 Michael Vranos  chief executive officer of $6 billion fixed income investor Ellington Management Group  says it is much better to invest in loans taken out by individuals than by companies.",
        "date": "11152016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Ellington's Vranos: Invest in people  not companies "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit:",
        "date": "11152016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Trump win \"a game changer\" for emerging markets says NNIP "
    },
    {
        "content": "NEW YORK  Nov 15 Gregory Peters  senior investment officer at Prudential Fixed Income  on Tuesday said the steep selloff in U.S. bonds following last week's surprise election of Donald Trump to the White House and the Republican sweep of Congress was overdone.",
        "date": "11152016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "RPT-REUTERS SUMMIT-Prudential's Peters says U.S. bond selloff overdone "
    },
    {
        "content": "NEW YORK  Nov 15 Gregory Peters  senior investment officer at Prudential Fixed Income  on Tuesday said the steep selloff in U.S. bonds following last week's surprise election of Donald Trump to the White House and the Republican sweep of Congress was overdone.",
        "date": "11152016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Prudential's Peters says U.S. bond selloff overdone "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit:",
        "date": "11152016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-UBS Wealth CIO bucks consensus with pro-euro call for 2017 "
    },
    {
        "content": "HONG KONG  Nov 15 AIA Group Ltd  the world's third-largest life insurer by market value  is keen to explore investment opportunities in U.S. infrastructure arising from President-elect Donald Trump's plans to boost spending  a top executive said.",
        "date": "11152016",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "REUTERS SUMMIT-Insurer AIA eyes U.S. infrastructure investments after Trump "
    },
    {
        "content": "Oct 21 Kristian Orssten has been promoted to head of EMEA debt capital markets at JP Morgan  according to an internal memo seen by Thomson Reuters LPC.",
        "date": "10212016",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "REFILE-MOVES-JP Morgan promotes Orssten  rejigs lev fin team "
    },
    {
        "content": " (Story refiles from August 3rd instance to add new paragraph 5)",
        "date": "08122016",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "Women with common ovary problem may not get recommended tests "
    },
    {
        "content": " (This June 30th story was refiled to fix link at the bottom of the story)",
        "date": "07292016",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "Stretching may ease women's depression and menopause symptoms "
    },
    {
        "content": "* Thomson Reuters Corp files for debt shelf of up to $3 billion - sec filing  Source text: 1.usa.gov/1WGq0MG Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "03222016",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "BRIEF-Thomson Reuters Corp files for debt shelf of up to $3 bln "
    },
    {
        "content": "(Reuters Health) - Race appears to affect the odds that a child or teen with appendicitis  a painful condition requiring surgery  will get pain medication  particularly opioid medication  according to a new study.",
        "date": "09162015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "Black children less likely to get pain drugs for appendicitis "
    },
    {
        "content": "NEW YORK U.S. hospitals urged antitrust regulators this week to consider whether health insurer Anthem Inc's   planned acquisition of rival Cigna Corp  would boost healthcare costs.",
        "date": "08062015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "U.S. hospitals urge DOJ antitrust probe of Anthem-Cigna deal "
    },
    {
        "content": "Health insurer Cigna Corp  which agreed last week to be bought by Anthem Inc for $47 billion  said on Thursday that medical services use was low in the second quarter  helping to keep costs in check and beat Wall Street profit estimates.",
        "date": "07302015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "Health insurer Cigna says second-quarter medical costs stay low; profit beats "
    },
    {
        "content": "U.S. health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc and could announce a roughly $48 billion deal as early as this week  two people familiar with the matter said on Wednesday. | Video ",
        "date": "07232015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "Anthem set to announce deal for Cigna this week: sources "
    },
    {
        "content": "Health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc and could announce a roughly $48 billion deal as early as this week  according to a person familiar with the matter.",
        "date": "07222015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "Anthem set to announce deal for Cigna this week: source "
    },
    {
        "content": "Cigna Corp  reported a better-than-expected quarterly profit  helped by an increase in premiums and fees in the health insurer's commercial business  which added more members.",
        "date": "04302015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "Cigna profit beats estimate as it adds more customers "
    },
    {
        "content": "(Reuters Health) - Providing no- or low-cost birth control pills over the counter may reduce costs and prevent up to a quarter of unplanned pregnancies  researchers say.",
        "date": "03042015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "'Over the counter' birth control pills might save public money "
    },
    {
        "content": "WASHINGTON John Whitehead  a former senior partner and co-chairman of Goldman Sachs who helped make it a top-tier Wall Street firm and led its international expansion  has died  the investment bank said on Saturday. He was 92.",
        "date": "02072015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "John Whitehead  former leader of Goldman Sachs  dies at 92 "
    },
    {
        "content": "WASHINGTON Dr. Margaret Hamburg  who as commissioner of the U.S. Food and Drug Administration (FDA) for almost six years has overseen public health initiatives ranging from tobacco control and food safety to personalized medicine and drug approvals  is stepping down  the agency said on Thursday.",
        "date": "02052015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "U.S. FDA Commissioner Margaret Hamburg to step down "
    },
    {
        "content": "Health insurer Cigna Corp  reported a better-than-expected quarterly adjusted profit from operations  driven by increased premium revenue and improved management of medical costs.",
        "date": "02052015",
        "name": "Thomson Reuters Corp",
        "news_type": "normal",
        "symbol": "TRI",
        "title": "Cigna fourth-quarter profit beats Street on higher premium revenue "
    },
    {
        "content": "WASHINGTON U.S. Senator Marco Rubio is preparing to launch a bid for the 2016 Republican presidential nomination  signing on a prominent fundraiser and planning trips to early voting states  a Rubio  adviser said on Friday.",
        "date": "01232015",
        "name": "Thomson Reuters Corp",
        "news_type": "topStory",
        "symbol": "TRI",
        "title": "Republican Senator Marco Rubio preparing for 2016 run: ABC "
    }
]