[
    {
        "content": "CALGARY  Alberta/LINCOLN  Neb. A major oil spill on the Keystone pipeline in South Dakota helped push U.S. crude prices higher on Friday  while fueling opposition to another pipeline project by owner TransCanada Corp that faces a crunch decision in Nebraska next week.",
        "date": "11182017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Keystone pipeline spill pushes oil higher  fuels TransCanada opponents "
    },
    {
        "content": "CALGARY  Alberta No date has been set yet for a restart of TransCanada Corp's Keystone pipeline  which was shut down on Thursday after a 5 000-barrel crude oil leak in South Dakota  a company spokesman said on Friday.",
        "date": "11172017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "No date set yet for Keystone pipeline restart: TransCanada spokesman "
    },
    {
        "content": "CALGARY  Alberta/LINCOLN  Neb.  Nov 17 A major oil spill on the Keystone pipeline in South Dakota helped push U.S. crude prices higher on Friday  while fueling opposition to another pipeline project by owner TransCanada Corp that faces a crunch decision in Nebraska next week.",
        "date": "11172017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 3-Keystone pipeline spill pushes oil higher  fuels TransCanada opponents "
    },
    {
        "content": "CALGARY  Alberta  Nov 17 No date has been set yet for a restart of TransCanada Corp's Keystone pipeline  which was shut down on Thursday after a 5 000-barrel crude oil leak in South Dakota  a company spokesman said on Friday.",
        "date": "11172017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "No date set yet for Keystone pipeline restart - TransCanada spokesman "
    },
    {
        "content": "CALGARY  Alberta/LINCOLN  Nebraska Nov 17 (Reuters) - C anadian heavy crude prices and TransCanada Corp shares slid on Friday  the day after the Keystone pipeline spilled 5 000 barrels of oil in South Dakota as officials in Nebraska mulled whether to approve another pipeline proposed by the company.",
        "date": "11172017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-South Dakota pipeline spill hits TransCanada shares  Canada crude price "
    },
    {
        "content": "* Says needs approval from U.S. authorities to restart Keystone pipeline shut after spill in Amherst  South Dakota Source text for Eikon: Further company coverage: (Reporting by Ethan Lou)",
        "date": "11172017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada says needs U.S. approval to restart shut Keystone pipeline "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp  shut part of its Keystone oil pipeline system after a 5 000-barrel leak in South Dakota  the company said on Thursday  four days before neighboring Nebraska was set to decide on the company's long-delayed Keystone XL pipeline.",
        "date": "11172017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Keystone oil pipeline leaks in South Dakota  as Nebraska weighs XL "
    },
    {
        "content": "CALGARY  Alberta  Nov 16 TransCanada Corp shut part of its Keystone oil pipeline system after a 5 000-barrel leak in South Dakota  the company said on Thursday  four days before neighboring Nebraska was set to decide on the company's long-delayed Keystone XL pipeline.",
        "date": "11162017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-Keystone oil pipeline leaks in S.Dakota  as Nebraska weighs XL "
    },
    {
        "content": "CALGARY  Alberta  Nov 17 The discount on Canadian heavy crude surged wider on Friday as traders waited for news on how long TransCanada Corp's 590 000 barrel per day Keystone pipeline would be shut down following a spill in South Dakota on Thursday.",
        "date": "11172017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Discount on Canadian heavy crude deepens after pipeline spill "
    },
    {
        "content": "CALGARY  Alberta  Nov 16 TransCanada Corp has shut part of its Keystone pipeline after 5 000 barrels of oil leaked in Amherst  South Dakota  the company said on Thursday  four days before the state of Nebraska is due to decide on an expansion of the system.",
        "date": "11162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada's Keystone pipeline shut after 5 000-barrel leak in U.S. "
    },
    {
        "content": "* Safely shut down keystone pipeline at about 6 a.m. CST after drop in pressure was detected in operating system resulting from an oil leak",
        "date": "11162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada responds to oil leak in Amherst  South Dakota "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp  has received adequate support from crude oil shippers on its long-delayed Keystone XL pipeline  but the parties still need to work out specific terms  the company said on Thursday as it reported a rise in quarterly earnings.",
        "date": "11092017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Keystone XL pipe has adequate commercial support: TransCanada "
    },
    {
        "content": "* Transcanada corp - ‍announced appointment of a new independent director  Thierry Vandal​ Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada appoints new independent director "
    },
    {
        "content": "CALGARY  Alberta  Nov 9 TransCanada Corp has received adequate support from crude oil shippers on its long-delayed Keystone XL pipeline  but the parties still need to work out specific terms  the company said on Thursday as it reported a rise in quarterly earnings.",
        "date": "11092017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 3-Keystone XL pipe has adequate commercial support -TransCanada "
    },
    {
        "content": "* Transcanada reports solid third quarter 2017 financial results; diversified  low-risk business strategy continues to drive performance",
        "date": "11092017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada reports Q3 EPS c$0.70 "
    },
    {
        "content": "Nov 9 TransCanada Corp  on Thursday reported a third-quarter profit compared with a loss a year ago  when the pipeline operator took an after-tax goodwill impairment charge of C$656 million.",
        "date": "11092017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada reports profit for third quarter "
    },
    {
        "content": "Oct 30 Canadian oil producer Cenovus Energy Inc on Monday named Alex Pourbaix  formerly of pipeline company TransCanada Corp  as its new chief executive  tapping another leader without direct technical experience even as some investors and analysts were expecting change.",
        "date": "10302017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-Cenovus names TransCanada veteran Pourbaix as new CEO "
    },
    {
        "content": "CALGARY  Alberta  Nov 2 Canadian Natural Resources Ltd has increased its  volume commitment on TransCanada Corp's Keystone XL pipeline by about 46 percent to 175 000 barrels per day (bpd)  Canadian Natural President Steve Laut told Reuters on Thursday.",
        "date": "11022017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-Canadian Natural commits to shipping more crude on Keystone XL pipeline "
    },
    {
        "content": "* Transcanada Corp is pressing the Alberta government to buy capacity in its Keystone XL pipeline - Bloomberg  citing sources Source text : https://bloom.bg/2z8EXm2 Further company coverage:",
        "date": "11022017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada presses Alberta to buy Keystone capacity - Bloomberg "
    },
    {
        "content": "* TransCanada -‍Canadian Mainline began shipping additional WCSB natural gas to markets in Eastern Canada  U.S. as part of long-term fixed price service Source text for Eikon: Further company coverage:",
        "date": "11012017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada begins shipping more WCSB natural gas to eastern markets "
    },
    {
        "content": "* Says ‍launched Open Season to solicit commitments for transportation of crude oil on Marketlink from Cushing  Oklahoma to U.S. Gulf coast​",
        "date": "11012017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada launches binding Open Season for Marketlink "
    },
    {
        "content": "Canadian pipeline operator TransCanada Corp  has agreed to sell its solar energy portfolio for C$540 million ($426 million) to focus on its C$24 billion worth of other core projects  including its recently purchased Columbia natural gas network  the company said on Wednesday.",
        "date": "10252017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada to sell solar assets  focus on C$24 billion capital program "
    },
    {
        "content": "NEW YORK TransCanada Corp is seeking to raise the temporary discounted spot rate for light crude on its 700 000 barrel-per-day Marketlink pipeline effective Dec. 1  according to a Federal Energy Regulatory Commission filing on Thursday.",
        "date": "10262017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada seeks to raise spot tariffs on Marketlink oil pipeline: FERC "
    },
    {
        "content": "Oct 25 Canadian pipeline operator TransCanada Corp has agreed to sell its solar energy portfolio for C$540 million ($426 million) to focus on its C$24 billion worth of other core projects  including its recently purchased Columbia natural gas network  the company said on Wednesday.",
        "date": "10252017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada to sell solar assets  focus on C$24 bln capital program "
    },
    {
        "content": "* Transcanada announces agreement to sell Ontario Solar Portfolio",
        "date": "10252017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada announces agreement to sell Ontario Solar Portfolio "
    },
    {
        "content": "NEW YORK  Oct 26 TransCanada Corp is seeking to raise the temporary discounted spot rate for light crude on its 700 000 barrel-per-day Marketlink pipeline effective Dec. 1  according to a Federal Energy Regulatory Commission filing on Thursday.",
        "date": "10262017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada seeks to raise spot tariffs on Marketlink oil pipeline -FERC "
    },
    {
        "content": "Oct 25 Canadian pipeline operator TransCanada Corp said on Wednesday it would sell its Ontario-based solar energy portfolio to Axium Infinity Solar LP for about C$540 million ($426 million).",
        "date": "10252017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to sell Ontario solar assets for C$540 mln "
    },
    {
        "content": "CALGARY  Alberta  Oct 18 TransCanada Corp's Keystone crude oil pipeline is shut down after a storm on Tuesday night in southeast Alberta and southwest Saskatchewan  market sources said on Wednesday.",
        "date": "10182017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada's Keystone crude pipeline shut down after storm -sources "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp abandoned its C$15.7 billion ($12.52 billion) cross-country Energy East pipeline on Thursday amid mounting regulatory hurdles  dealing a blow to the country's oil export ambitions.",
        "date": "10052017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Facing tougher regulations  TransCanada scraps $12 billion oil pipeline "
    },
    {
        "content": "CALGARY  Alberta  Oct 5 TransCanada Corp abandoned its C$15.7 billion ($12.52 billion) cross-country Energy East pipeline on Thursday amid mounting regulatory hurdles  dealing a blow to the country's oil export ambitions.",
        "date": "10052017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 4-Facing tougher regulations  TransCanada scraps $12 bln oil pipeline "
    },
    {
        "content": "Oct 5 TransCanada Corp said on Thursday it would abandon its Energy East and Eastern Mainline pipeline projects  following tough review by Canada's energy regulator.",
        "date": "10052017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to abandon Energy East and Eastern Mainline projects "
    },
    {
        "content": "* TransCanada announces termination of Energy East pipeline and Eastern Mainline projects",
        "date": "10052017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada announces termination of Energy East pipeline and Eastern Mainline projects "
    },
    {
        "content": "CALGARY  Alberta A Canadian regulator's plan to assess indirect carbon emissions when considering TransCanada Corp's  Energy East pipeline application sets a harsh precedent for future projects  the Alberta government and supporters of the pipeline said on Friday.",
        "date": "09082017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canada regulator's plan for review of Energy East pipeline under fire "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp  seeks to suspend the application for its Energy East pipeline for 30 days and may abandon the project  the company said on Thursday  weeks after Canada's National Energy Board (NEB) announced a tougher review process.",
        "date": "09082017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada may abandon Energy East pipe facing tougher review "
    },
    {
        "content": "CALGARY  Alberta  Sept 7 TransCanada Corp seeks to suspend the application for its Energy East pipeline for 30 days and may abandon the project  the company said on Thursday  weeks after Canada's National Energy Board (NEB) announced a tougher review process.",
        "date": "09082017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada may abandon Energy East pipe facing tougher review "
    },
    {
        "content": "CALGARY  Alberta  Sept 7 TransCanada Corp will suspend the application for its Energy East pipeline project for 30 days  the company said on Thursday  weeks after Canada's National Energy Board (NEB) regulator announced a tougher review process.",
        "date": "09072017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada pauses Energy East pipe in face of tougher review "
    },
    {
        "content": "CALGARY  Alberta  Sept 6 TransCanada Corp will extend the open season on its Keystone pipeline system by a month because of the unprecedented flooding and damage caused by Hurricane Harvey slamming into the Gulf Coast region in late August  the company said on Wednesday.",
        "date": "09062017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Harvey damage prompts TransCanada to extend pipeline open season "
    },
    {
        "content": "* Transcanada seeks 30-day suspension of Energy East Pipeline and Eastern Mainline Project applications",
        "date": "09072017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada seeks 30-day suspension of Energy East Pipeline and Eastern Mainline Project applications "
    },
    {
        "content": "* Transcanada Corp - ‍extension of keystone system open season to October 26  2017​",
        "date": "09062017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada to extend Keystone System open season "
    },
    {
        "content": "CALGARY  Alberta  Aug 23 The upcoming review of TransCanada Corp's proposed Energy East pipeline will consider its potential indirect contributions to greenhouse gas emissions  Canada's National Energy Board (NEB) regulator said on Wednesday.",
        "date": "08232017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada to consider indirect emissions for TransCanada Energy East pipe "
    },
    {
        "content": "CALGARY  Alberta  Aug 23 The review of TransCanada Corp's proposed Energy East pipeline will consider its indirect greenhouse gas contributions  Canada's National Energy Board (NEB) regulator said on Wednesday  expanding the scope of the assessment.",
        "date": "08232017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-Canada to consider indirect emissions for TransCanada Energy East pipe "
    },
    {
        "content": "LINCOLN  Neb. An attorney representing opponents of TransCanada Corp's proposed Keystone XL pipeline grilled the company's representatives during hearings in Nebraska on Monday  in proceedings that mark the last big hurdle for the long-delayed project.",
        "date": "08072017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Keystone XL pipeline representatives quizzed in Nebraska hearings "
    },
    {
        "content": "LINCOLN  Neb. Nebraska regulators opened a final hearing on TransCanada Corp’s  proposed Keystone XL pipeline on Monday  a week-long proceeding that marks the last big hurdle for the long-delayed project after President Donald Trump approved it in March. | Video ",
        "date": "08082017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Keystone XL pipeline fate in balance as Nebraska opens hearings "
    },
    {
        "content": "LINCOLN  Neb.  Aug 10 Opponents of the Keystone XL pipeline vowed on Thursday to block construction of the controversial project if Nebraska regulators approve the proposed route later this year.",
        "date": "08102017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-Keystone XL opponents vow long fight as Nebraska hearing concludes "
    },
    {
        "content": "LINCOLN  Neb.  Aug 7 An attorney representing opponents of TransCanada Corp's proposed Keystone XL pipeline grilled the company's representatives during hearings in Nebraska on Monday  in proceedings that mark the last big hurdle for the long-delayed project.",
        "date": "08072017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-Keystone XL pipeline representatives quizzed in Nebraska hearings "
    },
    {
        "content": "WASHINGTON  Aug 4 Nebraska regulators weighing the fate of TransCanada Corp’s proposed Keystone XL pipeline have ruled that opponents of the project cannot use one of their best arguments against it in final hearings next week: that America does not need the oil.",
        "date": "08042017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Nebraska regulators block testimony ahead of Keystone XL hearings "
    },
    {
        "content": "LINCOLN  Neb.  Aug 7 Nebraska regulators will hear final arguments for and against TransCanada Corp’s proposed Keystone XL pipeline this week before deciding whether to approve its route later this year  the last big hurdle for the long-delayed project after President Donald Trump gave it federal approval.",
        "date": "08072017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Keystone XL pipeline fate in balance as Nebraska opens hearings "
    },
    {
        "content": "WASHINGTON/CALGARY  Aug 4 Nebraska regulators weighing the fate of TransCanada Corp’s proposed Keystone XL pipeline have ruled that opponents of the project cannot use one of their best new arguments against it in final hearings next week: that America does not need the oil.",
        "date": "08042017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-Nebraska regulators block testimony ahead of Keystone XL hearings "
    },
    {
        "content": "CALGARY  Alberta  Aug 4 Petronas' decision to cancel its Pacific NorthWest LNG project is a blow to the growth outlook for Canada's largest shale play  eliminating a potentially huge source of future gas demand.",
        "date": "08042017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canceled LNG project casts shadow over Canada's biggest shale play "
    },
    {
        "content": "Aug 4 Futures pointed to a modestly higher opening for Canada's main stock index on Friday as investors awaited the monthly jobs report.",
        "date": "08042017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CANADA STOCKS-Futures little changed ahead of July jobs report "
    },
    {
        "content": "TransCanada Corp  Canada's No.2 pipeline operator  will make a final investment decision on its Keystone XL project by December  the company said on Friday as it reported a better-than-expected profit.",
        "date": "07282017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada to make final decision on Keystone XL by December "
    },
    {
        "content": "July 27 TransCanada Corp launched an open season on Thursday for additional commitments for the transportation of crude oil on the Keystone pipeline system  according to a company statement.",
        "date": "07272017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada seeks additional commitments on Keystone pipeline system "
    },
    {
        "content": "July 28 TransCanada Corp   Canada's No.2 pipeline operator  will make a final investment decision on its Keystone XL project by December  the company said on Friday as it reported a better-than-expected profit.",
        "date": "07282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada to make final decision on Keystone XL by December "
    },
    {
        "content": "July 27 TransCanada Corp launched an open season on Thursday for additional commitments for the transportation of crude oil on the Keystone pipeline system  according to a company statement.",
        "date": "07272017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada seeks additional commitments on Keystone pipeline system "
    },
    {
        "content": "* Transcanada launches binding open season for keystone pipeline system",
        "date": "07272017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada launches binding open season for Keystone Pipeline system "
    },
    {
        "content": "* Transcanada responds to PNW LNG decision; company to be reimbursed for full costs to advance PRGT project",
        "date": "07252017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada responds to PNW LNG decision "
    },
    {
        "content": "The U.S. Federal Energy Regulatory Commission (FERC) issued an environmental impact statement for TransCanada Corp's Mountaineer and Gulf XPress natural gas pipeline projects in West Virginia  Kentucky  Tennessee and Mississippi.",
        "date": "07282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "U.S. FERC issues TransCanada Mountaineer pipeline report "
    },
    {
        "content": "* TransCanada reports strong second quarter 2017 financial results; performance highlights diversified  low risk business strategy",
        "date": "07282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada reports Q2 non-GAAP earnings of C$0.76/shr "
    },
    {
        "content": "* TransCanada Corp - ‍declared a quarterly dividend of $0.625 per common share for quarter​ Source text for Eikon: Further company coverage:",
        "date": "07282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada Corp - ‍declared a quarterly dividend of $0.625 per common share for quarter​ "
    },
    {
        "content": "July 28 TransCanada Corp   Canada's No.2 pipeline operator  reported a quarterly profit on Friday which more than doubled  helped by strength in its natural gas and liquids pipelines units.",
        "date": "07282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada quarterly profit more than doubles "
    },
    {
        "content": "* TransCanada Corp - ‍approximately $160 million project is underpinned by 15-year contracts​",
        "date": "07282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada to expand Canadian mainline capacity through new investment "
    },
    {
        "content": "CALGARY  Alberta  July 8 Canadian lender Desjardins is considering no longer funding energy pipelines  a spokesman said on Saturday  citing concerns about the impact such projects may have on the environment.",
        "date": "07092017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada's Desjardins may stop pipeline loans  cites environment "
    },
    {
        "content": "CALGARY  Alberta  July 5 Canada's energy regulator should shift the burden for ensuring quality of oil-and-gas pipeline parts from operators and move it more to manufacturers  according to an official report viewed by Reuters.",
        "date": "07052017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-Canada's new pipeline parts rules to lessen burden on operators "
    },
    {
        "content": "CALGARY  Alberta  July 5 Canada's energy regulator should shift the burden for ensuring quality of oil-and-gas pipeline parts more to manufacturers and away from operators  according to an official report viewed by Reuters.",
        "date": "07052017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada's new pipeline parts rules to lessen burden on operators "
    },
    {
        "content": "NEW YORK U.S. pipeline operators are selling their underused space at steep discounts to keep crude flowing - angering shippers and distorting an already opaque market for oil trading.",
        "date": "06282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Oil pipeline firms' discounts rile clients  roil markets "
    },
    {
        "content": "* Transcanada -  established ATM program allowing co to issue common shares from treasury having an aggregate gross sales price of up to $1 billion to public Source text for Eikon: Further company coverage:",
        "date": "06272017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada establishes at-the-market equity program "
    },
    {
        "content": "OTTAWA  June 29 Canada wants a single federal authority to assess the potential impact of oil pipelines and mines  officials said on Thursday  a move that could help quell protests that have blocked a series of major projects.",
        "date": "06292017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada says it wants single body to assess major energy projects "
    },
    {
        "content": "June 14 TransCanada Corp  Canada's No.2 pipeline operator  said on Wednesday it would invest about C$2 billion ($1.5 billion)between now and 2021 to expand its natural gas gathering pipeline in western Canada.",
        "date": "06142017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada to spend C$2 bln to expand gas pipeline capacity "
    },
    {
        "content": "* Files for stock shelf of up to $1.0 billion - sec filing Source text for Eikon: Further company coverage:",
        "date": "06132017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada files for stock shelf of up to $1 bln "
    },
    {
        "content": "* Transcanada invests $2 billion to expand NGTL system capacity",
        "date": "06142017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada invests $2 bln to expand NGTL system capacity "
    },
    {
        "content": "* TransCanada Corp - intends to wind down its transcanada power marketing ltd (tcpm) operations",
        "date": "06052017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada completes sale of U.S. Northeast power assets "
    },
    {
        "content": "* TransCanada Corp says approval by its shareholders of appointment of 12 nominees as directors of TransCanada Source text for Eikon: Further company coverage:",
        "date": "05052017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada says approval by its shareholders of appointment of 12 nominees as directors "
    },
    {
        "content": "* Transcanada announces agreements to sell interests in Iroquois and Pngts to Tc Pipelines LP",
        "date": "05042017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada announces agreements to sell interests in Iroquois and Pngts to Tc Pipelines LP "
    },
    {
        "content": "CALGARY  Alberta  May 5 Lower oil prices and alternative export routes are complicating negotiations for shipper commitment for TransCanada Corp's Keystone XL pipeline project  and the company does not have a firm deadline for concluding the talks  Chief Executive Russell Girling said on Friday.",
        "date": "05052017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada Keystone XL shipper talks complicated  CEO says as profit up "
    },
    {
        "content": "Lower oil prices and alternative export routes are complicating negotiations for shipper commitment for TransCanada Corp's  Keystone XL pipeline project  and the company does not have a firm deadline for concluding the talks  Chief Executive Russell Girling said on Friday.",
        "date": "05052017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada Keystone XL shipper talks complicated  CEO says as profit up "
    },
    {
        "content": "TransCanada Corp   said on Thursday it would sell its remaining 49.3 percent interest in Iroquois Gas Transmission System LP and an 11.8 percent stake in Portland Natural Gas Transmission System (PNGTS) for $765 million.",
        "date": "05042017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to sell interests in two gas pipelines for $765 million "
    },
    {
        "content": "May 5 TransCanada Corp's quarterly profit more than doubled  as Canada's No. 2 pipeline operator incurred lower charges.",
        "date": "05052017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada's quarterly profit more than doubles "
    },
    {
        "content": "* Transcanada reports first quarter 2017 financial results; strong results build upon transformational 2016",
        "date": "05052017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada reports Q1 earnings per share C$0.74 "
    },
    {
        "content": "* Pembina to pay as much as C$1.52 bln in cash  99.5 mln in shares",
        "date": "05012017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 5-Pembina buys Veresen for $7.1 bln as pipeline sector consolidates "
    },
    {
        "content": "May 4 TransCanada Corp  said on Thursday it would sell its remaining 49.3 percent interest in Iroquois Gas Transmission System LP and an 11.8 percent stake in Portland Natural Gas Transmission System (PNGTS) for $765 million.",
        "date": "05042017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to sell interests in two gas pipelines for $765 mln "
    },
    {
        "content": "* Pembina to pay as much as C$1.52 bln in cash  99.5 mln in shares",
        "date": "05012017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CORRECTED-UPDATE 3-Pembina adds natgas infrastructure with $7.1 bln Veresen buy "
    },
    {
        "content": "WASHINGTON Several environmental groups filed lawsuits against the Trump administration on Thursday to challenge its decision to approve construction of TransCanada Corp's controversial Keystone XL crude oil pipeline.",
        "date": "03302017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Environmental groups sue Trump administration for approving Keystone pipeline "
    },
    {
        "content": "WASHINGTON  March 30 Several environmental groups filed lawsuits against the Trump administration on Thursday to challenge its decision to approve construction of TransCanada Corp's controversial Keystone XL crude oil pipeline.",
        "date": "03302017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 3-Environmental groups sue Trump administration for approving Keystone pipeline "
    },
    {
        "content": "CALGARY  Alberta  March 24 Transcanada Corp's  legal challenge against the United States over its past rejection of Keystone XL pipeline has been dropped  the website for the arbitration court showed on Friday  minutes after President Donald Trump formally green-lit the project.",
        "date": "03242017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada Keystone XL rejection lawsuit dropped - arbitrator "
    },
    {
        "content": "CALGARY  Alberta Transcanada Corp's  legal challenge against the United States over its past rejection of Keystone XL pipeline has been dropped  the website for the arbitration court showed on Friday  minutes after President Donald Trump formally green-lit the project.",
        "date": "03242017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada Keystone XL rejection lawsuit dropped: arbitrator "
    },
    {
        "content": "TORONTO  March 24 Canada's main stock index rose on Friday  led by financial and energy shares as oil prices gained and after TransCanada Corp said the U.S. Department of State issued a presidential permit for the construction of the Keystone XL oil pipeline.",
        "date": "03242017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CANADA STOCKS-TSX rises as TransCanada climbs after Keystone approval "
    },
    {
        "content": "TORONTO  March 24 Canada's main stock index rose on Friday  led by financial and energy shares as oil prices gained and after TransCanada Corp said the U.S. Department of State issued a presidential permit for the construction of the Keystone XL oil pipeline.",
        "date": "03242017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CANADA STOCKS-TSX rises  led by financials and TransCanada "
    },
    {
        "content": "TransCanada Corp  said on Friday the U.S. Department of State issued a presidential permit for the construction of the Keystone XL oil pipeline  a project blocked by former President Barack Obama.",
        "date": "03242017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada gets presidential permit for Keystone XL pipeline "
    },
    {
        "content": "March 24 The United States has issued a presidential permit for TransCanada Corp's Keystone XL oil pipeline  the Canadian company said on Friday  ending a years-long battle between environmentalists and the industry over whether Washington  should approve it.",
        "date": "03242017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-Trump administration grants permit for Keystone XL pipeline -TransCanada "
    },
    {
        "content": "CALGARY  Alberta  March 20 Transcanada Corp  has secured shippers' commitment for a pipeline associated with Malaysian state-owned oil company Petronas' pending Pacific NorthWest liquefied natural gas (LNG) terminal in western Canada and targets 2018 for construction  the company said on Monday.",
        "date": "03202017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada seeks pipe approval linked to Petronas LNG terminal "
    },
    {
        "content": "WASHINGTON  March 24 U.S. President Donald Trump will make an announcement on TransCanada Corp's  Keystone XL pipeline later on Friday morning  White House spokesman Sean Spicer said in a post on Twitter.",
        "date": "03242017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Trump to make announcement on Keystone XL -White House spokesman "
    },
    {
        "content": "March 24 TransCanada Corp said on Friday the U.S. Department of State issued a presidential permit for the construction of the Keystone XL Pipeline.",
        "date": "03242017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada gets presidential permit for Keystone XL "
    },
    {
        "content": "CALGARY  Alberta  March 20 Transcanada Corp  has secured shipper commitment for a pipeline for Malaysian state-owned oil company Petronas's Pacific NorthWest liquefied natural gas (LNG) terminal in western Canada and will seek approval for early construction  the company said on Monday.",
        "date": "03202017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada seeks Canada pipe approval for Petronas LNG terminal "
    },
    {
        "content": "* U.s. Department of state has signed and issued a presidential permit to construct Keystone XL pipeline.",
        "date": "03242017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada receives presidential permit for Keystone XL "
    },
    {
        "content": "CALGARY  Alberta  March 13 Shippers have taken up Transcanada Corp's new flat-toll offer to move natural gas on its Mainline pipe from western to central Canada  the company said on Monday.",
        "date": "03132017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Shippers take up Transcanada offer to move natgas on Mainline "
    },
    {
        "content": "March 15 TransCanada Corp plans to build a new crude oil storage facility in Cushing  Oklahoma in partnership with M2 Infrastructure LLC  an affiliate of U.S. private equity firm Lone Star Capital  M2 said on Wednesday.",
        "date": "03152017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada  M2 to build new crude storage facility in Cushing "
    },
    {
        "content": "CALGARY  Alberta  March 13 Shippers have taken up Transcanada Corp's sweetened offer to move natural gas on its Mainline pipeline  the company said on Monday  granting Canada's remote western plays a boost against more easily accessible American counterparts.",
        "date": "03142017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-Shippers back Transcanada Mainline in boost for Canada natgas "
    },
    {
        "content": "* Transcanada seeks approval to proceed with north montney mainline project",
        "date": "03202017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada seeks approval to proceed with North Montney Mainline Project "
    },
    {
        "content": "* Transcanada announces successful canadian mainline open season results",
        "date": "03132017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada announces Canadian mainline open season results "
    },
    {
        "content": "* M2 Infrastructure - entered into MOU with Transcanada to pursue construction of 6.2 million barrels of crude oil storage at Transcanada's terminal in Oklahoma",
        "date": "03152017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-M2 Infrastructure says entered into MOU with Transcanada to pursue construction of crude oil storage "
    },
    {
        "content": "WASHINGTON U.S. Secretary of State Rex Tillerson has recused himself from issues related to TransCanada Corp's  application for a permit for the Keystone XL pipeline  the State Department said in a letter on Thursday to the environmental group Greenpeace.",
        "date": "03102017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Tillerson has recused himself from Keystone pipeline issues -State Dept "
    },
    {
        "content": "WASHINGTON U.S. Secretary of State Rex Tillerson has recused himself from issues related to TransCanada Corp's application for a permit for the Keystone XL pipeline  the State Department said in a letter on Thursday to the environmental group Greenpeace.",
        "date": "03102017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Tillerson has recused himself from Keystone pipeline issues: State Dept. "
    },
    {
        "content": "WASHINGTON  March 9 U.S. Secretary of State Rex Tillerson has recused himself from issues related to TransCanada Corp's application for a permit for the Keystone XL pipeline  the State Department said in a letter on Thursday to the environmental group Greenpeace.",
        "date": "03102017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-Tillerson has recused himself from Keystone pipeline issues -State Dept "
    },
    {
        "content": "CALGARY  Alberta Canadian Natural Resources Ltd is likely interested in shipping natural gas under TransCanada's new flat toll for its Mainline system  but it has not made a firm decision  Canadian Natural's chief executive officer said.",
        "date": "03022017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canadian Natural says it is likely open to TransCanada natgas shipping "
    },
    {
        "content": "CALGARY  Alberta  Feb 28 TransCanada Corp  has suspended a $15 billion NAFTA suit filed against the United States over the Keystone XL pipeline  the company said on Tuesday  after U.S. President Donald Trump approved the project last month.",
        "date": "02282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada's $15 bln U.S. Keystone XL NAFTA suit suspended "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp  has suspended a $15 billion NAFTA suit filed against the United States over the Keystone XL pipeline  the company said on Tuesday  after U.S. President Donald Trump approved the project last month.",
        "date": "02282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada's $15 billion U.S. Keystone XL NAFTA suit suspended "
    },
    {
        "content": "CALGARY  Alberta  Feb 28 Transcanada Corp's  legal challenge against the United States over the proposed Keystone XL pipeline project's past rejection has been suspended for one month  the website of the International Centre for the Settlement of Investment Disputes showed on Tuesday.",
        "date": "02282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Transcanada's U.S. Keystone XL lawsuit suspended -arbitration court "
    },
    {
        "content": "* Has approved Towerbirch natural gas pipeline expansion project by a Transcanada Corp subsidiary",
        "date": "02282017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Canada's British Columbia approves Transcanada Towerbirch project "
    },
    {
        "content": "CALGARY  Alberta  Feb 27 TransCanada Corp   has offered to sell stakes in two U.S. natural gas pipelines to fund other projects including its recently purchased Columbia natural gas network  the Calgary-based company said on Monday.",
        "date": "02272017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada to sell two U.S. pipeline stakes to raise funds "
    },
    {
        "content": "Feb 27 TransCanada Corp  said it has offered to sell stakes in two natural gas pipelines that serve the U.S. Northeast to TC PipeLines LP  U.S.-based master limited partnership in which it holds a 27 percent stake.",
        "date": "02272017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to sell stakes in two U.S. Northeast pipelines "
    },
    {
        "content": "* TC Pipelines  LP announces 2016 fourth quarter and year end financial results",
        "date": "02272017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TC Pipelines LP posts Q4 earnings per unit $0.70 "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp said on Wednesday it plans to offer a flat toll on its Mainline system that takes natural gas from western Canada to southern Ontario  three months after shippers balked at the previous varied toll structure that they saw as too high.",
        "date": "02222017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada launches open season for flat toll on natgas Mainline "
    },
    {
        "content": "* TransCanada announces offer to sell 49.3 pct interest in Iroquois and remaining 11.8 pct interest in PNGTS to TC Pipelines  LP",
        "date": "02272017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada offers to sell interest in Iroquois and PNGTS to TC Pipelines LP "
    },
    {
        "content": "CALGARY  Alberta  Feb 22 TransCanada Corp  said on Wednesday it plans to offer a flat toll on its Mainline system that takes natural gas from western Canada to southern Ontario  three months after shippers balked at the previous varied toll structure that they saw as too high.",
        "date": "02222017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada launches open season for flat toll on natgas Mainline "
    },
    {
        "content": "* TransCanada launches open season on revised mainline tolling option",
        "date": "02222017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada launches open season on revised mainline tolling option "
    },
    {
        "content": "TransCanada Corp filed an application with Nebraska authorities on Thursday to route its Keystone XL pipeline through the state  saying it expected a decision this year for this crucial leg of the $8 billion project that had been stymied by environmental groups and other opponents.",
        "date": "02162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada files Keystone XL route application in Nebraska "
    },
    {
        "content": "* TransCanada to refresh Keystone's $8 bln cost estimate this year",
        "date": "02162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 4-TransCanada files Keystone XL route application in Nebraska "
    },
    {
        "content": "* TransCanada Corp - appointment of a new independent director  Stéphan Crétier  effective February 17  2017  Source text for Eikon:  Further company coverage:",
        "date": "02152017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada appoints Stéphan Crétier as independent director "
    },
    {
        "content": "* Says expects to retain sufficient commercial support from shippers to underpin Keystone XL pipeline project",
        "date": "02162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada expects to retain enough shipper support for KXL pipeline "
    },
    {
        "content": "(Adds analyst quotes and details on TransCanada pipeline application and updates prices)     * Canadian dollar ends at C$1.3080  or 76.45 U.S. cents     * Loonie touches its strongest since Feb. 6 at C$1.3010     * Bond prices end higher across the yield curve      By Fergal Smith     TORONTO  Feb 16 The Canadian dollar edged lower against its U.S. counterpart on Thursday  pulling back from an earlier 10-day high even as oil rose and the greenback lost ground against a basket of m",
        "date": "02162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CANADA FX DEBT-C$ pulls back from 10-day high  $1.3000 out of reach "
    },
    {
        "content": "CALGARY  Alberta Canadian oil and gas producer Cenovus Energy Inc  said on Thursday it is doing engineering and design work at two of its deferred oil sands projects in northern Alberta and it could potentially reactivate them in 2018 and 2019  respectively.",
        "date": "02162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Cenovus may restart another two deferred oil sands projects "
    },
    {
        "content": "CALGARY  Alberta  Feb 16 Canadian oil and gas producer Cenovus Energy Inc said on Thursday it is doing engineering and design work at two of its deferred oil sands projects in northern Alberta and it could potentially reactivate them in 2018 and 2019  respectively.",
        "date": "02162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CORRECTED-UPDATE 2-Cenovus may restart another two deferred oil sands projects "
    },
    {
        "content": "CALGARY  Alberta Encana Corp   Canada's No. 2 oil and natural gas producer  reported a better-than-expected quarterly operating profit on Thursday  helped by a cash tax recovery.",
        "date": "02162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Encana posts better-than-expected operating profit "
    },
    {
        "content": "CALGARY  Alberta  Feb 16 Encana Corp  Canada's No. 2 oil and natural gas producer  reported a better-than-expected quarterly operating profit on Thursday  helped by a cash tax recovery.",
        "date": "02162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-Encana posts better-than-expected operating profit "
    },
    {
        "content": "* \"PSC process is the clearest path to achieving route certainty for the project in Nebraska and is expected to conclude in 2017\"",
        "date": "02162017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada applies for Keystone XL route approval in Nebraska "
    },
    {
        "content": "* \"urges\" Columbia Pipeline Partners unitholders to vote against merger with TransCanada corporation",
        "date": "02092017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Whetstone Capital asks Columbia Pipeline unitholders to vote against TransCanada merger "
    },
    {
        "content": "Jan 27 Three U.S. natural gas pipeline companies on Friday asked the U.S. Federal Energy Regulatory Commission (FERC) for permission to move forward on their projects by Feb. 3  which is when one of the FERC commissioners will step down.",
        "date": "01272017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-U.S. natgas pipeline companies seek FERC decisions before Bay leaves "
    },
    {
        "content": "Jan 26 TransCanada Corp said on Thursday it submitted a presidential permit application to the U.S. Department of State for the approval of the Keystone XL pipeline.",
        "date": "01262017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada re-submits application for Keystone XL pipeline "
    },
    {
        "content": "OTTAWA  Jan 27 Canada's energy regulator on Friday scrapped a partially completed hearing into TransCanada Corp's proposed Energy East pipeline and said the process would start again from the beginning.",
        "date": "01272017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Review of Canada Energy East pipeline to restart from beginning "
    },
    {
        "content": "* Transcanada Corp - submitted a presidential permit application to u.s. Department of state for approval of Keystone Xl (KXL) pipeline.",
        "date": "01262017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada applies for Keystone XL presidential permit "
    },
    {
        "content": "* Transcanada receives FERC approval to construct Leach XPress and Rayne XPress projects",
        "date": "01192017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada receives FERC approval to construct Leach XPress  Rayne XPress Projects "
    },
    {
        "content": "WHISTLER  British Columbia  Jan 25 TransCanada Corp has yet to discuss the Keystone XL oil pipeline with shippers and is not certain if all were still in support of it  the company's CEO said on Wednesday in his first public comments since President Donald Trump revived the project.",
        "date": "01262017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "RPT-UPDATE 2-TransCanada has not yet broached Keystone XL with shippers-CEO "
    },
    {
        "content": "WHISTLER  British Columbia TransCanada Corp has yet to discuss the Keystone XL oil pipeline with shippers and is not certain if all were still in support of it  the company's CEO said on Wednesday in his first public comments since President Donald Trump revived the project.",
        "date": "01262017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada has not yet broached Keystone XL with shippers: CEO "
    },
    {
        "content": "WHISTLER  British Columbia  Jan 25 TransCanada Corp has yet to discuss the Keystone XL oil pipeline with shippers and is not certain if all were still in support of it  the company's CEO said on Wednesday in his first public comments since President Donald Trump revived the project.",
        "date": "01262017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada has not yet broached Keystone XL with shippers-CEO "
    },
    {
        "content": "CALGARY  Alberta  Jan 25 TransCanada Corp  does not know definitively if shippers are still behind the recently revived Keystone XL pipeline project and will be reaching out to them to find out  chief executive Russ Girling said on Wednesday  according to the Canadian Press.",
        "date": "01262017",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to find out if shippers still behind Keystone XL -report "
    },
    {
        "content": "CALGARY  Alberta  Jan 10 A Canadian environmental group on Tuesday filed a legal challenge against the regulatory review of TransCanada Corp's Energy East pipeline  seeking to restart what it calls a process tainted by bias.",
        "date": "01102017",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-Review process for Energy East pipeline faces legal challenge "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 17 A Husky Energy Inc  oil spill into a major Canadian river last summer that cut off drinking water supply for two cities was caused by ground movement that buckled a section of pipeline  the company said in a report to the Saskatchewan provincial government.",
        "date": "11172016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Husky oil spill in Canadian river caused by ground movement "
    },
    {
        "content": "Nov 15 TransCanada Corp said on Tuesday it halted an open season for a new  fixed-price toll on its natural gas pipeline from western Canada to southern Ontario as the bids it received did not make the project viable.",
        "date": "11152016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Transcanada halts open season for tolls on Canada gas pipeline "
    },
    {
        "content": "* Transcanada Corp will issue 20 million cumulative redeemable minimum rate reset first preferred shares  series 15 at a price of $25.00 per share",
        "date": "11142016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada announces preferred share issuance "
    },
    {
        "content": "* Transcanada-Will not proceed at this time with proposal to flow natural gas along Canadian mainline from empress receipt point in alberta to dawn hub",
        "date": "11152016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada ends open season on new mainline tolling option "
    },
    {
        "content": "* TransCanada closes $3.5 billion common share offering  Source text for Eikon:  Further company coverage:",
        "date": "11162016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada closes $3.5 bln common share offering "
    },
    {
        "content": "Nov 15 TransCanada Corp has halted its offer of lower tolls to move natural gas in Canada  a company executive said on Tuesday  closing the door to shippers who balked at prices they have said are still too high.",
        "date": "11162016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada halts bids on Canada gas pipeline  says prices firm "
    },
    {
        "content": "* Says evaluating ways to engage new U.S. administration on benefits  jobs and tax revenues of Keystone XL pipeline",
        "date": "11092016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada says fully committed to building Keystone XL pipeline "
    },
    {
        "content": "CALGARY  Alberta  Nov 3 Pipeline company TransCanada Corp and shippers on the Canadian gas mainline system are closer to reaching an agreement on a new toll structure  the chief executives of Canada's two biggest natural gas producers said on Thursday.",
        "date": "11032016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada gas toll talks making progress -CNRL  Encana "
    },
    {
        "content": "* Arclight Capital to purchase Transcanada's New England hydroelectric power portfolio",
        "date": "11012016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Arclight Capital to buy Transcanada's hydroelectric power portfolio "
    },
    {
        "content": "CALGARY  Alberta The Canadian government on Monday approved the C$1.3 billion ($968.78 million) expansion of a natural gas gathering pipeline in western Canada belonging to a wholly owned subsidiary of TransCanada Corp   with 36 conditions attached.",
        "date": "10312016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canada approves C$1.3 billion western gas pipeline expansion "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp   Canada's No. 2 pipeline operator  said on Tuesday it will sell its U.S. Northeast Power business and do a bought deal common share offering to help fund its acquisition of the Columbia Pipeline Group earlier this year.",
        "date": "11012016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada sells U.S. Northeast Power unit to fund Columbia deal "
    },
    {
        "content": "CALGARY  Alberta  Nov 1 TransCanada Corp   Canada's No. 2 pipeline operator  said on Tuesday it will sell its U.S. Northeast Power business and do a bought deal common share offering to help fund its acquisition of the Columbia Pipeline Group earlier this year.",
        "date": "11012016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada sells U.S. Northeast Power unit to fund Columbia deal "
    },
    {
        "content": "CALGARY  Alberta  Oct 31 The Canadian government on Monday approved the C$1.3 billion ($968.78 million) expansion of a natural gas gathering pipeline in western Canada belonging to a wholly owned subsidiary of TransCanada Corp  with 36 conditions attached.",
        "date": "10312016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-Canada approves C$1.3 billion western gas pipeline expansion "
    },
    {
        "content": "* Reaches agreement to purchase all of common units of Columbia Pipeline Partners LP for US$17.00 per unit",
        "date": "11012016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada to buy all Columbia Pipeline Partners LP units for $17/unit "
    },
    {
        "content": "* Sets quarterly dividend of C$0.565per share  Source text for Eikon:  Further company coverage:",
        "date": "11012016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada sets quarterly dividend of C$0.565per share "
    },
    {
        "content": "CALGARY  Alberta  Oct 31 The Canadian government said on Monday it will approve a C$1.3 billion ($968.78 million) project to expand a natural gas gathering pipeline in northern Alberta belonging to a wholly owned subsidiary of TransCanada Corp  with 36 conditions attached.",
        "date": "10312016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada approves C$1.3 billion Alberta gas pipeline expansion "
    },
    {
        "content": "* Transcanada Corp - qtrly revenues $3 632 million versus $2 944 million",
        "date": "11012016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada reports Q3 non-gaap earnings per share C$0.78 "
    },
    {
        "content": "CALGARY  Alberta  Nov 1 TransCanada Corp   Canada's No. 2 pipeline operator  on Tuesday reported a quarterly loss because of an after-tax goodwill impairment charge related to its U.S. Northeast Power business.",
        "date": "11012016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada reports quarterly loss  selling U.S. Northeast Power unit "
    },
    {
        "content": "CALGARY  Alberta  Oct 13 TransCanada Corp  launched an open season on Thursday to gauge interest from shippers for a new toll proposal on its  natural gas mainline from western Canada to southern Ontario.",
        "date": "10132016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada launches open season for tolls on Canada gas mainline "
    },
    {
        "content": "* Transcanada Corp - proposal does not impact current contracts that are already in place on canadian mainline system",
        "date": "10132016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada launches open season on new mainline tolling option "
    },
    {
        "content": "Oct 6 H&R Real Estate Investment Trust  said it agreed to sell 50 percent of its non-managing interest in TransCanada Tower in Calgary  Alberta to a unit of Healthcare of Ontario Pension Plan (HOOPP) for about C$257.4 million ($194.8 million).",
        "date": "10062016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "H&R REIT to sell stake in TransCanada Tower to HOOPP Realty "
    },
    {
        "content": "CALGARY  Alberta Shippers on TransCanada Corp's natural gas Mainline system are not signing up to a 42 percent cut on 10-year contracts because they think the toll is still too high for such a long-term commitment  according to two sources.",
        "date": "09302016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Natural gas shippers reject TransCanada's proposed Mainline tolls: sources "
    },
    {
        "content": "CALGARY  Alberta  Sept 30 Shippers on TransCanada Corp's natural gas Mainline system are not signing up to a 42 percent cut on 10-year contracts because they think the toll is still too high for such a long-term commitment  according to two sources.",
        "date": "09302016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Natural gas shippers reject TransCanada's proposed Mainline tolls -sources "
    },
    {
        "content": "Sept 26 TransCanada Corp said on Monday its unit  Columbia Pipeline Group  offered to buy Columbia Pipeline Partners LP for about $848 million in cash.",
        "date": "09262016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada's Columbia Pipeline offers to buy Columbia Pipeline Partners "
    },
    {
        "content": "* Unit Columbia Pipeline Group offered to buy 53.8 million units of  Columbia Pipeline Partners  LP at a price of US$15.75 per common unit",
        "date": "09262016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada offers to buy common units of Columbia Pipeline Partners "
    },
    {
        "content": "Sept 21 TransCanada Corp said its U.S. natural gas pipeline unit had reached a settlement with customers over proposed transportation rate hikes made earlier this year.",
        "date": "09212016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada's U.S. natgas pipeline unit settles case over rate hikes "
    },
    {
        "content": "* New settlement rates are effective August 1  2016  subject to ultimate approval of settlement by FERC",
        "date": "09212016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada's ANR pipeline files settlement in Section 4 rate case "
    },
    {
        "content": "OTTAWA Canada's energy regulator said on Friday that a panel assessing TransCanada Corp's proposed Energy East pipeline was quitting  a decision that will drag out an already-lengthy appraisal process.",
        "date": "09092016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canada regulator says TransCanada pipeline panel to step down "
    },
    {
        "content": "OTTAWA  Sept 9 Canada's energy regulator said on Friday that a panel assessing TransCanada Corp's  proposed Energy East pipeline was quitting  a decision that will drag out an already-lengthy appraisal process.",
        "date": "09092016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 4-Canada regulator says TransCanada pipeline panel to step down "
    },
    {
        "content": "Sept 9 Canada's energy regulator says all three members of panel assessing Transcanada Corp's Energy East oil pipeline have stepped down",
        "date": "09092016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-All three members of panel assessing TransCanada Corp's Energy East oil pipeline have stepped down "
    },
    {
        "content": "OTTAWA  Sept 9 Canada on Friday indicated it would not press the country's energy regulator to remove members from a panel looking into Transcanada Corp's proposed Energy East pipeline despite protests over their actions.",
        "date": "09092016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada indicates it won't demand regulator change pipeline panel "
    },
    {
        "content": "MONTREAL  Aug 29 Canada's National Energy Board cancelled the first day of hearings on TransCanada Corp's  proposed Energy East pipeline in Montreal on Monday after protesters disrupted the panel session  agency spokeswoman Sarah Kiley said.",
        "date": "08292016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Protesters shut down TransCanada pipeline hearing in Montreal "
    },
    {
        "content": "Aug 30 Canada's National Energy Board on Tuesday suspended Montreal hearings on TransCanada Corp's  proposed Energy East pipeline for the rest of the week after protests disrupted the first day on Monday.",
        "date": "08302016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada regulator suspends TransCanada pipeline approval hearing "
    },
    {
        "content": "CALGARY/OTTAWA  Aug 30 Canada's National Energy Board on Tuesday suspended Montreal hearings on TransCanada Corp's proposed Energy East pipeline after protests disrupted the first day of the process on Monday.",
        "date": "08302016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-Canada regulator suspends TransCanada pipeline approval hearing "
    },
    {
        "content": "MONTREAL Canada's National Energy Board has indefinitely postponed hearings in Montreal on TransCanada Corp's  proposed Energy East pipeline after protesters on Monday disrupted the first day's session  an agency spokeswoman said.",
        "date": "08302016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Protesters shut down TransCanada pipeline approval hearing "
    },
    {
        "content": "CALGARY  Alberta Pipeline company TransCanada Corp  is offering tolls as low as 82 Canadian cents per gigajoule on its natural gas mainline from western Canada if enough producers sign up to long-term contracts  a company executive said on Friday.",
        "date": "08192016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada offers 42 percent gas pipeline toll cut on long-term contracts "
    },
    {
        "content": "CALGARY  Alberta  Aug 19 Pipeline company TransCanada Corp is offering tolls as low as 82 Canadian cents per gigajoule on its natural gas mainline from western Canada if enough producers sign up to long-term contracts  a company executive said on Friday.",
        "date": "08192016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada offers 42 pct gas pipeline toll cut on long-term contracts "
    },
    {
        "content": "Aug 2 TransCanada Corp said on Tuesday it plans to build an $800 million marine terminal and oil pipeline project for refined products like gasoline and jet fuel  as the Canadian pipeline operator continues to expand its footprint in Mexico.",
        "date": "08022016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada plans $800 mln refined products project in Mexico "
    },
    {
        "content": "Aug 2 TransCanada Corp said it plans to build an $800 million marine terminal and oil pipeline project along with Sierra Oil & Gas and Grupo TMM SAB in Mexico.",
        "date": "08022016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada plans to develop $800 mln project in Mexico "
    },
    {
        "content": "July 28 TransCanada Corp  Canada's second-largest pipeline company  reported on Thursday a slightly higher-than-expected quarterly profit  and said the process of seeking buyers for the sale of some of its assets was well under way.",
        "date": "07282016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada profit beats; asset sales plan moving ahead "
    },
    {
        "content": "* Transcanada reports solid second quarter 2016 financial results",
        "date": "07282016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada reports Q2 earnings per share C$0.52 "
    },
    {
        "content": "July 28 TransCanada Corp  Canada's second-largest pipeline company  reported a 14.9 percent decline in quarterly profit due to costs related to its acquisition of Columbia Pipeline Group.",
        "date": "07282016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada profit falls on costs tied to Columbia Pipeline deal "
    },
    {
        "content": "* Columbia Pipeline Group Inc ratings raised to 'A-' after acquisition by Transcanada; off creditwatch",
        "date": "07062016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-S&P raises ratings on Columbia Pipeline Group to 'A-' after acquisition by Transcanada "
    },
    {
        "content": "* TransCanada completes acquisition of Columbia Pipeline Group and announces exchange date for subscription receipts",
        "date": "07012016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada completes acquisition of Columbia Pipeline Group "
    },
    {
        "content": "* Transcanada announces closing conditions satisfied for acquisition of Columbia pipeline group",
        "date": "06302016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada says conditions for acquisition of Columbia Pipeline have been satisfied "
    },
    {
        "content": "* CEO Skaggs  President Kettering  CFO Smith notified by Transcanada  will cease serving as directors upon effective time of merger",
        "date": "06282016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Columbia Pipeline - CEO  President  CFO will cease serving as directors after Transcanada merger "
    },
    {
        "content": "TORONTO TransCanada Corp is formally requesting arbitration over U.S. President Barack Obama's rejection of the Keystone XL pipeline  seeking $15 billion in damages  the company said in legal papers dated Friday.",
        "date": "06272016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada formally seeks NAFTA damages in Keystone XL rejection "
    },
    {
        "content": "TORONTO TransCanada Corp is formally requesting arbitration over U.S. President Barack Obama's rejection of the Keystone XL pipeline  seeking $15 billion in damages  the company said in legal papers dated Friday.",
        "date": "06252016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada formally seeks NAFTA damages in Keystone XL rejection "
    },
    {
        "content": "TORONTO  June 25 TransCanada Corp is formally requesting arbitration over U.S. President Barack Obama's rejection of the Keystone XL pipeline  seeking $15 billion in damages  the company said in legal papers dated Friday.",
        "date": "06252016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada formally seeks NAFTA damages in Keystone XL rejection "
    },
    {
        "content": "* Transcanada acquisition of Columbia Pipeline Group receives stockholder support",
        "date": "06222016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada receives stockholder support to buy Columbia Pipeline "
    },
    {
        "content": "TORONTO  June 25 TransCanada Corp is formally requesting arbitration over U.S. President Barack Obama's rejection of the Keystone XL pipeline  seeking $15 billion in damages  the company said in legal papers dated Friday.",
        "date": "06252016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada formally seeks damages over Keystone XL rejection "
    },
    {
        "content": "* Co and Transcanada anticipate that closing of transaction will be effective on July 1  2016",
        "date": "06222016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-CPG stockholders approve acquisition by TransCanada "
    },
    {
        "content": "VANCOUVER  June 16 Canada's energy regulator on Thursday officially launched its 21-month review of TransCanada Corp's Energy East pipeline  which would carry crude from Alberta's oil sands to refineries and export terminals in Eastern Canada.",
        "date": "06162016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-Canada's energy regulator starts review of oil pipeline to east "
    },
    {
        "content": "* TransCanada to invest $1.3 bln in pipeline   (Adds details on natural gas pipeline in Texas)",
        "date": "06132016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada to build $2.1 bln gas pipeline in Mexico "
    },
    {
        "content": "TransCanada Corp  will conduct two separate 24-hour outages on its Keystone crude oil pipeline in July upstream of Steele City  Nebraska  according to a customer notice reviewed by Reuters on Thursday.",
        "date": "06092016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada to conduct work on Keystone pipeline in July  Aug: notice "
    },
    {
        "content": "* TransCanada announces CFIUS clearance for Columbia acquisition",
        "date": "05162016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada receives CFIUS clearance for Columbia acquisition "
    },
    {
        "content": "* TransCanada to refile pre-merger notification to FTC for acquisition of Columbia Pipeline Group  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05042016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada to refile pre-merger notification for acquisition for Columbia Pipeline Group "
    },
    {
        "content": "* If lng canada partners elect to proceed with their project at that time  pipeline construction would begin in 2017",
        "date": "05052016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada provides update on Coastal GasLink Pipeline Project "
    },
    {
        "content": "* TransCanada to refile pre-merger notification to Federal Trade Commission for Columbia acquisition",
        "date": "05042016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada to refile pre-merger notification to FTC for Columbia Pipeline "
    },
    {
        "content": "* Announces 2016 annual and special meeting board of director election results",
        "date": "04292016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada says shareholders approve appointment of 12 nominees as directors "
    },
    {
        "content": "CALGARY  Alberta Delays in approving TransCanada Corp's Energy East pipeline have cost Canada's struggling economy billions of dollars  the company's chief executive said on Friday  adding he was hopeful regulators would finish their review by 2018 as scheduled.",
        "date": "04292016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada says delays to Energy East has cost Canada billions "
    },
    {
        "content": "CALGARY  Alberta  April 27 Cenovus Energy  is looking into building a diluent recovery unit at its Bruderheim crude-by-rail terminal near Edmonton  Alberta  which would allow the company to ship raw bitumen in tank cars and save on condensate costs.",
        "date": "04272016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Cenovus mulling diluent recovery unit at Alberta rail terminal "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp said on Friday maintenance planned for the 590 000 barrel-per-day Keystone pipeline in May  one of the main crude conduits from Canada to the United States  will not impact its ability to ship contracted volumes for that month.",
        "date": "04292016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada says Keystone maintenance will not affect May volumes "
    },
    {
        "content": "CALGARY  Alberta  April 29 TransCanada Corp  said on Friday maintenance planned for the 590 000 barrel-per-day Keystone pipeline in May  one of the main crude conduits from Canada to the United States  will not impact its ability to ship contracted volumes for that month.",
        "date": "04292016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada says Keystone maintenance will not affect May volumes "
    },
    {
        "content": "* Transcanada declares quarterly dividends  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04292016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada declares quarterly dividends "
    },
    {
        "content": "* Columbia Pipeline Group  Inc. Sets June 22  2016 as date of special stockholder meeting to vote on its proposed acquisition by Transcanada Corporation    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04202016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Columbia Pipeline sets stockholder meeting on June 22 to vote on acquisition by Transcanada "
    },
    {
        "content": "CALGARY  Alberta  April 22 TransCanada Corp  agreed to submit to a Quebec environmental review of its Energy East pipeline on Friday  avoiding a potential legal battle with the province by putting the controversial project through an extra round of scrutiny.",
        "date": "04222016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada agrees to Quebec environmental review for pipeline "
    },
    {
        "content": "NEW YORK Front-month U.S. crude futures' discount to forward prices widened sharply on Friday as traders dumped contracts on news of planned maintenance at TransCanada Corp's  Marketlink pipeline at the end of the month.",
        "date": "04152016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "U.S. crude's contango widens on Marketlink pipeline work "
    },
    {
        "content": "* Ends coal-fired PPAS as Alberta targets coal plants for closure  an industrial info news alert  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04152016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada ends coal-fired PPAS as Alberta targets coal plants for closure "
    },
    {
        "content": "NEW YORK TransCanada Corp's  590 000-barrel-per-day Keystone crude oil pipeline continued operating at reduced rates  the company said in an e-mail on Monday  as an investigation into a leak earlier this month remained under way.",
        "date": "04112016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada maintains Keystone crude pipeline at reduced rates "
    },
    {
        "content": "NEW YORK TransCanada Corp expects to restart its Keystone crude pipeline by Saturday  upon receiving conditional approval from the Pipeline and Hazardous Materials Safety Administration (PHMSA)  the company said in emailed statement on Friday.",
        "date": "04082016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada to restart Keystone pipeline by Saturday upon PHMSA approval "
    },
    {
        "content": "April 7 TransCanada Corp said on Thursday about 400 barrels could have spilled in South Dakota from its 590 000 barrel-per-day Keystone crude oil pipeline.",
        "date": "04072016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada puts Keystone pipeline spill volume estimate at 400 barrels "
    },
    {
        "content": "TransCanada Corp  on Sunday said it had restarted the 590 000- barrel-per-day Keystone crude pipeline at reduced pressure after it received American authorization to do so.",
        "date": "04102016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada restarts  Keystone pipeline at reduced pressure "
    },
    {
        "content": "NEW YORK  April 8 TransCanada Corp  expects to restart its Keystone crude pipeline by Saturday  upon receiving conditional approval from the Pipeline and Hazardous Materials Safety Administration (PHMSA)  the company said in emailed statement on Friday.",
        "date": "04082016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada to restart Keystone pipeline by Saturday upon PHMSA approval "
    },
    {
        "content": "NEW YORK TransCanada Corp affirmed to shippers on Friday that it was still expecting to restart the 590 000 barrel per day Keystone crude pipeline on Tuesday  according to two sources familiar with the matter.",
        "date": "04082016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada's Keystone pipeline still expected to restart on Tuesday: traders "
    },
    {
        "content": "TORONTO  April 7 Acquisitions in the utility sector and a major cross-border pipeline transaction helped drive the volume of Canadian M&A activity up 48 percent in the first quarter of 2016  even though the number of deals declined.",
        "date": "04072016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Pipeline  utility deals fuel jump in Canadian M&A activity "
    },
    {
        "content": "April 10 TransCanada Corp on Sunday said it had restarted the 590 000- barrel-per-day Keystone crude pipeline at reduced pressure after it received American authorization to do so.",
        "date": "04102016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada restarts  Keystone pipeline at reduced pressure "
    },
    {
        "content": "NEW YORK/HOUSTON  April 6 The sudden closure and subsequent delay in restarting the Keystone crude pipeline has caused traders to sell off heavy Canadian oil for immediate delivery  trading sources said on Wednesday  while temporarily lending support to U.S. futures markets.",
        "date": "04062016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 4-TransCanada delays restart of Keystone pipeline to Tues -traders "
    },
    {
        "content": "* Press Release - TransCanada announces increased preferred share issuance",
        "date": "04132016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada increases offering of series 13 preferred shares "
    },
    {
        "content": "April 10 TransCanada Corp said it aims to restart the 590 000- barrel-per-day Keystone crude pipeline by Sunday  after it received American authorization the previous day to do so at reduced pressure.",
        "date": "04102016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada aims to restart shut Keystone pipeline by Sunday -company "
    },
    {
        "content": "NEW YORK TransCanada Corp will curtail shipments on its 590 000-barrel-per-day Keystone crude pipeline by 35 percent for the remainder of April  according to a shipper notice dated Wednesday.",
        "date": "04062016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to curtail shipments on Keystone crude pipeline by 35 percent in April: notice "
    },
    {
        "content": "* Transcanada says Prince Rupert Gas Transmission Project has signed project agreements with Takla Lake First Nation and McLeod Lake Indian Band",
        "date": "04132016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada says Prince Rupert Gas Transmission signs project agreements "
    },
    {
        "content": "April 9 TransCanada Corp said it received authorization from the Pipeline and Hazardous Materials Safety Administration on Saturday evening to restart the 590 000 barrel per day Keystone crude pipeline at reduced pressure.",
        "date": "04102016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada receives approval notice for Keystone pipeline restart "
    },
    {
        "content": "* Transcanada Corp spokesman says have not retained JPMorgan to explore sale of minority stake in Mexican natural gas pipelines business at this point",
        "date": "03232016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada has retained JPMorgan to look at sale of its U.S. Northeast power unit- spokesman "
    },
    {
        "content": "* Offer at 8.5 pct premium to Columbia Pipeline's Thursday close",
        "date": "03172016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada to buy Columbia Pipeline Group for $10.2 bln "
    },
    {
        "content": "* Files for stock shelf of up to $3.34 billion - sec filing  Source text : http://1.usa.gov/22ouDBQ Further company coverage:",
        "date": "03172016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Transcanada files for stock shelf of up to $3.34 bln "
    },
    {
        "content": "* Says continues to advance growth projects including Energy East  Keystone XL and LNG pipelines",
        "date": "03172016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada says Columbia deal a rare opportunity "
    },
    {
        "content": "* Transcanada Corp  Transcanada Pipelines Ltd. outlook to negative on Columbia Pipeline Group acquisition",
        "date": "03182016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-S&P revises Transcanada Corp Transcanada Pipelines Ltd Outlook to negative on Columbia Pipeline Group Acquisition "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp   the company behind the controversial Keystone XL oil pipeline  said on Thursday it will buy Columbia Pipeline Group  for $10.2 billion  creating one of North America's largest regulated natural gas transmission businesses. | Video ",
        "date": "03182016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to buy Columbia Pipeline Group for $10.2 billion "
    },
    {
        "content": "OTTAWA  March 9 The United States sees no urgent need for a new energy pipeline between Canada and the United States  U.S. Secretary of State John Kerry said on Wednesday  in a broadcast interview ahead of a visit to Washington by Prime Minister Justin Trudeau.",
        "date": "03092016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Kerry says no pressing need for more US-Canada pipelines- CBC "
    },
    {
        "content": "March 10 TransCanada Corp is in talks to buy Columbia Pipeline Group Inc  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "03102016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada in talks to buy Columbia Pipeline Group - WSJ "
    },
    {
        "content": "MONTREAL  March 1 Quebec on Tuesday filed a motion for an injunction to ensure TransCanada Corp's  proposed Energy East oil pipeline complies with the Canadian province's environmental laws  another potential setback for the project.",
        "date": "03012016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 4-Quebec seeks injunction to force Energy East pipeline review "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp   the country's second-largest pipeline company  reported a fourth-quarter loss on Thursday as a result of a one-off C$2.9 billion ($2.08 billion) impairment charge relating to its rejected Keystone XL oil pipeline.",
        "date": "02112016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada books Keystone XL writedown  raises dividend "
    },
    {
        "content": "CALGARY  Alberta  Feb 11 TransCanada Corp   the country's second-largest pipeline company  reported a fourth-quarter loss on Thursday as a result of a one-off C$2.9 billion ($2.08 billion) impairment charge relating to its rejected Keystone XL oil pipeline.",
        "date": "02112016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada books Keystone XL writedown  raises dividend "
    },
    {
        "content": "Feb 11 TransCanada Corp   Canada's second-largest pipeline company  reported a quarterly loss as it recorded a C$2.9 billion after-tax impairment charge related to the proposed Keystone XL pipeline.",
        "date": "02112016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada posts Q4 loss on Keystone-related charge "
    },
    {
        "content": "CALGARY  Feb 3 Canada is committed to fast-tracking infrastructure investments in the province of Alberta that is reeling from the global slump in energy prices  Canadian Prime Minister Justin Trudeau said on Wednesday.",
        "date": "02042016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-Canada government to fast track infrastructure investments in Alberta "
    },
    {
        "content": "OTTAWA  Jan 27 Canada announced new interim rules on Wednesday for environmental reviews that will impose delays on two projects - TransCanada Corp's Energy East pipeline and Kinder Morgan Inc's expansion of its Trans Mountain Pipeline.",
        "date": "01272016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 3-Canada imposes further delays on two major pipeline projects "
    },
    {
        "content": "OTTAWA Following are the transitional rules for environmental reviews of major energy projects that the Canadian government unveiled on Wednesday:",
        "date": "01272016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Details of Canadian transitional rules for energy reviews "
    },
    {
        "content": "OTTAWA  Jan 29 TransCanada Corp must \"do its homework\" and meet a number of conditions to stand any chance of being allowed to build its proposed Energy East pipeline in the province of Quebec  a senior official said on Friday.",
        "date": "01292016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada must do homework to get Energy East permit: Quebec "
    },
    {
        "content": "Jan 29 The following are the top stories from selected Canadian newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "01292016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "PRESS DIGEST- Canada- Jan 29 "
    },
    {
        "content": "HOUSTON  Jan 22 Canadian pipeline operator TransCanada Corp has started trading oil through a new liquids trading group based in Calgary  Alberta  a spokesman for the company confirmed on Friday.",
        "date": "01222016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada launches an oil trading group "
    },
    {
        "content": "MONTREAL  Jan 21 The influential mayor of Montreal and leaders representing 81 nearby municipalities said on Thursday they oppose TransCanada Corp's proposed Energy East pipeline because of environmental and economic concerns.",
        "date": "01212016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-Montreal mayor  local leaders oppose Energy East pipeline "
    },
    {
        "content": "OTTAWA  Jan 21 The influential mayor of Montreal and other local municipal leaders will on Thursday announce their formal opposition to TransCanada Corp's proposed Energy East pipeline  the Canadian Broadcasting Corp said.",
        "date": "01212016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Montreal area mayors to oppose Energy East pipeline: CBC "
    },
    {
        "content": "WASHINGTON TransCanada Corp  faces a rocky legal path as it seeks to overturn President Barack Obama's denial of its Keystone XL pipeline or at least recoup some of its lost investment in the multibillion dollar project.",
        "date": "01082016",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada legal challenges over Keystone pipeline face long odds "
    },
    {
        "content": "WASHINGTON  Jan 7 TransCanada Corp  faces a rocky legal path as it seeks to overturn President Barack Obama's denial of its Keystone XL pipeline or at least recoup some of its lost investment in the multibillion dollar project.",
        "date": "01072016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada legal challenges over Keystone pipeline face long odds "
    },
    {
        "content": "CALGARY/WASHINGTON  Alberta TransCanada Corp sued the U.S government on Wednesday  to reverse President Barack Obama's rejection of the Keystone XL pipeline  calling his decision unconstitutional.",
        "date": "01062016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada sues U.S. over Keystone XL rejection  seeks damages "
    },
    {
        "content": "WASHINGTON  Jan 7 The White House said on Thursday that it is confident that President Barack Obama and his administration acted lawfully when rejecting TransCanada Corp's Keystone XL crude oil pipeline from Canada.",
        "date": "01072016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "White House says confident acted lawfully in Keystone pipeline rejection "
    },
    {
        "content": "CALGARY/WASHINGTON  Alberta  Jan 6 TransCanada Corp sued the U.S government on Wednesday  to reverse President Barack Obama's rejection of the Keystone XL pipeline  calling his decision unconstitutional.",
        "date": "01062016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada sues U.S. over Keystone XL rejection  seeks damages "
    },
    {
        "content": "* Canadian gov't says has no role in Transcanada plan to sue U.S. over Keystone and is not in a position to comment  Further company coverage:    (Reporting by Jeffrey Hodgson and David Ljunggren)",
        "date": "01062016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-Canada says has no role in Transcanada plan to sue U.S. over Keystone "
    },
    {
        "content": "CALGARY  Alberta  Jan 6 TransCanada Corp  sued the U.S government in U.S. federal court on Wednesday  alleging President Barack Obama's rejection of the Keystone XL pipeline exceeded his power under the U.S. Constitution.",
        "date": "01062016",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada launches legal action over Keystone XL rejection "
    },
    {
        "content": "CALGARY  Alberta  Dec 17 TransCanada Corp  increased the estimated cost of its Energy East crude oil pipeline by 30 percent to C$15.7 billion on Thursday as it filed an amendment to its application with Canadian regulators.",
        "date": "12172015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada ups Energy East pipeline cost estimate by 30 percent "
    },
    {
        "content": "Dec 3 TransCanada Corp  Canada's second-largest pipeline operator  said it raised its stake in Bruce nuclear power plant  in Ontario to 48.5 percent for $236 million.",
        "date": "12032015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada raises stake in Bruce Power to 48.5 pct "
    },
    {
        "content": "BOSTON  Dec 1 Several of the world's biggest climate-focused mutual funds have stakes in traditional oil and gas companies mixed in with their solar  wind and clean tech holdings  a potential shock to green investors seeking to avoid fossil fuels altogether.",
        "date": "12012015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Green investors take note: climate-focused mutual funds dabble in oil "
    },
    {
        "content": "CALGARY  Nov 22 The Canadian province of Alberta  home to the country's controversial oil sands  said on Sunday it will implement an economy-wide tax on carbon emissions in 2017  addressing long-standing criticism it is not doing enough to combat climate change.",
        "date": "11222015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada's Alberta to introduce economy-wide carbon tax in 2017 "
    },
    {
        "content": "CALGARY  Alberta  Nov 20 Canada's national energy regulator has halted construction on a new TransCanada Corp natural gas pipeline after reviewing evidence that it may have spilled a toxic drilling fluid into a major Western Canadian river  a spokesman said on Friday.",
        "date": "11202015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canadian regulator halts TransCanada pipeline construction following spills "
    },
    {
        "content": "CALGARY  Alberta Canada's national energy regulator has halted construction on a new TransCanada Corp natural gas pipeline after reviewing evidence that it may have spilled a toxic drilling fluid into a major Western Canadian river  a spokesman said on Friday.",
        "date": "11212015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canadian regulator halts TransCanada pipeline construction following spills "
    },
    {
        "content": "CALGARY  Alberta  Nov 18 Pipeline company TransCanada Corp has announced new job cuts  as slumping oil prices continue to take their toll on its customers  a spokesman said on Wednesday.",
        "date": "11182015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada announces new layoffs as crude slump persists "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp  said it expects to raise its dividend and bring C$13 billion ($9.76 billion) of new small and medium-sized projects into service by the end of 2018  following the rejection of its Keystone XL crude pipeline.",
        "date": "11172015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada to raise dividend  add C$13 billion of new projects "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp is withdrawing its route application for the Keystone XL pipeline in the state of Nebraska after U.S. President Barack Obama denied a permit for the controversial project  the company said on Wednesday.",
        "date": "11182015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada withdraws Keystone XL route application in Nebraska "
    },
    {
        "content": "CALGARY  Alberta  Nov 12 Canadian energy companies  especially those at higher cost oil sands producers  are signalling they will cut capital spending for a second straight year in 2016 as they adjust to a painful new reality of oil near $40 a barrel.",
        "date": "11122015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Hurting Canadian oil producers signal further cuts to come "
    },
    {
        "content": "CALGARY  Alberta  Nov 17 TransCanada Corp  said it expects to raise its dividend and bring C$13 billion ($9.76 billion) of new small and medium-sized projects into service by the end of 2018  following the rejection of its Keystone XL crude pipeline.",
        "date": "11172015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to raise dividend  add C$13 bln of new projects "
    },
    {
        "content": "* Says will spend C$7.3 billion in capital expenditure in 2016  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "11172015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada to spend C$7.3 billion in 2016 capex "
    },
    {
        "content": "CALGARY  Alberta  Nov 18 TransCanada Corp  is withdrawing its route application for the Keystone XL pipeline in the state of Nebraska after U.S. President Barack Obama denied a permit for the controversial project  the company said on Wednesday.",
        "date": "11182015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada withdraws Keystone XL route application in Nebraska "
    },
    {
        "content": "WASHINGTON U.S. Democratic presidential candidate Hillary Clinton on Thursday proposed a $30 billion plan to help displaced workers in coal-producing areas find new jobs and continue receiving health benefits as the country shifts to using renewable energy and more natural gas.",
        "date": "11122015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Clinton proposes $30 bln plan to help coal-producing areas "
    },
    {
        "content": "Nov 12 The following are the top stories from selected Canadian newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11122015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "PRESS DIGEST-Canada-Nov 12 "
    },
    {
        "content": "CALGARY  Nov 9 The rupture of a TransCanada Corp  natural gas pipeline in 2013 in Alberta was caused by \"miscommunication\" between staff and contractors that built the piece of the line that failed  the company said on Monday.",
        "date": "11092015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada blames 2013 pipeline rupture on miscommunication "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp said on Thursday it has scrapped plans to build a port in Quebec and will have only one crude oil export terminal for its proposed Energy East pipeline  a possible setback for the controversial project.",
        "date": "11052015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada to build only one Energy East oil export terminal "
    },
    {
        "content": "CALGARY The rupture of a TransCanada Corp  natural gas pipeline in 2013 in Alberta was caused by \"miscommunication\" between staff and contractors that built the piece of the line that failed  the company said on Monday.",
        "date": "11102015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada blames 2013 pipeline rupture on miscommunication "
    },
    {
        "content": "CALGARY  Alberta  Nov 6 TransCanada Corp  said on Friday it will keep pressing to build the Keystone XL oil pipeline from Canada to the United States despite the Obama administration's rejection  but skeptical investors suggested it focus on a controversial all-Canadian alternative.",
        "date": "11092015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CORRECTED-UPDATE 3-TransCanada says to keep pushing Keystone; investors skeptical "
    },
    {
        "content": " (This November 6 story has been corrected to change name in paragraph 11 to Adam Scott from Adam Smith)",
        "date": "11092015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada says to keep pushing Keystone; investors skeptical "
    },
    {
        "content": "OTTAWA  Nov 5 Canada's new Liberal government backs TransCanada Corp's proposed Keystone XL pipeline  but does not want it to become an irritant in its relationship with the United States  Foreign Minister Stephane Dion said on Thursday.",
        "date": "11052015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "New Canada government backs Keystone pipeline: foreign minister "
    },
    {
        "content": "CALGARY  Alberta  Nov 5 TransCanada Corp  said on Thursday it has scrapped plans to build a port in Quebec and will have only one crude oil export terminal for its proposed Energy East pipeline  a possible setback for the controversial project.",
        "date": "11052015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada to build only one Energy East oil export terminal "
    },
    {
        "content": "CALGARY  Alberta  Nov 6 TransCanada Corp  said on Friday it will keep pressing to build the Keystone XL oil pipeline from Canada to the United States despite the Obama administration's rejection  but skeptical investors suggested it focus on a controversial all-Canadian alternative.",
        "date": "11062015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada says to keep pushing Keystone; investors skeptical "
    },
    {
        "content": "* Says respects State Department decision not to pause Keystone XL review",
        "date": "11042015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada says respects U.S. decision not to pause KXL review "
    },
    {
        "content": "Nov 9 The following are the top stories from selected Canadian newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11092015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "PRESS DIGEST- Canada- Nov 9 "
    },
    {
        "content": "CALGARY  Alberta  Nov 6 TransCanada Corp  said on Friday it will review all options  including seeking a new permit to ship crude oil from Canada to the United States  after the Obama administration rejected its proposed Keystone XL oil pipeline.",
        "date": "11062015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to consider options after Obama rejects Keystone XL pipeline "
    },
    {
        "content": "CALGARY  Alberta  Nov 5 TransCanada Corp's  1.1-million-barrel-per-day Energy East pipeline will have only one export terminal  a company spokesman said on Thursday.",
        "date": "11052015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada says to build only one Energy East export terminal "
    },
    {
        "content": "WASHINGTON  Nov 3 President Barack Obama wants to rule on the long-pending Keystone XL oil pipeline by the end of his presidency  the White House said on Tuesday  calling a request by the project's Canadian developer to delay a review \"unusual.\"",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-Obama to rule on Keystone despite builder's plea for delay "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp  on Monday requested the suspension of the U.S. permit for its Keystone XL crude oil pipeline  according to a report in the Wall Street Journal.",
        "date": "11022015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada requests suspension of Keystone XL permit: WSJ "
    },
    {
        "content": "** TransCanada shares fall 5.2 pct to C$42.91; U.S.-listed shares down 6.2 percent at $32.24",
        "date": "11062015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "BUZZ-TransCanada Corp: Obama administration to reject Keystone pipeline "
    },
    {
        "content": "Nov 6 Canadian pipeline company TransCanada Corp  said it will sell a 49.9 percent stake in a U.S. natural gas pipeline to its master limited partnership  TC PipeLines LP  for $223 million.",
        "date": "11062015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to sell stake in natgas pipeline for $223 mln "
    },
    {
        "content": "CALGARY TransCanada Corp  is pushing ahead to develop Energy East  an all-Canadian alternative pipeline project to its struggling U.S. Keystone XL pipeline  and will soon reveal the location of a new export terminal. | Video ",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "As Keystone struggles  TransCanada pushes new Energy East terminal "
    },
    {
        "content": "CALGARY  Nov 3 TransCanada Corp is pushing ahead to develop Energy East  an all-Canadian alternative pipeline project to its struggling U.S. Keystone XL pipeline  and will soon reveal the location of a new export terminal.",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 3-As Keystone struggles  TransCanada pushes new Energy East terminal "
    },
    {
        "content": "CALGARY  Alberta  Nov 2 TransCanada Corp  on Monday requested the suspension of the U.S. permit for its Keystone XL crude oil pipeline  according to a report in the Wall Street Journal.",
        "date": "11022015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada requests suspension of Keystone XL permit -WSJ "
    },
    {
        "content": "CALGARY  Oct 30 Canada's energy regulator in a report released on Friday found that six of 16 pipeline safety allegations against TransCanada Corp were \"partially substantiated.\"",
        "date": "10302015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada regulator confirms some TransCanada safety allegations "
    },
    {
        "content": "WASHINGTON The U.S. State Department is in the process of sending a response to TransCanada Corp on its plea to pause the review of the Keystone XL oil pipeline  a department official said on Tuesday.",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Obama administration is sending response on Keystone XL to TransCanada: official "
    },
    {
        "content": "CALGARY  Oct 30 Canada's energy regulator in a report released on Friday found that six of 16 pipeline safety allegations against TransCanada Corp were \"partially substantiated.\"",
        "date": "10302015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-Canada regulator confirms some TransCanada safety allegations "
    },
    {
        "content": "WASHINGTON The White House said on Tuesday it would be \"unusual\" to pause the U.S. government's years-long review process of TransCanada Corp's proposed Keystone XL oil pipeline.",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "White House says unusual to 'pause' Keystone XL pipeline review "
    },
    {
        "content": "WASHINGTON  Nov 3 The White House said on Tuesday it would be \"unusual\" to pause the U.S. government's years-long review process of TransCanada Corp's  proposed Keystone XL oil pipeline.",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-White House says unusual to 'pause' Keystone XL pipeline review "
    },
    {
        "content": "WASHINGTON  Nov 3 White House spokesman Josh Earnest said on Tuesday there may be political considerations behind calls to pause the review process for TransCanada Corp's  proposed Keystone XL oil pipeline.",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "REFILE-White House says politics may be at play on Keystone pipeline timing "
    },
    {
        "content": "WASHINGTON White House spokesman Josh Earnest said on Tuesday there may be political considerations behind calls to pause the review process for TransCanada Corp's proposed Keystone XL oil pipeline.",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "White House says politics may be at play on Keystone pipeline timing "
    },
    {
        "content": "WASHINGTON  Nov 3 The White House said on Tuesday it seemed \"unusual\" that there be a pause in the review process for TransCanada Corp's Keystone XL pipeline.",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "White house says unusual to seek 'pause' in Keystone XL pipeline review process "
    },
    {
        "content": "WASHINGTON  Nov 3 The U.S. State Department is in the process of sending a response to TransCanada Corp  on its plea to pause the review of the Keystone XL oil pipeline  a department official said on Tuesday.",
        "date": "11032015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Obama administration is sending response on Keystone XL to TransCanada -official "
    },
    {
        "content": "CALGARY  Alberta  Oct 21 Pipeline company TransCanada Corp has announced new job cuts  eliminating about 20 percent of its directors as slumping oil prices continue to take their toll on its customers  a spokesman said on Wednesday.",
        "date": "10212015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada to cut more management jobs "
    },
    {
        "content": "CALGARY  Oct 21 Pipeline company TransCanada Corp has announced new job cuts  eliminating about 20 percent of its directors as slumping oil prices continue to take their toll on its customers  a spokesman said on Wednesday.",
        "date": "10212015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada to cut more management jobs "
    },
    {
        "content": "AJAX  Ontario  Oct 14 A co-chair of Canada's Liberal election campaign  Dan Gagnier  resigned his position on Wednesday after news emerged that he had advised TransCanada Corp on how to lobby the next government after the Oct. 19 election.",
        "date": "10152015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "REFILE-UPDATE 1-Canada Liberal campaign co-chair resigns over pipeline advice "
    },
    {
        "content": "AJAX  Ontario  Oct 14 A co-chair of the Canada's Liberal election campaign  Dan Gagnier  resigned his position on Wednesday after news emerged that he had advised TransCanada Corp on how to lobby the next government after the Oct. 19 election.",
        "date": "10142015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canada Liberal campaign co-chair resigns over pipeline advice "
    },
    {
        "content": "TransCanada Corp said on Wednesday it will seek approval from the Nebraska Public Service Commission to build its long-delayed and controversial Keystone XL crude oil pipeline route through the state.",
        "date": "09302015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada changes tack in seeking Nebraska Keystone approval "
    },
    {
        "content": "CALGARY  Alberta  Sept 24 Pipeline company TransCanada Corp will cut 20 percent of its senior management positions as a continuing slump in oil prices has necessitated cost reductions  with further staff cuts possible in the future  a company spokesman said on Thursday.",
        "date": "09242015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada says cutting 20 percent of senior management positions "
    },
    {
        "content": "Sept 1 Natural gas pipeline operator TransCanada Corp said on Tuesday the U.S. Federal Energy Regulatory Commission (FERC) has allowed it to reclassify some 1.1 billion cubic feet (bcf) of gas in storage as \"working gas\" which can be burned at any time for heating or electrical generation.",
        "date": "09012015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada says U.S. lets it reclassify 1.1 bcf of natgas in storage "
    },
    {
        "content": "NEW YORK  Sept 2 TransCanada Corp  submitted a filing with the Federal Energy Regulatory Commission to seek approval to raise uncommitted rates on its Marketlink crude oil pipeline:",
        "date": "09022015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "BRIEF-TransCanada raises rates on Marketlink Cushing-Texas crude pipeline "
    },
    {
        "content": "ABOARD AIR FORCE ONE  Aug 27 The White House said on Thursday that the U.S. State Department continues to review TransCanada Corp's proposed Keystone XL pipeline from Canada's oil sands to Gulf Coast refineries.",
        "date": "08272015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "White House says Keystone XL pipeline review continues "
    },
    {
        "content": "OTTAWA  Aug 12 Canada's New Democratic Party would take greenhouse gas emissions into account in deciding whether projects like TransCanada Corp's Energy East pipeline should be allowed to proceed  NDP leader Thomas Mulcair said on Wednesday.",
        "date": "08122015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canada's NDP would look at emissions in deciding on pipelines "
    },
    {
        "content": "VANCOUVER TransCanada Corp   is still committed to building the Keystone XL pipeline despite stubborn opposition in the United States that has thrown the C$8 billion ($6.2 billion) project into regulatory limbo  the chief executive of the Canadian company said on Friday.",
        "date": "07312015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada stands by Keystone XL; profit beats "
    },
    {
        "content": "VANCOUVER  July 31 TransCanada Corp   is still committed to building the Keystone XL pipeline despite stubborn opposition in the United States that has thrown the C$8 billion ($6.2 billion) project into regulatory limbo  the chief executive of the Canadian company said on Friday.",
        "date": "07312015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada stands by Keystone XL; profit beats "
    },
    {
        "content": "July 31 TransCanada Corp  the Canadian company behind the controversial Keystone XL pipeline  remains committed to the C$8 billion ($6.2 billion) project  the company's head said on Friday  even as hopes fade for an approval by the Obama administration.",
        "date": "07312015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada '100 percent committed\" to Keystone XL project "
    },
    {
        "content": "July 31 TransCanada Corp   Canada's second-largest pipeline company  reported a 19.6 percent rise in comparable profit  helped mainly by higher earnings from its Canadian Mainline and Keystone pipelines.",
        "date": "07312015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Pipeline operator TransCanada's profit rises 19.6 pct "
    },
    {
        "content": "OTTAWA Canadian Prime Minister Stephen Harper said on Wednesday he was not hopeful that the United States would approve the northern leg of TransCanada Corp's  controversial Keystone XL pipeline.",
        "date": "07292015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canada PM not hopeful that Obama will approve Keystone pipeline "
    },
    {
        "content": "WASHINGTON The White House on Wednesday declined to provide an update on the review of the proposed Keystone XL pipeline  saying the U.S. State Department was handling that process.",
        "date": "07292015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "White House declines to provide update on Keystone pipeline review "
    },
    {
        "content": "OTTAWA  July 29 Canadian Prime Minister Stephen Harper said on Wednesday he was not hopeful that the United States would approve the northern leg of TransCanada Corp's  controversial Keystone XL pipeline.",
        "date": "07292015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-Canada PM not hopeful that Obama will approve Keystone pipeline "
    },
    {
        "content": "WHITE HOUSE SAYS KEYSTONE XL ISSUE WILL BE RESOLVED BY THE END OF THE OBAMA ADMINISTRATION",
        "date": "07292015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "WHITE HOUSE SAYS KEYSTONE XL ISSUE WILL BE RESOLVED BY THE END OF THE OBAMA ADMINISTRATION "
    },
    {
        "content": "OTTAWA  July 17 Canada's provinces reached a long-sought deal on Friday over an energy plan for the country  agreeing broadly to curb greenhouse gas emissions while also promoting the use of pipelines.",
        "date": "07172015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Canada provinces agree to strategy on pipelines  climate change "
    },
    {
        "content": "CALGARY  Alberta  July 10 TransCanada Corp  is offering crude oil shippers extra space on its Keystone pipeline from Alberta to the U.S. Gulf Coast after technological improvements freed up 10 000-15 000 barrels per day (bpd) of capacity  the company said on Friday.",
        "date": "07102015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada frees up 10 000-15 000 bpd of Keystone pipeline capacity "
    },
    {
        "content": "CALGARY  Alberta  June 30 TransCanada Corp  said on Tuesday that tightening climate-change rules from the governments of Canada and the province of Alberta help justify the construction of the  controversial Keystone XL pipeline project.",
        "date": "06302015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "New CO2 rules should aid Keystone XL approval  TransCanada says "
    },
    {
        "content": "CALGARY  Alberta  June 23 Pipeline company TransCanada Corp and oil and gas producer Encana Corp  both said on Tuesday they were cutting jobs  joining other Canadian energy firms that have laid off staff since global oil prices slumped.",
        "date": "06232015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-Canadian energy companies TransCanada and Encana cut jobs "
    },
    {
        "content": "CALGARY  Alberta  June 23 TransCanada Corp   the backer of the controversial Keystone XL pipeline project  said on Tuesday it has eliminated 185 jobs following a restructuring of its major projects department.",
        "date": "06232015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Pipeline company TransCanada says cuts 185 jobs "
    },
    {
        "content": "VANCOUVER  June 12 TransCanada Corp  said on Friday it expects to start construction this year on natural gas pipeline to British Columbia's Pacific Coast worth at least C$5 billion ($4.1 billion) following a conditional go-ahead by a Petronas-led consortium for what could be Canada's first LNG export terminal.",
        "date": "06122015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada set to start building B.C. gas pipeline this year "
    },
    {
        "content": "June 12 TransCanada Corp said on Friday a consortium led by Malaysian national oil company Petronas has decided to proceed with plans to build a terminal in northern British Columbia to export Canadian natural gas to Asia.",
        "date": "06122015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada says Petronas LNG project plans to go ahead "
    },
    {
        "content": "VANCOUVER  June 11 The Canadian government has approved TransCanada Corp's proposed C$1.7 billion ($1.38 billion) North Montney Mainline natural gas pipeline that would connect natural gas fields in northern British Columbia with a Pacific Coast export terminal.",
        "date": "06112015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Canada approves TransCanada pipeline to feed Pacific LNG plant "
    },
    {
        "content": "CALGARY  May 12 A natural gas leak on a section of a TransCanada Corp pipeline near Medicine Hat  Alberta  has been safely shut in  TransCanada said on Tuesday.",
        "date": "05122015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 2-TransCanada says leak on Alberta natural gas pipeline shut in "
    },
    {
        "content": "CALGARY  Alberta  May 12 A natural gas leak on a section of a TransCanada Corp pipeline near Medicine Hat  Alberta  has been safety shut in  TransCanada said on Tuesday.",
        "date": "05122015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada says leak on Alberta natural gas pipeline shut in "
    },
    {
        "content": "May 1 TransCanada Corp  Canada's second largest pipeline operator  reported a 10 percent rise in comparable earnings  helped by the positive impact of a stronger U.S. dollar on its U.S. pipeline operations and profits at its power businesses.",
        "date": "05012015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada profit lifted by U.S. pipeline operations "
    },
    {
        "content": "May 1 TransCanada Corp is still mulling alternative sites for a second oil export terminal for its Energy East pipeline  though the C$12 billion project could go ahead with just one export port  chief executive Russ Girling said on Friday.",
        "date": "05012015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Energy East project could go ahead with one export port -TransCanada CEO "
    },
    {
        "content": "May 1 TransCanada Corp   Canada's second-largest pipeline company  reported a 6.1 percent fall in quarterly net profit  hurt by derivative losses.",
        "date": "05012015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Pipeline operator TransCanada's net profit falls on derivatives "
    },
    {
        "content": "CALGARY  Alberta  April 24 TransCanada Corp   whose controversial Keystone XL pipeline project has waited more than six years for U.S. approvals  is asking the Obama administration to approve another pipeline  one that would take American crude oil into Canada.",
        "date": "04242015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada seeks U.S. permit on Upland line as Keystone waits "
    },
    {
        "content": "CALGARY  Alberta  April 24 TransCanada Corp   whose controversial Keystone XL pipeline project has waited more than six years for U.S. approvals  is asking the Obama administration to approve another pipeline  one that would take American crude oil into Canada.",
        "date": "04242015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada seeks U.S. permit on Upland line as Keystone XL waits "
    },
    {
        "content": "A company pivotal to Canada's most ambitious oil pipeline project has a mixed environmental record of spills and regulatory warnings  according to government documents reviewed by Reuters  a finding likely to bolster activist opposition to the proposal.",
        "date": "04222015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Exclusive: Gatekeeper of Canada's Energy East pipeline has mixed environmental record "
    },
    {
        "content": "HOUSTON  April 21 TransCanada Corp is mulling ways to get Canadian crude to Louisiana refineries now that the company has forged a deal to increase its reach to southeast Texas Gulf Coast plants  its head of liquids pipelines said on Tuesday.",
        "date": "04212015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "CERAWEEK-TransCanada mulls moving Canadian crude to Louisiana -exec "
    },
    {
        "content": "April 14 Magellan Midstream Partners LP  and TransCanada Corp   Canada's second-largest pipeline company  said on Tuesday they will develop a pipeline to connect TransCanada's Houston tank terminal to Magellan's East Houston terminal.",
        "date": "04142015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-Magellan Midstream  TransCanada to develop Houston pipeline "
    },
    {
        "content": "April 14 Magellan Midstream Partners LP  and TransCanada Corp   Canada's second-largest pipeline company  said they would develop a pipeline to connect TransCanada's Houston tank terminal to Magellan's East Houston terminal.",
        "date": "04142015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Magellan Midstream  TransCanada to develop Houston pipeline "
    },
    {
        "content": "TORONTO  April 8 TransCanada Corp will widen its search for sites for an oil-pipeline export terminal outside Quebec after scrapping plans to build one in the province due to environmental concerns  the company's chief executive said on Wednesday.",
        "date": "04082015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada looking at oil port sites outside Quebec "
    },
    {
        "content": "April 8 TransCanada Corp is looking at alternatives to the Cacouna terminal  both inside Quebec and elsewhere  and said the Energy East pipeline project will not necessarily involve two export terminals  the company's chief executive said on Wednesday.",
        "date": "04082015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada CEO says looking at alternatives to Cacouna terminal "
    },
    {
        "content": "CALGARY  Alberta  April 7 After six years battling bitter opposition to its Keystone XL pipeline project in the United States  TransCanada Corp has learned where and when to pick its fights.",
        "date": "04072015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada applies Keystone's lessons to Energy East pipeline "
    },
    {
        "content": "TORONTO  April 1 TransCanada Corp has decided not to build a proposed oil export terminal in Quebec as part of its C$12 billion ($9.5 billion) Energy East pipeline  opting to ship the crude from Alberta to another terminal in New Brunswick  the La Presse newspaper reported on Wednesday.",
        "date": "04012015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada will not build oil export terminal in Quebec - news report "
    },
    {
        "content": "CALGARY  Alberta  April 2 TransCanada Corp   the company behind the controversial Keystone XL pipeline  is scrapping plans for a Quebec oil-export terminal because of danger to whales in the St. Lawrence River  a move that is a victory for environmentalists and which delays the company's C$12 billion ($9.5 billion) Energy East pipeline project.",
        "date": "04022015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada scraps Quebec oil port  delays Energy East pipeline "
    },
    {
        "content": "April 2 TransCanada Corp said it had scrapped plans to build a marine oil export terminal at Cacouna in Quebec as part of its Energy East pipeline project due to environmental concerns and would look for another site for the terminal in the province.",
        "date": "04022015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada says won't build oil terminal at Cacouna  Quebec "
    },
    {
        "content": " (This March 18 story corrects paragraph nine to show audit had been scheduled  not prompted by allegations)",
        "date": "03252015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Exclusive: Canada regulator probing TransCanada over safety allegations "
    },
    {
        "content": " ",
        "date": "03252015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CORRECTED-RPT-Canada energy regulator engineers investigated by industry group "
    },
    {
        "content": "OTTAWA  March 25 Senior engineers at Canada's energy regulator are under investigation by their professional association over their probe of alleged safety code violations at TransCanada Corp  Canada's second largest pipeline operator.",
        "date": "03252015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CORRECTED-Canada energy regulator engineers investigated by industry group "
    },
    {
        "content": "OTTAWA  March 19 The Canadian government's review of TransCanada Corp's proposed Energy East pipeline is deeply flawed  Quebec aboriginal leaders said on Thursday  signaling they could line up with opponents of the C$12 billion ($9.43 billion) project.",
        "date": "03192015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Quebec aboriginals say TransCanada pipeline review flawed "
    },
    {
        "content": "TORONTO  March 18 Canada's main stock index slipped on Wednesday as investors were nervous ahead of Federal Reserve comments expected to clarify the U.S. central bank's plans to raise interest rates.",
        "date": "03182015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "CANADA STOCKS-TSX declines as investors are cautious ahead of Fed "
    },
    {
        "content": "WASHINGTON The U.S. Senate failed on Wednesday to override President Barack Obama's veto of legislation approving the Keystone XL oil pipeline  leaving the controversial project to await an administration decision on whether to permit or deny it.",
        "date": "03042015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Senate fails to override Obama's veto of Keystone XL approval "
    },
    {
        "content": "WASHINGTON  March 4 The U.S. Senate failed on Wednesday to override President Barack Obama's veto of legislation approving the Keystone XL oil pipeline  leaving the controversial project to await an administration decision on whether to permit or deny it.",
        "date": "03042015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-U.S. Senate fails to override Obama's veto of Keystone XL approval "
    },
    {
        "content": "WASHINGTON President Barack Obama on Tuesday  as promised  swiftly vetoed a Republican bill approving the Keystone XL oil pipeline  leaving the long-debated project in limbo for another indefinite period.",
        "date": "02242015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Obama vetoes Keystone XL pipeline  leaving it in limbo "
    },
    {
        "content": "WASHINGTON President Barack Obama on Tuesday  as promised  swiftly vetoed a Republican bill approving the Keystone XL oil pipeline  leaving the long-debated project in limbo for another indefinite period. | Video ",
        "date": "02252015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Obama vetoes Keystone XL pipeline  leaving it in limbo "
    },
    {
        "content": "CALGARY  Alberta  Feb 11 Pipeline company TransCanada Corp said on Wednesday it will decide by March 31 whether to proceed with an oil export terminal in Quebec that has come under fire from environmentalists who say it poses a threat to beluga whales.",
        "date": "02112015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada says to decide on Quebec oil terminal by March 31 "
    },
    {
        "content": "Feb 11 TransCanada Corp rejected the U.S. Environmental Protection Agency's inference that its Keystone XL pipeline would help increase the rate of oil sands production even at lower oil prices  and raise greenhouse gas emissions.",
        "date": "02112015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 1-TransCanada opposes U.S. EPA on Keystone carbon footprint "
    },
    {
        "content": "Feb 11 TransCanada Corp said it rejected the U.S. Environmental Protection Agency's inference that its Keystone XL pipeline would increase the rate of oil sands production at lower oil prices  and raise greenhouse gas emissions.",
        "date": "02112015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada disagrees with U.S. EPA on Keystone carbon footprint "
    },
    {
        "content": "VANCOUVER TransCanada Corp    Canada's second-largest pipeline company  reported on Friday a better-than-expected fourth quarter profit  driven mainly by increased earnings from its Canadian operations.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "TransCanada profit beats estimates  boosts dividend "
    },
    {
        "content": "VANCOUVER  Feb 13 TransCanada Corp    Canada's second-largest pipeline company  reported on Friday a better-than-expected fourth quarter profit  driven mainly by increased earnings from its Canadian operations.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 3-TransCanada profit beats estimates  boosts dividend "
    },
    {
        "content": "CALGARY  Alberta  Feb 13 Transcanada Corp   Canada's No. 2 pipeline operator  said on Friday its Gulf Coast pipeline  which carries crude oil from Cushing  Oklahoma  to Nederland  Texas  is currently moving just less than 400 000 barrels per day.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada says Keystone XL's southern leg moving 400 000 bpd "
    },
    {
        "content": "TORONTO  Feb 13 Canada's main stock index rose to its highest level in almost five months on Friday as robust oil prices helped boost the energy sector  offsetting a decline in TransCanada Corp after the pipeline company reported quarterly results.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CANADA STOCKS-TSX nears 5-month high on energy gains; TransCanada slips "
    },
    {
        "content": "Feb 13 TransCanada Corp  Canada's second-largest pipeline company  is not seeing any impact from the decline in the oil price on its new and proposed crude oil pipeline projects  a company executive said on Friday.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada: No impact on pipeline projects from declining oil prices "
    },
    {
        "content": "TORONTO  Feb 13 Canada's main stock index rose to its highest in almost five months on Friday as robust oil prices helped boost the energy sector  offsetting a decline in TransCanada Corp after the pipeline company reported quarterly results.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CANADA STOCKS-TSX nears five-month high as oil prices rise "
    },
    {
        "content": "WASHINGTON Oil prices have dropped so low that the Keystone XL pipeline could play a bigger role in the development of Canada's oil sands and raise greenhouse gas emissions  Obama administration environmental regulators said.",
        "date": "02032015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Oil's price plunge could raise Keystone carbon footprint -EPA "
    },
    {
        "content": "TORONTO  Feb 13 Canada's main stock index advanced to its highest in almost five months on Friday as stronger oil prices helped boost the energy sector and TransCanada Corp's shares climbed after the pipeline company reported quarterly results.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CANADA STOCKS-TSX nears five-month high on oil prices  TransCanada "
    },
    {
        "content": "TORONTO  Feb 13 Canada's main stock index opened higher on Friday as stronger oil prices helped boost shares of energy companies and TransCanada Corp's shares climbed after the pipeline company reported quarterly results.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "CANADA STOCKS-TSX opens higher as oil prices  TransCanada gain "
    },
    {
        "content": "Feb 13 TransCanada Corp   Canada's second-largest pipeline company  reported a 9 percent rise in quarterly profit  mainly helped by higher earnings from its Canadian pipelines such as Canadian Mainline.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "REFILE-Pipeline operator TransCanada's profit rises 9 pct "
    },
    {
        "content": "Pipeline company TransCanada Corp is planning to ask the U.S. government for a permit to build a new 200-mile (322 km) pipeline from North Dakota across the border into Canada  the Wall Street Journal reported  citing a source.",
        "date": "02132015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada plans to seek approval from U.S. for new pipeline project: WSJ "
    },
    {
        "content": "WASHINGTON Democrats in the U.S. Senate blocked the Keystone XL pipeline bill from moving forward on Monday  but supporters of the project vowed to push ahead and eventually get a vote on the measure.",
        "date": "01272015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Senate blocks swift passage of Keystone XL pipeline bill "
    },
    {
        "content": "WASHINGTON The U.S. Senate will likely pass a bill approving the long-pending Keystone XL oil pipeline on Thursday  a measure the White House said President Barack Obama would veto.",
        "date": "01292015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Keystone XL advances in U.S. Senate  faces Obama veto "
    },
    {
        "content": "OTTAWA  Jan 15 Canada has postponed a summit with the leaders of the United States and Mexico  officials said on Thursday  amid persistent tensions over the construction of TransCanada Corp's Keystone XL pipeline and other issues.",
        "date": "01152015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "UPDATE 1-Canada postpones Three Amigos summit amid Keystone XL tension "
    },
    {
        "content": "WASHINGTON The Keystone XL oil pipeline cleared two hurdles on Friday  setting up a showdown between Congress and President Barack Obama who has raised new questions about the project after more than six years of review. | Video ",
        "date": "01092015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Keystone clears hurdles  stage set for Washington showdown "
    },
    {
        "content": "CALGARY  Alberta  Jan 9 TransCanada Corp  Chief Executive Russ Girling said on Friday the company is pleased with a Nebraska Supreme Court ruling that upheld the routing of the controversial Keystone XL pipeline and hopes for a swift resumption of the U.S. regulatory approval process.",
        "date": "01092015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "TransCanada CEO pleased by Nebraska decision on Keystone XL "
    },
    {
        "content": "WASHINGTON The Nebraska Supreme Court on Friday removed one of the last hurdles for President Barack Obama to settle the fate of the politically charged Keystone XL oil pipeline  delivering a closely watched decision on an issue that could help define his second term.",
        "date": "01092015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "Nebraska court clears pipeline route as showdown looms in Washington "
    },
    {
        "content": "WASHINGTON President Barack Obama's advisers will recommend he veto a House bill approving construction of the Keystone XL oil pipeline if the legislation reaches his desk  the White House said in a statement on Wednesday.",
        "date": "01072015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Obama advisers to recommend veto of House Keystone bill "
    },
    {
        "content": "WASHINGTON Republican senators kicked off the new U.S. Congress with legislation to approve the Keystone XL pipeline to bring oil from Canada  but the White House promptly threatened a veto.",
        "date": "01062015",
        "name": "TransCanada Corporation",
        "news_type": "topStory",
        "symbol": "TRP",
        "title": "Republicans push Keystone bill  White House threatens veto "
    },
    {
        "content": "(Adds reaction from Canadian prime minister and TransCanada)",
        "date": "01062015",
        "name": "TransCanada Corporation",
        "news_type": "normal",
        "symbol": "TRP",
        "title": "UPDATE 2-Republicans push Keystone bill  White House threatens veto "
    }
]