[
    {
        "content": "* Estimates range of catastrophe losses from california wildfires​",
        "date": "11092017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers Companies estimates range of catastrophe losses from California wildfires​ "
    },
    {
        "content": "Travelers Cos Inc  plans to stick to its recent growth pace for sales of cyber insurance  which protects businesses against hacking and other liabilities  despite potential to boost it  as the insurer assesses risks in the segment  its head of specialty insurance said on Monday.",
        "date": "11132017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Travelers says it is in 'right spot' for cyber insurance exposure "
    },
    {
        "content": "Nov 13 Travelers Cos Inc plans to stick to its recent growth pace for sales of cyber insurance  which protects businesses against hacking and other liabilities  despite potential to boost it  as the insurer assesses risks in the segment  its head of specialty insurance said on Monday.",
        "date": "11132017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 2-Travelers says it is in 'right spot' for cyber insurance exposure "
    },
    {
        "content": "Nov 13 Travelers Companies Inc is \"just in the right spot\" for managing its exposure to the cyber insurance market  the head of its specialty insurance practice said on Monday.",
        "date": "11132017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Insurer Travelers say it in \"right spot\" for cyber insurance exposure "
    },
    {
        "content": "Travelers Cos Inc's  quarterly profit fell less than Wall Street expected after a severe Atlantic storm season  helping its shares up slightly on Thursday  but it warned investors of large claims likely this quarter from wildfires raging in California.",
        "date": "10192017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Insurer Travelers beats Wall Street profit estimate after hit from storms "
    },
    {
        "content": "Oct 19 Travelers Cos Inc's quarterly profit fell less than Wall Street expected after a severe Atlantic storm season  helping its shares up slightly on Thursday  but it warned investors of large claims likely this quarter from wildfires raging in California.",
        "date": "10192017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 3-Insurer Travelers beats Wall St profit estimate after hit from storms "
    },
    {
        "content": "* Travelers Companies-property & casualty insurance market conditions expected to remain \"competitive\" during rest of 2017 & into 2018 for new business‍​",
        "date": "10192017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "BRIEF-Travelers expects property & casualty insurance market to remain \"competitive\" "
    },
    {
        "content": "* Travelers reports third quarter net income and core income per diluted share of $1.05 and $0.91  respectively  including catastrophe losses of $1.63 per diluted share",
        "date": "10192017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "BRIEF-Travelers Q3 core earnings per share $0.91 "
    },
    {
        "content": "Oct 19 Property and casualty insurer Travelers Cos Inc reported a 59 percent drop in quarterly profit on Thursday  hurt by higher catastrophe losses from hurricanes Harvey and Irma.",
        "date": "10192017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Insurer Travelers' profit tanks on higher catastrophe losses "
    },
    {
        "content": "* Travelers Companies Inc - co introduces ZoneCheck (SM)  online tool to help contractors spot potential for vibration damage Source text for Eikon: Further company coverage:",
        "date": "09202017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers Companies introduces ZoneCheckSM to help contractors spot potential for vibration damage "
    },
    {
        "content": "* Travelers estimates range of catastrophe losses from Hurricane Harvey",
        "date": "09112017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers estimates pre-tax loss in range of $375 mln - $750 mln related to Hurricane Harvey "
    },
    {
        "content": "* Travelers completes acquisition of UK-based Simply Business Source text for Eikon: Further company coverage:",
        "date": "08042017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers completes acquisition of UK-based Simply Business "
    },
    {
        "content": "* Travelers CEO Alan D. Schnitzer elected chairman of board of directors",
        "date": "08022017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers CEO Alan Schnitzer elected chairman of board "
    },
    {
        "content": "July 20 Property and casualty insurer Travelers Cos Inc reported a 10.4 percent fall in quarterly profit on Thursday  hurt by higher catastrophe losses and lower underwriting gains.",
        "date": "07202017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Travelers' quarterly profit falls on higher catastrophe losses "
    },
    {
        "content": "* Q2 earnings per share $2.11; Q2 core earnings per share $1.92",
        "date": "07202017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "BRIEF-Travelers Companies Q2 earnings of $2.11 per share "
    },
    {
        "content": "June 29 The Financial Industry Regulatory Authority (FINRA) on Thursday named William Heyman  chief investment officer of Travelers Company Inc  as its chairman  effective July 18.",
        "date": "06292017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Travelers Co's William Heyman elected as FINRA chairman "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 19 (Fitch) Fitch Ratings has affirmed its ratings on The Travelers Companies  Inc. (NYSE: TRV)  as follows: --Insurer Financial Strength (IFS) on insurance company subsidiaries at 'AA'/'Very Strong'; --Issuer Default Rating (IDR) at 'A+'; --Senior unsecured notes at 'A'; --Subordinated notes at 'BBB+'. The Rating Outlook is Stable. See the full list of rating actions below. KEY RATING DRIVERS TRV's ratings are supported b",
        "date": "06192017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Fitch Affirms Travelers' Ratings; Outlook Stable "
    },
    {
        "content": "* Travelers Companies - will redeem remaining $106.9 million aggregate principal amount of 6.25% fixed-to-floating rate junior subordinated debentures due 2067 Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers to redeem certain debentures "
    },
    {
        "content": "April 20 Property and casualty insurer Travelers Cos Inc reported an 11 percent fall in quarterly profit hurt by higher catastrophe losses and lower underwriting gains.",
        "date": "04202017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Travelers' profit falls on higher catastrophe losses "
    },
    {
        "content": "* Q1 earnings per share $2.17; Q1 core earnings per share $2.16",
        "date": "04202017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "BRIEF-Travelers Companies reports Q1 earnings of $2.17 per share "
    },
    {
        "content": "DUBAI  April 16 Saudi Arabia's two largest listed banks were the main drag on the index in early trade on Sunday on news that U.S. insurers have filed a lawsuit against the lenders over the Sept. 11  2001  attacks  while National Bank of Kuwait rose on strong first quarter results.",
        "date": "04162017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "MIDEAST STOCKS-U.S. 9/11 lawsuit against Saudi banks main drag  NBK up on Q1 earnings beat "
    },
    {
        "content": "* Making pre-breach cybersecurity services from Symantec Corp. available to eligible Travelers cyber policyholders Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers Companies offers customers cybersecurity services from Symantec "
    },
    {
        "content": "* Travelers estimates impact of UK Ogden discount rate change  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers estimates impact of UK Ogden discount rate change "
    },
    {
        "content": "* Expects to record increase to prior year loss reserves of approximately $62 million pre-tax in Q1 2017 operating results",
        "date": "03202017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "BRIEF-Travelers sees higher Q1 loss reserves on discount rate change "
    },
    {
        "content": "Property and casualty insurer Travelers Cos Inc  reported a better-than-expected quarterly profit on Tuesday  as gains from its investments more than offset higher auto accident claims.",
        "date": "01242017",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Insurer Travelers profit beats as investment earnings rise "
    },
    {
        "content": "Jan 24 Property and casualty insurer Travelers Cos Inc reported a better-than-expected quarterly profit on Tuesday  as gains from its investments more than offset higher auto accident claims.",
        "date": "01242017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 2-Insurer Travelers profit beats as investment earnings rise "
    },
    {
        "content": "Jan 24 Property and casualty insurer Travelers Cos Inc reported an 8.9 percent rise in quarterly net profit on Tuesday  helped by a rise in investment earnings and a gain from a dispute settlement.",
        "date": "01242017",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Insurer Travelers profit rises 8.9 pct "
    },
    {
        "content": "* Travelers Companies says on November 7  agreed to a settlement with one of defendants in previously reported reinsurance dispute - SEC filing",
        "date": "11082016",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers companies agreed to a settlement with one of defendants in previously reported reinsurance dispute "
    },
    {
        "content": "Property and casualty insurer Travelers Cos Inc  reported a 22.8 percent fall in quarterly net profit on Thursday as gains from underwriting declined.",
        "date": "10202016",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Insurer Travelers reports 22.8 percent fall in profit "
    },
    {
        "content": "* Global gauge of equities hits one-week high  then falls   (Updates to U.S. market close)",
        "date": "10202016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "GLOBAL MARKETS-Dollar hits 7-mth high on ECB's Draghi  pressures oil  stocks "
    },
    {
        "content": "Oct 20 Property and casualty insurer Travelers Cos Inc reported a 22.8 percent fall in quarterly net profit on Thursday as gains from underwriting declined.",
        "date": "10202016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 1-Insurer Travelers reports 22.8 pct fall in profit "
    },
    {
        "content": "Oct 20 Property and casualty insurer Travelers Cos Inc reported a 22.8 percent fall in quarterly net profit due to weaker underwriting.",
        "date": "10202016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Insurer Travelers reports 22.8 pct fall in profit "
    },
    {
        "content": "Aug 19 Jay Fishman  chairman and former chief executive of property and casualty insurer Travelers Cos Inc   died on Friday.",
        "date": "08192016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Travelers former CEO Jay Fishman dies at 63 "
    },
    {
        "content": "* Death of Jay Fishman  its executive chairman of board and former chief executive officer  Source text for Eikon:  Further company coverage:",
        "date": "08192016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "BRIEF-Travelers mourns death of former CEO Jay Fishman "
    },
    {
        "content": "* Q2 net written premiums $6.35 billion versus $6.17 billion last year",
        "date": "07212016",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers Companies posts Q2 earnings per share of $2.24 "
    },
    {
        "content": "Travelers Cos Inc  reported its lowest quarterly earnings since 2012  when hurricane Sandy struck the U.S. Atlantic coast  but managed to beat market expectations.",
        "date": "07222016",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Travelers reports smallest profit since hurricane Sandy "
    },
    {
        "content": "July 21 Travelers Cos Inc reported its lowest quarterly earnings since 2012  when hurricane Sandy struck the U.S. Atlantic coast  but managed to beat market expectations.",
        "date": "07222016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "CORRECTED-UPDATE 2-Travelers reports smallest profit since hurricane Sandy "
    },
    {
        "content": "* Files for potential mixed shelf; size not disclosed - SEC filing  Source text: (http://1.usa.gov/1Yx6Rzq) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06172016",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers files for potential mixed shelf "
    },
    {
        "content": "* Travelers promotes Greg Toczydlowski to president of business insurance    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05252016",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "BRIEF-Travelers promotes Greg Toczydlowski to president of business insurance "
    },
    {
        "content": "Property and casualty insurer Travelers Cos Inc  reported a lower-than-expected quarterly profit as catastrophe losses nearly doubled  mainly due to hail storms in Texas in March.",
        "date": "04212016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Texas storms bruise Travelers' quarterly profit "
    },
    {
        "content": "April 21 Property and casualty insurer Travelers Cos Inc reported a lower-than-expected quarterly profit as catastrophe losses nearly doubled  mainly due to hail storms in Texas in March.",
        "date": "04212016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 3-Texas storms bruise Travelers' quarterly profit "
    },
    {
        "content": "* Travelers reports first quarter net and operating income of $2.30 and $2.33 per diluted share  respectively  including catastrophe losses of $0.69 per diluted share",
        "date": "04212016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "BRIEF-Travelers Companies Q1 earnings per share $2.30 "
    },
    {
        "content": "April 21 Property and casualty insurer Travelers Cos Inc reported a 17 percent fall in quarterly net profit on Thursday as catastrophe losses nearly doubled  mainly due to hail storms in Texas in late March.",
        "date": "04212016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Texas storms hit insurer Travelers profit "
    },
    {
        "content": "Property and casualty insurer Travelers Cos Inc's quarterly profit fell 16.6 percent as its underwriting gains declined and the company earned less from its fixed income and energy investments.",
        "date": "01212016",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Travelers profit hurt by lower underwriting  investments gains "
    },
    {
        "content": "Jan 21 Property and casualty insurer Travelers Cos Inc's quarterly profit fell 16.6 percent as its underwriting gains declined and the company earned less from its fixed income and energy investments.",
        "date": "01212016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 1-Travelers profit hurt by lower underwriting  investments gains "
    },
    {
        "content": "Jan 21 Property and casualty insurer Travelers Cos Inc  reported a 16.6 percent fall in quarterly net profit as its net investment income was hurt due to low interest rates and a slump in oil prices.",
        "date": "01212016",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Insurer Travelers Cos profit falls 16.6 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  December 02 (Fitch) Fitch Ratings has affirmed its ratings on The  Travelers Companies  Inc. (NYSE: TRV)  as follows:  --Issuer Default Rating (IDR) at 'A+'; --Senior unsecured notes at 'A';  --Subordinated notes at 'BBB+';  --Insurer Financial Strength (IFS) on insurance company subsidiaries at 'AA'.  See the full list of rating actions below. The Rating Outlook is Stable.  KEY RATING DRIVERS TRV's ratings are supported by a t",
        "date": "12022015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Fitch Affirms Travelers' Ratings; Outlook Stable "
    },
    {
        "content": "Property and casualty insurer Travelers Cos Inc  reported a better-than-expected quarterly profit  helped by higher underwriting gains.",
        "date": "10202015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Insurer Travelers' profit beats as underwriting gains surge "
    },
    {
        "content": "Oct 20 Property and casualty insurer Travelers Cos Inc reported a better-than-expected quarterly profit  helped by higher underwriting gains.",
        "date": "10202015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 1-Insurer Travelers' profit beats as underwriting gains surge "
    },
    {
        "content": "Oct 20 Property and casualty insurer Travelers Cos Inc's quarterly net profit rose 1 percent as the company's underwriting gains rose 34.6 percent.",
        "date": "10202015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Insurer Travelers' profit rises on higher underwriting gains "
    },
    {
        "content": "Aug 4 Property and casualty insurer Travelers Cos Inc said on Tuesday Alan Schnitzer would take over as chief executive from Jay Fishman  effective Dec. 1.",
        "date": "08042015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "UPDATE 1-Travelers names Alan Schnitzer CEO  replacing Jay Fishman "
    },
    {
        "content": "Aug 4 Property and casualty insurer Travelers Cos Inc said on Tuesday Chief Executive Jay Fishman will step down  and Alan Schnitzer will succeed him.",
        "date": "08042015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Travelers says CEO Jay Fishman to step down "
    },
    {
        "content": "Aug 4 Property and casualty insurer Travelers Cos Inc said on Tuesday that Chief Executive Officer Jay Fishman  who last year disclosed he had a neuromuscular condition  will step down  as Fishman said he may be battling ALS.",
        "date": "08052015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "UPDATE 2-Travelers' CEO Fishman to step down  says may have ALS "
    },
    {
        "content": "Property and casualty insurer Travelers Cos Inc  reported a stronger-than-expected quarterly operating profit as catastrophe losses halved and underwriting gains doubled.",
        "date": "07212015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Travelers profit beats estimates as catastrophe losses halve "
    },
    {
        "content": "* Shares rise marginally   (Adds comment from conference call; updates shares)",
        "date": "07212015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 2-Travelers profit beats estimates as catastrophe losses halve "
    },
    {
        "content": "July 21 Property and casualty insurer Travelers Cos Inc reported a 19 percent rise in quarterly net profit as catastrophe losses almost halved and it recorded $32 million from the resolution of tax issues from last year.",
        "date": "07212015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Insurer Travelers profit boosted by lower catastrophe losses "
    },
    {
        "content": "NEW YORK Connecticut Governor Dannel Malloy on Friday proposed cutting planned business taxes by $223.7 million over two years after several large corporations threatened to leave the state.",
        "date": "06122015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Connecticut governor proposes scrapping business taxes "
    },
    {
        "content": "NEW YORK  June 12 Connecticut Governor Dannel Malloy on Friday proposed cutting planned business taxes by $223.7 million over two years after several large corporations threatened to leave the state.",
        "date": "06122015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 4-Connecticut governor proposes scrapping business taxes "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 09 (Fitch) Fitch Ratings has affirmed its ratings on The Travelers  Companies  Inc. (NYSE: TRV) as follows:  --Issuer Default Rating (IDR) at 'A+'; --Senior unsecured notes at 'A';  --Subordinated notes at 'BBB+';  --Insurer Financial Strength (IFS) on insurance company subsidiaries at 'AA'.  A full list of rating actions follows at the end of this release. The Rating  Outlooks are Stable.  KEY RATING DRIVERS TRV's ratings",
        "date": "06092015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Fitch Affirms Travelers' Ratings; Outlook Stable "
    },
    {
        "content": "Property and casualty insurer Travelers Cos Inc's  quarterly net profit fell 21 percent  narrowly missing analysts' estimates  as low interest rates and a drop in value of its energy investments squeezed the company's net investment income.",
        "date": "04212015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Travelers profit misses estimates as investment income falls "
    },
    {
        "content": "* Shares fall about 3 pct   (Adds analyst comment  compares with estimates; updates shares)",
        "date": "04212015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 2-Travelers profit misses estimates as investment income falls "
    },
    {
        "content": "April 21 Property and casualty insurer Travelers Cos Inc reported a 21 percent fall in quarterly net profit  largely due to lower net investment income.",
        "date": "04212015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Travelers profit falls 21 pct on lower investment returns "
    },
    {
        "content": "A slew of Dow 30 companies report results in the week: Chemicals conglomerate DuPont  industrial conglomerate United Technologies Corp  property and casualty insurer Travelers Companies Inc and wireless carrier Verizon Communications Inc on Tuesday; McDonald's Corp  AT&T Inc  Boeing Co and Coca-Cola Co on Wednesday; and diversified manufacturer 3M Co  Procter & Gamble and Microsoft Corp on Thursday. While DuPont is expected to report lower first-quarter results  Travelers Companies Inc's first-q",
        "date": "04172015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "UPDATE 1-What to Watch in the Week Ahead and on Monday  April 20 "
    },
    {
        "content": "Property and casualty insurer Travelers Cos Inc reported a 5 percent rise in quarterly net profit  helped by higher underwriting gains and lower losses from natural disasters.",
        "date": "01222015",
        "name": "The Travelers Companies Inc",
        "news_type": "topStory",
        "symbol": "TRV",
        "title": "Travelers profit rises as underwriting gains jump "
    },
    {
        "content": "Jan 22 Property and casualty insurer Travelers Cos Inc reported a 5 percent rise in quarterly net profit  helped by higher underwriting gains and lower losses from natural disasters.",
        "date": "01222015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "UPDATE 1-Travelers profit rises as underwriting gains jump "
    },
    {
        "content": "Jan 22 Property and casualty insurer Travelers Cos Inc reported a 5 percent rise in quarterly net profit  helped by lower weather-related catastrophe losses.",
        "date": "01222015",
        "name": "The Travelers Companies Inc",
        "news_type": "normal",
        "symbol": "TRV",
        "title": "Travelers profit rises on lower catastrophe losses "
    }
]