[
    {
        "content": "* Boosted by revenue from partnerships (Adds comments from CEO  analyst  details  share reaction)",
        "date": "11072017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "UPDATE 1-Japan royalties help to drive profits higher for TowerJazz "
    },
    {
        "content": "TEL AVIV  Nov 7 Israeli chip manufacturer TowerJazz reported higher quarterly net profit that topped estimates on Tuesday and  forecast an 11 percent rise in 2017 full-year revenue.",
        "date": "11072017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Israeli chipmaker TowerJazz Q3 profit up more than forecast "
    },
    {
        "content": "* Towerjazz and Yuanchen Microelectronics announce partnership for Backside Illumination (BSI) manufacturing in Changchun  China",
        "date": "10302017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "BRIEF-Towerjazz and Yuanchen Microelectronics announce partnership for Backside Illumination manufacturing in Changchun  China "
    },
    {
        "content": "MIGDAL HA'EMEK  Israel  Oct 4 Executives at Panasonic were surprised when Russell Ellwanger  CEO of Israeli chipmaker TowerJazz  asked to partner in three of their factories without putting any cash on the table. \"They had said that to do the deal it would be between a $300 million and $400 million cost for us \" he told Reuters in an interview. \"I said  'No  we want to do this deal ... but we will pay nothing'.\" Instead Ellwanger sealed the joint venture with what he characterised as",
        "date": "10042017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "'We'll pay nothing': TowerJazz seeks growth with minimal investment "
    },
    {
        "content": "JERUSALEM  Aug 21 Israeli chipmaker TowerJazz is linking up with Tacoma Semiconductor Technology Co to establish a fabrication plant in Nanjing  China to make 8-inch wide wafers  as it seeks a foothold in the world's second-largest economy.",
        "date": "08212017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Israel's TowerJazz to set up China chip plant with Tacoma Semi "
    },
    {
        "content": "* Towerjazz and Tacoma announce a partnership for a new 8-inch fabrication facility in Nanjing  China; Tower received first milestone payment of $18 million net",
        "date": "08212017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "BRIEF-Towerjazz and Tacoma announce partnership for new fabrication facility in Nanjing  China "
    },
    {
        "content": "JERUSALEM  Aug 3 Israeli microchip maker TowerJazz reported a more than 20 percent rise in second-quarter net profits on Thursday and said it was on track for record revenues in the current quarter  in line with analysts' forecasts as demand continues to grow across its product range.",
        "date": "08032017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "UPDATE 1-Israeli chipmaker TowerJazz's Q2 profit rises as forecast "
    },
    {
        "content": "* TowerJazz announces records in revenues  margins  EBITDA and free cash flow for the second quarter and first half of 2017",
        "date": "08032017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "BRIEF-Towerjazz reports Q2 revenue of $345 mln "
    },
    {
        "content": "JERUSALEM  Aug 3 Israeli chipmaker TowerJazz on Thursday reported higher quarterly net profit that met estimates  and forecast record revenue for the third quarter.",
        "date": "08032017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Israeli chipmaker TowerJazz Q2 profit rises  meets estimates "
    },
    {
        "content": "* Towerjazz reports first quarter 2017 results: record free cash flow resulting from strong year over year growth in revenue and margins",
        "date": "05082017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "BRIEF-Tower Semiconductor reports Q1 earnings per share of $0.45 "
    },
    {
        "content": "TEL AVIV  May 8 Israeli chipmaker TowerJazz reported quarterly net profit that beat estimates and forecast record revenue in the second quarter  boosted by robust demand from high margin businesses such as image sensors.",
        "date": "05082017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Israeli chipmaker TowerJazz Q1 profit beats estimates "
    },
    {
        "content": "* Tower semiconductor and Aisin Seiki Co announce volume production of Aisin's new generation automotive devices for automotive body products",
        "date": "04122017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "BRIEF-Tower semiconductor and Aisin Seiki Co announce production of Aisin's new automotive devices "
    },
    {
        "content": "* Sees Q1 2017 revenue up about 19 percent  Source text for Eikon:  Further company coverage:",
        "date": "02132017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "BRIEF-Towerjazz reports Q4 earnings per share $0.53 "
    },
    {
        "content": "* CEO says pursuing multiple M&A opportunities in China   (Adds details  CEO comments)",
        "date": "02132017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "UPDATE 1-Chipmaker TowerJazz sees further growth in 2017 after record 2016 "
    },
    {
        "content": "JERUSALEM  Feb 13 Israeli chipmaker TowerJazz  reported a doubling of  quarterly net profit that beat estimates  boosted by robust demand from existing and new customers.",
        "date": "02132017",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Chipmaker TowerJazz Q4 profit jumps  tops estimates "
    },
    {
        "content": "JERUSALEM Israeli chipmaker TowerJazz  reported record quarterly revenues on Tuesday and said annual earnings growth should accelerate in 2017 as the company takes on new customers.",
        "date": "11152016",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "Israeli chipmaker TowerJazz sees brighter 2017 after record third-quarter revenues "
    },
    {
        "content": "* Nasdaq shares up 4.4 pct in early Nasdaq trade   (Adds details  CEO comments)",
        "date": "11152016",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "UPDATE 1-Israeli chipmaker TowerJazz sees brighter 2017 after record third-quarter revenues "
    },
    {
        "content": "JERUSALEM  Nov 15 Israeli chipmaker TowerJazz  reported sharply higher profit that topped estimates  boosted by strong demand from existing customers.",
        "date": "11152016",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Chipmaker TowerJazz Q3 profit rise beats estimates "
    },
    {
        "content": "* Towerjazz continues strong performance: announces highest ever revenues  EBITDA and free cash flow for the third quarter of 2016",
        "date": "11152016",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "BRIEF-Towerjazz Q3 earnings per share $0.58 "
    },
    {
        "content": "* Towerjazz Announces Successful Completion Of Non-Convertible unsecured bonds institutional tender",
        "date": "05312016",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "BRIEF-Towerjazz announces completion of non-convertible unsecured bonds institutional tender "
    },
    {
        "content": "TEL AVIV  May 31 TowerJazz has received binding commitments from institutional investors to invest $100 million in its long-term unsecured straight bonds  the Israeli chipmaker said on Tuesday.",
        "date": "05312016",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Chipmaker TowerJazz receives $100 mln in commitments for bond issue "
    },
    {
        "content": "JERUSALEM Israeli chipmaker TowerJazz  swung to a profit in the first quarter  boosted by the acquisition of a U.S. plant  and said it expects revenue to increase further in the next three quarters.",
        "date": "05092016",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "Israeli chipmaker TowerJazz beats estimates with first-quarter profits "
    },
    {
        "content": "* TowerJazz CEO says he expects stronger revenue in the second half of 2016 than in first half  Source text for Eikon:  Further company coverage:    (Reporting by Ari Rabinovitch)",
        "date": "05092016",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "BRIEF-TowerJazz CEO sees revenue up in second half of 2016 "
    },
    {
        "content": "JERUSALEM  May 9 Israeli chipmaker TowerJazz  swung to a profit in the first quarter  boosted by the acquisition of a U.S. plant  and said it expects revenue to jump in the next quarter as well.",
        "date": "05092016",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Israeli chipmaker TowerJazz Q1 profit beats estimates "
    },
    {
        "content": "TEL AVIV Israeli specialty chip maker TowerJazz has agreed to buy Maxim Integrated Products' wafer manufacturing plant in San Antonio  Texas for $40 million in an all-share transaction.",
        "date": "11182015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "TowerJazz buys Maxim chip plant in Texas for $40 million in stock "
    },
    {
        "content": "TEL AVIV  Nov 18 Israeli specialty chip maker TowerJazz has agreed to buy Maxim Integrated Products'  wafer manufacturing plant in San Antonio  Texas for $40 million in an all-share transaction.",
        "date": "11182015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "TowerJazz buys Maxim chip plant in Texas for $40 mln in stock "
    },
    {
        "content": "TEL AVIV Israeli chipmaker TowerJazz expects strong growth into 2016 as it reported higher quarterly profit that beat estimates on rising orders from its largest customers.",
        "date": "11112015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "Chipmaker TowerJazz third-quarter profit up  sees strong 2016 "
    },
    {
        "content": "* Sees Q4 revenue around $252 mln   (Adds CEO comments  share reaction  details)",
        "date": "11112015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "UPDATE 1-Chipmaker TowerJazz Q3 profit up  sees strong 2016 "
    },
    {
        "content": "TEL AVIV  Nov 11 Israeli chipmaker TowerJazz  reported on Wednesday higher quarterly profit and revenue that beat estimates.",
        "date": "11112015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Chipmaker TowerJazz Q3 profit rise beats estimates "
    },
    {
        "content": "* CEO: Momentum strong for 2016 and 2017   (Adds CEO comments  share reaction)",
        "date": "08052015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "UPDATE 1-Chipmaker TowerJazz Q2 profit up  sees momentum into 2016 "
    },
    {
        "content": "TEL AVIV  June 24 Kenon Holdings plans to list its power station IC Power on the New York Stock Exchange at a valuation of $1.5 billion at the end of this year or the start of 2016  the Calcalist financial news website said on Wednesday.",
        "date": "06242015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "Kenon Holdings plans to list IC Power in New York -report "
    },
    {
        "content": "JERUSALEM  March 19 Israeli chipmaker TowerJazz  will double the amount of bonds it is including in an accelerated conversion to equity plan following strong demand  bringing the total to $80 million  it said on Thursday.",
        "date": "03192015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "TowerJazz doubles offer for accelerated bond conversion "
    },
    {
        "content": "JERUSALEM  March 10 Israeli chipmaker TowerJazz  said on Tuesday it would offer an accelerated conversion of some of its bonds to equity  a move that would reduce debt and help the company reach profitability.",
        "date": "03102015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "TowerJazz to help profit by accelerating bond conversion "
    },
    {
        "content": "TEL AVIV  March 3 TowerJazz has won a contract from Intel Corp to produce infrared sensors for Intel's 3D cameras  the Israeli chip manufacturer said on Tuesday.",
        "date": "03032015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "Israel's TowerJazz to produce sensors for Intel's 3D cameras "
    },
    {
        "content": "* Shares up 7 pct in Tel Aviv   (Adds quotes from CEO  details  share price)",
        "date": "02232015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "topStory",
        "symbol": "TSEM",
        "title": "UPDATE 1-TowerJazz 4th-quarter profit doubles  tops estimates "
    },
    {
        "content": "TEL AVIV  Feb 23 Israeli chipmaker TowerJazz  beat estimates for fourth-quarter net profit on revenue from its joint venture in Japan with Panasonic Corp  as well as growing market share from its largest customers.",
        "date": "02232015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "TowerJazz Q4 profit doubles  tops estimates "
    },
    {
        "content": "TEL AVIV  Feb 12 Israel's TowerJazz  said on Thursday it will manufacture chips for Flir Systems Inc's infrared technology for smartphone  security and industrial markets.",
        "date": "02122015",
        "name": "Tower Semiconductor Ltd",
        "news_type": "normal",
        "symbol": "TSEM",
        "title": "TowerJazz to make chips for Flir smartphone night vision systems "
    }
]