[
    {
        "content": "* Technology executive from Alphabet's X joins Tyson Foods' board",
        "date": "11162017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods says Dean Banks joins board "
    },
    {
        "content": "CHICAGO Tyson Foods Inc  is weighing new sites for a $320 million chicken slaughterhouse after opposition from residents of a small Kansas town picked for the project  the chief executive said on Monday.",
        "date": "11142017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson weighs sites for $320 million chicken plant after Kansas town objects "
    },
    {
        "content": "CHICAGO  Nov 13 Tyson Foods Inc is weighing new sites for a $320 million chicken slaughterhouse after opposition from residents of a small Kansas town picked for the project  the chief executive said on Monday.",
        "date": "11132017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson weighs sites for $320 mln chicken plant after Kansas town objects "
    },
    {
        "content": "Tyson Foods Inc  shares climbed to their highest level in more than a year on Monday as the No. 1 U.S. meat processor said low prices for livestock feed will help boost results again next year.",
        "date": "11132017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson shares top one-year high as low feed costs boost margins "
    },
    {
        "content": "Nov 13 Tyson Foods Inc shares climbed to their highest level in more than a year on Monday as the No. 1 U.S. meat processor said low prices for livestock feed will help boost results again next year.",
        "date": "11132017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 3-Tyson shares top one-year high as low feed costs boost margins "
    },
    {
        "content": "* Tyson Foods names Stewart Glendinning chief financial officer",
        "date": "11082017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods names Stewart Glendinning as CFO "
    },
    {
        "content": "* ‍INTEGRATION TEAMS FROM TYSON FOODS AND ORIGINAL PHILLY HAVE BEEN FORMED​ Source text for Eikon: Further company coverage:",
        "date": "11132017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-TYSON FOODS ACQUIRES ORIGINAL PHILLY HOLDINGS "
    },
    {
        "content": "Nov 13 U.S. meat processor Tyson Foods Inc reported higher earnings for the fourth quarter on Monday  as lower costs to buy cattle feed boosted profit margins in its beef and chicken businesses.",
        "date": "11132017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods posts higher profit in 4th quarter "
    },
    {
        "content": "CHICAGO  Oct 27 McDonald's Corp will require suppliers to follow new standards for raising and slaughtering chickens served in its restaurants  the company said on Friday  the latest changes affecting popular menu items like McNuggets.",
        "date": "10272017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 1-McDonald's sets new welfare standards for chickens "
    },
    {
        "content": "CHICAGO  Oct 27 McDonald's Corp will require suppliers to improve the living conditions and slaughter process for chickens raised to be served in its restaurants  the company said on Friday  the latest changes affecting popular menu items like McNuggets.",
        "date": "10272017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "McDonald's sets new welfare standards for chicken suppliers "
    },
    {
        "content": "* Tyson Foods boosts FY2017 EPS guidance on strong beef segment performance",
        "date": "09282017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods sees adj. EPS $5.20-5.30 for FY17 "
    },
    {
        "content": "WASHINGTON and CHICAGO  Sept 27 Tyson Foods Inc's poultry unit on Wednesday pleaded guilty in federal court to two criminal charges stemming from  discharged feed supplement at a company facility in Missouri  the U.S. Department of Justice said.",
        "date": "09272017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "UPDATE 1-Tyson poultry pleads guilty over Missouri spill  to pay $2 mln fine "
    },
    {
        "content": "CHICAGO  Sept 11 Tyson Foods Inc  the biggest U.S. meat company  shut meat plants in Georgia and Florida on Monday because of Hurricane Irma  a spokesman said  reducing its output of chicken and beef products.",
        "date": "09112017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods shuts meat plants due to Irma "
    },
    {
        "content": "Sept 6 Tyson Foods  the biggest U.S. meat processor  said on Tuesday it would build a $320 million poultry complex in eastern Kansas to meet increasing consumer demand for chicken.",
        "date": "09052017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson to build new Kansas plant as demand for chicken surges "
    },
    {
        "content": "* Announced plans to build a $320 million poultry complex in Eastern Kansas.​",
        "date": "09052017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods to build a $320 million poultry complex in Eastern Kansas​ "
    },
    {
        "content": " (This version of the Aug. 25 story  corrects to remove reference to Pilgrim's Pride and Sanderson Farms receiving subpoenas from the SEC in paragraph 3)",
        "date": "08282017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson Foods says it clears SEC probe on alleged chicken pricing "
    },
    {
        "content": "Aug 25 Meat processor Tyson Foods Inc said U.S regulators have not recommended any enforcement action after they concluded a probe related to allegations the company fixed chicken prices along with its peers for years.",
        "date": "08282017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "CORRECTED-Tyson Foods says it clears SEC probe on alleged chicken pricing (Aug. 25) "
    },
    {
        "content": "* Received letter from SEC concerning investigation of company related to allegations in In re Broiler Chicken Antitrust Litigation​",
        "date": "08252017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-SEC concludes investigation of Tyson Foods "
    },
    {
        "content": "* Tyson Foods  Inc. Announces pricing of senior notes offerings",
        "date": "08212017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods  Inc. Announces pricing of senior notes offerings "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 21 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Tyson Foods  Inc.'s (Tyson; NYSE: TSN) aggregate issuance of up to $900 million senior unsecured notes. The Rating Outlook is Stable. A full list of ratings follows at the end of this press release. Net proceeds from the senior notes offering will be used to repay amounts outstanding under the company's term loan due June 2020 and/or certain other debt. At July 1  2",
        "date": "08212017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Fitch Rates Tyson's Senior Notes Offering 'BBB'; Outlook Stable "
    },
    {
        "content": "* Tyson Foods Inc announces proposed public offerings of senior notes",
        "date": "08212017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods announces proposed public offerings of senior notes "
    },
    {
        "content": "* Tyson Foods -  on August 18  2017  Tyson Foods  Inc  Bank of America  N.A. entered into a second amendment of an April 7  2015 term loan agreement",
        "date": "08182017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods  Bank of America  N.A. entered into a second amendment of an April 7  2015 term loan agreement "
    },
    {
        "content": "* Tyson Foods Inc - ‍will invest $84 million as part of its commitment to union city  Tennessee poultry plant​ Source text for Eikon: Further company coverage:",
        "date": "08162017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods to expand Tennessee poultry operation "
    },
    {
        "content": "Tyson Foods Inc  reported stronger-than-expected quarterly results on Monday  sending its shares up 5 percent  and said it would ramp up chicken production in the face of record demand from U.S. consumers. | Video ",
        "date": "08072017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson posts better-than-expected profit  bets on chicken "
    },
    {
        "content": "Aug 7 Tyson Foods Inc reported stronger-than-expected quarterly results on Monday  sending its shares up 5 percent  and said it would ramp up chicken production in the face of record demand from U.S. consumers.",
        "date": "08072017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 2-Tyson posts better-than-expected profit  bets on chicken "
    },
    {
        "content": "* Dow off 0.04 pct  S&P down 0.1 pct  Nasdaq up 0.15 pct (Updates to open)",
        "date": "08072017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "US STOCKS-Dow hits record high again; Nasdaq slightly higher "
    },
    {
        "content": "* Rockwell Collins jumps on report of United Technologies bid",
        "date": "08072017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "US STOCKS-Wall St to open higher  Dow on track to extend record run "
    },
    {
        "content": "* Q3 earnings per share view $1.18 -- Thomson Reuters I/B/E/S",
        "date": "08072017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods Q3 GAAP earnings per share $1.21 "
    },
    {
        "content": "Aug 7 Tyson Foods Inc  the No. 1 U.S. meat processor  reported a 7.6 percent drop in quarterly profit  as the company spent more on marketing and promotions in its chicken business.",
        "date": "08072017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods posts 7.6 pct drop in quarterly profit "
    },
    {
        "content": "* Tyson Foods Inc - new structure is designed around company's segments of beef  pork  chicken and prepared foods",
        "date": "08022017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods streamlines organization to maximize growth "
    },
    {
        "content": "CHICAGO  June 21 Tyson Foods Inc will test a new way to render chickens unconscious before slaughter  the company said on Wednesday  in the latest sign that heightened concerns about animal welfare are affecting U.S. meat processors.",
        "date": "06212017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "U.S. meat processor Tyson to test new method to stun chickens "
    },
    {
        "content": "* Tyson Foods names Hewlett Packard Enterprise executive as Chief Technology Officer‍",
        "date": "06122017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods names Hewlett Packard Enterprise executive as Chief Technology Officer "
    },
    {
        "content": "* Tyson Foods successfully completes acquisition of Advancepierre Source text for Eikon: Further company coverage:",
        "date": "06072017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods completes acquisition of Advancepierre "
    },
    {
        "content": "* Tyson foods  inc. Announces pricing of $2.75 billion senior notes offerings",
        "date": "05232017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods prices $2.75 billion senior notes offerings "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 23 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Tyson Foods Inc.'s (Tyson; NYSE: TSN) benchmark issuance of senior unsecured notes that Fitch anticipates will approximate around $2.5 billion in aggregate. The Rating Outlook is Stable. A full list of Tyson's ratings follows at the end of this press release. Proceeds from the senior notes offering form part of the financing for the $4.2 billion acquisition of AdvanceP",
        "date": "05232017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Fitch Rates Tyson's Senior Notes Offering 'BBB'; Outlook Stable "
    },
    {
        "content": "* Tyson Foods Inc announces proposed public offerings of senior notes",
        "date": "05232017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods announces proposed public offerings of senior notes "
    },
    {
        "content": "* Tyson foods inc - declared a quarterly dividend of $0.225 per share on class a common stock and $0.2025 per share on class b common stock  Source text for Eikon: Further company coverage:",
        "date": "05122017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods declares quarterly dividend of $0.225 per share on class A common stock "
    },
    {
        "content": "Top U.S. chicken companies Tyson Foods Inc  and Pilgrim's Pride Corp  said on Monday that Florida's attorney general sought information from them regarding a probe into possible anticompetitive behavior  widening a legal review into chicken pricing. | Video ",
        "date": "05092017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Florida probes Tyson Foods  Pilgrim's Pride on chicken pricing "
    },
    {
        "content": "May 8 Top U.S. chicken companies Tyson Foods Inc and Pilgrim's Pride Corp said on Monday that Florida's attorney general sought information from them regarding a probe into possible anticompetitive behavior  widening a legal review into chicken pricing.",
        "date": "05082017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "UPDATE 4-Florida probes Tyson Foods  Pilgrim's Pride on chicken pricing "
    },
    {
        "content": "* Files for potential mixed shelf offering; size not disclosed - sec filing Source text (http://bit.ly/2pZQS0O) Further company coverage:",
        "date": "05082017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson foods files for potential mixed shelf offering size not disclosed "
    },
    {
        "content": "Tyson Foods Inc said on Monday quarterly profit fell 21 percent  hurt by fires at two chicken plants  and that Florida's attorney general was seeking information from the company regarding a probe into possible anticompetitive behavior.",
        "date": "05082017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods profit slumps  Florida seeks info in pricing probe "
    },
    {
        "content": "* Tyson Foods Inc - On March 1  Co received civil investigative demand from office of the attorney general  department of legal affairs  of the State of Florida",
        "date": "05082017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods says gets civil investigative demand related to possible anticompetitive conduct "
    },
    {
        "content": "The S&P 500 ended flat on Monday after briefly touching a record high  while Wall Street's \"fear gauge\" dropped to its lowest in over two decades following centrist Emmanuel Macron's victory in the French presidential election. | Video ",
        "date": "05092017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Wall Street flat; fear barometer falls to 1993 low "
    },
    {
        "content": "* Tyson Foods generates record first six months as gaap eps rises 12%  17% on an adjusted basis; reaffirms guidance for another record year",
        "date": "05082017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods reports net earnings per share $1.01 "
    },
    {
        "content": "May 8 Tyson Foods Inc  the No. 1 U.S. meat processor  reported a 21.3 percent slump in quarterly profit as a fire at two of its plants in the period disrupted chicken production  hurting sales at the company's second-biggest business.",
        "date": "05082017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods profit falls as plant fires hurt production "
    },
    {
        "content": "* Tyson Foods Inc - entire retail line of tyson branded chicken products will be from birds raised with no antibiotics ever (NAE) Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods Inc  unveils documentary to show how its chicken are made "
    },
    {
        "content": "* Tyson Foods - in connection with termination of deal with AdvancePierre foods under specified circumstances AdvancePierre to pay co termination fee of $100 million Source text: (http://bit.ly/2oUpnEw) Further company coverage:",
        "date": "04282017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-AdvancePierre to pay $100 mln in termination fee to Tyson Foods "
    },
    {
        "content": "* Tyson foods - pilot compensation program at 2 poultry plants that involves increasing base wages  shortening time it takes new workers to move to higher wage rates Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods announces compensation program at 2 poultry plants involving increasing base wages "
    },
    {
        "content": "* Tyson Foods explores the sale of  three non-protein businesses as part of corporate strategy",
        "date": "04242017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods explores sale of three non-protein businesses "
    },
    {
        "content": "CHICAGO  April 26 Tyson Foods Inc  the biggest U.S. chicken company  said on Wednesday it may raise wages again for workers at all of its poultry plants  a sign of an intensifying battle for employees in a tightening labor market.",
        "date": "04262017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods eyes higher wages as U.S. labor market tightens "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 25 (Fitch) Fitch Ratings has affirmed the 'BBB/F2' ratings of Tyson Foods  Inc. (Tyson: NYSE: TSN) following the company's announcement that it has entered into a definitive agreement to acquire AdvancePierre Foods Holdings  Inc. (AdvancePierre; NYSE: APFH). The Rating Outlook is Stable. The $4.2 billion acquisition  which represents 14x APFH's $300 million of EBITDA and 2.6x its $1.6 billion of yearly sales  will be debt",
        "date": "04252017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Fitch Affirms Tyson Foods at 'BBB/F2' on $4.2B APFH Acquisition; Outlook Stable "
    },
    {
        "content": "April 25 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04252017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Tyson Foods Inc   the No. 1 U.S. meat processor  said on Tuesday it would buy packaged sandwich supplier AdvancePierre Foods Holdings Inc  for about $3.2 billion in cash  to expand its fast-growing portfolio of prepared food brands. | Video ",
        "date": "04252017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods beefs up prepared foods with AdvancePierre buy "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Tyson Foods has found a delectable new bite to swallow in its quest to become America’s premier protein provider from the farmyard to the kitchen table. Its $3.2 billion purchase of ready-to-eat sandwich maker AdvancePierre takes the Springdale  Arkansas-based poultry company further up the food value chain. Along with plans to carve off some less wholesome morsels  Tyson is giving investors plenty to cluck about.",
        "date": "04252017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson makes shareholders tasty $3.2 bln sandwich "
    },
    {
        "content": "NEW YORK Traders took a big bite out of AdvancePierre Foods Holdings'  near-term bullish options just days ahead of Tuesday's announcement by Tyson Foods  that it would buy the packaged sandwich supplier for $3.2 billion.",
        "date": "04252017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "AdvancePierre deal a delicious treat for timely options buyers "
    },
    {
        "content": "* Transaction expected to close in Tyson's third-qtr (Adds details  updates shares)",
        "date": "04252017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 2-Tyson Foods beefs up prepared foods with AdvancePierre buy "
    },
    {
        "content": "April 25 Tyson Foods Inc  the No. 1 U.S. meat processor  said on Tuesday it would buy packaged sandwich supplier AdvancePierre Foods Holdings Inc for about $3.2 billion in cash.",
        "date": "04252017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods to buy AdvancePierre for $3.2 bln "
    },
    {
        "content": "CHICAGO/LOS ANGELES  April 7 To meet increasing demand for meat raised without certain antibiotics  top U.S. chicken company Tyson Foods Inc and rival producers are turning to sanitizing wipes  bacteria-reducing fog and even oregano to keep birds healthy.",
        "date": "04082017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "RPT-As KFC shuns some antibiotics  U.S. chicken industry deploys wet wipes  oregano "
    },
    {
        "content": "CHICAGO/LOS ANGELES  April 7 To meet increasing demand for meat raised without certain antibiotics  top U.S. chicken company Tyson Foods Inc and rival producers are turning to sanitizing wipes  bacteria-reducing fog and even oregano to keep birds healthy.",
        "date": "04082017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "As KFC shuns some antibiotics  U.S. chicken industry deploys wet wipes  oregano "
    },
    {
        "content": "CHICAGO Bird flu that is highly lethal to poultry has infected a second commercial chicken farm in Tennessee that supplies Tyson Foods Inc  company and state officials said on Thursday.",
        "date": "03162017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Bird flu hits another U.S. farm that supplies Tyson Foods "
    },
    {
        "content": "CHICAGO  March 16 Bird flu that is highly lethal to poultry has infected a second commercial chicken farm in Tennessee that supplies Tyson Foods Inc  company and state officials said on Thursday.",
        "date": "03162017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 3-Bird flu hits another U.S. farm that supplies Tyson Foods "
    },
    {
        "content": "CHICAGO  March 7 The strain of bird flu that infected a chicken farm in Tennessee in recent days shares the same name as a form of the virus that has killed humans in China  but is genetically distinct from it  U.S. authorities said on Tuesday.",
        "date": "03082017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tennessee bird flu shares name  not genetics  of feared China strain -USDA "
    },
    {
        "content": "PARIS  March 7 The United States reported an outbreak of avian flu on a farm in Wisconsin  the second in the country in less than a week although the virus found this time is considered less virulent  the World Organisation for Animal Health (OIE) said on Tuesday.",
        "date": "03072017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 1-U.S. reports low pathogenic bird flu outbreak in Wisconsin -OIE "
    },
    {
        "content": "PARIS  March 7 The United States reported an outbreak of low pathogenic avian flu in a turkey flock in Wisconsin  the World Organisation for Animal Health (OIE) said on Tuesday.",
        "date": "03072017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "U.S. reported low pathogenic H5N2 bird flu in Wisconsin - OIE "
    },
    {
        "content": "SEOUL/CHICAGO South Korea  Japan  Taiwan and Hong Kong have limited imports of U.S. poultry after the United States detected its first case this year of avian flu on a commercial chicken farm  South Korea's government and a U.S. trade group said on Monday. | Video ",
        "date": "03072017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Asian nations restrict U.S. poultry imports over bird flu "
    },
    {
        "content": "SEOUL/CHICAGO  March 6 South Korea  Japan  Taiwan and Hong Kong have limited imports of U.S. poultry after the United States detected its first case this year of avian flu on a commercial chicken farm  South Korea's government and a U.S. trade group said on Monday.",
        "date": "03072017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 3-Asian nations restrict U.S. poultry imports over bird flu "
    },
    {
        "content": "* SAUER'S RESIGNATION IS EFFECTIVE IMMEDIATELY AND THERE ARE CURRENTLY NO PLANS TO ADD ANOTHER DIRECTOR",
        "date": "02272017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-BRAD SAUER RESIGNS FROM TYSON FOODS’ BOARD "
    },
    {
        "content": "CHICAGO  Feb 21 Tyson Foods Inc in June will switch its retail line of company-branded chicken products to birds raised without any antibiotics  a top executive said on Tuesday  accelerating the meat sector's shift away from the drugs.",
        "date": "02212017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods accelerates shift away from antibiotics in chicken "
    },
    {
        "content": "* Says declared a quarterly dividend of $0.225 per share on class A common stock",
        "date": "02132017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods says declared a quarterly dividend of $0.225 per share on class A common stock "
    },
    {
        "content": "Tyson Foods Inc disclosed on Monday it has received a subpoena from the U.S. Securities and Exchange Commission following allegations it conspired with rivals for years to fix chicken prices.",
        "date": "02062017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson reveals subpoena linked to alleged price fixing "
    },
    {
        "content": "Feb 6 Tyson Foods Inc disclosed on Monday it has received a subpoena from the U.S. Securities and Exchange Commission following allegations it conspired with rivals for years to fix chicken prices.",
        "date": "02062017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 4-Tyson reveals subpoena linked to alleged price fixing "
    },
    {
        "content": "* For fiscal 2017  pork segment's operating margin should be around 12%",
        "date": "02062017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods reports Q1 net income per share attributable to Tyson of $1.59 "
    },
    {
        "content": "* Tyson Foods - On Jan 20  Co received a subpoena from the sec  in connection with an investigation related to the company - SEC filing",
        "date": "02062017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods says gets subpoena from SEC "
    },
    {
        "content": "Feb 6 Tyson Foods Inc  the biggest U.S. meat processor  reported a 28.6 percent rise in quarterly profit  helped by higher exports of beef and pork and lower livestock costs.",
        "date": "02062017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods quarterly profit jumps 28.6 pct "
    },
    {
        "content": "* Tyson Foods Inc - Q1 sales $9 182 million versus $9 152 million",
        "date": "02062017",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods qtrly net income per share attributable to Co $ 1.59 "
    },
    {
        "content": "CHICAGO Tyson Foods Inc's hog processing plant in Storm Lake  Iowa  returned to normal operations on Wednesday following a fire at the facility on Tuesday night  a company spokeswoman said in an email.",
        "date": "01042017",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson Iowa pork plant resumes operations day after fire "
    },
    {
        "content": "CHICAGO Tyson Foods Inc  has launched a $150 million venture capital fund that will target investments in companies commercializing meat substitutes  deepening the largest U.S. chicken producer's foray into alternative sources of protein.",
        "date": "12052016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson starts $150 million venture capital fund  eyes meat substitutes "
    },
    {
        "content": "Tyson Foods Inc shares tumbled more than 14 percent on Monday after the nation's biggest meat processor forecast lower-than-expected 2017 profit and said well-regarded Chief Executive Officer Donnie Smith would step down at the end of the year.",
        "date": "11212016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson Foods shares dive on CEO departure  dim 2017 forecast "
    },
    {
        "content": "* Indexes up: Dow 0.5 pct  S&P 0.8 pct  Nasdaq 0.9 pct   (Updates to close)",
        "date": "11212016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "US STOCKS-Major indexes hit records as post-election rally goes on "
    },
    {
        "content": "Nov 21 Tyson Foods Inc shares tumbled more than 14 percent on Monday after the nation's biggest meat processor forecast lower-than-expected 2017 profit and said well-regarded Chief Executive Officer Donnie Smith would step down at the end of the year.",
        "date": "11212016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 6-Tyson Foods shares dive on CEO departure  dim 2017 forecast "
    },
    {
        "content": "* Tyson Foods Inc - CEO Tom Hayes' contract provides for  among other things  an annual base salary of $1.2 million - SEC filing",
        "date": "11222016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods CEO Tom Hayes' contract provides annual base salary of $1.2 mln "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 0.6 pct  Nasdaq 0.8 pct   (Updates to late afternoon  adds dateline)",
        "date": "11212016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "US STOCKS-Wall St at record highs as tech  energy stocks rally "
    },
    {
        "content": "* Indexes up: Dow 0.28 pct  S&P 0.56 pct  Nasdaq 0.66 pct   (Updates to early afternoon)",
        "date": "11212016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "US STOCKS-Wall St at record highs as techs  energy stocks rally "
    },
    {
        "content": "* Indexes up: Dow 0.19 pct  S&P 0.41 pct  Nasdaq 0.42 pct   (Adds details  comments  updates prices)",
        "date": "11212016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "US STOCKS-S&P  Dow eye record; techs boost Nasdaq to all-time high "
    },
    {
        "content": "* Q4 earnings per share view $1.17 -- Thomson Reuters I/B/E/S",
        "date": "11212016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods posts Q4 earnings per share of $1.03 "
    },
    {
        "content": "Nov 21 Tyson Foods Inc reported a 12.8 percent drop in quarterly revenue  hurt by lower sales of beef and chicken  and said Chief Executive Donnie Smith would step down at the end of the year.",
        "date": "11212016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods sales drop 12.8 pct; CEO to step down "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 21 (Fitch) Fitch Ratings has affirmed the Issuer Default  Ratings (IDRs) of Tyson Foods  Inc. (Tyson; NYSE: TSN) at 'BBB/F2' and the IDR  of its wholly-owned subsidiary - The Hillshire Brands Co. (Hillshire) - at  'BBB'. The Rating Outlook is Stable.  Tyson's ratings recognize structural improvement in the company's business and  significant debt reduction since the 2014 acquisition of Hillshire. However   ratings incor",
        "date": "10212016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Fitch Affirms Tyson's IDR at 'BBB/F2'; Outlook Stable "
    },
    {
        "content": "Oct 10 Tyson Foods Inc  the largest U.S. meat processor  took a 5 percent stake in plant-based protein maker Beyond Meat amid growing pressure on food companies to reduce environmental and health risks by changing the way they source protein.",
        "date": "10102016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Meat processor Tyson Foods invests in plant-based protein maker "
    },
    {
        "content": "* Tyson Foods says has taken a 5-percent ownership stake in plant-based protein producer beyond meat",
        "date": "10102016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods says takes 5-pct ownership stake in Beyond Meat "
    },
    {
        "content": "A federal judge has denied Tyson Foods Inc's request for a new trial in a case in which the U.S. Supreme Court signed off on a $5.8 million jury award for workers who were not compensated for time spent donning and doffing safety gear at one of the company's pork processing plants.",
        "date": "10072016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson loses bid for new trial in don-doff case that reached Supreme Court "
    },
    {
        "content": "Oct 7 Shares of Tyson Foods Inc  the largest U.S. meat processor  fell as much as 11.5 percent to $65.85 on Friday after a brokerage report said a class action lawsuit against the company alleging collusion might have merit.",
        "date": "10072016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods stock plunges as brokerage says lawsuit may have merit "
    },
    {
        "content": "Oct 7 Shares of Tyson Foods Inc fell 11.5 percent  their biggest intraday percentage drop in more than six years  after a brokerage said a class action lawsuit against the largest U.S. meat processor over industry collusion was \"powerfully convincing\".",
        "date": "10072016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 1-Tyson Foods stock plunges as brokerage says lawsuit may have merit "
    },
    {
        "content": "Tyson Foods Inc  said on Tuesday it is recalling about 132 520 pounds of chicken nuggets due to a possible contamination from plastic.",
        "date": "09292016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson Foods recalls chicken nuggets sold at Costco stores "
    },
    {
        "content": "Sept 27 Tyson Foods Inc said on Tuesday it is recalling about 132 520 pounds of chicken nuggets due to a possible contamination from plastic.",
        "date": "09272016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods recalls chicken nuggets sold at Costco stores "
    },
    {
        "content": "CHICAGO  Aug 11 Tyson Foods Inc said it has fired 10 workers who were captured abusing breeder chickens in Virginia in a secretly recorded video released by an animal rights group on Thursday.",
        "date": "08112016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson fires 10 U.S. workers after video captures chicken abuse "
    },
    {
        "content": "* Declared quarterly dividend of $0.15 per share on Class A common stock and $0.135 per share on Class B common stock  Source text for Eikon:  Further company coverage:",
        "date": "08082016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods declares quarterly dividend of $0.15/share on Class A common stock "
    },
    {
        "content": "Tyson Foods Inc  said profits should reach record highs this year and next as its focus on higher-margin packaged products pays off  after low feed and livestock costs helped quarterly earnings smash analysts' expectations on Monday.",
        "date": "08082016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods projects record profits  shares hit high "
    },
    {
        "content": "* Tyson's third quarter earnings surge 51% due to strong performance across all segments of business",
        "date": "08082016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods Q3 earnings per share $1.25 "
    },
    {
        "content": "OAK BROOK  Ill.  Aug 1 McDonald's Corp  will replace corn syrup in hamburger buns with sugar this month and has removed antibiotics that are important to human medicine from its chicken months ahead of schedule  it said on Monday  moves that are part of its drive to target increasingly health-conscious consumers.",
        "date": "08012016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 2-McDonald's to remove corn syrup from buns  curbs antibiotics in chicken "
    },
    {
        "content": "Aug 8 Tyson Foods Inc  the biggest U.S. meat processor  reported a 41 percent rise in quarterly profit  helped by lower feed and livestock costs.",
        "date": "08082016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods profit jumps 41 pct "
    },
    {
        "content": "* Says President Tom Hayes' annual salary will increase to $950 000.00 - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06142016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods says President Tom Hayes' annual salary will increase to $950 000 "
    },
    {
        "content": "* Tom Hayes named president of Tyson Foods; Donnie Smith to continue as CEO  Source text for Eikon:  Further company coverage:",
        "date": "06132016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods names Tom Hayes president "
    },
    {
        "content": "Hundreds of commissioned salespeople can sue Ashley Furniture Industries and its subsidiary  Stoneledge Furniture  as a class for allegedly violating California minimum wage laws  a federal appeals court ruled Wednesday.",
        "date": "06092016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "9th Circuit signs off on sales reps' class action citing Tyson "
    },
    {
        "content": "SAO PAULO  May 11 Processed food maker BRF  confirmed on Wednesday that executives from Tyson Foods Inc visited plants in Brazil in response to a report in Valor Economico newspaper that said an acquisition of BRF may be in Tyson's plans.",
        "date": "05112016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Brazil's BRF confirms visits from Tyson executives "
    },
    {
        "content": "SAO PAULO Executives of Tyson Foods   the largest U.S. meats company that plans to resume investment abroad  have been visiting plants of Brazil's poultry processor BRF SA  over the past month  the Valor Economico newspaper said on Tuesday.",
        "date": "05102016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Brazil's BRF may be in Tyson's expansion plans: paper "
    },
    {
        "content": "SAO PAULO  May 10 Executives of Tyson Foods   the largest U.S. meats company that plans to resume investment abroad  have been visiting plants of Brazil's poultry processor BRF SA over the past month  the Valor Economico newspaper said on Tuesday.",
        "date": "05102016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Brazil's BRF may be in Tyson's expansion plans -paper "
    },
    {
        "content": "* Declared quarterly dividend of $0.15 per share on Class A common stock",
        "date": "05092016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods declares qtrly dividend of $0.15 per share on Class A common stock "
    },
    {
        "content": "Tyson Foods Inc   the biggest U.S. meat processor  raised its earnings forecast for the year citing healthy supply of cattle and hogs  and reported record high quarterly margins helped by lower feed and livestock costs.",
        "date": "05092016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods beefs up profit forecast on strong cattle supply "
    },
    {
        "content": "* Shares touch record high of $70.44   (Adds detail from conf call  updates shares)",
        "date": "05092016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 2-Tyson Foods beefs up profit forecast on strong cattle supply "
    },
    {
        "content": "* CEO on conf call- \"In the macro environment  consumer sentiment is strong and disposable personal income continues to rise\"",
        "date": "05092016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods CEO on conf call- \"good cattle supply around us  looks like that will continue through the rest of summer\" "
    },
    {
        "content": "May 9 Tyson Foods Inc  the biggest U.S. meat processor  reported a 39 percent rise in quarterly profit as the company benefited from lower feed and livestock costs.",
        "date": "05092016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods profit jumps as feed costs fall "
    },
    {
        "content": "* Tyson foods says proposed building a new processing facility near its existing poultry plant in green forest  arkansas",
        "date": "04142016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "BRIEF-Tyson Foods proposes building a new processing facility near its existing poultry plant in Green Forest  Arkansas "
    },
    {
        "content": "WASHINGTON  March 22 The U.S. Supreme Court on Tuesday handed a loss to Tyson Foods Inc over the company's challenge to an almost $5.8 million class action judgment in a case won by workers at an Iowa pork-processing facility who contend they were underpaid.",
        "date": "03222016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "U.S. top court rules against Tyson Foods in class action case "
    },
    {
        "content": "WASHINGTON  March 22 The U.S. Supreme Court on Tuesday handed a loss to Tyson Foods Inc over the company's challenge to an almost $5.8 million class action judgment in a case won by workers at an Iowa pork-processing facility who contended they were underpaid.",
        "date": "03222016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 2-U.S. top court rules against Tyson Foods in class action case "
    },
    {
        "content": "Tyson Foods Inc   the biggest U.S. meat processor  raised its full-year profit forecast  helped by a sharp drop in feed and livestock costs  sending its shares to a record high on Friday. | Video ",
        "date": "02052016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson Foods raises full-year profit forecast as costs fall "
    },
    {
        "content": "* Shares touch record high   (Adds details from conference call  analyst comment; updates shares)",
        "date": "02052016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 3-Tyson Foods raises full-year profit forecast as costs fall "
    },
    {
        "content": "Feb 5 Tyson Foods Inc  the biggest U.S. meat processor  reported a 49 percent rise in quarterly profit  helped by lower feed and livestock costs.",
        "date": "02052016",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods quarterly profit jumps 49 pct "
    },
    {
        "content": "CHICAGO  Feb 2 Blizzard conditions in the Central United States shut down some Cargill and Tyson beef and pork processing plants in the region  company spokesmen told Reuters by email on Tuesday.",
        "date": "02022016",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "UPDATE 1-Some pork  beef packing plants close as blizzard slams Central U.S. "
    },
    {
        "content": "* Boulder Brands shares up 8.5 pct   (Adds details  background; updates shares)",
        "date": "11242015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 2-Pinnacle Foods to buy Boulder Brands to boost health offerings "
    },
    {
        "content": "Tyson Foods Inc   the biggest U.S. meat processor  said it would stop operations at two of its plants in the United States  affecting about 880 employees.",
        "date": "11192015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson Foods to close two plants  cut 880 jobs "
    },
    {
        "content": "Tyson Foods Inc   the biggest U.S. meat processor  reported better-than-expected quarterly sales on Monday  sending its shares up by over 10 percent as strong demand for chicken products and a boost from its purchase of sausage seller Hillshire Brands buoyed results.",
        "date": "11232015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson Foods quarterly sales beat estimates; shares soar 10 percent "
    },
    {
        "content": "Nov 19 Tyson Foods Inc  the biggest U.S. meat processor  said it would stop operations at two of its plants in the United States  affecting about 880 employees.",
        "date": "11192015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods to close 2 plants  cut 880 jobs "
    },
    {
        "content": "Nov 23 Tyson Foods Inc  the biggest U.S. meat processor  reported better-than-expected quarterly sales on Monday  sending its shares up by over 10 percent as strong demand for chicken products and a boost from its purchase of sausage seller Hillshire Brands buoyed results.",
        "date": "11232015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 3-Tyson Foods quarterly sales beat estimates; shares soar 10 pct "
    },
    {
        "content": "Nov 23 Tyson Foods Inc  the biggest U.S. meat processor  reported a 4 percent rise in quarterly sales  helped by higher demand for chicken and as the Hillshire Brands acquisition boosted sales of prepared foods.",
        "date": "11232015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods quarterly sales rise 4 pct "
    },
    {
        "content": "Tyson Foods Inc's bid to curb class actions might have hit a roadblock at the U.S. Supreme Court on Tuesday  in the form of a  69-year-old wage and hour decision.",
        "date": "11112015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Supreme Court's attention in Tyson shifts to wage and hour precedent "
    },
    {
        "content": "WASHINGTON U.S. Supreme Court justices expressed skepticism on Tuesday toward Tyson Foods Inc's challenge to an almost $5.8 million class action judgment in a case that could buck the court's recent pro-business trend in such disputes.",
        "date": "11102015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "U.S. justices skeptical toward Tyson class action appeal "
    },
    {
        "content": "WASHINGTON  Nov 10 U.S. Supreme Court justices expressed skepticism on Tuesday toward Tyson Foods Inc's  challenge to an almost $5.8 million class action judgment in a case that could buck the court's recent pro-business trend in such disputes.",
        "date": "11102015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 3-U.S. justices skeptical toward Tyson class action appeal "
    },
    {
        "content": "WASHINGTON  Nov 10 U.S. Supreme Court justices on Tuesday expressed skepticism toward Tyson Foods Inc's  challenge to an almost $5.8 million judgment against the company over worker pay at an Iowa pork facility in a closely watched class action case.",
        "date": "11102015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "U.S. justices express skepticism toward Tyson class action appeal "
    },
    {
        "content": "WASHINGTON  Oct 2 Big business is urging the U.S. Supreme Court to curb class action litigation in a series of cases that dominate the nine justices' business docket in the coming months.",
        "date": "10022015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "U.S. Supreme Court's business docket targets class actions "
    },
    {
        "content": "Aug 26 Tyson Foods Inc  one of the world's largest meat processors  on Wednesday won the reversal of nearly $24 million of damage awards in two class action lawsuits claiming it cheated thousands of hourly workers in two Nebraska plants out of wages.",
        "date": "08262015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "UPDATE 1-Tyson Foods wins reversal of damages in Nebraska wage lawsuits "
    },
    {
        "content": "Aug 26 Tyson Foods Inc  one of the world's largest meat processors  on Wednesday won the reversal of nearly $24 million of damage awards in two class action lawsuits claiming it cheated thousands of hourly workers in two Nebraska plants out of wages.",
        "date": "08262015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods wins reversal of damages in Nebraska wage lawsuits "
    },
    {
        "content": "Aug 14 Tyson Foods Inc on Friday said it is permanently ceasing beef production at its plant in Denison  Iowa  effective immediately  as cattle ranchers work to rebuild shrunken herds following the severe Midwestern drought.",
        "date": "08142015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "UPDATE 2-Tyson cuts beef production due to cattle shortage "
    },
    {
        "content": "Aug 14 Tyson Foods Inc said it will cut beef production capacity due to a shortage of cattle and will close beef operations at its plant in Denison  Iowa  effective Friday.",
        "date": "08142015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson to cut beef production due to cattle shortage "
    },
    {
        "content": "Tyson Foods Inc   the biggest U.S. meat processor  cut its full-year profit forecast after posting its slowest sales growth in nine quarters as customers overseas refused to accept shipments delayed by West Coast port disruptions. | Video ",
        "date": "08032015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Tyson sales growth slows as port disruptions hit beef exports "
    },
    {
        "content": "Aug 3 Tyson Foods Inc  the biggest U.S. meat processor  warned it may not be able to achieve its profit forecast for the year ending September due to export disruptions in its beef business and high cattle costs.",
        "date": "08032015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods warns full-year profit may fall short of forecast "
    },
    {
        "content": "The former chief of a financial services firm owned by Live Nation Entertainment Inc  who was previously accused of embezzling from former heavyweight boxing champion Mike Tyson  was charged by the U.S. Securities and Exchange Commission with stealing $670 000 from clients.",
        "date": "06152015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "SEC charges ex-Mike Tyson financial adviser with fraud "
    },
    {
        "content": "June 15 The former chief of a financial services firm owned by Live Nation Entertainment Inc  who was previously accused of embezzling from former heavyweight boxing champion Mike Tyson  was charged by the U.S. Securities and Exchange Commission with stealing $670 000 from clients.",
        "date": "06152015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 1-SEC charges ex-Mike Tyson financial adviser with fraud "
    },
    {
        "content": "The former chief of a financial services firm owned by Live Nation Entertainment Inc  who was previously accused of embezzling from former heavyweight boxing champion Mike Tyson  was charged by the U.S. Securities and Exchange Commission with stealing $670 000 from clients.",
        "date": "06162015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "SEC charges ex-Mike Tyson financial adviser with fraud "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Monday agreed to take up Tyson Foods Inc's challenge to an almost $5.8 million judgment awarded against the company over worker pay at an Iowa meat-processing facility in a case that gives the nine justices a new chance to curb class action litigation.",
        "date": "06082015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "U.S. Supreme Court takes up Tyson Foods class action challenge "
    },
    {
        "content": "WASHINGTON  June 8 The U.S. Supreme Court on Monday agreed to take up Tyson Foods Inc's challenge to an almost $5.8 million judgment awarded against the company over worker pay at an Iowa meat-processing facility in a case that gives the nine justices a new chance to curb class action litigation.",
        "date": "06082015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 2-U.S. Supreme Court takes up Tyson Foods class action challenge "
    },
    {
        "content": "WASHINGTON  June 8 The U.S. Supreme Court on Monday agreed to take up Tyson Foods Inc's challenge to an almost $5.8 million judgment awarded against the company over worker pay at an Iowa meat processing facility.",
        "date": "06082015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "U.S. Supreme Court to hear new Tyson Foods class action case "
    },
    {
        "content": "SAO PAULO  June 1 Brazilian meatpacker JBS SA  said in a market filing on Monday that Mexico's market regulator approved its subsidiary JBS Food's bid to acquire the poultry assets of Tyson Foods Inc in Mexico.",
        "date": "06012015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Brazil JBS says regulator approves Tyson asset takeover in Mexico "
    },
    {
        "content": "Tyson Food Inc   the biggest U.S. meat processor  posted a better-than-expected quarterly profit  helped by its acquisition of Jimmy Dean sausage maker Hillshire Brands Co last year.",
        "date": "05042015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Hillshire deal helps Tyson Foods beat profit estimates "
    },
    {
        "content": "May 4 Tyson Foods Inc  the biggest U.S. meat processor  reported a 10.5 percent rise in quarterly sales  helped by the acquisition of Jimmy Dean sausage maker Hillshire Brands Co.",
        "date": "05042015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods sales rise 10.5 pct on Hillshire acquisition "
    },
    {
        "content": "CHICAGO Tyson Foods Inc   the largest U.S. poultry producer  plans to eliminate use of human antibiotics in its chicken flocks by September 2017  one of the most aggressive timetables yet set by an American poultry company.",
        "date": "04282015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods to end use of human antibiotics in U.S. chickens by 2017 "
    },
    {
        "content": "CHICAGO  April 28 Tyson Foods Inc  the largest U.S. poultry producer  plans to eliminate use of human antibiotics in its chicken flocks by September 2017  one of the most aggressive timetables yet set by an American poultry company.",
        "date": "04282015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 1-Tyson Foods to end use of human antibiotics in U.S. chickens by 2017 "
    },
    {
        "content": "CHICAGO  April 28 Tyson Foods Inc  the largest U.S. poultry producer  plans to eliminate the use of human antibiotics in its chicken flocks by September 2017 - one of the most aggressive timelines yet set by an American poultry company.",
        "date": "04282015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "CORRECTED-Tyson Foods plans to cut human antibiotics in U.S. chicken flocks by 2017 "
    },
    {
        "content": "CHICAGO Tyson Foods Inc  the largest U.S. poultry producer  plans to eliminate the use of human antibiotics in its chicken flocks by September 2017 - one of the most aggressive timelines yet set by an American poultry company.",
        "date": "04282015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson Foods plans to cut human antibiotics in U.S. chicken flocks by 2017 "
    },
    {
        "content": "CHICAGO The U.S. Department of Agriculture on Wednesday confirmed the discovery of highly pathogenic avian influenza in a commercial turkey flock in Arkansas  the third-largest U.S. turkey producer and home to Tyson Foods Inc  the nation's biggest chicken company.",
        "date": "03122015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Highly pathogenic bird flu confirmed in Arkansas turkeys: USDA "
    },
    {
        "content": "LOS ANGELES/CHICAGO  March 12 KFC  the world's largest chain of fried chicken restaurants  may face pressure from consumer and environmental groups to change how its poultry are raised after McDonald's Corp said it would switch to chicken raised without human antibiotics.",
        "date": "03122015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "RPT - INSIGHT-KFC faces pressure after McDonald's says no antibiotics in chicken "
    },
    {
        "content": " ",
        "date": "03122015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 2-Highly pathogenic bird flu confirmed in Arkansas turkeys -USDA "
    },
    {
        "content": "CHICAGO A suspected case of avian influenza has been identified in poultry in Arkansas  the third-largest U.S. turkey producer and home to Tyson Foods Inc  the nation's biggest chicken company  the U.S. Department of Agriculture said on Tuesday.",
        "date": "03102015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Suspected bird flu in Arkansas poultry threatens exports "
    },
    {
        "content": "CHICAGO/LOS ANGELES McDonald's Corp's decision last week to phase out human antibiotics from its U.S. chicken supply will add to costs of production in a tight-margin business that are likely to be borne mostly by poultry companies. | Video ",
        "date": "03092015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Chicken growers set to pay price for no-antibiotic McNugget "
    },
    {
        "content": "CHICAGO/LOS ANGELES McDonald's Corp's decision last week to phase out human antibiotics from its U.S. chicken supply will add to costs of production in a tight-margin business that are likely to be borne mostly by poultry companies.",
        "date": "03082015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Chicken growers set to pay price for no-antibiotic McNugget "
    },
    {
        "content": "CHICAGO  March 10 A suspected case of avian influenza has been identified in poultry in Arkansas  the third-largest U.S. turkey producer and home to Tyson Foods Inc   the nation's biggest chicken company  the U.S. Department of Agriculture said on Tuesday.",
        "date": "03102015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 1-Suspected bird flu in Arkansas poultry threatens exports "
    },
    {
        "content": "CHICAGO/LOS ANGELES  March 9 McDonald's Corp's  decision last week to phase out human antibiotics from its U.S. chicken supply will add to costs of production in a tight-margin business that are likely to be borne mostly by poultry companies.",
        "date": "03092015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "RPT - INSIGHT-Chicken growers set to pay price for no-antibiotic McNugget "
    },
    {
        "content": "CHICAGO/LOS ANGELES  March 8 McDonald's Corp's  decision last week to phase out human antibiotics from its U.S. chicken supply will add to costs of production in a tight-margin business that are likely to be borne mostly by poultry companies.",
        "date": "03082015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "INSIGHT-Chicken growers set to pay price for no-antibiotic McNugget "
    },
    {
        "content": "CHICAGO A suspected case of avian influenza has been identified in poultry in Arkansas  the third-largest U.S. turkey producer and home to Tyson Foods Inc  the nation's biggest chicken company  the U.S. Department of Agriculture said on Tuesday.    The infection  if confirmed  threatens to widen trading restrictions from countries such as Taiwan  Singapore and Nicaragua that have already limited U.S. poultry exports due to bird flu outbreaks in states ranging from Minnesota and Misso | Video ",
        "date": "03112015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "Suspected bird flu in Arkansas poultry threatens exports "
    },
    {
        "content": "CHICAGO The U.S. Department of Agriculture on Wednesday confirmed the discovery of highly pathogenic avian influenza in a commercial turkey flock in Arkansas  the third-largest U.S. turkey producer and home to Tyson Foods Inc  the nation's biggest chicken company.",
        "date": "03112015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Highly pathogenic bird flu confirmed in Arkansas turkeys: USDA "
    },
    {
        "content": "CHICAGO  March 11 The U.S. Department of Agriculture on Wednesday confirmed the discovery of highly pathogenic avian influenza in a commercial turkey flock in Arkansas  the third-largest U.S. turkey producer and home to Tyson Foods Inc  the nation's biggest chicken company.",
        "date": "03112015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 1-Highly pathogenic bird flu confirmed in Arkansas turkeys -USDA "
    },
    {
        "content": "CHICAGO  March 10 A suspected case of avian influenza has been identified in poultry in Arkansas  the third-largest U.S. turkey producer and home to Tyson Foods Inc   the nation's biggest chicken company  the U.S. Department of Agriculture said on Tuesday.",
        "date": "03112015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "RPT-UPDATE 2-Suspected bird flu in Arkansas poultry threatens exports "
    },
    {
        "content": "CHICAGO  March 11 Tyson Foods Inc has removed gentamicin  a key antibiotic for human use  from company hatcheries  the company told Reuters on Tuesday.",
        "date": "03112015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "Tyson continues effort to cut antibiotics from chicken production "
    },
    {
        "content": "CHICAGO A suspected case of avian influenza has been identified in poultry in Arkansas  the third-largest U.S. turkey producer and home to Tyson Foods Inc  the nation's biggest chicken company  the U.S. Department of Agriculture said on Tuesday.",
        "date": "03112015",
        "name": "Tyson Foods Inc",
        "news_type": "normal",
        "symbol": "TSN",
        "title": "UPDATE 2-Suspected bird flu in Arkansas poultry threatens exports "
    },
    {
        "content": "ConAgra Foods Inc   the maker of Slim Jim beef jerky and Chef Boyardee pasta  appointed former Hillshire Brands Co Chief Executive Sean Connolly its CEO  replacing Gary Rodkin.",
        "date": "02122015",
        "name": "Tyson Foods Inc",
        "news_type": "topStory",
        "symbol": "TSN",
        "title": "ConAgra names Sean Connolly CEO  cuts profit forecast "
    }
]