[
    {
        "content": "Nov 8 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "11082017",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "SAO PAULO  Nov 8 Tim Participações SA   Brazil's second-largest wireless phone company  expressed concerns on Wednesday about the potential acquisition of debt-laden carrier Oi SA by state-run China Telecom Corp Ltd  adding to criticism already put forth by rival Telefonica Brasil SA.",
        "date": "11082017",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "UPDATE 1-Brazil's TIM criticizes China Telecom tactics in Oi bid "
    },
    {
        "content": "SAO PAULO  Nov 7 TIM Participações SA   Brazil's second-largest wireless phone company  on Tuesday reported third-quarter net income of 279 million reais ($85.3 million)  up 51.6 percent from a year earlier  as customers continued to shift away from pre-paid plans in the strengthening economy.",
        "date": "11082017",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil's TIM beats quarterly profit estimates "
    },
    {
        "content": "SAO PAULO  Oct 4 The government of Brazilian state Rio Grande do Sul may sell a non-controlling stake in state bank Banco do Estado do Rio Grande do Sul SA  according to a securities filing on Wednesday.",
        "date": "10042017",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Rio Grande do Sul state gov't may sell stake in Brazil's Banrisul "
    },
    {
        "content": "SAO PAULO  July 26 Brazilian wireless carrier TIM Participações SA is standing by its capital spending target for this year  as stronger revenue in the second half of the year should provide cash to increase investments  executives said on Wednesday.",
        "date": "07262017",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM sticks to 2017 capital spending target "
    },
    {
        "content": "SAO PAULO  July 25 TIM Participaçoes SA   Brazil's second-largest wireless phone company  reported on Tuesday that second-quarter net income nearly tripled from a year earlier to 219 million reais ($69 million)  according to a securities filing.",
        "date": "07262017",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil wireless carrier TIM triples profit  beating forecasts "
    },
    {
        "content": "BRASILIA  July 25 Brazilian wireless carrier TIM Participações SA has obtained board approval for its plan to reorganize its subsidiaries TIM Celular and long-distance operator Intelig Telecom  according to a securities filing on Tuesday.",
        "date": "07262017",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil carrier TIM board approves reorganization of subsidiaries "
    },
    {
        "content": "SAO PAULO  April 28 TIM Participaçoes SA   Brazil's second-largest wireless phone company  posted first-quarter net income of 132 million reais ($41.46 million)  up 3.3 percent from a year earlier  according to a securities filing on Friday.",
        "date": "04282017",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM posts 3 pct rise in quarterly profit "
    },
    {
        "content": "* Signs 7.2 million euro ($7.64 million) contract with Persidera",
        "date": "04122017",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "BRIEF-Giglio Group signs 7.2 mln euro contract with Persidera "
    },
    {
        "content": "BRASILIA  Feb 3 TIM Participações SA  Brazil's second largest wireless carrier  said its net income fell 22 percent in the fourth quarter from a year earlier due to more capital spending and financial expenses.",
        "date": "02032017",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM net income drops 22 pct y/y in Q4 "
    },
    {
        "content": "SAO PAULO  Feb 2 TIM Participaçoes SA   Brazil's second-largest wireless phone company  said on Thursday it aims to trim capital spending in the next three years while expanding its operating margins and maintaining positive revenue growth.",
        "date": "02032017",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil's TIM aims to cut investment  expand margins in 2017-2019 "
    },
    {
        "content": "MILAN  Jan 10 Telecom Italia has no intention of merging its TIM Participações SA unit with Brazilian wireless carrier Oi SA  a spokesman for Telecom Italia said on Tuesday.",
        "date": "01102017",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Telecom Italia has no intention to merge Tim Brasil with Oi "
    },
    {
        "content": "SAO PAULO  Oct 31 TIM Participaçoes SA   Brazil's second-largest wireless carrier  on Monday posted a 49 percent drop in third-quarter net income from the same period a year ago but still beat market expectations.",
        "date": "10312016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM beats expectations with 184 mln real Q3 profit "
    },
    {
        "content": "SAO PAULO  Nov 1 TIM Participacoes SA  Chief Executive Officer Stefano De Angelis vowed to accelerate the migration of pre-paid clients into post-paid while keeping sales expenses in check  one of his initiatives to revive profits at Brazil's No. 2 wireless carrier.",
        "date": "11012016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "UPDATE 1-TIM Brasil seeks faster post-paid migration to revive margins "
    },
    {
        "content": "SAO PAULO  Nov 1 Tim Participacoes SA   Brazil's second largest wireless carrier  on Tuesday reaffirmed its plans to invest 12.5 billion reais ($3.9 billion) during the 2016-2018 period.",
        "date": "11012016",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil's TIM reaffirms 12.5 bln reais investment plan "
    },
    {
        "content": "RIO DE JANEIRO Brazil's state-owned oil producer Petrobras agreed to sell 90 percent of a natural gas pipeline unit to a group led by Canada's Brookfield Asset Management Inc  for $5.2 billion  the companies said on Friday.",
        "date": "09232016",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brookfield-led group to pay $5.2 billion for Petrobras natgas unit "
    },
    {
        "content": "SAO PAULO  Sept 21 America Movil SAB  is interested in acquiring some or all of the operations run by struggling Brazilian rival Oi SA  the chief executive of the Mexican telecom giant said in a newspaper interview published on Wednesday.",
        "date": "09212016",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Mexico's America Movil eyes acquisition of Brazilian rival Oi -Valor "
    },
    {
        "content": "* Said on Friday that the board of directors had agreed to appoint Adrian Calaza as new chief financial officer to replace Guglielmo Noya",
        "date": "09052016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "BRIEF-TIM Participacoes appoints new CFO "
    },
    {
        "content": "SAO PAULO  July 25 TIM Participaçoes SA   Brazil's second-largest wireless carrier  on Monday posted an 85 percent drop in second-quarter net income from a year ago.",
        "date": "07262016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "UPDATE 1-Brazil's TIM posts lower quarterly profit  misses consensus "
    },
    {
        "content": "SAO PAULO  July 25 TIM Participaçoes SA   Brazil's second-largest wireless carrier  on Monday posted an 85-percent drop in second-quarter net income from a year ago.",
        "date": "07262016",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil's TIM posts 47.41 mln real quarterly profit - filing "
    },
    {
        "content": "* Signs a three-parties partnership agreement with Tim SA  and Rotopino.pl SA for the delivery of the company's products",
        "date": "07192016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "BRIEF-Sonel signs partnership agreement with Tim and Rotopino.pl "
    },
    {
        "content": "SAO PAULO  July 11 Brazilian wireless carrier TIM Participações SA has laid off 1 700 call center employees  union representatives said on Monday  highlighting efforts to cut costs in the worst recession in decades.",
        "date": "07112016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "TIM Brasil lays off 1 700 workers in call center cuts -union "
    },
    {
        "content": "June 1 Banco do Estado do Rio Grande do Sul SA  :",
        "date": "06012016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "BRIEF-Banrisul to pay BRL 1.28 billion for civil servants payroll transfer "
    },
    {
        "content": "* Announces new agreement between TIM and Gemalto to develop a new mobile marketing tool focused on app installation  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "05302016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "BRIEF-Gemalto announces new agreement with TIM "
    },
    {
        "content": "SAO PAULO  May 11 TIM Participaçoes SA   Brazil's second-largest wireless phone company  is replacing its chief executive  seeking new leadership to spearhead a turnaround after reporting a 60 percent drop in first-quarter net income.",
        "date": "05122016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM replaces CEO after first-quarter profit slides 60 pct "
    },
    {
        "content": "MOSCOW  Feb 25 London-based investment firm LetterOne  controlled by Russian billionaire Mikhail Fridman  said it could not proceed with its plan to facilitate a proposed merger between Brazilian telecoms groups Oi SA and TIM Participações SA.",
        "date": "02252016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "RPT-LetterOne says cannot proceed with proposed Oi/Tim tie-up "
    },
    {
        "content": "RIO DE JANEIRO  Feb 11 TIM Participações SA   the Brazilian telephone unit of Telecom Italia SpA   plans to lay off 800 to 1 000 workers as it restructures operations to boost efficiency  a union representing company workers said on Thursday.",
        "date": "02112016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Telecom Italia Brazil unit to lay off up to 1 000 workers -union "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 05 (Fitch) According to the latest of Fitch Ratings'  10-report series titled '10 Most Distressed LatAm Corporates ' Oi S.A.'s (Oi)  rating depends entirely on whether the merger with TIM Participacoes S.A. (TIM)  takes place. We intend to release one report each day through February 12 as per the schedule  found at the end of this release. \"A successful merger with TIM  based on an equity-swap deal without any  addit",
        "date": "02052016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Fitch Report: What Investors Want to Know: Oi's Rating Depends on TIM Merger "
    },
    {
        "content": "SAO PAULO  Feb 4 TIM Participaçoes SA   Brazil's second-largest wireless phone company  posted a 3.3 percent rise in fourth-quarter net income despite falling revenues  as it continued  selling rights to more of its cellular towers.",
        "date": "02042016",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM posts 475 mln reais quarterly profit "
    },
    {
        "content": "RIO DE JANEIRO  Feb 5 TIM Participaçoes SA   Brazil's second-largest wireless phone company  expects data transfer revenues to surpass voice revenues in 2016  the company's Chief Executive Officer Rodrigo Abreu said on Friday.",
        "date": "02052016",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil's Tim sees data surpassing voice revenues -CEO "
    },
    {
        "content": "SAO PAULO  Dec 9 The chief executive officer of TIM Participacoes SA  Rodrigo Abreu  said the telecommunications provider will review opportunities for consolidation when they arise but denied there was a deal in the works to merge with Brazil's biggest fixed-line operator Oi SA .",
        "date": "12092015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM open to M&A if opportunities arise - CEO "
    },
    {
        "content": "* No offer for TIM Brasil has been presented so far   (Adds that Vivendi not expected to oppose  comments from conference call)",
        "date": "11062015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "UPDATE 1-Vivendi will not oppose Telecom Italia stock conversion-source "
    },
    {
        "content": "SAO PAULO  Nov 4 Wireless carrier TIM Participações SA is not counting on consolidation of major players in Brazil  although there are aspects of the market opening the door for a possible tie-up  Chief Executive Rodrigo Abreu said on Wednesday.",
        "date": "11042015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM sees market aspects opening door for consolidation "
    },
    {
        "content": "SAO PAULO  Nov 3 TIM Participaçoes SA  Brazil's second-largest wireless phone company  reported a 50 percent drop in adjusted net profit for the third quarter to 172 million reais ($45.6 million)  the company said in a Tuesday securities filing.",
        "date": "11032015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "UPDATE 2-Brazil's TIM posts 50 pct drop in adjusted Q3 profit "
    },
    {
        "content": "BRASILIA  Nov 3 TIM Participaçoes SA  Brazil's second-largest wireless phone company  reported on Tuesday a 50 percent drop in adjusted net profit for the third quarter to 172 million Brazilian reais ($45.6 million)  the company said in a securities filing.",
        "date": "11032015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil's TIM posts 50 pct drop in adjusted Q3 profit "
    },
    {
        "content": "SAO PAULO/MOSCOW Brazil's telecommunications group Oi SA  and investment firm LetterOne said on Friday they entered exclusive financing negotiations for a merger with rival TIM Participações SA .",
        "date": "10302015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil Oi in exclusive talks with LetterOne for merger with TIM "
    },
    {
        "content": "SAO PAULO Shares of Brazilian telecommunications company Oi SA  jumped as much as 7 percent on Thursday on a report that its board of directors approved a proposal by investment firm LetterOne Group to inject up to $4 billion in the company if it merges with rival TIM Participações SA .",
        "date": "10292015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil Oi shares jump as LetterOne proposal reportedly approved "
    },
    {
        "content": "SAO PAULO  Oct 28 Brazil needs to update its regulations for fixed-line telephone concessions to pave the way for long-term investments and possible consolidation of market players  the chief executive of wireless carrier TIM Participações SA said Wednesday.",
        "date": "10282015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "TIM CEO says any consolidation depends on new regulations "
    },
    {
        "content": "SAO PAULO  Oct 27 Updated regulations in Brazil will determine whether wireless carrier TIM Participações SA  considers a tie-up with a local rival  the chief executive officer of controlling shareholder Telecom Italia SpA  said on Tuesday.",
        "date": "10272015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "New Brazil rules key for any merger  Telecom Italia CEO says "
    },
    {
        "content": "SAO PAULO LetterOne Group  the investment firm controlled by Russian billionaire Mikhail Fridman  could pour up to $4 billion into Brazilian telecommunications company Oi SA  if it merges with rival TIM Participações SA .",
        "date": "10262015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's Oi gets proposal for TIM tie-up from LetterOne "
    },
    {
        "content": "SAO PAULO/MOSCOW  Oct 30 Brazil's telecommunications group Oi SA and investment firm LetterOne said on Friday they entered exclusive financing negotiations for a merger with rival TIM Participações SA .",
        "date": "10302015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "UPDATE 2-Brazil Oi in exclusive talks with LetterOne for merger with TIM "
    },
    {
        "content": "SAO PAULO  Oct 26 LetterOne Group  the investment firm controlled by Russian billionaire Mikhail Fridman  could pour up to $4 billion into Brazilian telecommunications company Oi SA if it merges with rival TIM Participações SA.",
        "date": "10262015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "UPDATE 2-Brazil's Oi gets proposal for TIM tie-up from LetterOne "
    },
    {
        "content": "SAO PAULO  Oct 26 Oi SA  Brazil's No. 4 wireless carrier  received on Friday a proposal by investment firm LetterOne Group to pursue a potential combination with rival TIM Participações SA.",
        "date": "10262015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil's Oi receives proposal from LetterOne for tie-up with rival "
    },
    {
        "content": "SAO PAULO  Oct 30 Brazil's telecommunications group Oi SA said on Friday it entered in exclusive negotiations with investment firm LetterOne to merge with rival TIM Participações SA.",
        "date": "10302015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil Oi says in exclusive talks with LetterOne for merger with TIM "
    },
    {
        "content": "SAO PAULO  Oct 7 TIM Participações SA   Brazil's second-largest wireless carrier  says it is currently not in talks with any rivals over possible consolidation moves  as reported by local media this week.",
        "date": "10072015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "TIM Brasil says not in talks over potential tie-up with rivals "
    },
    {
        "content": "MILAN Telecom Italia  on Friday opened the way for the sale of its listed phone masts group Inwit  but also said it was not planning to sell its Brazilian mobile network operator Tim Participacoes .",
        "date": "09252015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Telecom Italia paves way for sale of Inwit "
    },
    {
        "content": "MILAN  Sept 25 Telecom Italia on Friday opened the way for the sale of its listed phone masts group Inwit but also said it was not planning to sell its Brazilian mobile network operator Tim Participacoes .",
        "date": "09252015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "UPDATE 1-Telecom Italia paves way for sale of Inwit "
    },
    {
        "content": "NEW YORK  Sept 15 Brazilian telecom company TIM Participações SA will stick to its investment plan  denominated in reais  despite a more than 30 percent drop in Brazil's currency this year  Chief Executive Rodrigo Abreu told analysts on Monday.",
        "date": "09152015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM sticking to investment plan despite currency drop "
    },
    {
        "content": "SAO PAULO  Aug 5 TIM Participações SA   Brazil's second-biggest wireless carrier  aims to reduce operating expenses by at least 1 billion reais ($290 million) over the next three years  Chief Financial Officer Guglielmo Noya said on a Wednesday earnings call.",
        "date": "08052015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil telecom TIM announces three-year cost cutting plan "
    },
    {
        "content": "SAO PAULO  Aug 4 TIM Participaçoes SA   Brazil's second-largest wireless phone company  reported on Tuesday a 20 percent drop in adjusted quarterly profit due to weak sales.",
        "date": "08052015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil's TIM posts 20 percent drop in adjusted quarterly profit "
    },
    {
        "content": "SAO PAULO  June 18 Brazilian wireless carrier TIM Participações SA said on Thursday that its controlling shareholder Telecom Italia SpA had reiterated that it remains a strategic asset for the Italian group.",
        "date": "06182015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM says Telecom Italia has no info on possible sale "
    },
    {
        "content": "SAO PAULO  May 6 TIM Participaçoes SA   Brazil's second-largest wireless phone company  is not planning significant job cuts as part of its program to control costs  Chief Executive Rodrigo Abreu said on a Wednesday call to discuss earnings.",
        "date": "05062015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazilian telecom TIM not planning significant job cuts -CEO "
    },
    {
        "content": "SAO PAULO  May 5 TIM Participaçoes SA   Brazil's second-largest wireless phone company  posted a 16 percent drop in first-quarter profit from a year ago due to weak sales and rising expenses.",
        "date": "05062015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil's TIM hits sales headwinds  profit down 16 pct "
    },
    {
        "content": "RIO DE JANEIRO  Feb 20 Brazilian telecommunications company TIM Participacoes SA plans to invest more than 14 billion reais ($4.90 billion) from 2015 to 2017  the company said on Friday in a strategic planning statement.",
        "date": "02202015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "UPDATE 1-Brazil's TIM to invest more than $4.9 bln in 2015-2017 "
    },
    {
        "content": "SAO PAULO  Feb 12 TIM Participações SA   Brazil's second-largest wireless phone company  posted an 8 percent drop in quarterly profit on Thursday because of stagnant sales and rising costs.",
        "date": "02132015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Brazil's TIM profit slips 8 percent on weak sales "
    },
    {
        "content": "RIO DE JANEIRO  Feb 20 Brazilian telecommunications company TIM Participacoes SA  expects continued net sales growth in the 2015-2017 period  the company said on Friday in a strategic planning statement.",
        "date": "02202015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazilian telecoms firm TIM expects 2015-2017 net sales growth -plan "
    },
    {
        "content": "Jan 23 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "01232015",
        "name": "TIM Participacoes SA",
        "news_type": "topStory",
        "symbol": "TSU",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "RIO DE JANEIRO  Jan 23 A group of Brazilian telecommunications companies is ready to make a bid for wireless carrier TIM Participações SA in the short term  a source with knowledge of the situation told Reuters  after Oi SA  secured shareholder approval for the sale of its Portuguese assets.",
        "date": "01232015",
        "name": "TIM Participacoes SA",
        "news_type": "normal",
        "symbol": "TSU",
        "title": "Brazil telecom firms set for bid for TIM after Portuguese deal "
    }
]