[
    {
        "content": "Nov 10 Indian shares were nearly unchanged on Friday  with refiners such as Reliance Industries Ltd tumbling as oil prices gained overnight and Tata Motors Ltd down after it said its British unit faced intensifying competition.",
        "date": "11102017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares little changed; Reliance  Tata Motors fall "
    },
    {
        "content": "* Says global wholesales for Jaguar Land Rover were 49 757 vehicles in Oct 2017",
        "date": "11102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors says Tata Motors Group Oct global wholesales  including JLR  up 2.7 pct "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_11102017.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     08:30 am: Aurobindo Pharma post-earnings analyst conference call in Mumbai.     09:15 am: Mahindra Logistics lists on stock exchanges in Mumbai.     10:00 am: Prime Minister Economic Advisory Council",
        "date": "11102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Morning News Call - India  November 10 "
    },
    {
        "content": "* Strong customer demand for Range Rover Velar drive profits (Adds executive's comments)",
        "date": "11092017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 2-Tata Motors' Q2 profits boosted by rise in Jaguar Land Rover sales "
    },
    {
        "content": "Nov 9 India's Tata Motors Ltd reported a nearly three-fold rise in quarterly profit on Thursday  blowing past estimates  helped by higher sales from its Jaguar Land Rover business.",
        "date": "11092017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Tata Motors Q2 profit jumps three-fold  beats estimates "
    },
    {
        "content": "* Blackberry in talks with Tata Motors' Jaguar Land Rover for software deal- WSJ  citing sources Source text : http://on.wsj.com/2Agzg5T Further company coverage:",
        "date": "11032017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Blackberry in talks with Tata Motors' Jaguar Land Rover for software deal- WSJ "
    },
    {
        "content": "Nov 6 Indian shares ended nearly flat on Monday  after hitting record highs earlier in the session  as blue chips such as Bharti Airtel Ltd fell on profit-taking  though Tata Motors Ltd rallied on strong earnings expectations.",
        "date": "11062017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares end little changed after hitting record highs "
    },
    {
        "content": "* Sept quarter consol profit 24.83 billion rupees versus profit of 8.28 billion rupees last year",
        "date": "11092017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors Sept qtr consol profit nearly triples "
    },
    {
        "content": "* Says ‍initiated steps to terminate dealership & hire purchase agreements between co and Tata Motors​ Source text - http://bit.ly/2z0MxPG Further company coverage:",
        "date": "10312017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-LG Balakrishnan & Bros ‍initiates steps to terminate agreements with Tata Motors​ "
    },
    {
        "content": "* Says ‍co buys blower assembly business from Ashok Leyland  Swaraj Mazda Isuzu  Mahindra Truck and Bus division  Tata Motors",
        "date": "10302017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Subros buys blower assembly business from Ashok Leyland  Tata Motors  others "
    },
    {
        "content": "* Overall commercial vehicles sales in october 2017  in domestic market were at 32 411 nos.  higher by 7% over October 2016​",
        "date": "11012017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Oct domestic passenger & commercial vehicle business up 5 pct "
    },
    {
        "content": "BRUSSELS  Oct 13 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10132017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "EU mergers and takeovers (Oct 13) "
    },
    {
        "content": "* Seeks shareholders' nod for for proposed scheme of merger and arrangement between tml drivelines limited and co  as per NCLT directive Source text - http://bit.ly/2i70zuz Further company coverage:",
        "date": "10132017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors seeks shareholders' nod for for proposed scheme of merger and arrangement between TML Drivelines and co "
    },
    {
        "content": "* Says group global wholesales in Sept were 116419  up 14 pct‍​",
        "date": "10102017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Group Sept global wholesales  including JLR  up 14 pct‍​ "
    },
    {
        "content": "Oct 3 Indian shares closed higher for a third straight session on Tuesday as automakers such as Tata Motors Ltd gained on strong monthly sales  while investors shifted their focus to the Reserve Bank of India's policy meeting on Wednesday.",
        "date": "10032017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares rise for third session; Tata Motors surges "
    },
    {
        "content": "* Says co  Tata Motors sign MoU to finance commercial vehicles‍​‍​",
        "date": "10042017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-SREI Equipment Finance  Tata Motors sign MoU to finance commercial vehicles‍​‍​ "
    },
    {
        "content": "Oct 3 Indian shares rose over 1 percent on Tuesday and were headed for a third consecutive session of gains  as automakers such as Tata Motors Ltd surged after posting strong monthly sales  while Dr. Reddy's Laboratories jumped on the launch of a drug in its key U.S. market.",
        "date": "10032017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares head for 3rd session of gains; automakers jump on Sept sales "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_10032017.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     9:15 am: SBI Life Insurance lists on stock exchanges in Mumbai.     11:00 am: Vespa Red launch in Mumbai.     1:00 pm: NHAI Chairman to launch new website and project monitoring information system mo",
        "date": "10032017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Morning News Call - India  October 3 "
    },
    {
        "content": "* Energy Efficiency Services Limited to procure 10 000 electric vehicles from Tata Motors‍​",
        "date": "09292017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Energy Efficiency Services Limited to buy 10 000 electric vehicles from Tata Motors‍​ "
    },
    {
        "content": "DETROIT  Sept 29 An initial public offering by Lyft Inc will give investors a way to jump into self-driving cars  although the ride services company and rival Uber Technologies Inc may have to wait years before sending a driverless robotaxi to a customer.",
        "date": "09292017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Lyft IPO puts investors in self-driving cars as well as ride services "
    },
    {
        "content": "BRUSSELS  Sept 21 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09212017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "EU mergers and takeovers (Sept 21) "
    },
    {
        "content": "MUMBAI Citi is handling the process for a prospective buyer to acquire up to 20 billion rupees ($311.8 million) worth of shares in India's Tata Motors Ltd  on Tuesday  according to a term sheet seen by Reuters.",
        "date": "09182017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Book opens for buyer seeking $312 million stake in India's Tata Motors "
    },
    {
        "content": "MUMBAI  Sept 18 Citi is handling the process for a prospective buyer to acquire up to 20 billion rupees ($311.8 million) worth of shares in India's Tata Motors Ltd on Tuesday  according to a term sheet seen by Reuters.",
        "date": "09182017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Book opens for buyer seeking $312 mln stake in India's Tata Motors "
    },
    {
        "content": "FRANKFURT Volkswagen's  Skoda division remains open to teaming up with other players to help meet cost targets to build a low-cost car for emerging markets  its chief executive said  after cooperation talks with India's Tata Motors  collapsed.",
        "date": "09142017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "VW's Skoda open to partnerships on India low-cost car: CEO "
    },
    {
        "content": "* Says Tata Motors Group global wholesales at 94 210 in August 2017  ‍​",
        "date": "09122017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Group Aug global wholesales  including JLR  up 9 pct "
    },
    {
        "content": "* Says total retail sales for Jaguar Land Rover were 38 519 vehicles in August  up 4.3 percent compared to August 2016",
        "date": "09082017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors total JLR retail sales in August was 38 519 vehicles  up 4.3 pct y-o-y "
    },
    {
        "content": "* Exec says have adopted a platform from Jaguar Land Rover to build cars and SUVs for India  first SUV to be launched in end-2018",
        "date": "09072017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors exec: have adopted a plaform from Jaguar Land Rover to build cars  SUVs for India "
    },
    {
        "content": "LONDON  Sept 7 All new Jaguar Land Rover cars will be available in an electric or hybrid version from 2020  Britain's biggest carmaker said on Thursday  as it speeds up plans to electrify its model range.",
        "date": "09072017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "All new Jaguar Land Rover cars to have electric option from 2020 "
    },
    {
        "content": "    Aug 28 India Index Services And Products Ltd      * Says Bajaj Finance Ltd  Hindustan Petroleum Corporation Ltd and UPL Ltd being included in Nifty 50 index     * ACC Ltd  Bank Of Baroda  Tata Power Co Ltd  Tata Motors Ltd DVR to be excluded from Nifty50 index from Sept 29  Source text -   The Index Maintenance Sub-Committee (IMSC) has decided to make the following replacement of stocks in various indices as part of its periodic review. These changes shall become effective from S",
        "date": "08282017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-India Index Services & Products says Bajaj Finance  HPCL and UPL Ltd to be included in Nifty 50 index "
    },
    {
        "content": "* Says August total sales of commercial and passenger vehicles of 48 988 units versus 43 105 units last year",
        "date": "09012017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors Aug total sales up about 14 pct "
    },
    {
        "content": "* To focus on cutting costs  boosting production  new launches",
        "date": "08212017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 1-India's Tata Motors CEO says to invest $625 mln to boost sales "
    },
    {
        "content": "MUMBAI  Aug 21 Tata Motors will invest more than 40 billion rupees ($625 million) to boost sales of its passenger and commercial vehicles  its chief executive said on Monday  as the Indian automaker looks to return to profit in its domestic business.",
        "date": "08212017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors CEO says to invest $625 mln to boost car  truck sales "
    },
    {
        "content": "* Says appointment of P B Balaji as chief financial officer of the company w.e.f. November 15  2017. Source text - http://bit.ly/2uGumvw Further company coverage:",
        "date": "08142017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors appoints P B Balaji as CFO "
    },
    {
        "content": "* Tata Motors Group global wholesales in July 2017  including Jaguar Land Rover  were at 98 534 nos.  higher by 12%  over July 2016",
        "date": "08082017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Group July global wholesales  including JLR  up 12 pct "
    },
    {
        "content": "BERLIN Cooperation talks between Germany's Volkswagen Group   and India's Tata Motors  about joint development of a car for emerging markets have ended amicably  the two companies said on Thursday.",
        "date": "08102017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "VW Group  Tata end talks on emerging markets tie-up "
    },
    {
        "content": "* CEO says financial position to improve in coming quarters (Adds details  CEO comments)",
        "date": "08092017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 1-One-off gain embellishes Tata Motors' first quarter profits "
    },
    {
        "content": "* Tata AMP platform cost risks led to end of talks -VW source",
        "date": "08102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 3-VW Group  Tata end talks on emerging markets tie-up "
    },
    {
        "content": "BERLIN Volkswagen's  Czech division Skoda said talks with India's Tata Motors  on a strategic alliance have ended because the two carmakers failed to achieve planned cost savings.",
        "date": "08102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "VW's Skoda  Tata end cooperation talks after failing to hit cost targets "
    },
    {
        "content": "* June quarter consol profit 31.82 billion rupees versus profit 22.36 billion rupees year ago",
        "date": "08092017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors June-qtr consol profit up about 42 pct "
    },
    {
        "content": "Aug 10 Indian shares fell for a fourth straight session on Thursday  as Tata Motors dragged indexes down after its results failed to meet expectations  while sentiment was also hurt by worries about simmering U.S.-North Korea tensions.",
        "date": "08102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares post fourth consecutive session of falls "
    },
    {
        "content": "* Says intimating cessation of discussion with Skoda around potential partnership   ‍​",
        "date": "08102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors calls off partnership talks with Skoda "
    },
    {
        "content": "FRANKFURT  Aug 10 Cooperation talks between Germany's Volkswagen Group  and India's Tata Motors about joint development of a cheap car for emerging markets  have been ended amicably  a Volkswagen Group source said on Thursday.",
        "date": "08102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "VW Group  Tata cooperation talks have been ended 'amicably' - source "
    },
    {
        "content": "Aug 9 India's Tata Motors Ltd posted a 42 percent rise in quarterly profit on Wednesday.",
        "date": "08092017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors Q1 profit rises 42 pct "
    },
    {
        "content": "Aug 10 Indian shares fell for a fourth straight session on Thursday  led by losses in financials and auto stocks  with Tata Motors weighing on the indexes after its first-quarter results failed to meet expectations.",
        "date": "08102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares extend decline; Tata Motors skids "
    },
    {
        "content": "* Tata Motors along with its distributor for Nepal Sipradi Trading Pvt. Ltd. announced commercial launch of Tata Tigor",
        "date": "08102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors announces commercial launch of Tata Tigor in Nepal "
    },
    {
        "content": "* Works council and trade union oppose Tata JV plan (New throughout)",
        "date": "08022017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 1-Thyssenkrupp works council chief says not pushing for a break up "
    },
    {
        "content": "* Approves offering of NCDs aggregating up to 10 billion rupees",
        "date": "07262017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors approves offering of NCDs aggregating up to 10 bln rupees "
    },
    {
        "content": "* India's Tata motors says considering offering non convertible debentures of upto 10 billion Rupees",
        "date": "07212017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata motors says considering offering non convertible debentures of upto 10 billion rupees "
    },
    {
        "content": "* Says Tata Motors strengthens presence in Philippines with launch of its range of commercial vehicles",
        "date": "07262017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors launches range of commercial vehicles in Philippines "
    },
    {
        "content": "* Says offering price reducion in commercial vehicles (cargo) in range of 0.3 percent to 4.21 percent",
        "date": "07062017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors slashes prices of its commercial vehicles "
    },
    {
        "content": "* Says offering a price reduction of up to 12 percent ranging between INR 3 300 and INR 217 000 depending on model and variant Source text for Eikon: Further company coverage:",
        "date": "07052017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors slashes prices of its passenger vehicles by up to 12 pct "
    },
    {
        "content": "* HIAB SECURES AN ORDER FOR OVER 600 LOADER CRANES FROM TATA MOTORS  INDIA",
        "date": "07032017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Cargotec: Hiab gets order for over 600 loader cranes from Tata Motors  India "
    },
    {
        "content": "NEW DELHI  July 2 Tata Motors Ltd's vehicle sales in June:",
        "date": "07022017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "TABLE-India's Tata Motors June total vehicle sales down 9 pct "
    },
    {
        "content": "Tata Steel Ltd  said on Friday it sold its stake in Tata Motors Ltd  to Tata Sons [TATAS.UL]  the holding company of India's salt-to-software Tata conglomerate  for 37.83 billion rupees ($586.3 million).",
        "date": "06232017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Steel sells stake in Tata Motors to Tata Sons for $586.3 million "
    },
    {
        "content": "June 23 Tata Steel Ltd said on Friday it sold its stake in Tata Motors Ltd to Tata Sons   the holding company of India's salt-to-software Tata conglomerate  for 37.83 billion rupees ($586.3 million).",
        "date": "06232017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Tata Steel sells stake in Tata Motors to Tata Sons for $586.3 mln "
    },
    {
        "content": "* Sold 83.54 million shares of Tata Motors to Tata Sons at 452.80 rupees per share (excluding brokerage and STT) Source text: http://bit.ly/2rYWBbB Further company coverage:",
        "date": "06232017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Steel sells 83.54 mln shares of Tata Motors to Tata Sons "
    },
    {
        "content": "* Says approved offering for subscription NCDs worth 5 billion rupees Source text for Eikon: Further company coverage:",
        "date": "06212017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors approved offering for subscription NCDs worth 5 bln rupees "
    },
    {
        "content": "* Says to merge unit TML Drivelines with self Source text: (http://bit.ly/2rLuOeN) Further company coverage:",
        "date": "06202017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors to merge unit TML Drivelines with self "
    },
    {
        "content": "MUMBAI  June 17 Tata Sons Ltd  the holding company of India's salt-to-software Tata conglomerate  plans to buy out Tata Steel Ltd's stake in Tata Motors Ltd on or after June 23  it said in a regulatory filing on Saturday.",
        "date": "06172017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Sons to buy Tata Steel stake in Tata Motors on or after June 23 "
    },
    {
        "content": "* To consider issuance of NCDs worth 5 billion rupees Source text: (http://bit.ly/2shiNe3) Further company coverage:",
        "date": "06162017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors to consider issuance of NCDs worth 5 bln rupees "
    },
    {
        "content": "* Committee of board approved partial divestment of stake held by company in Tata Technologies Limited  a subsidiary of company",
        "date": "06152017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Warburg Pincus to buy 43 pct stake in Tata Technologies for $360 mln "
    },
    {
        "content": "* Announced appointment of Girish Wagh as 'head of Commercial Vehicle Business Unit' and a member of executive committee",
        "date": "06132017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors appoints Girish Wagh as Head of commercial vehicle business unit "
    },
    {
        "content": "* Says Tata Motors Group global wholesales at 86 385 units in May 2017",
        "date": "06092017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors says May group global wholesales figures drop 1 pct "
    },
    {
        "content": "June 9 India's Tata Motors Ltd reached a long-term wage settlement with workers at Sanand plant in the western state of Gujarat.",
        "date": "06092017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors reaches wage deal with Sanand plant union "
    },
    {
        "content": "* Says Tata Motors resolves long-term wage settlement issue in Sanand",
        "date": "06092017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors resolves long-term wage settlement issue in Sanand "
    },
    {
        "content": "* Says May total sales of 38361 units versus 40 123 units last year",
        "date": "06022017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors May total sales down 4.3 pct "
    },
    {
        "content": "* Says Satish Borwankar has been appointed as COO of company with immediate effect Source text - (http://bit.ly/2rVRzMv) Further company coverage:",
        "date": "06052017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors names Satish Borwankar as chief operating officer "
    },
    {
        "content": "* Says resignation of Ravindra Pisharody as executive director (commercial vehicle) Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors announces resignation of Ravindra Pisharody as executive director (commercial vehicle) "
    },
    {
        "content": "BRUSSELS  May 24 EU state aid regulators opened on Wednesday an investigation into Slovakia's plan to grant 125 million euros ($139.7 million) to Tata Motors' luxury British arm Jaguar Land Rover  saying they had concerns about the legality of the measure.",
        "date": "05242017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "EU regulators to investigate Slovakian aid for Jaguar Land Rover "
    },
    {
        "content": "May 24 India's main NSE index posted its fourth session of losses in five on Wednesday as investors were unnerved by border tensions with Pakistan and on the expiry of derivatives contracts this week.",
        "date": "05242017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares fall on border tensions; Tata Motors rallies "
    },
    {
        "content": "May 24 Indian shares rose on Wednesday with Tata Motors Ltd leading the gains after the automaker reported a better-than-expected quarterly profit.",
        "date": "05242017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares rise; Tata Motors rallies "
    },
    {
        "content": "MUMBAI  May 23 India's Tata Motors reported a 17 percent fall in fourth-quarter net profit on Tuesday as losses in its domestic business outweighed strong sales at luxury British arm Jaguar Land Rover (JLR).",
        "date": "05232017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 1-Losses at home outweigh strong JLR sales for India's Tata Motors "
    },
    {
        "content": "NEW DELHI  May 23 India's Tata Motors on Tuesday reported a 17 percent fall in fourth-quarter net profit  hurt by lower income from operations.",
        "date": "05232017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors Q4 net profit falls 17 percent "
    },
    {
        "content": "* Consensus forecast for March quarter consol net profit was 26.95 billion rupees",
        "date": "05232017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors March-qtr consol profit falls about 17 pct "
    },
    {
        "content": "* Says approved appointment of Om Prakash Bhatt as additional and independent director Source text - (http://bit.ly/2pjIMTV) Further company coverage:",
        "date": "05102017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors appoints Om Prakash Bhatt as additional & independent director "
    },
    {
        "content": "* Global wholesales of all passenger vehicles in April 2017 were 54 847  higher by 6 percent  compared to April 2016",
        "date": "05102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors April global wholesales falls 9 pct "
    },
    {
        "content": "* Says Tata Motors group global wholesales at 73 691 in april 2017",
        "date": "05102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Group global wholesales lower by 4 pct "
    },
    {
        "content": "* Says small decrease in sales in quarter  as in UK  customers purchased vehicles before the increase in vehicle tax on 1st April",
        "date": "05052017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors JLR total April sales down 2.3 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE/MUMBAI  April 28 (Fitch) Fitch Ratings has upgraded India-based Tata Motors Limited's (TML) Long-Term Issuer Default Rating (IDR) to 'BB+' from 'BB'. The Outlook is Stable. The upgrade reflects the sustained improvement in TML's Indian automotive business over the last two years  supported by growing commercial vehicle volumes  successful new product launches in the passenger vehicle segment  as well as the management's renewe",
        "date": "04282017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Fitch Upgrades Tata Motors to 'BB+'; Outlook Stable "
    },
    {
        "content": "* Co's commercial vehicles are BSIV ready with exhaust gas recirculation and new future leading selective catalytic reduction Source text - (Tata Motors  the country’s largest truck and bus manufacturer  announced readiness of SCR (Selective Catalytic Reduction) and EGR (Exhaust Gas Recirculation) technologies for BSIV compliant engines  powering its range of Commercial Vehicles.) Further company coverage:",
        "date": "04262017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors' says co's commercial vehicles are BSIV ready "
    },
    {
        "content": "* Says contract for supply of 3192 units of Tata Safari Storme 4x4 to Indian armed forces  under new category of vehicles - GS800 Source text - (Tata Motors has signed a contract for supply of 3192 units of the Tata Safari Storme 4x4 to the Indian Armed Forces  under a new category of vehicles - GS800 (General Service 800). The Indian Ministry of Defence (MOD) had floated an RFP for vehicles with three basic criteria – minimum payload capacity of 800 kgs; hard roofs and air conditioning. Develop",
        "date": "04272017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors signs contract for supply of Tata Safari Storme to Indian armed forces "
    },
    {
        "content": "NEW DELHI  April 19 Tata Motors is planning to export some of its unsold stock of older-technology trucks  after an unexpected ban on their sale in India  a senior company executive said on Wednesday.",
        "date": "04192017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Motors to export some older-technology trucks after court ban "
    },
    {
        "content": "NEW YORK  April 12 Daimler AG's Mercedes-Benz USA chief said the German automaker has not decided whether to resume selling diesel vehicles in the United States.",
        "date": "04122017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Mercedes-Benz undecided if it will sell future U.S. diesels "
    },
    {
        "content": "* Tata Motors group global wholesales in March 2017  including Jaguar Land Rover  were at 129 951 nos.  higher by 9% over March 2016",
        "date": "04102017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors March group global wholesales  including JLR  up 9 pct "
    },
    {
        "content": "* Says Tata Motors receives order for 500 buses from Ivory Coast",
        "date": "04062017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors hands over first lot of 117 buses to SOTRA in Abidjan "
    },
    {
        "content": "* Says Tata Motors announces joint venture with Jayem Automotives for special performance vehicles",
        "date": "03312017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors forms JV with with Jayem Automotives for special performance vehicles "
    },
    {
        "content": "* Tata motors says ban on euro iii compliant vehicles sales from april 1 will have a material impact on entire automotive industry",
        "date": "03292017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors says ban on Euro III compliant vehicles to impact entire automotive industry "
    },
    {
        "content": "* Says acquisition of goods transport vehicles from Tata Motors",
        "date": "03282017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Pincon Spirit buys goods transport vehicles from Tata Motors "
    },
    {
        "content": "* Says aproved issue of non-convertible debentures aggregating up to INR 5 billion on a private placement basis  Source text - (http://bit.ly/2nu3qys) Further company coverage:",
        "date": "03242017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors aproves issue of NCDs worth up to 5 bln rupees "
    },
    {
        "content": "* Says to consider issue of NCDs worth INR 5 billion  Source text - (http://bit.ly/2nJhUrN) Further company coverage:",
        "date": "03202017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors to consider issue of NCDs worth 5 bln rupees "
    },
    {
        "content": "NEW DELHI/FRANKFURT German carmaker Volkswagen  said on Friday it had signed a memorandum of understanding to explore a partnership with India's Tata Motors  to jointly develop auto components and vehicles for the Indian subcontinent and beyond.",
        "date": "03102017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Volkswagen  Tata Motors plan to cooperate in India "
    },
    {
        "content": "BERLIN  March 9 Volkswagen has signed a memorandum of understanding (MoU) with Tata Motors  to explore cooperation in India  sources close to the matter said  as the German carmaker takes a fresh attempt at conquering low-cost markets.",
        "date": "03092017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "VW  Tata sign accord to explore cooperation - sources "
    },
    {
        "content": "* India set to become the world's No.3 car market by 2020   (Adds details from press release of Tata  VW  background)",
        "date": "03102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 1-Volkswagen  Tata Motors plan to cooperate in India "
    },
    {
        "content": "FRANKFURT  March 10 Volkswagen and Tata Motors said on Friday they had signed a memorandum of understanding to explore a strategic partnership in India  confirming a Reuters story from Thursday.",
        "date": "03102017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Volkswagen  Tata Motors confirm to explore cooperation "
    },
    {
        "content": "* Says Jaguar Land Rover February total retail sales of 40 978 vehicles  up 9.3%",
        "date": "03072017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Jaguar Land Rover Feb total retail sales up 9.3 pct "
    },
    {
        "content": "* Says to consider offering for subscription non-convertible debentures on a private placement basis",
        "date": "03022017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors to consider NCD issue worth 5 bln rupees "
    },
    {
        "content": "* Says February total sales of 47 573 units versus 46 674 units last year",
        "date": "03012017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Feb total sales up about 2 pct "
    },
    {
        "content": "* Says to consider offering  sixth series of its rated  listed  unsecured  redeemable  NCDs aggregating to INR 5 billion  Source text - (http://bit.ly/2kOM5QC) Further company coverage:",
        "date": "02232017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors says to consider offering NCDs worth 5 bln rupees "
    },
    {
        "content": "MUMBAI  Feb 16 Tata Motors Ltd and Microsoft India on Thursday announced a strategic collaboration on the technology front to make driving a more personalised experiences for the customers  the companies said in a joint statement.",
        "date": "02162017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors  Microsoft ink technology collaboration deal "
    },
    {
        "content": "Feb 15 Indian shares ended at their lowest in two weeks on Wednesday  with Tata Motors pulling the indexes down after posting disappointing results.",
        "date": "02152017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares end at 2-week low; Tata Motors plunges "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Coca Cola Co - SEC filing",
        "date": "02142017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Soros Fund Management takes share stake in Tata Motors  dissolves share stake in Coca Cola  Dunkin' Brands "
    },
    {
        "content": "MUMBAI  Feb 14 India's Tata Motors on Tuesday reported a worse than expected 96 percent fall in net profit for its third quarter  citing slow growth in sales at its British luxury carmaker Jaguar Land Rover and losses in its domestic business.",
        "date": "02142017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors posts 96 percent profit plunge "
    },
    {
        "content": "* Q3 consolidated net profit 1.12 bln rupees vs f'cast 22.48 bln",
        "date": "02142017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 1-India's Tata Motors posts 96 percent profit plunge "
    },
    {
        "content": "* Says Tata Motors group global wholesales at 95 931 in January 2017",
        "date": "02082017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Group global wholesales up 3 pct in Jan 2017 "
    },
    {
        "content": "* Co to reduce number of car platforms to achieve scale  cut costs   (Adds details  comments from company executives)",
        "date": "02022017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 1-Tata Motors says set for first TAMO brand car launch next month "
    },
    {
        "content": "MUMBAI  Feb 2 Tata Motors Ltd will introduce a new brand called TAMO  which will incubate new technologies and make cars to meet expectations of consumers  it said on Thursday  as the Indian carmaker aims to future-proof its business.",
        "date": "02022017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Tata Motors to launch new TAMO sub-brand  cut number of platforms "
    },
    {
        "content": "Feb 14 Indian shares ended nearly flat for a second straight session on Tuesday amid weak Asian markets  while losses in auto stocks led by Tata Motors offset gains in energy and IT stocks.",
        "date": "02142017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares end nearly flat; Tata Motors drags "
    },
    {
        "content": "* Says Dec quarter consol total income from operations 685.41 billion rupees",
        "date": "02142017",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Dec-qtr consol profit down about 96 pct "
    },
    {
        "content": "* Says January total sales of 46349 units versus 47 035 units last year",
        "date": "02012017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors January total sales down 1.5 pct "
    },
    {
        "content": "* Tata Motors appoints Natarajan Chandrasekaran as additional director and chairman of the board with immediate effect.  Source text for Eikon: [Tata Motors Limited has informed the Exchange that the Board of Directors have on January 17  2017 appointed Mr Natarajan Chandrasekaran as Additional Director and Chairman of the Board with immediate effect]  Further company coverage:",
        "date": "01172017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors appoints Natarajan Chandrasekaran chairman of the board "
    },
    {
        "content": "* Tata Motors Group global wholesales at 95 081 in December 2016",
        "date": "01102017",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Group Dec global wholesales at 95 081 units "
    },
    {
        "content": "MUMBAI Morgan Stanley has started the process for an undisclosed buyer to for up to 50 million shares of Tata Motors Ltd  from the market in a potential 24.99 billion-rupee ($370.8 million) deal  according to a termsheet seen by Reuters on Monday.",
        "date": "12122016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Morgan Stanley opens book for Tata Motors' shares worth up to $371 million: termsheet "
    },
    {
        "content": "* EGM on Dec. 21 to remove Mistry as Tata Steel director   (Adds details from source  background)",
        "date": "11252016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 2-India's Tata Steel removes Cyrus Mistry as chairman "
    },
    {
        "content": "* To call shareholder meeting on Dec 22 to consider removing Cyrus Mistry  Nusli Wadia as directors  Further company coverage:  Source text: http://bit.ly/2fR38Oa  Tata Motors Limited has informed the Exchange that the Board of Directors of the Company  at its meeting held on November 23  2016  has pursuant to the Requisition and Special Notice dated November 10  2016 received from Tata Sons Limited  Promoter and Shareholder of the Company  holding 26.51% of the voting share capital of the Compa",
        "date": "11232016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors to call EGM on Dec 22 to consider removing Mistry  Wadia as directors "
    },
    {
        "content": "Nov 21 India's NSE index fell nearly 2 percent on Monday to its lowest close in six months  dragged down by finance and auto stocks such as State Bank of India  and Tata Motors.",
        "date": "11212016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "India's NSE index falls about 2 pct to 6-mth closing low "
    },
    {
        "content": "Nov 15 India's NSE index fell more than 2 percent on Tuesday as market heavyweight Tata Motors  slumped after posting weaker-than-expected earnings  and lenders such as ICICI Bank and HDFC Bank declined.",
        "date": "11152016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "India's NSE index falls over 2 pct  ends below 200-day moving average "
    },
    {
        "content": "* Mistry ousted as Tata Sons chairman in board coup last month",
        "date": "11142016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 2-Tata Motors' independent directors give Chairman Mistry tacit nod "
    },
    {
        "content": "MUMBAI  Nov 13 Ousted Tata Sons chairman Cyrus Mistry had tried to form a corporate governance framework that balanced the interests of the promoter and shareholders without impinging on the independence of group companies  according to a statement issued by his office on Sunday.",
        "date": "11132016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 1-Ousted Tata chairman tried for balanced corporate governance - statement "
    },
    {
        "content": "Nov 15 Indian shares fell as much as 2 percent on Tuesday on worries about capital outflows as U.S. bond yields surged and the dollar strengthened  and as heavyweight Tata Motors  mired in a corporate power struggle  plunged after reporting weak earnings.",
        "date": "11152016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares extend losses; U.S. bond yields  dollar weigh "
    },
    {
        "content": "MUMBAI  Nov 15 Shares in Tata Motors  owner of British car maker Jaguar Land Rover  fell more than 5 percent in early trade on Tuesday after the company's quarterly profit missed missed estimates.",
        "date": "11152016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors shares slump after quarterly results "
    },
    {
        "content": "* Says  independent directors have affirmed that co continues to be governed  supervised and managed under the guidance and direction of board",
        "date": "11142016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors: board decisions on strategy  business have been unanimous "
    },
    {
        "content": "NEW DELHI  Nov 14 India's Tata Motors Ltd  on Monday posted a quarterly net profit but missed estimates due to higher realised hedging losses and a one-time provision at its British luxury unit Jaguar Land Rover  the company said in a statement.",
        "date": "11142016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors quarterly profit falls short of estimates "
    },
    {
        "content": "* Mistry ousted as Tata Sons chairman in board coup last month",
        "date": "11142016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Key week for Tata tussle as Mistry faces Tata Motors board "
    },
    {
        "content": "MUMBAI  Nov 11 Tata Motors said on Friday that Tata Sons has called for an extraordinary general meeting to oust two directors  Cyrus Mistry and Nusli Wadia  from the automaker's board  as the nasty spat between the Tata and Mistry camps escalates.",
        "date": "11112016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Sons moves to oust Cyrus Mistry  Nusli Wadia from Tata Motors' board "
    },
    {
        "content": "* Tata Motors Ltd says group global wholesales in Oct  including JLR  were at 101 057 units  up 9 percent",
        "date": "11102016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Oct group global wholesales up 9 pct "
    },
    {
        "content": "* Clarifies on news item \"FIIs raise concerns over Tata Motors governance\"",
        "date": "11082016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors says has not received any letter from FIIs raising concerns on governance "
    },
    {
        "content": "MUMBAI Tata Sons has put in place a new management team for the $100 billion steel-to-software group  days after its board ousted Chairman Cyrus Mistry and disbanded his advisory council  triggering a public spat between him and Ratan Tata.",
        "date": "11042016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Ratan Tata installs new management team at Tata Sons "
    },
    {
        "content": "* Tata Motors -got requisition  special notice from Tata Sons for convening EGM for considering resolutions for removal of Cyrus P Mistry   Nusli N Wadia as  directors  Source text - (http://bit.ly/2fpQdA3) Further company coverage:",
        "date": "11112016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata motors gets requisition from Tata Sons for convening EGM for removal of Cyrus P Mistry  Nusli N Wadia as directors "
    },
    {
        "content": "MUMBAI  Nov 4 Tata Sons has put in place a new management team for the $100 billion steel-to-software group  days after its board ousted Chairman Cyrus Mistry and disbanded his advisory council  triggering a public spat between him and Ratan Tata.",
        "date": "11042016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 2-Ratan Tata installs new management team at Tata Sons "
    },
    {
        "content": "MUMBAI  Nov 5 Tata Motors  part of India's Tata group  defended its strategy for producing the $1 500 Nano but shied away from commenting on the loss-making car's future  after the conglomerate's ousted chairman said there were emotional reasons for not shutting down production.",
        "date": "11052016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors defends strategy for $1500 Nano car "
    },
    {
        "content": "* MoU further includes a study to check feasibility of locally assembling Tata armoured vehicles at PT Pindad's facility in Bandung  Further company coverage:",
        "date": "11032016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors signs MoU with Indonesia's PT Pindad "
    },
    {
        "content": "* Says October total sales of 52 813 units versus 43 486 last year",
        "date": "11012016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors October total sales up about 21 pct "
    },
    {
        "content": "NEW DELHI Ratan Tata may have dumped Cyrus Mistry as chairman of his 148-year-old family empire  but will find it harder to expunge the ex-manager's accusations that his acquisitive habits and lack of focus on returns have destroyed billions of dollars in shareholder value.",
        "date": "10282016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata may find dismissing Mistry easier than his accusations "
    },
    {
        "content": "* Tata Motors clarifies on news item captioned 'Ousted Tata chief says group faces $18 billion in writedowns'",
        "date": "10272016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors says co's accounting policies \"present true and fair view\" "
    },
    {
        "content": "* Tata Group companies recover  Tata Motors among top gainers",
        "date": "10282016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares edge higher; Tech Mahindra  Tata Group gain "
    },
    {
        "content": "I was shocked beyond words at the happenings at the board meeting of October 24  2016. Apart from the invalidity and illegality of the business that was conducted  I have to say that the board of directors has not covered itself with glory. To \"replace\" your Chairman without so much as a word of explanation and without affording him an opportunity of defending himself in a summary manner must be unique in the annals of corporate history. The suddenness of the action  and the lack of explanation ",
        "date": "10272016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "FULL TEXT-Letter sent by Cyrus Mistry  former Chairman of Tata Group  to directors of Tata Sons Ltd "
    },
    {
        "content": "Oct 24 Indian shares ended higher on Monday  driven by strong performances by ICICI Bank and Tata Motors  as investors gear up for a crucial week of quarterly results.",
        "date": "10242016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares end higher; bank  auto stocks surge "
    },
    {
        "content": "LONDON  Oct 21 Jaguar Land Rover  Ford and Tata Motors are testing connected cars which can communicate with each other using technology designed to speed up journeys and cut accidents  the first such trials in Britain.",
        "date": "10202016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Jaguar Land Rover and Ford test connected cars in Britain "
    },
    {
        "content": "* Says approved NCD issue of up to 5 billion rupees  Source text: http://bit.ly/2doikh0 Further company coverage:    (Bengaluru newsroom)",
        "date": "10182016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors approves NCD issue of up to 5 bln rupees "
    },
    {
        "content": "* Tata Motors Ltd says to consider offering NCDs worth up to 5 billion rupees  Source text: http://bit.ly/2dKsc7g Further company coverage:    (Bengaluru newsroom)",
        "date": "10122016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors to consider offering NCDs worth up to 5 bln rupees "
    },
    {
        "content": "* Tata Motors group global wholesales cross 1 lakh sales mark in September 2016",
        "date": "10102016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Sept global wholesales up 5 pct "
    },
    {
        "content": "* Says Jaguar Land Rover September retail sales of 61 047 vehicles  up 28%",
        "date": "10072016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors Sept Jaguar Land Rover retail sales up 28 pct "
    },
    {
        "content": "* Tata Motors forays into Bolivia with the launch of commercial vehicle range",
        "date": "09272016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata motors forays into Bolivia with launch of commercial vehicle range "
    },
    {
        "content": "* Tata motors and Castrol sign new agreement to strengthen partnership  Further company coverage:",
        "date": "09212016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors signs agreement with Castrol "
    },
    {
        "content": "Sept 2 Indian shares closed higher on Friday  with the benchmark BSE index recording its biggest weekly gain in nine weeks  as strong August sales data of companies such as Hero MotoCorp and Tata Motors lifted investor sentiments.",
        "date": "09022016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares gain  BSE posts biggest weekly gain in two months "
    },
    {
        "content": "Sept 2 Indian shares edged up on Friday  helped by gains in auto stocks such as Hero MotoCorp and Tata Motors on upbeat August sales data  while broader sentiment was subdued ahead of a key U.S. jobs report later in the day.",
        "date": "09022016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares edge up; Tata Motors  Hero MotoCorp gain "
    },
    {
        "content": "* Tata Motors to phase out suppliers that do not meet standards",
        "date": "08302016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "India's Tata Motors aims to turn around domestic business by 2019 "
    },
    {
        "content": "Aug 29 Indian shares ended higher on Monday  reversing two consecutive sessions of falls  with Tata Motors  among top gainers after its unit Jaguar Land Rover  reported favourable quarterly figures on Friday.",
        "date": "08292016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares end higher; Tata Motors extends gains "
    },
    {
        "content": "* Exec says will eliminate suppliers that don't meet our requirement in terms of quality  delivery and cost",
        "date": "08302016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors says will eliminate suppliers that don't meet co's requirements "
    },
    {
        "content": "Aug 29 Indian shares were little changed on Monday  with Tata Motors leading gainers on key unit Jaguar Land Rover's quarterly performance  while broader sentiment was hit after U.S. Federal Reserve Chair Janet Yellen indicated an interest rate hike remains on the cards for this year.",
        "date": "08292016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares little changed; Tata Motors gains on JLR show "
    },
    {
        "content": "* Tata Motors CFO says monitoring  assessing UK  EU markets   (Adds executive comments  result details)",
        "date": "08262016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 1-India's Tata Motors Q1 net profit halves on forex loss post-Brexit vote "
    },
    {
        "content": "Aug 30 India's Tata Motors Ltd  Managing Director and CEO  Guenter Butschek says:",
        "date": "08302016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors will be aggressive in driving supplier rationalisation program "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_08292016.pdf         INDIA TOP NEWS     \u007f Dirty laundry: Welspun tangle highlights India's quality challenge     Questions over the exact provenance of bedsheets sold by Welspun India to America's middle classes have not only wiped $740 million off the firm's market value  but also revived one of Indian manufacturing's enduring headaches: quality.      \u007f Paris prosecutor opens i",
        "date": "08292016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Morning News Call - India  August 29 "
    },
    {
        "content": "* JLR operating margin for Q1 at 12.3 percent compared with 16.4 percent in year ago quarter",
        "date": "08262016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors: have robust forex hedging policy for JLR "
    },
    {
        "content": "NEW DELHI  Aug 26 India's Tata Motors Ltd  on Friday posted a 57 percent fall in quarterly net profit  missing estimates  as foreign exchange losses after Britain's decision to leave the European Union offset higher sales at its luxury unit Jaguar Land Rover.",
        "date": "08262016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors Q1 net profit halves on forex loss post-Brexit "
    },
    {
        "content": "Aug 26 India's benchmark BSE index  inched lower on Friday  heading for its worst week since early May  as investors stayed on the sidelines ahead a speech by U.S. Federal Reserve Chair Janet Yellen in Jackson Hole  Wyoming later in the day.",
        "date": "08262016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares tread water ahead of Fed meeting "
    },
    {
        "content": "* Passenger and commercial vehicle sales (including exports) July 2016 at 43 160 vehicles versus over 40 154 vehicles in July 2015  Further company coverage:",
        "date": "08012016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors July passenger  commercial vehicle sales up 7.5 pct on-year "
    },
    {
        "content": "July 4 India's NSE index rose to a 10-month high on Monday as Tata Motors rallied after posting stellar auto sales for June  with broader sentiment underpinned by a continued recovery in global markets from Britain's shock vote to leave the European Union.",
        "date": "07042016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares end higher on global cues  Tata Motors gains "
    },
    {
        "content": "* Domestic reforms  prospect of more ECB easing buoy sentiment",
        "date": "07042016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's NSE index rises to 10-mth high; Tata Motors gains "
    },
    {
        "content": "NEW DELHI  June 24 Indian automaker Tata Motors Ltd's British luxury arm Jaguar Land Rover will remain committed to all its manufacturing sites and investment decisions  a company spokeswoman said in a statement on Friday.",
        "date": "06242016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Jaguar Land Rover says committed to investment decisions after Brexit "
    },
    {
        "content": "LONDON  June 24 Shocked chief executives from Mumbai to Denver woke up on Friday to face tough decisions over how to respond to Britain's vote to leave the European Union.",
        "date": "06242016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "From beer to drugs to cars: Global business laments EU vote "
    },
    {
        "content": "June 22 Indian shares fell for a second consecutive session on Wednesday  a day ahead of the Brexit referendum  with Tata Motors declining on worries its unit Jaguar Land Rover would be hit if Britain leaves the European Union.",
        "date": "06222016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares fall ahead of Brexit vote; Tata Motors down "
    },
    {
        "content": "June 22 Indian shares fell on Wednesday  heading for their second straight session of falls  a day ahead of the Brexit referendum  while Tata Motors declined on worries that its unit Jaguar Land Rover would be hit if Britain leaves the European Union.",
        "date": "06222016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian shares fall ahead of Brexit referendum "
    },
    {
        "content": "LONDON  June 2 Carmakers in Britain are making plans to get more steel from continental Europe  putting pressure on Tata Steel to secure a sale of its troubled UK plants before it loses customers.",
        "date": "06022016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Carmakers seek alternatives to UK steel as Tata looks for buyers "
    },
    {
        "content": "* Jaguar Land Rover capex for FY 2016-17 raised to 3.75 bln pounds",
        "date": "05302016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 1-Strong Jaguar Land Rover sales drive tripling of profit at India'a Tata Motors "
    },
    {
        "content": "* 100 000 Jaguar Land Rover vehicles to be recalled in the U.S. to fix faulty airbags",
        "date": "05302016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors to recall 100 000 JLR cars in U.S. to fix faulty airbags "
    },
    {
        "content": "* Exec says expects capital expenditure for Jaguar Land Rover at 3.75 billion pounds ($5.48 billion) for FY 2016-17  up from 3.3 billion pounds a year ago  Further company coverage:  ($1 = 0.6840 pounds)   (Reporting by Promit Mukherjee in MUMBAI)",
        "date": "05302016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors capex for Jaguar Land Rover at 3.75 bln pounds in FY 17-exec "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE  May 03 (Fitch) Fitch Ratings has affirmed India-headquartered Tata  Motor Limited's (TML) Long-Term Foreign-Currency Issuer Default Rating (IDR) at  'BB'. The Outlook is Stable. The rating reflects TML's small size in relation to global auto majors and its  profitable wholly owned subsidiary  Jaguar Land Rover (JLR  BB-/Positive)  which  accounted for 75% of TML's  consolidated revenue and 90% of EBITDA in the  financial year",
        "date": "05032016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Fitch Affirms Tata Motors at 'BB'; Outlook Stable "
    },
    {
        "content": "LONDON  April 11 British business minister Sajid Javid said on Monday the government would consider co-investing on commercial terms to secure the sale of Tata's UK steelmaking assets.",
        "date": "04112016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UK would consider co-investing to secure sale of Tata steel assets "
    },
    {
        "content": "LONDON  April 8 British Grand Prix track Silverstone is in talks to lease the circuit's property to Jaguar Land Rover  the owners of the Formula One site said after a vote of its members authorised the board to continue discussing the deal.",
        "date": "04082016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "REFILE-Jaguar Land Rover in talks to lease Silverstone "
    },
    {
        "content": "NEW DELHI  April 7 Jaguar Land Rover   Tata Motors Ltd's luxury car unit  reported a 13 percent rise in car sales for the year ended march 31  helped by strong demand for its recently-launched Jaguar XE and XF sedans and Land Rover Discovery Sport SUV.",
        "date": "04072016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata's Jaguar Land Rover FY 2015-16 car sales rise 13 pct y/y "
    },
    {
        "content": "MUMBAI  April 6 India's Tata Motors is reducing the size of its diesel engines to skirt a temporary ban on the sale of large diesel-powered cars in New Delhi as the government seeks to reduce toxic smog in the capital city.",
        "date": "04062016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "India's Tata Motors to resize diesel engines to skirt New Delhi ban "
    },
    {
        "content": "* Exec says hatchback Tiago to be priced starting at 339 359  rupees for petrol version",
        "date": "04062016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors to price hatchback Tiago starting at $5097 for petrol version "
    },
    {
        "content": "* Tiago launch running late because of name change but will be in the market soon",
        "date": "03172016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors CEO says would like to extend global footprint "
    },
    {
        "content": "March 16 India's Tata Group exec says Tata Motors",
        "date": "03162016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata group exec: Tata motors defence business is likely to grow at a CAGR of 10-12 pct "
    },
    {
        "content": "March 14 Indian shares rose for a second consecutive session on Monday  led by Tata Motors  after it posted robust sales for February and on improved global risk appetite after gains on Wall Street and in Europe last week.",
        "date": "03142016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares rise for second session on Tata Motors  global markets "
    },
    {
        "content": "March 14 Indian shares rose for a second consecutive session on Monday  led by Tata Motors  after it posted robust sales for February and on improved global risk appetite after gains on Wall Street and in Europe last week.",
        "date": "03142016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian stocks gain for 2nd session; focus on CPI data "
    },
    {
        "content": "MUMBAI Tata Motors Ltd said on Monday it has renamed its Zica hatchback as Tiago.",
        "date": "02222016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Motors renames hatchback Zica as Tiago "
    },
    {
        "content": "MUMBAI  Feb 22 India's Tata Motors Ltd  said on Monday it has renamed its Zica hatchback as Tiago.",
        "date": "02222016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "REFILE-UPDATE 1-India's Tata Motors renames hatchback Zica as Tiago "
    },
    {
        "content": "MUMBAI  Feb 22 India's National Stock Exchange said it would add Aurobindo Pharma Ltd  Bharti Infratel Ltd  Eicher Motors Ltd  and Tata Motors' Differential Voting Rights to its benchmark Nifty 50 index.",
        "date": "02222016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's NSE exchange to add 4 companies  drop 3 from index "
    },
    {
        "content": "NEW DELHI Tata Motors reported on Thursday strong sales by its British Jaguar Land Rover subsidiary in Europe and North America in the last three months of last year  offsetting a drop in China  once its fastest-growing market.",
        "date": "02112016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata's profit dented by drop in Jaguar Land Rover's Chinese sales "
    },
    {
        "content": "NEW DELHI  Feb 11 Tata Motors reported on Thursday strong sales by its British Jaguar Land Rover subsidiary in Europe and North America in the last three months of last year  offsetting a drop in China  once its fastest-growing market.",
        "date": "02112016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 1-Tata's profit dented by drop in Jaguar Land Rover's Chinese sales "
    },
    {
        "content": "NEW DELHI  Feb 11 Tata Motors Ltd on Thursday said quarterly net profit for the December quarter fell 2 percent  hit by lower sales of its luxury Jaguar Land Rover unit in China  once its fastest growing market.",
        "date": "02112016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors Q3 net profit down 2 pct on weak China sales "
    },
    {
        "content": "Feb 1 Tata Motors Ltd's vehicle sales in January:                        Jan 2016    Jan 2015   Pct change TOTAL SALES            47 034          42 595     10 PASSENGER VEHICLES     10 728      13 047    -18 COMMERCIAL VEHICLES    30 670      25.587    20 EXPORTS                 5 636       3 961     42      NOTE: Tata Motors makes commercial vehicles and passenger cars  including the ultra-cheap Nano. The figures exclude overseas sales by the company's British Jaguar Land Rover uni",
        "date": "02012016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "TABLE-India's Tata Motors Jan total vehicle sales up 10 pct y/y "
    },
    {
        "content": "NEW DELHI  Jan 18 Tata Motors Ltd has hired former Airbus Group executive Guenter Butschek as its new chief executive  India's largest automaker said on Monday.",
        "date": "01182016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Tata Motors names former Airbus executive as new CEO "
    },
    {
        "content": "MUMBAI India's top court on Tuesday upheld a temporary ban on the sale of large diesel cars in New Delhi to combat toxic smog in India's capital  but postponed hearing an industry appeal on an environmental tax that carmakers say will hit investment.",
        "date": "01052016",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's top court upholds ban on sale of large diesel cars in Delhi "
    },
    {
        "content": "Jan 4 Jan 1 Tata Motors Ltd  :  * Sales for December 2015 at 39 973 units  * LCVs witnessed a growth of 11% in December 2015  bucking recent trends  * M&HCVs continued to grow by 2% in December 2015  * Company's exports grew by 15% in December 2015  * Domestic sales of Tata commercial and passenger vehicles for December 2015 were 35 416  lower by 6%  * In December 2015  Tata Motors passenger vehicles sales were at 8 069  * The company's sales from exports were 4 557 vehic",
        "date": "01042016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "CORRECTED-(OFFICIAL)-BRIEF-Tata Motors Dec sales down 4 pct (Jan. 1) "
    },
    {
        "content": "MUMBAI  Jan 1 India's NSE index staged a late rebound on Friday to end at its highest level in nearly two months after public sector banking shares led financials higher  while gains in stocks such as Tata Motors also provided some support.",
        "date": "01012016",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "India's NSE index ends near 2-month high "
    },
    {
        "content": "LONDON/BRATISLAVA Luxury carmaker Jaguar Land Rover (JLR) confirmed on Friday it will build a car plant in Slovakia  beginning a 1 billion pound ($1.5 billion) project which will be one of the biggest ever foreign direct investments in the central European nation.",
        "date": "12112015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Jaguar Land Rover seals deal for $1.5 billion Slovak car plant "
    },
    {
        "content": "BRATISLAVA  Dec 8 Luxury car maker Jaguar Land Rover and the Slovak government will sign an agreement this week on a production plant in Slovakia  three Slovak government sources said on Tuesday.",
        "date": "12082015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Jaguar Land Rover  Slovakia to sign agreement on factory this week-sources "
    },
    {
        "content": "* Almost 15 000 jobs at plant and supplier firms   (Adds quotes from news conference  state aid  jobs in auto sector)",
        "date": "12112015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 1-Jaguar Land Rover seals deal for $1.5 bln Slovak car plant "
    },
    {
        "content": "LONDON  Dec 11 Luxury carmaker Jaguar Land Rover (JLR) confirmed on Friday it will build a car plant in Slovakia  beginning a 1 billion pound ($1.5 billion) project which will be one of the biggest ever foreign direct investments in the central European nation.",
        "date": "12112015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Jaguar Land Rover confirms Slovak car plant "
    },
    {
        "content": "Dec 1 Tata Motors Ltd's vehicle sales in November:",
        "date": "12012015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "TABLE-India's Tata Motors Nov total vehicle sales down 7 pct y/y "
    },
    {
        "content": "NEW DELHI Tata Motors Ltd posted a surprise 4.3 billion rupee ($65.4 million) net loss in the quarter to the end of September after sales in China fell and a port explosion damaged thousands of vehicles.",
        "date": "11062015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Motors slides to a loss on China woes "
    },
    {
        "content": "* Margin fall at JLR business squeezes profits   (Adds management comments  JLR numbers)",
        "date": "11062015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 2-India's Tata Motors slides to a loss on China woes "
    },
    {
        "content": "* Exec says JLR sales rise 24 percent in October year on year  Further company coverage:    (Reporting By Tommy Wilkes)",
        "date": "11062015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-Tata Motors exec says JLR sales rise 24 pct in October yoy "
    },
    {
        "content": "NEW DELHI  Nov 6 India's Tata Motors Ltd  on Friday reported a 4.3 billion rupee ($65.4 million) net loss in the July to September quarter  hit by a one-time charge and slowing sales in China  once its fastest growing market.",
        "date": "11062015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors slumps to second-quarter loss "
    },
    {
        "content": "MUMBAI The BSE Sensex and Nifty gave up early gains on Wednesday to mark their lowest close in over a month as gains sparked by Tata Motors'  strong sales in the United States were negated as investors booked profits in blue-chip stocks.",
        "date": "11042015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Sensex loses steam  closes at over one-month low "
    },
    {
        "content": "MUMBAI  Nov 4 Indian shares headed for a second consecutive session of mild gains on Wednesday tracking higher global shares  while auto makers surged after Tata Motors reported strong October sales  but foreign sales capped broader gains.",
        "date": "11042015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Indian stocks extend gains  Tata Motors zooms on strong sales "
    },
    {
        "content": "NEW DELHI/PARIS  Oct 5 PSA Peugeot Citroen  has no plans to re-enter India's car market any time soon  a company spokesman told Reuters  after an Indian newspaper reported that the French carmaker is in talks with Tata Motors to form a local partnership.",
        "date": "10052015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "French carmaker Peugeot says no plan for swift return to India "
    },
    {
        "content": "HONG KONG Tata Steel Ltd will sell shares in automaker Tata Motors Ltd worth up to $188 million  according to a term sheet of the deal seen by Reuters on Friday.",
        "date": "09182015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Steel to sell shares in Tata Motors worth up to $188 million "
    },
    {
        "content": "HONG KONG  Sept 18 India's Tata Steel Ltd  will sell shares in automaker Tata Motors Ltd  worth up to $188 million  according to a term sheet of the deal seen by Reuters on Friday.",
        "date": "09182015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Tata Steel to sell shares in Tata Motors worth up to $188 mln "
    },
    {
        "content": "NEW DELHI  Aug 21 Indian carmaker Tata Motors Ltd said on Friday 'many' of the 5 800 Jaguar and Land Rover vehicles it had at Tianjin port in China were likely to have been damaged in the recent chemical explosion that killed more than a hundred people.",
        "date": "08212015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Tata Motors says had 5 800 JLR cars at China port hit by blasts "
    },
    {
        "content": "MUMBAI/NEW DELHI Tata Motors Ltd  has cut prices  sales and production targets at its luxury Jaguar Land Rover (JLR) arm in China  a top executive said  as it struggles with high inventories in a slowing market.",
        "date": "08072015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Motors cuts sales  production targets for JLR in China "
    },
    {
        "content": "* Strong JLR sales  mainly in China  has long helped Tata   (Adds CFO comments  details on China car market)",
        "date": "08072015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 2-Tata Motors cuts sales  production targets for JLR in China "
    },
    {
        "content": "NEW DELHI  Aug 7 Quarterly profit at Tata Motors Ltd  India's top automaker by revenue  fell for the fourth consecutive quarter  as sales of its sleek Jaguar saloons and sporty Range Rovers dipped in China  the world's biggest car market.",
        "date": "08072015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors Q1 profit nearly halves on weak China sales "
    },
    {
        "content": "Aug 1 Tata Motors Ltd's vehicle sales in July:                              JULY 2015   JULY 2014   PCT CHANGE  TOTAL SALES            40 154      39 629      1  DOMESTIC SALES         35 076      35 266      -1  COMMERCIAL VEHICLES    24 687      NA          -5  PASSENGER VEHICLES     10 389      9 167       13  EXPORTS                5 078       4 363       16  NOTE: Tata Motors makes commercial vehicles and passenger cars  including the ultra-cheap Nano. The figures exclude overse",
        "date": "08012015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "TABLE-India's Tata Motors July vehicle sales up 1 pct year/year "
    },
    {
        "content": "MUMBAI  July 22 Tata Motors Ltd  India's biggest automaker by revenue  plans to triple exports of its trucks and buses to countries in Asia and beyond to counter slow sales growth in India  it said on Wednesday.",
        "date": "07222015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Tata Motors to grow exports of trucks to offset slow India sales "
    },
    {
        "content": "* Exec says expect commercial vehicle dealerships to reach 4000 by March 2017 from around 3000 at present",
        "date": "07222015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors: commercial vehicle dealerships to reach 4000 by FY17 "
    },
    {
        "content": "NEW DELHI  July 16 Tata Motors Ltd  India's biggest auto maker by revenue  plans to raise up to 44 billion rupees ($694 million) through non-convertible debentures in the current financial year that began in April  the company said on Thursday.",
        "date": "07162015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Motors plans to raise up to $694 mln this fiscal year "
    },
    {
        "content": "MUMBAI Indian shares edged lower on Tuesday after worse-than-expected retail inflation data dented hopes of an interest rate cut by the central bank next month  but gains due to a landmark nuclear deal with Iran provided some support to stocks.",
        "date": "07142015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Sensex ends lower; retail inflation dents rate-cut hopes "
    },
    {
        "content": "MUMBAI  July 10 India's Tata Motors Ltd  plans to double the revenue from its defence business over the next three years to $600 million  betting on the government's push for more local defence manufacturing  a top company official said on Friday.",
        "date": "07102015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "India's Tata Motors says to double defence revenues over next 3 years "
    },
    {
        "content": "* Exec says defence order book at about 15 billion rupees  expected to be delivered over next two yrs",
        "date": "07102015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors exec: defence order book at abt 15 bln rupees "
    },
    {
        "content": "NEW DELHI Fiat Chrysler  will invest $280 million to begin Jeep production in India from 2017 through an expanded joint venture with Tata Motors   the carmaker said on Wednesday.",
        "date": "07012015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Fiat Chrysler to start Jeep production in India from 2017 "
    },
    {
        "content": "* India to be No. 3 car market by 2020 - IHS Automotive   (Adds details  background; changes dateline)",
        "date": "07012015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 1-Fiat Chrysler to start Jeep production in India from 2017 "
    },
    {
        "content": "PARIS  July 1 Fiat Chrysler will invest $280 million to begin Jeep production in India through an expanded joint venture with Tata Motors  the carmaker said on Wednesday.",
        "date": "07012015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Fiat Chrysler unveils $280 mln investment in Indian Jeep production "
    },
    {
        "content": "BEIJING  June 1 Jaguar Land Rover  has appointed a former Porsche executive as its new China head of sales  the automaker owned by India's Tata Motors Ltd  said on Monday  amid a slowdown in one of its key markets.",
        "date": "06012015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Jaguar Land Rover appoints new China sales head after Q1 drop "
    },
    {
        "content": "* Analyst estimates forex loss of about 220 mln pounds   (Adds executive comment  details)",
        "date": "05262015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 2-Tata Motors net profit down 56 pct as Jaguar Land Rover Chinese sales drop "
    },
    {
        "content": "NEW DELHI  May 26 Tata Motors Ltd  India's biggest automaker by revenue  reported a drop in quarterly net profit due to a spike in costs despite steady sales of its luxury Jaguar Land Rover unit and an increase in demand for its cars in its home market.",
        "date": "05262015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors net profit falls 56 pct  misses estimates "
    },
    {
        "content": "NEW DELHI Weak demand for sleek Jaguars in China battered the profits of its parent Tata Motors  pushing its shares down 5 percent on Wednesday and showing the car maker lacked agility in a market where the appetite for brash luxury has ebbed.",
        "date": "05272015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "China's luxury slowdown leaves Tata Motors nursing wounds "
    },
    {
        "content": " ",
        "date": "05272015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "UPDATE 2-China's luxury slowdown leaves India's Tata Motors nursing wounds "
    },
    {
        "content": "MUMBAI The Nifty ended little-changed on Wednesday as gains in banking stocks on expectations of a rate cut offset a fall in shares of Tata Motors.",
        "date": "05272015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "Sensex ends flat as rate-cut hopes offset earnings disappointment "
    },
    {
        "content": "* Says price of new version of Nano to start at 199 000 rupees ($3 127.21) ex-showroom delhi",
        "date": "05192015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "BRIEF-India's Tata Motors unveils new Nano version starting at $3 127 "
    },
    {
        "content": "MUMBAI  March 24 Indian shares fell to the lowest close in nearly six weeks on Tuesday as gains in healthcare stocks such as Lupin were offset by fall in Tata Motors  which dropped ahead of a board meet to consider a rights issue.",
        "date": "03242015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Indian shares near 6-week low; Tata Motors falls "
    },
    {
        "content": "DETROIT  Feb 25 Jaguar Land Rover is eyeing North America as a possible site to build a vehicle assembly plant  the former head of the British luxury automaker's parent said according to Automotive News.",
        "date": "02252015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata's ex-chair: Jaguar Land Rover looking at N. American plant -report "
    },
    {
        "content": "MUMBAI  Feb 17 India's Tata Motors  said on Tuesday it sold 80 499 vehicles in January 2015 on a wholesale basis  unchanged on the same period a year ago.",
        "date": "02172015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "India's Tata Motors January global sales flat at 80 499 vehicles "
    },
    {
        "content": "MUMBAI  Feb 6 India's NSE index fell on Friday  heading towards its biggest weekly loss in eight  as blue-chips such as Tata Motors slumped on weak earnings and on worries the Bharatiya Janata Party may face defeat in Delhi elections.",
        "date": "02062015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "India's NSE index heading towards biggest weekly fall in eight on earnings "
    },
    {
        "content": "NEW DELHI  Feb 2 Tata Motors Ltd's  vehicle sales in January:",
        "date": "02022015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Tata Motors January vehicle sales up 5 pct y-o-y "
    },
    {
        "content": "MUMBAI  Feb 5 Tata Motors Ltd  India's biggest automaker by revenue  posted a fall in quarterly profit  missing analyst estimates  due to losses in its domestic business  unfavourable foreign exchange rates and a dip in sales at its Jaguar Land Rover unit.",
        "date": "02052015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "UPDATE 1-India's Tata Motors Q3 profit down 26 pct  misses estimates "
    },
    {
        "content": "MUMBAI  Feb 5 India's Tata Motors Ltd  said it expects to spend between 3.6 billion pounds ($5.51 bln) and 3.8 billion pounds ($5.8 bln) on capital expenditure at its luxury Jaguar Land Rover (JLR) unit in the fiscal year starting April 1.",
        "date": "02052015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "India's Tata Motors expects up to $5.8 bln in capex for JLR "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE/MUMBAI  January 29 (Fitch) Fitch Ratings has affirmed India-based Tata  Motor Limited's (TML) Long-Term foreign currency Issuer Default Rating (IDR) at  'BB'. The Outlook is Stable. KEY RATING DRIVERS Strong Financial Profile: TML's consolidated financial profile remains strong  with consolidated leverage (net debt/ operating EBITDA) of 0.6x in in the  financial year ending 31 March 2014 (FY14) (FY13: 1.09x). The company's net",
        "date": "01292015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "Fitch Affirms Tata Motors at 'BB'; Outlook Stable "
    },
    {
        "content": "NEW DELHI  Feb 5 Tata Motors Ltd  India's biggest automaker by revenue  posted a 25.5 percent fall in quarterly net profit  missing analyst estimates  weighed down by losses in its India business as vehicle sales fell.",
        "date": "02052015",
        "name": "Tata Motors Ltd",
        "news_type": "normal",
        "symbol": "TTM",
        "title": "CORRECTED-India's Tata Motors Q3 profit down 26 pct  misses estimates "
    },
    {
        "content": "NEW DELHI  Jan 22 Tata Motors Ltd  India's top automaker by revenue  is looking to shake off its image as a taxi supplier by targeting younger customers with its new Bolt hatchback model.",
        "date": "01222015",
        "name": "Tata Motors Ltd",
        "news_type": "topStory",
        "symbol": "TTM",
        "title": "India's Tata Motors targets younger drivers with new Bolt model "
    }
]