[
    {
        "content": "Canadian telecom company Telus Corp  on Thursday reported a lower-than-expected quarterly profit as it spent heavily to expand its wireless and fiber-optic networks in a bid to add more subscribers in a fiercely competitive industry.",
        "date": "11092017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Telus misses profit estimates as it spends heavily to add subscribers "
    },
    {
        "content": "Nov 9 Canadian telecom company Telus Corp on Thursday reported a lower-than-expected quarterly profit as it spent heavily to expand its wireless and fiber-optic networks in a bid to add more subscribers in a fiercely competitive industry.",
        "date": "11092017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "UPDATE 3-Telus misses profit estimates as it spends heavily to add subscribers "
    },
    {
        "content": "* Q3 revenue C$3.4 billion versus I/B/E/S view C$3.38 billion",
        "date": "11092017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus reports Q3 basic earnings per share C$0.62 "
    },
    {
        "content": "* Q3 revenue C$3.4 billion versus I/B/E/S view C$3.38 billion",
        "date": "11092017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus reports qtrly earnings per share C$0.62‍​ "
    },
    {
        "content": "Nov 9 Canadian telecom company Telus Corp on Thursday posted a 5.5 percent rise in third-quarter profit  driven by its wireless business.",
        "date": "11092017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Telus profit rises on strong demand for wireless services "
    },
    {
        "content": "* Telus Corp - ‍transaction will be financed primarily from Telus International credit facilities and Telus International shares​",
        "date": "10302017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus International to acquire Xavient Information Systems "
    },
    {
        "content": "* ‍Telus says restored all services after power outages caused by winter storm disrupted some wireless and home services in region​ Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-‍Telus says services restored throughout southeastern Alberta "
    },
    {
        "content": "* Telus services down in some Southeastern Alberta communities due to power loss caused by winter storm",
        "date": "10032017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus services down in some Southeastern Alberta communities "
    },
    {
        "content": "* Telus Corp - ‍iPhone 8 and iPhone 8 plus arrive at Telus on Friday  September 22; telus to also offer apple watch series 3​",
        "date": "09152017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-iPhone X will be available to pre-order at Telus on Oct 27​ "
    },
    {
        "content": "TORONTO  Aug 11 Canada's main stock index lost ground on Friday  weighed by moves lower in financial stocks and a fall in shares of telecommunications company Telus Corp   which posted  lower-than-expected quarterly earnings.",
        "date": "08112017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "CANADA STOCKS-TSX dragged lower by financials group  telecoms company Telus "
    },
    {
        "content": "TORONTO Telus Corp   one of Canada's biggest telecom companies  reported a smaller-than-expected profit on Friday  as it spent heavily to win and retain wireless customers by investing in customer service and subsidizing high-end smartphones.",
        "date": "08112017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Telus profit misses forecasts on spending to fuel wireless growth "
    },
    {
        "content": "TORONTO  Aug 11 Telus Corp  one of Canada's biggest telecom companies  reported a smaller-than-expected profit on Friday  as it spent heavily to win and retain wireless customers by investing in customer service and subsidizing high-end smartphones.",
        "date": "08112017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "UPDATE 3-Telus profit misses forecasts on spending to fuel wireless growth "
    },
    {
        "content": "TORONTO  Aug 11 Canada's main stock index fell in early trading on Friday  weighed by heavyweight mining and financial stocks as well as telecom company Telus Corp  which lost ground after reporting a smaller-than-expected profit.",
        "date": "08112017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "CANADA STOCKS-TSX falls  Telus weighs after profit miss "
    },
    {
        "content": "Aug 11 Telus Corp  one of Canada's biggest telecom companies  reported an 8.9 percent fall in quarterly profit on Friday  as expenses rose.",
        "date": "08112017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Canada's Telus posts 8.9 pct fall in quarterly profit "
    },
    {
        "content": "* Q2 revenue C$3.3 billion versus I/B/E/S view C$3.26 billion",
        "date": "08112017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus reports Q2 earnings per share C$0.64 "
    },
    {
        "content": "Canada's Telus Corp said it would spend C$4.2 billion ($3.11 billion) on new broadband and wireless infrastructure in Alberta by 2020  as it tries to stay ahead in a highly competitive market.",
        "date": "06052017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Telus to invest C$4.2 billion in Alberta through 2020 "
    },
    {
        "content": "June 5 Canada's Telus Corp said it would spend C$4.2 billion  ($3.11 billion) on new broadband and wireless infrastructure in Alberta by 2020  as it tries to stay ahead in a highly competitive market.",
        "date": "06052017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Telus to invest C$4.2 bln in Alberta through 2020 "
    },
    {
        "content": "* Telus investing $4.2 billion through 2020 to extend advanced communications infrastructure across alberta to continue driving growth and innovation for the #next150",
        "date": "06052017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus to invest $4.2 bln through 2020 to extend advanced communications infrastructure across Alberta "
    },
    {
        "content": "* Telus Corp says will invest $4.2 billion in new communications infrastructure across Alberta through 2020 Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus Corp says will invest $4.2 bln in new communications infrastructure across Alberta through 2020 "
    },
    {
        "content": "* Telus Corp says will invest $4.7 billion in new communications infrastructure across British Columbia through 2020 Source text for Eikon: Further company coverage:",
        "date": "05312017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus to invest $4.7 bln in communications infrastructure across British Columbia through 2020 "
    },
    {
        "content": "* Telus Corp- nominees listed in information circular dated March 15  2017 were elected as directors of Telus Source text for Eikon: Further company coverage:",
        "date": "05112017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus announces election of directors "
    },
    {
        "content": "TORONTO  May 11 Canadian telecommunications provider Telus Corp on Thursday reported profit that beat analysts' forecasts as it attracted more postpaid wireless customers and got them to pay more  even in the face of heightened competition.",
        "date": "05112017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "UPDATE 2-Canada's Telus surprises with strong wireless growth "
    },
    {
        "content": "* Q1 revenue c$3.2 billion versus i/b/e/s view c$3.22 billion",
        "date": "05112017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus Q1 earnings per share c$0.73 "
    },
    {
        "content": "May 11 Telus Corp  one of Canada's three big telecommunications companies  reported a 16.7 percent rise in quarterly profit on Thursday  as it added more wireless customers.",
        "date": "05112017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Canada's Telus posts 16.7 pct rise in profit "
    },
    {
        "content": "* Telus recommends that shareholders reject TRC Capital's \"mini-tender offer\"",
        "date": "05052017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus recommends that shareholders reject TRC Capital's \"mini-tender offer\" "
    },
    {
        "content": "* Telus finalizes deal to expand its wireless business in Manitoba",
        "date": "04032017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus finalizes deal to expand its wireless business in Manitoba "
    },
    {
        "content": "* Announced an offering of US$500 million of senior unsecured notes with a 10-year maturity",
        "date": "03022017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus announces pricing of US and Canadian debt offerings "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 01 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to TELUS  Corporation's (TSX: T  NYSE: TU) offering of CAD325 million of senior unsecured  notes due 2048 and $500 million of senior unsecured notes due 2027. Net proceeds are expected to be used to repay at maturity the company's CAD700  million of notes due March 2017 and to repay commercial paper  with the  remaining balance to be used for general corporate purposes",
        "date": "03012017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Fitch Rates TELUS' Senior Unsecured Notes Offering 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Sees 2017 revenue of C$13.12 bln-C$13.25 bln   (Adds analyst comment  shares)",
        "date": "02092017",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "UPDATE 2-Telus profit misses as it spends more to win wireless customers "
    },
    {
        "content": "Feb 9 Canada's main stock index was set for a higher start on Thursday  tracking gains in oil prices following an unexpected fall in U.S. gasoline inventories.",
        "date": "02092017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "CANADA STOCKS-Futures indicate a higher start as oil prices rise "
    },
    {
        "content": "* Telus reports strong results for fourth quarter 2016 and announces 2017 financial targets",
        "date": "02092017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus Q4 adjusted earnings $0.53/shr "
    },
    {
        "content": "Feb 9 Telus Corp  one of Canada's three big telecommunications companies  reported a 67 percent fall in quarterly profit due to restructuring charges.",
        "date": "02092017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Canada's Telus quarterly profit falls 67 pct "
    },
    {
        "content": "Jan 6 Canadian stock futures were little changed on Friday ahead of December unemployment data.",
        "date": "01062017",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "CANADA STOCKS-Futures little changed ahead of Dec jobs data "
    },
    {
        "content": "Nov 4 Telus Corp CEO Darren Entwistle says expects company to turn materially cash flow positive in 2018  Telus' profit hit by spending; subscriber metrics holding up:   Further company coverage:    (Reporting by Alastair Sharp)",
        "date": "11042016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus expects to turn cash flow positive in 2018 "
    },
    {
        "content": "TORONTO  Nov 4 Telus Corp   one of Canada's three big telecommunications companies  reported a smaller-than-expected quarterly profit on Friday  hurt by increased spending on its broadband networks.",
        "date": "11042016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "UPDATE 2-Telus' profit hit by spending; subscriber metrics holding up "
    },
    {
        "content": "* Wireless segment postpaid churn rate was 0.94% in the third quarter of 2016",
        "date": "11042016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus reports results for third quarter 2016 "
    },
    {
        "content": "Nov 4 Telus Corp   one of Canada's three big telecommunications companies  reported a 2.7 percent fall in quarterly profit as expenses rose.",
        "date": "11042016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Canada's Telus reports 2.7 pct drop in profit "
    },
    {
        "content": "* TELUS and telecommunications workers union  united steelworkers local 1944 agreed to terms of a tentative collective agreement",
        "date": "10032016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus and telecommunications workers union  united steelworkers local 1944 agreed to terms of tentative collective agreement "
    },
    {
        "content": "* TELUS receives approval for a normal course issuer bid to purchase up to $250 million in TELUS common shares over next 12 months",
        "date": "09282016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-TELUS receives approval to purchase up to $250mln in common shares "
    },
    {
        "content": "* TELUS receives approval for a normal course issuer bid to purchase up to $250 million in TELUS common shares over next 12 months  Source text for Eikon:  Further company coverage:",
        "date": "09282016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-TELUS receives approval for a normal course issuer bid "
    },
    {
        "content": "* Offering U.S.$600 million senior unsecured notes with a 10-year maturity",
        "date": "09142016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus announces debt offering of U.S.$600 mln senior unsecured notes "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 14 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to  TELUS Corporation's (TSX: T  NYSE: TU) offering of up to USD750 million senior  unsecured notes due 2027. Net proceeds are expected to be used to repay outstanding commercial paper with  the remaining balance to be used for general corporate purposes. TELUS' Issuer Default Rating (IDR) is currently 'BBB+'. The Rating Outlook is  Stable. KEY RATING DRIVERS Stron",
        "date": "09142016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Fitch Rates TELUS's Senior Unsecured Notes Offering 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Files for mixed shelf of up to $3 billion - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "09022016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus files for mixed shelf of up to $3 bln - SEC filing "
    },
    {
        "content": "TORONTO Telus Corp  one of Canada's three biggest telecommunications companies  on Friday reported surprisingly strong wireless subscriber growth and raised the low end of its profit outlook  helping push its shares higher.",
        "date": "08052016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Canada's Telus profit grows with wireless bounce; shares rise "
    },
    {
        "content": "TORONTO  Aug 5 Telus Corp   one of Canada's three biggest telecommunications companies  on Friday reported surprisingly strong wireless subscriber growth and raised the low end of its profit outlook  helping push its shares higher.",
        "date": "08052016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "UPDATE 2-Canada's Telus profit grows with wireless bounce; shares rise "
    },
    {
        "content": "Aug 5 Canada's main stock index was set to start higher on Friday  mirroring gains in U.S. markets after better-than-expected payrolls data  despite an increase in Canadian unemployment.",
        "date": "08052016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "CANADA STOCKS-Futures rise after strong U.S. jobs data "
    },
    {
        "content": "Aug 5 Stock futures pointed to a higher opening for Canada's main stock index on Friday as investors keenly await employment figures for July as well as U.S. payroll data.",
        "date": "08052016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "CANADA STOCKS-TSX futures rise ahead of July employment figures "
    },
    {
        "content": "Aug 5 Telus Corp   one of Canada's three biggest telecom providers  reported a 22 percent rise in quarterly profit  helped by lower income tax expense and restructurings costs.",
        "date": "08052016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Telus quarterly profit rises on lower expenses "
    },
    {
        "content": "* Announced it has entered into an agreement to acquire Canadian business of Nightingale Informatix Corp  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07142016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus Health to acquire Canadian business of Nightingale Informatix Corp "
    },
    {
        "content": "* Intends to purchase and cancel up to 1 583 000 of its common shares through private agreements with an arm's-length third-party seller",
        "date": "06142016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus Corp to purchase up to 1.583 million common shares "
    },
    {
        "content": "June 8 Canadian media company Corus Entertainment Inc said it hired John Gossling  the former chief financial officer of Telus Corp  to replace its own retiring CFO  Tom Peddie.",
        "date": "06082016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Canadian media company Corus hires Telus's ex-CFO "
    },
    {
        "content": "Telus Corp    one of Canada's three big telecom providers  said it would sell a 35 percent stake in outsourcing service provider Telus International  and plans to use the proceeds to expand its wireless and wireline networks.",
        "date": "05052016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Canada's Telus to divest stake in unit  posts lower profit "
    },
    {
        "content": "* Bce to sell a portion of MTS Wireless subscribers and assign certain dealer locations to Telus",
        "date": "05022016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Bce inc to sell a portion of MTS Wireless subscribers "
    },
    {
        "content": "May 5 Canada's main stock index was set to open higher on Thursday  tracking gains in oil prices as a huge wildfire near Canada's oil sands region and escalating tensions in Libya stoked concerns of a near-term supply shortage.",
        "date": "05052016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "CANADA STOCKS-Futures gain as oil prices rise "
    },
    {
        "content": "* Bce to sell a portion of MTS wireless subscribers and assign certain dealer locations to TELUS",
        "date": "05022016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Bce to sell a portion of MTS Wireless subscribers "
    },
    {
        "content": "* Intends to retain a long-term majority ownership position in Telus International",
        "date": "05052016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus says Baring Private Equity Asia to acquire 35 pct stake in Telus International "
    },
    {
        "content": "* Q1 revenue c$3.1 billion versus I/B/E/S view c$3.11 billion",
        "date": "05052016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus Corp posts Q1 adj. basic EPS c$0.70 "
    },
    {
        "content": "* Intends to retain a long-term majority ownership position in telus international",
        "date": "05052016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "BRIEF-Telus says Baring Private Equity Asia to buy 35 pct Stake in TELUS International "
    },
    {
        "content": "Canada's Shaw Communications Inc  posted a 3 percent rise in quarterly revenue as it added more retail Internet customers.",
        "date": "04142016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Shaw Communications posts slight rise in quarterly revenue "
    },
    {
        "content": "* Investing $1 billion through 2019 to extend advanced communications infrastructure across Ontario  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04112016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus investing $1 bln through 2019 to extend communications infrastructure across Ontario "
    },
    {
        "content": "* Intends to invest $4.5 billion in new communications infrastructure across alberta through 2019  Source text for Eikon:  Further company coverage:",
        "date": "04042016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "BRIEF-Telus to invest $4.5 bln in new communications infrastructure across Alberta "
    },
    {
        "content": "TORONTO Telus Corp   one of Canada's three big telecom providers  reported a 16 percent drop in fourth-quarter profit on Thursday  hurt by increased wireless competition and sagging demand  partly due to economic weakness in the oil-producing province of Alberta.",
        "date": "02112016",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Telus says Alberta weakness  competition hurt fourth-quarter profit "
    },
    {
        "content": "* Adds net 62 000 postpaid wireless customers  down 56 000 yr/yr",
        "date": "02112016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "UPDATE 3-Telus says Alberta weakness  competition hurt fourth-qtr profit "
    },
    {
        "content": "Feb 11 Telus Corp  one of Canada's three big telecoms providers  reported a 2.8 percent rise in quarterly revenue  helped by continued strength in its wireless business.",
        "date": "02112016",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Telus quarterly revenue rises 2.8 pct "
    },
    {
        "content": "TORONTO  Dec 30 Canadian telecoms provider Telus Corp signed an deal with the country's Competition Bureau to give its wireless customers up to C$7.34 million ($5.27 million) in rebates after the competition watchdog found some Telus promotions misleading.",
        "date": "12302015",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "UPDATE 1-Telus settles with watchdog  to pay customers C$7.34 mln in rebates "
    },
    {
        "content": "TORONTO  Dec 30 Canadian telecoms provider Telus Corp signed an deal with the country's Competition Bureau to give its wireless customers up to C$7.34 million ($5.27 million) in rebates after the competition watchdog found some Telus promotions misleading.",
        "date": "12302015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Telus settles with watchdog  to pay customers C$7.34 mln in rebates "
    },
    {
        "content": "TORONTO  Dec 17 Canada's main stock index slipped on Thursday as telecom stocks weighed after Shaw Communications Inc said it planned to jump into wireless with a C$1.6 billion bid for recent entrant Wind Mobile.",
        "date": "12172015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "CANADA STOCKS-TSX falls as telecoms drag after Shaw's Wind Mobile bid "
    },
    {
        "content": "TORONTO Shares in Telus Corp   one of Canada's three big telecoms providers  fell on Thursday after the company reported slowing wireless growth and forecast higher restructuring costs as it announced job cuts.",
        "date": "11052015",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Telus eyes job cuts as wireless growth slows; shares fall "
    },
    {
        "content": "TORONTO  Nov 5 Shares in Telus Corp  one of Canada's three big telecoms providers  fell on Thursday after the company reported slowing wireless growth and forecast higher restructuring costs as it announced job cuts.",
        "date": "11052015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "UPDATE 2-Telus eyes job cuts as wireless growth slows; shares fall "
    },
    {
        "content": "TORONTO  Nov 5 Telus Corp  one of Canada's three big telecoms providers  reported a 4.2 percent rise in quarterly revenue on Thursday  helped by continued strength in its wireless business as well as Internet service growth.",
        "date": "11052015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Telus wireless  Internet growth boost revenue  profit "
    },
    {
        "content": "TORONTO Telus Corp announced a surprise change in its leadership on Monday  with former Chief Executive Officer Darren Entwistle returning as CEO of the major Canadian telecoms company a little over a year after handing the reins to Joe Natale.",
        "date": "08102015",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Canada's Telus brings back company veteran Entwistle as CEO "
    },
    {
        "content": "TORONTO  Aug 10 Telus Corp announced a surprise change in its leadership on Monday  with former Chief Executive Officer Darren Entwistle returning as CEO of the major Canadian telecoms company a little over a year after handing the reins to Joe Natale.",
        "date": "08102015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "UPDATE 2-Canada's Telus brings back company veteran Entwistle as CEO "
    },
    {
        "content": "Aug 10 Canadian telecommunications company Telus Corp said Darren Entwistle would resume his role as chief executive  effective Monday  as Joe Natale steps down due to personal reasons.",
        "date": "08102015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Canada's Telus brings back company veteran Darren Entwistle as CEO "
    },
    {
        "content": "TORONTO  Aug 7 Telus Corp  one of Canada's three big telecoms providers  reported a 5.1 percent rise in quarterly revenue on Friday  while gaining wireless  Internet and television customers during a tumultuous period for the industry.",
        "date": "08072015",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "UPDATE 2-Canada's Telus adds wireless customers; revenue up 5.1 pct "
    },
    {
        "content": "Aug 7 Canadian telecommunications company Telus Corp posted a 10.5 percent fall in quarterly profit  mainly due to an increase in costs and charges related to adjustments from higher corporate tax rates in Alberta.",
        "date": "08072015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Canadian telecom company Telus' profit falls 10.5 pct "
    },
    {
        "content": "June 24 The following are the top stories from selected Canadian newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "06242015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "PRESS DIGEST- Canada - June 24 "
    },
    {
        "content": "June 19 Telus Corp  and Rogers Communications Inc  are looking to acquire wireless telecommunications provider Mobilicity  and the Canadian government is expected to approve a deal with one of the suitors  the Globe and Mail reported  citing copies of two opinion letters obtained from Industry Canada.",
        "date": "06202015",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "UPDATE 1-Telus  Rogers in race to buy Mobilicity with federal approval -GLOBML "
    },
    {
        "content": "June 19 Telus Corp  and Rogers Communications Inc  are looking to acquire wireless telecommunications provider Mobilicity  and the Canadian government is expected to approve a deal with one of the suitors  the Globe and Mail reported  citing copies of two opinion letters obtained from Industry Canada.",
        "date": "06202015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Telus  Rogers in race to buy Mobilicity with federal approval -GLOBML "
    },
    {
        "content": "TORONTO  June 9 Canadian telecom company Telus Corp will close all its Blacks photo retail stores across Canada by early August  saying the chain  founded in the 1930s  has struggled as technology has changed the way customers take and share photographs.",
        "date": "06092015",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Telus to close Blacks photo stores across Canada "
    },
    {
        "content": "Telus Corp    one of Canada's three top telecommunications companies  reported a 10 percent rise in quarterly profit  helped by higher revenue from its wireless and wireline businesses.",
        "date": "05072015",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "Telus profit rises 10 percent on strong demand "
    },
    {
        "content": "May 7 Telus Corp   one of Canada's three top telecommunications companies  reported a 10 percent rise in quarterly profit  helped by higher revenue from its wireless and wireline businesses.",
        "date": "05072015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "UPDATE 1-Telus profit rises 10 pct on strong demand "
    },
    {
        "content": "May 7 Telus Corp   one of Canada's three dominant telecommunications companies  reported a 10 percent rise in quarterly profit  helped by higher revenue from both its wireless and wireline businesses.",
        "date": "05072015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Telus profit rises 10 pct on strong demand "
    },
    {
        "content": "* Rogers  country's largest wireless operator  buys none   (Adds comment from Rogers and analyst  details and background)",
        "date": "03062015",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "UPDATE 2-Canada raises C$2.11 bln in wireless airwaves auction "
    },
    {
        "content": "TORONTO  Feb 12 Telus Corp  one of Canada's three dominant telecommunications companies  reported an 8 percent rise in quarterly profit on Thursday and forecast solid revenue and earnings growth in 2015.",
        "date": "02122015",
        "name": "TELUS Corporation",
        "news_type": "topStory",
        "symbol": "TU",
        "title": "UPDATE 2-Telus makes gains in wireless  sees solid 2015 growth "
    },
    {
        "content": "Feb 12 Telus Corp   one of Canada's largest telecommunications companies  reported an 8 percent rise in quarterly profit  helped by higher revenue in both its wireless and wireline businesses.",
        "date": "02122015",
        "name": "TELUS Corporation",
        "news_type": "normal",
        "symbol": "TU",
        "title": "Canada's Telus posts 8 pct rise in quarterly profit "
    }
]