[
    {
        "content": "MEXICO CITY  Oct 31 TV Azteca  Mexico's second-largest broadcaster  said on Tuesday that it has hired a longtime Televisa executive to lead its unit for television and distribution of content.",
        "date": "11012017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico broadcaster TV Azteca hires ex-Televisa exec to lead TV unit "
    },
    {
        "content": "MEXICO CITY  Oct 26 Mexican broadcaster Grupo Televisa posted a third-quarter net profit of 1.159 billion pesos ($63.8 million) on Thursday  up 9.1 percent from a year earlier.",
        "date": "10262017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Televisa reports 3rd-qtr net profit of 1.159 bln pesos "
    },
    {
        "content": "MEXICO CITY Emilio Azcarraga will step down as chief executive of Grupo Televisa but remain as chairman  the Mexican company said on Thursday  as the world's top Spanish-language content producer faces challenges with tougher competition and weak ad sales.",
        "date": "10262017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Televisa chief Azcarraga to step down after 20 years "
    },
    {
        "content": "MEXICO CITY  Oct 26 Emilio Azcarraga will step down as chief executive of Grupo Televisa but remain as chairman  the Mexican company said on Thursday  as the world's top Spanish-language content producer faces challenges with tougher competition and weak ad sales.",
        "date": "10262017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "UPDATE 1-Televisa chief Azcarraga to step down after 20 years "
    },
    {
        "content": "MEXICO CITY  Oct 26 Mexico's Grupo Televisa said on Thursday that Emilio Azcarraga will step down as chief executive from the beginning of next year  but will remain as chairman of the company.",
        "date": "10262017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Grupo Televisa confirms Azcarraga to step down as CEO "
    },
    {
        "content": "MEXICO CITY  Oct 26 Mexican broadcaster Grupo Televisa's Emilio Azcarraga will step down as chief executive of the company but remain as chairman  the Wall Street Journal reported on Thursday.",
        "date": "10262017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Televisa's Azcarraga to step down as CEO  remain chairman - WSJ "
    },
    {
        "content": "MEXICO CITY  Sept 29 Mexico's top broadcaster Televisa has renwed its TV broadcast contract with the Mexican soccer federation for eight years  Femexfut official Alejandro Irarragorri said on Friday. (Reporting by Carlos Pacheco)",
        "date": "09292017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Televisa renews Mexico soccer broadcast contract for 8 years-official "
    },
    {
        "content": "* Grupo Televisa to distribute its premium  over-the-air television networks via co's galaxy satellites",
        "date": "09142017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "BRIEF-Intelsat says Mexico's Grupo Televisa to use co's galaxy satellites "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 28 (Fitch) Fitch Ratings has affirmed Grupo Televisa S.A.B's (Televisa) Long-Term Foreign and Local Currency Issuer Default Ratings (IDR) at 'BBB+'  as well as the company's National Long-Term Rating at 'AAA(mex)'. The Rating Outlook is Stable. Fitch also affirmed the company's foreign and local currency senior unsecured debt ratings at 'BBB+'/ 'AAA(mex)'  respectively. A complete list of rating actions follows at the end ",
        "date": "07282017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Fitch Affirms Televisa at 'BBB+'; Outlook Stable "
    },
    {
        "content": "MEXICO CITY Shares of Grupo Televisa   fell on Tuesday after the Mexican media heavyweight reported a dip in second-quarter revenue that disappointed investors already worried by viewers and advertisers turning to online rivals.",
        "date": "07112017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico's Televisa shares drop after 'difficult' first half year "
    },
    {
        "content": "MEXICO CITY  July 11 Shares of Grupo Televisa fell on Tuesday after the Mexican media heavyweight reported a dip in second-quarter revenue that disappointed investors already worried by viewers and advertisers turning to online rivals.",
        "date": "07112017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Televisa shares drop after 'difficult' first half year "
    },
    {
        "content": "MEXICO CITY Mexican media company Grupo Televisa  on Monday posted a dip in second-quarter revenue  missing some analysts' expectations as advertisers spent less on television commercials.",
        "date": "07112017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Televisa's quarterly revenue falls as advertisers spend less "
    },
    {
        "content": "MEXICO CITY  July 10 Mexican media company Grupo Televisa on Monday posted a dip in second-quarter revenue  missing some analysts' expectations as advertisers spent less on television commercials.",
        "date": "07112017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "UPDATE 1-Televisa's quarterly revenue falls as advertisers spend less "
    },
    {
        "content": "MEXICO CITY  July 10 Mexican media company Grupo Televisa posted a second-quarter net profit of 1.453 billion pesos ($80.1 million)  up 2.6 percent from a year earlier  the company said on Monday.",
        "date": "07102017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico's Televisa posts 2.6-percent increase in 2-qtr net profit "
    },
    {
        "content": "MEXICO CITY  July 10 Shares of Grupo Televisa surged on Monday ahead of the Mexican media company's quarterly results  with some investors looking beyond a potential dip in cable subscribers to a pickup next year  driven by the World Cup soccer tournament.",
        "date": "07102017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Televisa shares surge ahead of quarterly report "
    },
    {
        "content": "MEXICO CITY  June 30 A cable operator belonging to Mexico's largest television network said on Friday it won court rulings against requests by Office Depot and Radio Shack to resume sales of Roku video streaming devices.",
        "date": "06302017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico's Televisa says court ruled against Office Depot on Roku ban "
    },
    {
        "content": "MEXICO CITY  April 26 Mexican broadcaster Grupo Televisa on Wednesday reported a first-quarter profit of 1.35 billion pesos ($72.1 million)  up 125 percent compared with the same period last year.",
        "date": "04262017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico broadcaster Televisa's 1st-qtr profit jumps 125 percent to $72 mln "
    },
    {
        "content": "MEXICO CITY  April 27 Shares in Mexican broadcaster Grupo Televisa slid more than 7 percent on Thursday before paring losses after it reported a drop in first-quarter advertising sales  dragging on Mexico's stock index.",
        "date": "04272017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Shares in Mexico's Televisa drop on weak advertising sales "
    },
    {
        "content": "MEXICO CITY  April 27 Shares in Mexican broadcaster Televisa dropped more than 4 percent on Thursday after it posted its first-quarter results that showed weak sales despite a 125-percent year-on-year rise in net profit.",
        "date": "04272017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Shares in Mexican broadcaster Televisa down more than 4 pct "
    },
    {
        "content": "MEXICO CITY  April 26 Mexican broadcaster Grupo Televisa's first-quarter profit jumped on Wednesday  rising 125 percent compared with the same quarter last year  largely thanks to currency fluctuations.",
        "date": "04272017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Televisa sees 1st-qtr profit surge on forex gains "
    },
    {
        "content": "MEXICO CITY  April 20 Mexican broadcaster Televisa said on Thursday it had signed a deal with Spanish telecoms giant Telefonica that would give the mobile operator's customers cheaper access to the broadcaster's content carried on its digital platform Blim.",
        "date": "04202017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico's Televisa signs deal with Telefonica to distribute content "
    },
    {
        "content": "MEXICO CITY  March 9 Broadcaster Grupo Televisa said on Thursday that Mexico's telecommunications watchdog had imposed new regulations on it in the broadcasting sector  including increased accounting transparency.",
        "date": "03092017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico slaps new antitrust rules on broadcaster Televisa "
    },
    {
        "content": "MEXICO CITY  March 9 Broadcaster Grupo Televisa said on Thursday that Mexico's telecommunications watchdog had added new regulations against it in the broadcasting sector  including accounting separation of its different units.",
        "date": "03092017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Televisa says Mexico telecom regulator adds new antitrust rules "
    },
    {
        "content": "MEXICO CITY  Feb 28 Shares of Mexico's Grupo Televisa slipped on Tuesday following reports the broadcaster had been declared to have market power in pay television by the telecoms regulator  paving the way for tougher rules against it.",
        "date": "02282017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico's Televisa shares slip on reports of pay TV rule U-turn "
    },
    {
        "content": "MEXICO CITY  March 2 Mexico's Grupo Televisa   said on Thursday that Mexico's telecommunications regulator has declared that the media and entertainment company and its units have substantial market power in pay television  which could lead to tougher regulation.",
        "date": "03022017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 2-Mexico's Televisa says regulator could restrict its pay TV operations "
    },
    {
        "content": "NEW YORK Shares of Mexican media company Grupo Televisa SAB  could surge 20 percent in a year to $30 or more  according to Barron's.",
        "date": "02262017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Grupo Televisa stock could rise 20 percent in a year: Barron's "
    },
    {
        "content": "NEW YORK  Feb 26 Shares of Mexican media company Grupo Televisa SAB  could surge 20 percent in a year to $30 or more  according to Barron's.",
        "date": "02262017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Grupo Televisa stock could rise 20 pct in a year -Barron's "
    },
    {
        "content": "MEXICO CITY  Feb 23 Mexico's Grupo Televisa said on Thursday that it would slash its capital expenditures by more than a third to around $1 billion in 2017 as it prepares for tougher times with a weaker Mexican peso.",
        "date": "02232017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico broadcaster Televisa to slash investment in 2017 "
    },
    {
        "content": "MEXICO'S GRUPO TELEVISA REPORTS 4TH-QTR NET PROFIT OF 643 MILLION PESOS",
        "date": "02222017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "MEXICO'S GRUPO TELEVISA REPORTS 4TH-QTR NET PROFIT OF 643 MILLION PESOS "
    },
    {
        "content": "MEXICO CITY  Feb 23 Mexico's Grupo Televisa said on Thursday that it would slash its capital expenditure in 2017 by more than one third to around $1 billion.",
        "date": "02232017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico broadcaster Televisa to slash capital expenditure in 2017 "
    },
    {
        "content": "MEXICO CITY  Feb 23 Shares of Mexico's leading broadcaster Grupo Televisa gained more than 4 percent on Thursday following the company's fourth quarter earnings report.   (Reporting by Paulina Osorio)",
        "date": "02232017",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico's Televisa surges 4 pct following earnings report "
    },
    {
        "content": "MEXICO CITY  Jan 19 A Mexican tribunal has stuck down a ruling which declared that broadcaster Grupo Televisa did not have market power in pay television  two people with knowledge of the matter said  opening the door to tougher rules against the company.",
        "date": "01192017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico tribunal strikes down telecom ruling in blow to Televisa "
    },
    {
        "content": "MEXICO CITY Mexican broadcaster Televisa said on Wednesday the U.S. Federal Communications Commission (FCC) had given approval for Televisa to own up to 40 percent of U.S. Spanish-language peer Univision's voting stock and up to 49 percent of its common shares.",
        "date": "01042017",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Televisa says FCC approves higher Univision stake threshold "
    },
    {
        "content": "NEW YORK An unnamed company described in a sweeping probe of corruption in soccer's world governing body FIFA matches the description of a close affiliate of Grupo Televisa   the largest broadcaster in Latin America  according to a Reuters review of U.S. and Swiss government documents.",
        "date": "12172016",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Exclusive: Televisa affiliate surfaces in widening FIFA bribery probe "
    },
    {
        "content": "MEXICO CITY Mexico's Grupo Televisa on Thursday reported a more than 80 percent fall in third-quarter net profit  due to higher costs in its content division and an extraordinary gain in the year earlier period.",
        "date": "10272016",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico's Televisa profit falls more than 80 percent in third quarter "
    },
    {
        "content": "MEXICO CITY  Oct 27 Mexico's Grupo Televisa on Thursday reported a more than 80 percent fall in third-quarter net profit  due to higher costs in its content division and an extraordinary gain in the year earlier period.",
        "date": "10272016",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Televisa profit falls more than 80 pct in 3rd qtr "
    },
    {
        "content": "MEXICO CITY  Oct 27 Mexico's Grupo Televisa on Thursday reported a more than 80 percent fall in third-quarter profit compared to the year earlier period.",
        "date": "10272016",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico's Televisa reports more than 80 pct fall in 3rd-qtr profit "
    },
    {
        "content": "MEXICO CITY  Sept 29 Mexican cable television firm Megacable announced on Thursday that it would no longer carry six Grupo Televisa channels after Televisa terminated the contract.",
        "date": "09292016",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "CORRECTED-Mexico's Megacable says Televisa cancels contract for 6 channels "
    },
    {
        "content": "MEXICO CITY Mexican broadcaster and content provider Grupo Televisa said on Monday that the country's second-largest cable television company  Megacable  had decided to stop carrying 14 of its channels.",
        "date": "09052016",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexican cable operator to pull plug on 14 Televisa channels "
    },
    {
        "content": "MEXICO CITY  Sept 5 Mexican broadcaster and content provider Grupo Televisa said on Monday that the country's second-largest cable television company  Megacable  had decided to stop carrying 14 of its channels.",
        "date": "09052016",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "UPDATE 1-Mexican cable operator to pull plug on 14 Televisa channels "
    },
    {
        "content": "MEXICO CITY  July 5 Mexico's Televisa   one of the world's biggest producers of Spanish-language content  on Tuesday reported a 6.6 percent rise in its second-quarter profit  mostly driven by its fast-growing cable television business.",
        "date": "07062016",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Televisa says Q2 profit rises 6.6 pct "
    },
    {
        "content": "MEXICO CITY  July 5 Mexico's broadcaster Televisa  one of the world's biggest producers of Spanish-language content  on Tuesday reported a 6.6 percent rise in its second-quarter profit.",
        "date": "07062016",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico's Televisa says 2nd-qtr profit rises 6.6 pct "
    },
    {
        "content": "MEXICO CITY  April 28 Profit at Mexico's Grupo Televisa dropped by 59 percent in the first quarter  as the impact of a one-off payment a year earlier distorted results  the company said on Thursday.",
        "date": "04282016",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Televisa says 1st-qtr profit slides 59 percent "
    },
    {
        "content": "* Said on Tuesday that Joint Polish Investment Fund C.V. (fund)  ScaleThings Sp. z o. o. and ScaleThings founders signed an investment agreement on Feb. 29",
        "date": "03022016",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "BRIEF-Adiuvo Investments informs on investment in ScaleThings project "
    },
    {
        "content": "MEXICO CITY  Feb 26 Mexico's Grupo Televisa  expects to maintain its level of capital investment in 2016  the company's executive vice president said on a conference call on Friday.",
        "date": "02262016",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Grupo Televisa to maintain capital spending in 2016 - exec "
    },
    {
        "content": "MEXICO CITY  Feb 26 Mexico's Grupo Televisa  expects its capital expenditure in 2016 will be similar to its investment in 2015  the company's Executive Vice President Alfonso Angoitia said on a conference call on Friday.   (Reporting by Christine Murray)",
        "date": "02262016",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico's Grupo Televisa expects 2016 capex similar to 2015 "
    },
    {
        "content": "MEXICO CITY  Feb 25 Mexico's Grupo Televisa  on Thursday reported a 37 percent drop in profit in the fourth quarter  dragged down by higher costs and weakness in its advertising unit as it rethinks its pricing strategy.",
        "date": "02252016",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Televisa profit falls on ad weakness  higher costs "
    },
    {
        "content": "* \u007fTelevisa  a Mexican multimedia company  has contracted capacity on SES`s AMC-9 satellite at orbital position of 83 degrees west",
        "date": "12182015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "BRIEF-SES signs capacity deal with Televisa "
    },
    {
        "content": "NEW YORK  Nov 19 (IFR) - Mexico's Televisa injected some life into the Latin American primary market on Thursday with an up to US$1.2bn bond sale - the media company's first dollar deal in a year and a half.",
        "date": "11192015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "LATAM WRAP-Televisa breaks lull in LatAm primary market "
    },
    {
        "content": "MEXICO CITY  Nov 17 Mexican broadcaster Grupo Televisa on Tuesday said it was planning on issuing up to $1.2 billion in long-term bonds in the coming 90 days if market conditions permit.",
        "date": "11172015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico's Televisa says plans on issuing $1.2 bln in bonds "
    },
    {
        "content": "MEXICO CITY  Oct 22 Mexico's Grupo Televisa  swung to a quarterly profit from a year-ago loss  boosted by recent acquisitions in pay TV  though the company's advertising revenue fell.",
        "date": "10222015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Grupo Televisa acquisitions boost 3rd-qtr profit "
    },
    {
        "content": "MEXICO CITY  Oct 22 Mexico's Grupo Televisa  on Thursday reported a profit in the third quarter  compared to a loss in the same period last year due to the sale of its stake in wireless business Iusacell.",
        "date": "10222015",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico's Grupo Televisa posts 3rd-qtr profit vs loss year ago "
    },
    {
        "content": "MEXICO CITY  Oct 20 Mexico's America Movil  faces tough challenges across all its biggest markets with weak Latin American currencies  tougher regulation and new competition contributing to its first quarterly loss in almost 14 years.",
        "date": "10202015",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "UPDATE 2-Slim's America Movil faces multiple tests after surprise loss "
    },
    {
        "content": "* Said on Tuesday that on Oct. 12 Joint Stock Polish Investment Fund CV (Joint Stock PIF) and the USA-based Manta Instruments Inc signed an agreement for acquisition of preference series A shares",
        "date": "10142015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "BRIEF-Adiuvo Investments says Joint Stock PIF to buy shares of Manta Instruments "
    },
    {
        "content": "MEXICO CITY  Oct 2 Mexico's telecommunications regulator has ruled that broadcaster Grupo Televisa does not have market power in pay television  meaning the company avoids being hit with new tougher rules.",
        "date": "10032015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Televisa avoids new regulations in Pay TV "
    },
    {
        "content": "MEXICO CITY  Oct 2 Mexico's telecommunications regulator said on Friday it had decided that broadcaster Grupo Televisa does not have \"substantial market power\" in pay television  meaning the company avoids being hit with new tougher rules.",
        "date": "10032015",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico telecom regulator rules Televisa not dominant in Pay TV "
    },
    {
        "content": "MEXICO CITY  July 7 Shares in Mexican broadcast giant Televisa fell more than 5 percent on Tuesday  the day after the company reported a 40 percent drop in its second-quarter profits on higher financial costs.",
        "date": "07072015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Shares in Mexico's Televisa fall over 5 pct after 2nd-qtr results "
    },
    {
        "content": "MEXICO CITY  July 6 Mexican broadcaster Televisa  the world's biggest producer of Spanish-language television content  on Monday reported a 40 percent fall in its second-quarter profit as its financial costs rose.",
        "date": "07062015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico's Televisa profit drops on higher financial costs "
    },
    {
        "content": "MEXICO CITY  July 6 Mexican broadcaster Televisa  the world's biggest producer of Spanish-language content  on Monday reported a 40 percent fall in its second-quarter profit.",
        "date": "07062015",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico's Televisa profit drops 40 pct in 2nd-qtr "
    },
    {
        "content": "MEXICO CITY  June 29 Mexico will not send a contestant to this year's Miss Universe pageant after part owner and TV personality Donald Trump made comments insulting Mexicans  Mexican broadcaster Televisa said on Monday.",
        "date": "06302015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico won't send candidate to Miss Universe over Trump comments-Televisa "
    },
    {
        "content": "* Kambi Group plc and Grupo Televisa have signed a contract for the provision of sports betting services to Grupo Televisa's PlayCity brand",
        "date": "06242015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "BRIEF-Kambi Group plc and Grupo Televisa signs deal for the provision of sports betting "
    },
    {
        "content": "MEXICO CITY  April 23 Mexican broadcaster Televisa  the world's biggest provider of Spanish-language TV content  on Thursday reported a 70 percent  increase in its first-quarter net profit  reflecting a one-time payment from Univision.",
        "date": "04242015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 2-Mexico Televisa's quarterly net profit up 70 pct on one-time payment "
    },
    {
        "content": "MEXICO CITY Mexican regulators said on Tuesday that broadcaster Televisa has substantial power in 99 municipalities across the country  as a result of its acquisition of Mexican cable company Cablecom last year.",
        "date": "04282015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Televisa tightens Mexico TV market grip with Cablecom deal: regulator "
    },
    {
        "content": "MEXICO CITY  April 28 Mexican regulators said on Tuesday that broadcaster Televisa has substantial power in 99 municipalities across the country  as a result of its acquisition of Mexican cable company Cablecom last year.",
        "date": "04282015",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Televisa tightens Mexico TV market grip with Cablecom deal -regulator "
    },
    {
        "content": "MEXICO CITY  April 23 Mexican broadcaster Televisa  the world's biggest provider of Spanish-language TV content  on Thursday reported a 70 percent  increase in its first-quarter net profit on a one-time payment it received from Univision.",
        "date": "04232015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico Televisa's 1st-qtr net profit jumps 70 pct on payment "
    },
    {
        "content": "MEXICO CITY  April 20 The president and chief executive of U.S. cable network operator Discovery Communications  David Zaslav  will be nominated to join the board of directors at broadcaster Televisa   the Mexican company said on Monday.",
        "date": "04212015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico's Televisa to nominate Discovery Communications CEO to board "
    },
    {
        "content": "MEXICO CITY Mexico's telecoms regulator said on Friday it will analyze its next step after a media group backed out from paying for a new TV network  undermining the government's efforts to open up an industry controlled by broadcaster Televisa.",
        "date": "04112015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico telecoms regulator looking at options after voided TV license "
    },
    {
        "content": "MEXICO CITY  April 10 Mexico's telecoms regulator said on Friday it will analyze its next step after a media group backed out from paying for a new TV network  undermining the government's efforts to open up an industry controlled by broadcaster Televisa.",
        "date": "04112015",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "UPDATE 1-Mexico telecoms regulator looking at options after voided TV license "
    },
    {
        "content": "MEXICO CITY  March 18 Shares in Mexican broadcaster Grupo Televisa fell by more than three percent in early trade on Wednesday after Mexico's telecommunications regulator published findings about the company's market power that could lead to tougher regulation.",
        "date": "03182015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Shares in Mexico's Televisa drop 3 pct after regulator finding "
    },
    {
        "content": "MEXICO CITY  March 17 A unit of Mexico's telecommunications regulator has reached an initial conclusion that broadcaster Grupo Televisa has substantial power in the country's pay-TV market  according to a document posted on its website  a finding that could lead to stiffer regulations.",
        "date": "03182015",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico telco regulator initially concludes Televisa dominant in pay TV "
    },
    {
        "content": "MEXICO CITY  Feb 27 An executive from Mexico's Grupo Televisa on Friday said U.S. media company Univision could list shares within the next 12-18 months.",
        "date": "02272015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico's Televisa says Univision could go public in 12-18 months "
    },
    {
        "content": "MEXICO CITY  Feb 26 Mexico broadcaster Televisa  the world's biggest provider of Spanish-language content  on Thursday reported a 1.6 percent increase in its fourth-quarter profit  as it added pay-TV subscribers and sold more content and advertising.",
        "date": "02272015",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "UPDATE 2-Mexico's Televisa reports slightly higher 4th-qtr profit "
    },
    {
        "content": "MEXICO CITY  Feb 26 Mexico broadcaster Televisa on Thursday reported a 1.6 percent increase in its fourth-quarter profit.",
        "date": "02272015",
        "name": "Grupo Televisa SA",
        "news_type": "normal",
        "symbol": "TV",
        "title": "Mexico broadcaster Televisa reports slightly higher 4th-qtr profit "
    },
    {
        "content": "MEXICO CITY  Jan 8 Mexican broadcaster Grupo Televisa on Thursday said it sold its 50 percent stake in cellphone company Iusacell back to its joint-venture partner Grupo Salinas  paving the way for U.S. phone giant AT&T Inc to acquire Mexico's No. 3 phone company.",
        "date": "01092015",
        "name": "Grupo Televisa SA",
        "news_type": "topStory",
        "symbol": "TV",
        "title": "Mexico's Televisa completes sale of its 50 pct stake in Iusacell "
    }
]