[
    {
        "content": "Microblogging website Twitter Inc   known for its iconic 140-character tweets  said on Tuesday it would roll out 280-character tweets to users across the world.",
        "date": "11072017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter to roll out 280-character tweets worldwide "
    },
    {
        "content": "The following statements were posted to the verified Twitter accounts of U.S. President Donald Trump  @realDonaldTrump and @POTUS.",
        "date": "11072017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Trump on Twitter (Nov 7) - South Korea "
    },
    {
        "content": "WASHINGTON U.S. Commerce Secretary Wilbur Ross said on Monday he probably would not keep his holdings in a shipping company with business ties to Russian President Vladimir Putin's inner circle and that he had fully and properly disclosed investments. | Video ",
        "date": "11072017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "U.S. commerce chief says he is likely to divest Russia-linked shipping stake "
    },
    {
        "content": "Nov 1 Periscope  a mobile app that lets users live-stream video  said Wednesday it will give all earnings from a select program  save for an administrative fee  back to the users who broadcast from Periscope.",
        "date": "11012017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter's streaming app Periscope hikes payments to video stars "
    },
    {
        "content": "Twitter Inc faced questions on Friday about its approach to internal security after a company employee briefly deactivated U.S. President Donald Trump's account. | Video ",
        "date": "11032017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter employee briefly shuts Trump account  putting controls in question "
    },
    {
        "content": "Nov 3 Twitter Inc faced questions on Friday about its approach to internal security after a company employee briefly deactivated U.S. President Donald Trump's account.",
        "date": "11032017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 7-Twitter employee briefly shuts Trump account  putting controls in question "
    },
    {
        "content": "Twitter Inc  said on Thursday it may become profitable for the first time next quarter after slashing expenses over the past year and ramping up deals to sell its data to other companies  which could help to break its reliance on advertising for revenue. | Video ",
        "date": "10262017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter says it could turn first-ever profit  shares surge "
    },
    {
        "content": "RIYADH Saudi Prince Alwaleed bin Talal  who owns investment firm Kingdom Holding  said in an interview with CNBC on Monday that he was optimistic about his investment in Twitter.",
        "date": "10232017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Saudi Prince Alwaleed bin Talal optimistic about Twitter investment: CNBC "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc  said on Tuesday it would add labels to election-related advertisements and say who is behind each of them  after a threat of regulation from the United States over the lack of disclosure for political spending on social media.",
        "date": "10242017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter to label election ads after U.S. regulatory threat "
    },
    {
        "content": "WASHINGTON Republican U.S. Senator Bob Corker warned on Sunday that President Donald Trump risks setting the nation “on the path to World War Three\" in an interview with The New York Times  the latest in a series public barbs traded over the day. | Video ",
        "date": "10092017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Senator Corker says Trump risks putting U.S. on path to World War Three "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO Twitter  said on Thursday it had suspended about 200 Russian-linked accounts as it probes online efforts to meddle with the 2016 U.S. election  but an influential Democratic senator slammed its steps as insufficient. | Video ",
        "date": "09292017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter suspends Russia-linked accounts  but U.S. senator says response inadequate "
    },
    {
        "content": "NEW YORK The days of Twitter Inc  limiting messages to 140 characters  a signature of the social network since its launch in 2006  may be numbered. | Video ",
        "date": "09272017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter to test 280-character tweets  busting old limit "
    },
    {
        "content": "WASHINGTON The top Democrat on the U.S. House of Representatives Intelligence Committee said on Thursday that Twitter Inc  has taken \"remedial steps\" against accounts linked to Russian government actors  but still has work to do.",
        "date": "09282017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter 'has significant work to do' in Russia probe: U.S. lawmaker "
    },
    {
        "content": "WASHINGTON Executives from Facebook  Alphabet Inc's Google and Twitter have been asked to testify to the U.S. Congress in coming weeks as lawmakers probe Russia's alleged interference in the 2016 U.S. election  committee sources said on Wednesday. | Video ",
        "date": "09282017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Facebook  Google  Twitter asked to testify on Russian meddling "
    },
    {
        "content": "WASHINGTON Twitter Inc  is expected to brief U.S. congressional investigators soon on whether Russia used its advertising platform to promote divisive social and political messages during the 2016 election  Senator Mark Warner said on Thursday.",
        "date": "09072017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter to brief Congress on possible Russia-backed ads: U.S. senator "
    },
    {
        "content": "LAUNCESTON  Australia Gold's rally in recent weeks may be its first boosted by Twitter  but for the gains to sustain it will likely take more than just the ramping up of global geopolitical tensions amid bellicose tweets from U.S. President Donald Trump.",
        "date": "08142017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Gold rally is fueled by Trump's tweets  but that's not enough: Russell "
    },
    {
        "content": "Twitter Inc  shares plunged more than 14 percent on Thursday after the social media platform disappointed investors with stagnant monthly active user growth in the second quarter. | Video ",
        "date": "07272017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter shares tumble as user growth stalls "
    },
    {
        "content": "July 27 Twitter Inc shares plunged more than 14 percent on Thursday after the social media platform disappointed investors with stagnant monthly active user growth in the second quarter.",
        "date": "07272017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 4-Twitter shares tumble as user growth stalls "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc  on Tuesday hired Ned Segal  senior vice president of finance at Intuit Inc  and a former managing director at Goldman Sachs Group Inc   as its chief financial officer beginning in late August.",
        "date": "07112017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter hires ex-Goldman managing director as CFO "
    },
    {
        "content": "SAN FRANCISCO A U.S. judge ruled on Thursday that Twitter Inc  could move forward with a lawsuit that aims to free technology companies to speak more openly about surveillance requests they receive from the U.S. government.",
        "date": "07062017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "U.S. judge allows Twitter lawsuit over surveillance to move forward "
    },
    {
        "content": "SAN FRANCISCO  July 11 Twitter Inc on Tuesday hired Ned Segal  senior vice president of finance at Intuit Inc and a former managing director at Goldman Sachs Group Inc  as its chief financial officer beginning in late August.",
        "date": "07112017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 2-Twitter hires ex-Goldman managing director as CFO "
    },
    {
        "content": "* IGN Entertainment and Twitter partner on global live stream at san diego comic-con 2017",
        "date": "06292017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-IGN Entertainment and Twitter partner on global live stream at San Diego comic-con 2017 "
    },
    {
        "content": "June 1 Goldman Sachs Group Inc Chief Executive Officer Lloyd Blankfein criticized the United States' decision to withdraw from the Paris climate deal in his first message on Twitter Inc since joining the platform six years ago.",
        "date": "06012017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Goldman's Blankfein criticizes U.S decision to leave Paris climate deal "
    },
    {
        "content": "May 16 Twitter Inc co-founder Biz Stone said on Tuesday he would be returning full time to the microblogging service in an unspecified role.",
        "date": "05162017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter co-founder Biz Stone returns to company "
    },
    {
        "content": "* Soros Fund Management takes share stake of 29 600 shares in Twitter Inc - sec filing",
        "date": "05152017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Soros Fund Management takes share stake in Twitter  Visa Inc "
    },
    {
        "content": "May 11 Twitter Inc said on Thursday it signed a multi-year deal with the U.S. National Football League to live-stream pre-game coverage as well as a 30-minute show on the microblogging website.",
        "date": "05112017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter  NFL sign multi-year deal for live show "
    },
    {
        "content": "LOS ANGELES Family members of three victims of the December 2015 shooting rampage in San Bernardino  California  have sued Facebook  Google and Twitter  claiming that the companies permitted Islamic State to flourish on social media.",
        "date": "05042017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Families of San Bernardino shooting sue Facebook  Google  Twitter "
    },
    {
        "content": "May 3 Square Inc  the payments company co-founded by Twitter Inc Chief Executive Jack Dorsey  reported a smaller-than-expected quarterly loss on Wednesday  as customers processed more transactions through its network and costs fell.",
        "date": "05032017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "CORRECTED-UPDATE 1-Dorsey-led Square posts smaller-than-expected qtrly loss "
    },
    {
        "content": "The following statements were posted to the verified Twitter accounts of U.S. President Donald Trump  @realDonaldTrump and @POTUS.",
        "date": "05042017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Trump on Twitter (May 3): Betsy Devos  Mahmoud Abbas "
    },
    {
        "content": "May 3 Square Inc  the payments company co-founded by Twitter Inc Chief Executive Jack Dorsey  reported a smaller quarterly loss on Wednesday  as customers processed more transactions through its network.",
        "date": "05032017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "REFILE-Dorsey-led Square's quarterly loss narrows "
    },
    {
        "content": "The following statements were posted to the verified Twitter accounts of U.S. President Donald Trump  @realDonaldTrump and @POTUS.",
        "date": "05032017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Trump on Twitter (May 2): Shutdown  legislation  Director Comey "
    },
    {
        "content": "Shares of Twitter Inc jumped on Wednesday after the microblogging service reported better-than-expected user growth in the first quarter  although its revenue fell for the first time. | Video ",
        "date": "04262017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter posts strong user growth  shares soar "
    },
    {
        "content": "SAN FRANCISCO Oscar-winning actor Tom Hanks  who plays a Silicon Valley tycoon in the new film \"The Circle\" about a powerful social media company  teased Twitter Inc Chief Executive Officer Jack Dorsey on Monday that he may have been inspiration for the part.",
        "date": "04252017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Tom Hanks jokes Twitter CEO inspired his character in 'The Circle' "
    },
    {
        "content": "April 26 Shares of Twitter Inc jumped on Wednesday after the microblogging service reported better-than-expected user growth in the first quarter  although its revenue fell for the first time.",
        "date": "04262017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 4-Twitter posts strong user growth  shares soar "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Twitter has undeservedly attracted a bunch of new followers. The struggling social-media company touted surprise user growth as evidence it can get back on track under moonlighting Chief Executive Jack Dorsey. Revenue  however  fell 8 percent in the first quarter  a first since Twitter went public in 2013  as advertisers grew skeptical.",
        "date": "04262017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter unduly attracts financial followers "
    },
    {
        "content": "SAN FRANCISCO The U.S. Homeland Security Department's inspector general said on Friday he was investigating possible abuse of authority in a case that triggered a lawsuit against the department by Twitter Inc .",
        "date": "04222017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "U.S. Homeland Security probes possible abuse in Twitter summons case "
    },
    {
        "content": "April 26 Shares of Twitter Inc soared in premarket trade on Wednesday after the microblogging service reported better-than-expected user growth.",
        "date": "04262017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "CORRECTED-UPDATE 2-Twitter posts strong user growth  shares soar "
    },
    {
        "content": "* Brandwatch and Twitter announce strategic social data partnership Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "BRIEF-Brandwatch  Twitter announce social data partnership "
    },
    {
        "content": "The following statements were posted to the verified Twitter accounts of U.S. President Donald Trump  @realDonaldTrump and @POTUS.",
        "date": "04192017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Factbox: Trump on Twitter (April 18) - Obama administration  interview "
    },
    {
        "content": "The following statements were posted to the verified Twitter accounts of U.S. President Donald Trump  @realDonaldTrump and @POTUS.",
        "date": "04182017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Factbox: Trump on Twitter (April 17) - Fake news  foreign policy "
    },
    {
        "content": "The following statements were posted to the verified Twitter accounts of U.S. President Donald Trump  @realDonaldTrump and @POTUS.",
        "date": "04112017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Trump on Twitter (April 11) - President of China  North Korea "
    },
    {
        "content": "April 7 Twitter Inc's chief executive  Jack Dorsey  continued to forego direct compensation and Peter Fenton  a board member since 2009  will leave after the company's annual meet in May  a regulatory filing showed on Friday.",
        "date": "04072017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter CEO forgoes compensation; long-time board member to leave "
    },
    {
        "content": "SAN FRANCISCO Shares of Twitter  dropped about 1 percent on Thursday after co-founder Ev Williams said he is selling a minority of his shares in the social media company  which has been losing ground to Facebook and other fast-growing rivals.",
        "date": "04062017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter dips after co-founder says selling some of his shares "
    },
    {
        "content": "The following statements were posted to the verified Twitter accounts of U.S. President Donald Trump  @realDonaldTrump and @POTUS.",
        "date": "03312017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Trump on Twitter (March 30) - China meeting  Freedom Caucus "
    },
    {
        "content": "SAN FRANCISCO  April 6 Shares of Twitter dropped about 1 percent on Thursday after co-founder Ev Williams said he is selling a minority of his shares in the social media company  which has been losing ground to Facebook and other fast-growing rivals.",
        "date": "04062017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Twitter dips after co-founder says selling some of his shares "
    },
    {
        "content": "* IGN Entertainment and Twitter announce week-long exclusive global live stream partnership for E3 expo 2017",
        "date": "04062017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "BRIEF-IGN Entertainment and Twitter report global live stream partnership "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc  is launching a faster version of its mobile service on Wednesday aimed at people with sporadic connections or little data on their smartphone plans  hoping to pick up users in harder-to-reach emerging markets.",
        "date": "04062017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter creates 'lite' version for data-starved users "
    },
    {
        "content": "March 28 Twitter Inc  trying to boost its sagging advertising revenue  will allow brands to buy commercials on its video streams for Periscope  signaling a major push to make money off the live-streaming platform  the company announced on Tuesday morning.",
        "date": "03282017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter to let advertisers buy video ads on Periscope "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc  is considering whether to build a premium version of its popular Tweetdeck interface aimed at professionals  the company said on Thursday  raising the possibility that it could collect subscription fees from some users for the first time. | Video ",
        "date": "03242017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter explores subscription-based option for first time "
    },
    {
        "content": "SAN FRANCISCO  March 23 Twitter Inc is considering whether to build a premium version of its network aimed at professionals  the company said on Thursday  raising the possibility that it could collect subscription fees from some users for the first time.",
        "date": "03232017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter explores premium version after 11 years as a free service "
    },
    {
        "content": "SAN FRANCISCO  March 23 Twitter Inc is considering whether to build a premium version of its popular Tweetdeck interface aimed at professionals  the company said on Thursday  raising the possibility that it could collect subscription fees from some users for the first time.",
        "date": "03242017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Twitter explores subscription-based option for first time "
    },
    {
        "content": "Twitter Inc said on Tuesday it had suspended more than 636 000 accounts since the middle of 2015 as the company steps up efforts to tackle \"violent extremism\" on its microblogging platform.",
        "date": "03212017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter suspended more than 636 000 accounts since 2015 to tackle extremism "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc  said on Tuesday it had stepped up efforts to rid its social network of posts from users advocating political or religious violence  and was increasingly using software to find them rather than relying on reports from users or governments.",
        "date": "03212017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter software helps find  ban users advocating violence "
    },
    {
        "content": "March 21 Twitter Inc said on Tuesday it had suspended more than 636 000 accounts since the middle of 2015 as the company steps up efforts to tackle \"violent extremism\" on its microblogging platform.",
        "date": "03212017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "CORRECTED-Twitter suspended more than 636 000 accounts since 2015 to tackle extremism "
    },
    {
        "content": "BRUSSELS European consumer protection authorities will ask social media companies Facebook Inc  Alphabet Inc and Twitter Inc to amend their terms of service within one month or possibly face fines  a source familiar with the matter said on Thursday.",
        "date": "03172017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "EU consumer authorities to take on Facebook  Google  Twitter "
    },
    {
        "content": "BRUSSELS Social media companies Facebook Inc  Alphabet Inc and Twitter Inc will have to amend their terms of service for European users within a month or face the risk of fines  a European Commission official said on Friday. | Video ",
        "date": "03172017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "EU authorities demand changes from Facebook  Google  Twitter "
    },
    {
        "content": "* Follows German plans for tighter regulation   (Adds Commission official confirms authorities to take action)",
        "date": "03172017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 3-EU authorities demand changes from Facebook  Google  Twitter "
    },
    {
        "content": "BRUSSELS  March 16 European consumer protection authorities will ask Facebook  Google and Twitter to amend their terms of service within one month or possibly face fines  a source familiar with the matter said on Thursday.",
        "date": "03162017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "RPT-EU consumer authorities to take on Facebook  Google  Twitter "
    },
    {
        "content": "BRUSSELS  March 16 European consumer protection authorities will ask Facebook  Google and Twitter to amend their terms of service within one month or possibly face fines  a source familiar with the matter said on Thursday.",
        "date": "03162017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "EU consumer authorities to take on Facebook  Google  Twitter "
    },
    {
        "content": "The following statements were posted to the verified Twitter accounts of U.S. President Donald Trump  @realDonaldTrump and @POTUS.",
        "date": "03082017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Trump on Twitter (March 7) - Gitmo  Healthcare bill  Russia "
    },
    {
        "content": "* Mashable and Twitter announce live show partnership for SXSW",
        "date": "02272017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Mashable and Twitter announce live show partnership for SXSW "
    },
    {
        "content": "SAO PAULO Twitter Inc has found a bright spot in Brazil  Latin America's largest economy  even as weak advertising sales across the globe have punished the social network's stock in recent weeks.",
        "date": "02232017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Olympics  smartphones push Twitter revenue up 30 percent in Brazil "
    },
    {
        "content": "SAO PAULO  Feb 23 Twitter Inc has found a bright spot in Brazil  Latin America's largest economy  even as weak advertising sales across the globe have punished the social network's stock in recent weeks.",
        "date": "02232017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Olympics  smartphones push Twitter revenue up 30 pct in Brazil "
    },
    {
        "content": "Feb 22 Square Inc  the mobile payments company co-founded and run by Twitter Inc Chief Executive Jack Dorsey  reported a 20.7 percent jump in quarterly revenue as it processed more payments.",
        "date": "02222017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Dorsey's Square reports 20.7 pct jump in quarterly revenue "
    },
    {
        "content": "* Kudelski Group and Twitter pursue business collaboration opportunities  Source text for Eikon:  Further company coverage:   (Gdynia Newsroom)",
        "date": "02202017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Kudelski and Twitter pursue business collaboration opportunities "
    },
    {
        "content": "* Says merger with PSA makes sense in principle  doing everything to create sustainable future for Opel  Further company coverage:",
        "date": "02172017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Opel CEO says merger with PSA makes sense in principle "
    },
    {
        "content": "* Jana Partners LLC dissolves sole share stake in Twitter - sec filing",
        "date": "02142017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Jana Partners dissolves stake in Twitter  Viacom and Priceline "
    },
    {
        "content": "* Says updates include stopping creation of new abusive accounts  bringing forward safer search results  collapsing potentially abusive/low-quality tweets",
        "date": "02072017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter announces three changes to update safety "
    },
    {
        "content": "* Evan Clark Williams reports 6.1% passive stake in Twitter Inc as of December 31  2016 - SEC filing",
        "date": "02102017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Evan Williams reports 6.1 pct passive stake in Twitter "
    },
    {
        "content": "Feb 9 Twitter Inc's desultory earnings report on Thursday show a company with no evident path to profitability  as core costs climb more quickly than revenue while user growth stagnates.",
        "date": "02092017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter numbers paint grim profitability picture "
    },
    {
        "content": "Twitter Inc's  desultory earnings report on Thursday show a company with no evident path to profitability  as core costs climb more quickly than revenue while user growth stagnates. | Video ",
        "date": "02102017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter numbers paint grim profitability picture "
    },
    {
        "content": "Twitter Inc  posted the slowest revenue growth since it went public four years ago  sending shares down more than 10 percent on Thursday on fears that rivals Snapchat and Facebook Inc were winning the war for advertising. | Video ",
        "date": "02092017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter advertising revenue falls  shares drop more than 10 percent "
    },
    {
        "content": "Feb 9 Twitter Inc posted the slowest revenue growth since it went public four years ago  sending shares down more than 10 percent on Thursday on fears that rivals Snapchat and Facebook Inc were winning the war for advertising.",
        "date": "02092017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 4-Twitter advertising revenue falls  shares drop more than 10 pct "
    },
    {
        "content": "Feb 9 Investors hammered Twitter Inc on Thursday after the social network reported its slowest quarterly revenue growth since going public in 2013  struggling to attract advertisers amid intense competition from Snap Inc's Snapchat and Facebook Inc.",
        "date": "02092017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "REFILE-UPDATE 2-Twitter reports slowest quarterly revenue growth  shares slump "
    },
    {
        "content": "* HRH Prince Alwaleed Bin Talal Bin Abdulaziz Alsaud reports 4.9pct passive stake in twitter inc as of December 31  2016",
        "date": "02062017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-HRH Prince Alwaleed Bin Talal Bin Abdulaziz Alsaud reports 4.9% passive stake in Twitter "
    },
    {
        "content": "Feb 9 Twitter Inc reported its slowest quarterly revenue growth since going public  as the company continues to grapple with intense competition from newer services such as Snap Inc's Snapchat and Facebook's  Instagram.",
        "date": "02092017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter reports slowest quarterly revenue growth "
    },
    {
        "content": "SAN FRANCISCO  Jan 30 Short sellers have been closing their bets against Twitter Inc so far in 2017  possibly frustrated by a lack of volatility in the social network's stock price.",
        "date": "01302017",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Short sellers giving up on Twitter trade "
    },
    {
        "content": "NEW YORK/BEIJING Twitter Inc  executive Kathy Chen  brought in to run Greater China just over eight months ago  has quit  according to a tweet sent by her over the weekend. | Video ",
        "date": "01032017",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter's China boss Kathy Chen quits after eight months "
    },
    {
        "content": "One of Netflix Inc's  Twitter accounts was hacked on Wednesday by an entity calling itself \"OurMine\".",
        "date": "12212016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Hacker group takes over Netflix Twitter account "
    },
    {
        "content": "SAN FRANCISCO Greylock Partners  a top-tier Silicon Valley venture firm  said on Tuesday it has hired a new investing partner in Josh McFarland  who will be leaving his executive post at Twitter Inc.",
        "date": "12202016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Another Twitter executive exits  joins venture firm Greylock "
    },
    {
        "content": "WASHINGTON President-elect Donald Trump left Twitter off the invitation list for a meeting of technology company executives on Wednesday because it is too small  a spokesman for his transition team told Reuters.",
        "date": "12142016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Trump team says Twitter too small to be included in tech meeting "
    },
    {
        "content": "Nov 17 Twitter's Chief Executive Jack Dorsey apologized on Thursday after the microblogging service let through an ad promoting a white supremacist group.",
        "date": "11172016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter CEO apologizes for allowing white supremacist ad "
    },
    {
        "content": "* Jana Partners LLC takes sole share stake in Yahoo Inc - sec filing",
        "date": "11142016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Jana Partners takes sole share stake in Yahoo  Twitter "
    },
    {
        "content": "Nov 17 Salesforce.com Inc reported a 25.3 percent jump in quarterly revenue on Thursday  as more businesses used its cloud-based sales and marketing software.",
        "date": "11172016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Salesforce's quarterly revenue jumps 25.3 pct "
    },
    {
        "content": "Twitter Inc  said it was able to deliver more viewers than promised to advertisers on a U.S. election night livestream  good news for the microblogging site as it tries to ward off growing competition for ad dollars from Snapchat and Instagram.",
        "date": "11112016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter impresses advertisers with BuzzFeed U.S. election livestream "
    },
    {
        "content": "* Saudi's Prince Alwaleed bin Talal says he sees better growth to come from Twitter",
        "date": "11102016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Saudi Prince Alwaleed bin Talal: M.East needs reassurance from Trump -CNBC "
    },
    {
        "content": "Nov 11 Twitter Inc said it was able to deliver more viewers than promised to advertisers on a U.S. election night livestream  good news for the microblogging site as it tries to ward off growing competition for ad dollars from Snapchat and Instagram.",
        "date": "11112016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Twitter impresses advertisers with BuzzFeed U.S. election livestream "
    },
    {
        "content": "Nov 11 Twitter said it was able to deliver more viewers than promised to advertisers on an election night livestream  good news for the microblogging site as it tries to ward off growing competition for ad dollars from Snapchat and Instagram.",
        "date": "11112016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "CORRECTED-Twitter outperforms on ads for BuzzFeed's election livestream "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc said on Wednesday that Chief Operating Officer Adam Bain  widely credited with building a robust advertising business at the company even as it struggled with user growth  is leaving to explore other opportunities.",
        "date": "11092016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter says COO Adam Bain to leave  Noto to take his place "
    },
    {
        "content": "SAN FRANCISCO  Nov 9 Twitter Inc said on Wednesday that Chief Operating Officer Adam Bain  widely credited with building a robust advertising business at the company even as it struggled with user growth  is leaving to explore other opportunities.",
        "date": "11092016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 2-Twitter says COO Adam Bain to leave  Noto to take his place "
    },
    {
        "content": "* Bain will assist with transition of COO role over coming weeks.",
        "date": "11092016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter COO Adam bain to leave "
    },
    {
        "content": "* Twitter's board is not pushing CEO Jack Dorsey to choose between Square & Twitter - CNBC  citing source",
        "date": "11042016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter's board is not pushing CEO Jack Dorsey to choose between Square & Twitter - CNBC  citing source "
    },
    {
        "content": "Nov 1 Square Inc  the mobile payments company co-founded and run by Twitter Inc Chief Executive Jack Dorsey  reported a 32.2 percent jump in quarterly revenue as it processed more transactions.",
        "date": "11012016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Dorsey's Square reports 32 pct jump in quarterly revenue "
    },
    {
        "content": "SAO PAULO Twitter Inc is seeking revenue outside traditional advertising sales by helping companies develop customer service channels on its platform  according to its most senior executive in Latin America  a testing ground for the new strategy.",
        "date": "11042016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter Latam executive sees customer service strategy as key to revenue boost "
    },
    {
        "content": "SAO PAULO  Nov 4 Twitter Inc is seeking revenue outside traditional advertising sales by helping companies develop customer service channels on its platform  according to its most senior executive in Latin America  a testing ground for the new strategy.",
        "date": "11042016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter Latam exec sees customer service strategy as key to revenue boost "
    },
    {
        "content": "ISTANBUL  Nov 4 Access to social media sites Twitter and Whatapp was blocked in Turkey on Friday  an internet monitoring group said  following the detentions of 11 pro-Kurdish lawmakers in the mainly Kurdish southeast overnight.",
        "date": "11042016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Turkey blocks access to Twitter  Whatsapp - internet monitoring group "
    },
    {
        "content": "Twitter Inc said Thursday it would cut 9 percent of its global workforce to keep costs down even as quarterly results eclipsed Wall Street's beaten-down expectations  lifting shares that had fallen after a failed effort to sell the company. | Video ",
        "date": "10272016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter cuts jobs with eye on 2017 profit; Vine discontinued "
    },
    {
        "content": "Oct 26 Salesforce.com Inc Chief Executive Marc Benioff spoke on Wednesday about a pair of key acquisitions that got away  suggesting his vision for LinkedIn  was different from Microsoft's and that he would have pursued Twitter if shareholders had not learned of his plans",
        "date": "10262016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Salesforce.com CEO speaks of failed efforts to buy Twitter  LinkedIn "
    },
    {
        "content": "Twitter Inc  may cut 8 percent of its workforce or about 300 people  Bloomberg reported on Monday  citing people it said were familiar with the matter.",
        "date": "10252016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter plans to cut about 300 more jobs: Bloomberg "
    },
    {
        "content": "* Shares gain but off day's highs   (Adds that Twitter intends to end Vine service  updates shares)",
        "date": "10272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 7-Twitter cuts jobs with eye on 2017 profit; Vine discontinued "
    },
    {
        "content": "Salesforce.com Inc  Chief Executive Officer Marc Benioff spoke on Wednesday about a pair of key acquisitions that got away  suggesting his vision for LinkedIn Corp  was different from Microsoft Corp's  and that he would have pursued Twitter Inc  if shareholders had not learned of his plans.",
        "date": "10262016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Salesforce CEO speaks of failed efforts to buy Twitter  LinkedIn "
    },
    {
        "content": "Oct 26 Salesforce.com Inc Chief Executive Officer Marc Benioff spoke on Wednesday about a pair of key acquisitions that got away  suggesting his vision for LinkedIn Corp was different from Microsoft Corp's  and that he would have pursued Twitter Inc if shareholders had not learned of his plans.",
        "date": "10262016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Salesforce.com CEO speaks of failed efforts to buy Twitter  LinkedIn "
    },
    {
        "content": "Hollywood executives Jeff Sagansky and Harry Sloan are in advanced talks to acquire magazine publishing company Playboy Enterprises Inc [ICONAP.UL] through an acquisition vehicle they launched last year  people familiar with the matter said.",
        "date": "10262016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Hollywood execs Sagansky  Sloan in talks to acquire Playboy: sources "
    },
    {
        "content": "Oct 24 Twitter Inc may cut 8 percent of its workforce or about 300 people  Bloomberg reported on Monday  citing people it said were familiar with the matter.",
        "date": "10252016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 2-Twitter plans to cut about 300 more jobs - Bloomberg "
    },
    {
        "content": "SAN FRANCISCO/BOSTON The apparent lack of interest in Twitter Inc by potential suitors may force the social media company to consider a route anathema to aspiring tech startups: a major restructuring and cutting some its nearly 4 000 employees. | Video ",
        "date": "10212016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "No partner in sight  Twitter faces tough solo choices "
    },
    {
        "content": "Twitter Inc faces an uncertain future after Saleforce.com Inc   the last of the companies believed to be interested in buying the troubled social network  said on Friday that it would not make a bid.",
        "date": "10142016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter charts solo path as Salesforce rules out takeover "
    },
    {
        "content": "Oct 14 Twitter Inc faces an uncertain future after Saleforce.com Inc  the last of the companies believed to be interested in buying the troubled social network  said on Friday that it would not make a bid.",
        "date": "10142016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 3-Twitter charts solo path as Salesforce rules out takeover "
    },
    {
        "content": "U.S. stocks ended little changed on Friday  losing ground late after Federal Reserve Chair Janet Yellen's comments on the economy unnerved investors. | Video ",
        "date": "10142016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Wall Street's gains fade as Yellen questions economy's resilience "
    },
    {
        "content": "Oct 14 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "10142016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Confirms The Financial Times report that said Salesforce walked away from Twitter bid -spokesperson  Further company coverage:",
        "date": "10142016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "BRIEF-Salesforce confirms FT report that Salesforce walks away from Twitter bid "
    },
    {
        "content": "** Twitter recovery off its May 2016 low has turned volatile amid possible deal chatter. Nevertheless  severe bear trend still intact  suggesting shares destined for new lows",
        "date": "10112016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BUZZ-Twitter: Charts not much to chirp about "
    },
    {
        "content": "Salesforce.com Inc  is still deliberating whether it should make an offer for Twitter Inc  in the face of resistance from Salesforce shareholders over the strategic merits and valuation of such a deal  people familiar with the matter said on Monday. | Video ",
        "date": "10102016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Salesforce still mulls bid for Twitter as shareholders resist: sources "
    },
    {
        "content": "Twitter Inc has told potential acquirers it is seeking to conclude negotiations about selling itself by the time it reports third-quarter earnings on Oct. 27  according to people familiar with the matter.",
        "date": "10062016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Exclusive: Twitter to conclude sale deliberations this month - sources "
    },
    {
        "content": "Oct 11 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "10112016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "PRESS DIGEST- New York Times business news - Oct 11 "
    },
    {
        "content": "Oct 10 Salesforce.com Inc is still deliberating whether it should make an offer for Twitter Inc  in the face of resistance from Salesforce shareholders over the strategic merits and valuation of such a deal  people familiar with the matter said on Monday.",
        "date": "10102016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Salesforce still mulls bid for Twitter as shareholders resist -sources "
    },
    {
        "content": "Twitter Inc's  shares slumped more than 13 percent in early trading on Monday after a weekend Bloomberg report that top potential bidders  including Salesforce.com Inc    had lost interest in making a bid for the company.",
        "date": "10102016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter's shares slump on report that potential bidders lose interest "
    },
    {
        "content": "* Twitter is expected to field bids this week- WSJ  citing sources  Source (http://on.wsj.com/2dpQeYK)",
        "date": "10042016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter is expected to field bids this week- WSJ  citing sources "
    },
    {
        "content": "Oct 10 Shares of Twitter Inc slumped more than 13 percent in premarket trading on Monday after a weekend Bloomberg report that the social media company was unlikely to receive any bids.",
        "date": "10102016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter's shares slump on report that bids are unlikely "
    },
    {
        "content": "Sept 26 Walt Disney Co is working with a financial adviser to evaluate a possible bid for Twitter Inc   Bloomberg reported  citing people familiar with the matter.",
        "date": "09262016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Disney working with adviser on possible Twitter bid - Bloomberg "
    },
    {
        "content": "SAN FRANCISCO  Sept 26 With speculation mounting that Twitter Inc will soon have a new corporate owner  the 10-year-old social networking service - which has long struggled to define its core purpose -may end up heading in one of several distinctly different directions depending on who ends up paying for it.",
        "date": "09272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter could take many forms  depending on new owner "
    },
    {
        "content": "Walt Disney Co  and Microsoft Corp  joined a list of potential suitors for Twitter Inc   according to media reports on Monday. | Video ",
        "date": "09272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Disney  Microsoft among possible Twitter suitors: reports "
    },
    {
        "content": " ",
        "date": "09232016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "UPDATE 5-Twitter initiates talks with tech companies over sale -source "
    },
    {
        "content": "SAN FRANCISCO  Sept 27 With speculation mounting that Twitter Inc will soon have a new corporate owner  the 10-year-old social networking service - which has long struggled to define its core purpose -may end up heading in one of several distinctly different directions depending on who ends up paying for it.",
        "date": "09272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "RPT-Twitter could take many forms  depending on new owner "
    },
    {
        "content": "Sept 27 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "09272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "PRESS DIGEST - Wall Street Journal - Sept 27 "
    },
    {
        "content": "Twitter Inc  has initiated talks with several technology companies to explore selling itself  a person familiar with the matter said on Friday  signaling the start of what is likely to be a slow-rolling auction of the high-profile but money-losing social media company. | Video ",
        "date": "09232016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter initiates talks with tech companies over sale: source "
    },
    {
        "content": "Sept 23 Twitter Inc has initiated talks with several technology companies to explore selling itself  a person familiar with the matter said on Friday  as the social media company grapples with its slowest revenue growth since going public in 2013.",
        "date": "09232016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "RPT-UPDATE 3-Twitter begins discussions to explore a sale -source "
    },
    {
        "content": "* Twitter moving closer to sale  has received expressions of interest; no sale is imminent - CNBC  citing sources",
        "date": "09232016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter may receive formal bid shortly  suitors said to include Salesforce and Google - CNBC  citing sources "
    },
    {
        "content": "Twitter Inc Chief Executive Jack Dorsey is expected to be given a few more quarters to execute his turnaround plan and his management will not be questioned at Thursday's board meeting  CNBC reported  citing sources.",
        "date": "09082016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter's Dorsey likely to get few more quarters to execute plan: CNBC "
    },
    {
        "content": " ",
        "date": "09082016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Twitter's Dorsey likely to get few more quarters to execute plan-CNBC "
    },
    {
        "content": "Sept 8 Twitter Inc Chief Executive Jack Dorsey is expected to be given a few more quarters to execute his turnaround plan and his management will not be questioned at Thursday's board meeting  CNBC reported  citing sources.",
        "date": "09082016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter's Dorsey to get few more quarters to execute plan- CNBC "
    },
    {
        "content": "* Twitter has hired kristin binns as new communications boss; binns joins the company from anthem - recode    Further company coverage:",
        "date": "09072016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter hires Kristin Binns as new communications boss - Recode "
    },
    {
        "content": "Twitter Inc on Tuesday stepped up its battle to attract video talent to its platform  saying it will allow U.S. users who upload a video to share in any advertising revenue it generates.",
        "date": "08302016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter to share ad revenue on videos by U.S. users "
    },
    {
        "content": "Aug 30 Twitter Inc said it would share some of the advertising revenue on videos created by its individual users in the United States as part of an expanded video advertising program.",
        "date": "08302016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter to share ad revenue on videos by U.S. individual users "
    },
    {
        "content": "* Will secure featured placement in #stickers library in ten countries across five continents",
        "date": "08152016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-PepsiCo announced as Twitter launch partner for promoted #stickers "
    },
    {
        "content": "Rizvi Traverse Management LLC  managed by secretive investor Suhail Rizvi  has halved its stake in Twitter Inc and increased its holding in mobile payments company Square Inc  regulatory filings showed on Friday.",
        "date": "08122016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Secretive investor Rizvi halves Twitter stake  buys Square stock "
    },
    {
        "content": "Aug 4 Twitter Inc's head of corporate  revenue and policy communications  Jim Prosser  is leaving to join online lender SoFi.",
        "date": "08042016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter loses another corporate communications executive "
    },
    {
        "content": "Aug 3 Square Inc  the mobile payments company co-founded and run by Twitter Inc Chief Executive Jack Dorsey  reported a 41.5 percent jump in quarterly revenue as more transactions were processed through the company's network.",
        "date": "08032016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Dorsey's Square reports 41.5 pct jump in quarterly revenue "
    },
    {
        "content": "Aug 4 Jim Prosser  Twitter Inc's head of corporate  revenue and policy communications  said on Thursday he was leaving the microblogging website to join online lender SoFi.",
        "date": "08042016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Twitter loses another corporate communications executive "
    },
    {
        "content": "SAN FRANCISCO  July 27 Twitter Inc  disappointed investors yet again on Tuesday with second-quarter earnings that missed estimates and a lower-than-expected outlook  reviving chatter about a possible sale of the company and the future of Chief Executive Officer Jack Dorsey.",
        "date": "07272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Disappointing earnings revive speculation on Twitter's future "
    },
    {
        "content": "SAN FRANCISCO/BENGALURU Twitter Inc reported its slowest revenue growth since going public in 2013 and set a disappointing forecast  fanning concerns that faster growing social media services will make it a niche product.",
        "date": "07262016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter revenue growth stalls  struggles to boost users "
    },
    {
        "content": "Video may have killed the radio star  but it could offer a lifeline to Twitter Inc . Just don't expect a turnaround in the company's flagging fortunes anytime soon  analysts said.",
        "date": "07272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter's video push seen taking time to fast-forward growth "
    },
    {
        "content": "SAN FRANCISCO/BENGALURU  July 26 Twitter Inc  reported its slowest revenue growth since going public in 2013 and set a disappointing forecast  fanning concerns that faster growing social media services will make it a niche product.",
        "date": "07262016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 4-Twitter revenue growth stalls  struggles to boost users "
    },
    {
        "content": "* Futures: Dow down 12 pts  S&P flat  Nasdaq up 7.25 pts   (Adds details  comments  updates prices)",
        "date": "07262016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St set to open flat as investors assess earnings "
    },
    {
        "content": "July 26 The following are the top stories from selected Canadian newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "07262016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "PRESS DIGEST- Canada-July 26 "
    },
    {
        "content": "Twitter Inc said on Tuesday it had signed a deal with the NBA to stream exclusive non-game programing  pushing deeper into sports streaming as it seeks new ways to attract users.",
        "date": "07192016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter signs streaming deal with NBA for non-game programing "
    },
    {
        "content": "STOCKHOLM/SAN FRANCISCO Square Inc  the mobile payments company run by Twitter Inc CEO Jack Dorsey  has incorporated a business called Squareup Europe Ltd in Britain  registration documents show  lining itself up for what could be its first foray into Europe.",
        "date": "07192016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Dorsey's Square starts up UK operation for first European foray "
    },
    {
        "content": "July 19 Twitter Inc said on Tuesday it had signed a deal with the NBA to stream exclusive non-game programming  pushing deeper into sports streaming as it seeks new ways to attract users.",
        "date": "07192016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Twitter signs streaming deal with NBA for non-game programming "
    },
    {
        "content": "July 19 Twitter Inc said on Tuesday it had signed a deal with the NBA to stream exclusive non-game programming.",
        "date": "07192016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter signs streaming deal with NBA for non-game programming "
    },
    {
        "content": "TORONTO  July 13 Canada's main spy agency joined Twitter on Wednesday  announcing in a cheeky flip of the script: \"Now it's your turn to follow us.\"",
        "date": "07132016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Canada spy agency joins Twitter: 'It's your turn to follow us' "
    },
    {
        "content": "July 12 Twitter is set to live-stream some of Bloomberg LP's television programs  the latest in a series of content deals struck by the microblogging service this year.",
        "date": "07122016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter to live-stream some Bloomberg TV programs "
    },
    {
        "content": "* Bloomberg says Bloomberg media and Twitter announce live streaming partnership",
        "date": "07122016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "BRIEF-Bloomberg says Bloomberg media  Twitter announce live streaming partnership "
    },
    {
        "content": "Twitter Inc  is in talks with the NBA  Major League Soccer and Time Warner Inc's  cable network Turner Broadcasting to buy digital streaming rights for content related to major sports and events  Recode reported. | Video ",
        "date": "07082016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter seeks NBA  MLS  Turner deals to stream sports - Recode "
    },
    {
        "content": "* Since  september 2012  taylor  has served as chief executive officer and co-founder of quip  inc",
        "date": "07052016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter appoints Quip Inc Co-founder Bret Taylor to board "
    },
    {
        "content": "July 8 Twitter Inc is in talks with the NBA  Major League Soccer and Time Warner Inc's cable network Turner Broadcasting to buy digital streaming rights for content related to major sports and events  Recode reported.",
        "date": "07082016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 4-Twitter seeks NBA  MLS  Turner deals to stream sports - Recode "
    },
    {
        "content": "* Twitter talking to the NBA  MLS and Turner to buy rights to more sports streams -Recode  citing sources",
        "date": "07082016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter looking to ink more NFL-style streaming deals -Recode "
    },
    {
        "content": "June 20 Twitter Inc said on Monday it acquired London-based Magic Pony Technology  a machine-learning startup that specializes in working with images  to deliver better video and picture content.",
        "date": "06202016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter buys machine-learning firm Magic Pony to boost image content "
    },
    {
        "content": "Twitter Inc has invested about $70 million in Berlin-based music service SoundCloud  technology website Re/code reported citing people familiar with the deal.",
        "date": "06142016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter invests $70 million in SoundCloud: Re/code "
    },
    {
        "content": "June 14 Twitter Inc has invested about $70 million in Berlin-based music service SoundCloud  technology website Re/code reported citing people familiar with the deal.",
        "date": "06142016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Twitter invests $70 mln in SoundCloud - Re/code "
    },
    {
        "content": "SAN FRANCISCO Advertising agencies are for the first time turning to Instagram more frequently than Twitter for social media ad campaigns  a survey released Thursday showed  a further indication of weakness in an ad sales operation that has been one of the few bright spots for Twitter.",
        "date": "06102016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Instagram attracting more advertising than Twitter: survey "
    },
    {
        "content": "* Twitter has invested $70 million in music streaming service SoundCloud -Recode  citing sources",
        "date": "06142016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter invests $70 mln in music streaming service SoundCloud -Recode "
    },
    {
        "content": "Microsoft Corp will buy LinkedIn Corp for $26.2 billion in its biggest-ever deal  a bold stroke by Microsoft CEO Satya Nadella in his efforts to make the venerable software company a major force in next-generation computing. | Video ",
        "date": "06142016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Microsoft to buy LinkedIn for $26.2 billion in its largest deal "
    },
    {
        "content": "June 13 Microsoft Corp will buy LinkedIn Corp for $26.2 billion in its biggest-ever deal  a bold stroke by Microsoft CEO Satya Nadella in his efforts to make the venerable software company a major force in next-generation computing.",
        "date": "06142016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 7-Microsoft to buy LinkedIn for $26.2 bln in its largest deal "
    },
    {
        "content": "May 16 Twitter Inc users will soon have more flexibility in writing tweets because the company plans to stop including photos and links as part of its 140-character limit  according to a Bloomberg report.",
        "date": "05162016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter to eliminate photos and links in character count: report "
    },
    {
        "content": "* Board also appoints marjorie scardino as lead independent director",
        "date": "05162016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "BRIEF-Twitter appoints Debra Lee to its board "
    },
    {
        "content": "SAN FRANCISCO A U.S. judge on Monday partly dismissed a lawsuit filed by Twitter Inc  in which the social media company argued it should be allowed to publicly disclose more details about requests for information it receives from the U.S. government.",
        "date": "05022016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter lawsuit partly dismissed over U.S. information requests "
    },
    {
        "content": "* Oil near highs as Fed hold indicates weaker dollar   (Updates data  prices  adds details of Fed statement)",
        "date": "04272016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "GLOBAL MARKETS-Wall St stocks steady  bond yields fall  oil hits 2016 high after Fed "
    },
    {
        "content": "* Oil up at highs on weak dollar; EIA survey trims gains   (Updates data  prices)",
        "date": "04272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "GLOBAL MARKETS-World stocks  US dollar down as markets await Fed "
    },
    {
        "content": "April 26 Twitter Inc disappointed investors yet again with first-quarter results that showed stagnant revenue growth as the microblogging service struggles to grab new users amid efforts to improve its complicated interface with several new features.",
        "date": "04262016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "UPDATE 3-Twitter stock plunges after revenue misses estimates "
    },
    {
        "content": "* Oil up at highs on weak dollar; EIA survey trims gains   (New throughout  changes dateline  previous LONDON)",
        "date": "04272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "GLOBAL MARKETS-Weak results drag on tech stocks; dollar drops before Fed "
    },
    {
        "content": "* Apple  Twitter results weigh on tech stocks in Europe and Asia",
        "date": "04272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "GLOBAL MARKETS-Apple's results hit tech shares  dollar dips before Fed "
    },
    {
        "content": "Apple Inc  on Tuesday posted its first-ever decline in iPhone sales and its first revenue drop in 13 years as the company credited with inventing the smartphone struggles with an increasingly saturated market. | Video ",
        "date": "04272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Apple's nine-year iPhone juggernaut stops with first sales decline "
    },
    {
        "content": "Twitter Inc  disappointed investors yet again with first-quarter results that showed stagnant revenue growth as the microblogging service struggles to grab new users amid efforts to improve its complicated interface with several new features.",
        "date": "04272016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter stock plunges after revenue misses estimates "
    },
    {
        "content": "* Kathy Chen joins Twitter as MD for China- Twitter CEO Jack Dorsey tweet  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "04152016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "BRIEF-Kathy Chen joins Twitter as MD for China - Twitter CEO Jack Dorsey tweet "
    },
    {
        "content": "The National Football League has chosen Twitter as its exclusive global partner for streaming its Thursday night games during the 2016 regular season  the parties said on Tuesday  a deal that could help the social media site expand its user base. | Video ",
        "date": "04052016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter to stream Thursday night NFL games in 2016 season "
    },
    {
        "content": "April 5 The National Football League has chosen Twitter as its exclusive global partner for streaming its Thursday night games during the 2016 regular season  the parties said on Tuesday  a deal that could help the social media site expand its user base.",
        "date": "04052016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 7-Twitter to stream Thursday night NFL games in 2016 season "
    },
    {
        "content": "LOS ANGELES  March 25 Microsoft is \"deeply sorry\" for the racist and sexist Twitter messages generated by the so-called chatbot it launched this week  a company official wrote on Friday  after the artificial intelligence program went on an embarrassing tirade.",
        "date": "03262016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Microsoft apologizes for offensive tirade by its 'chatbot' "
    },
    {
        "content": "Twitter Inc is testing a new feature called 'Stickers' to add images to photos before tweeting them  tech news site Re/code reported on Tuesday.",
        "date": "03232016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter testing new 'Stickers' feature: report "
    },
    {
        "content": "March 22 Twitter Inc is testing a new feature called 'Stickers' to add images to photos before tweeting them  tech news site Re/code reported on Tuesday.",
        "date": "03232016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter testing new 'Stickers' feature - report "
    },
    {
        "content": "SAN FRANCISCO Alphabet Inc's  Google  Facebook Inc   Microsoft Corp  and Twitter Inc  will all file or sign on to amicus briefs in support of Apple Inc's  fight against a magistrate's order  which requires it to help the U.S. Federal Bureau of Investigation break into a San Bernardino shooter's iPhone.",
        "date": "02252016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Google  Facebook  others plan briefs supporting Apple in iPhone case: sources "
    },
    {
        "content": "SAN FRANCISCO  Feb 25 Alphabet Inc's  Google  Facebook Inc  Microsoft Corp and Twitter Inc will all file or sign on to amicus briefs in support of Apple Inc's fight against a magistrate's order  which requires it to help the U.S. Federal Bureau of Investigation break into a San Bernardino shooter's iPhone.",
        "date": "02252016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Google  Facebook  others plan briefs supporting Apple in iPhone case-sources "
    },
    {
        "content": "Feb 11 Shares of social media website Twitter Inc hit an all-time low on Thursday after the company said on Wednesday evening that user growth stalled for the first time since the company went public.",
        "date": "02112016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter shares slump to all-time low as user growth stalls "
    },
    {
        "content": "Feb 11 Activision Blizzard Inc's  revenue and profit for the holiday quarter missed market estimates  as strong sales of its latest \"Call of Duty\" videogame failed to offset lackluster demand for role-playing title \"Skylanders: SuperChargers\".",
        "date": "02112016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Activision's revenue miss overshadows \"Call of Duty\" success "
    },
    {
        "content": "Twitter Inc  reported its first quarter with no growth in users since it went public  stoking fresh concerns on how long it will take for the company to reverse the trend. | Video ",
        "date": "02112016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter disappoints investors as user growth hits wall "
    },
    {
        "content": "Feb 10 Twitter Inc reported its first quarter with no growth in users since it went public  stoking fresh concerns on how long it will take for the company to reverse the trend.",
        "date": "02112016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "REFILE-UPDATE 3-Twitter disappoints investors as user growth hits wall "
    },
    {
        "content": " (This version of the story corrects throughout to show timeline changes do not affect paid ads) | Video ",
        "date": "02112016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter to change homepage to customise tweet displays to individuals "
    },
    {
        "content": "Twitter Inc made a dramatic product change on Wednesday  saying it will recast the way it displays tweets on its homepage by customizing them to individual users  instead of uniformly displaying tweets in reverse chronological order. | Video ",
        "date": "02112016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter to change homepage to customize tweet displays to individuals "
    },
    {
        "content": "Feb 10 Twitter Inc made a dramatic product change on Wednesday  saying it will recast the way it displays tweets on its homepage by customizing them to individual users  instead of uniformly displaying tweets in reverse chronological order.",
        "date": "02102016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "CORRECTED-Twitter to change homepage to customize tweet displays to individuals "
    },
    {
        "content": "NEW YORK Feb 6 The hashtag #RIPTwitter became the top trending U.S. item on Twitter on Saturday  after a report from BuzzFeed said the company is planning to change how it displays users' tweets.",
        "date": "02062016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter users decry reported plan to prioritize tweets "
    },
    {
        "content": "WASHINGTON Twitter Inc  has shut down more than 125 000 terrorism-related accounts since the middle of 2015  most of them linked to the Islamic State group  the company said in a blog post on Friday.",
        "date": "02052016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter suspends over 125 000 accounts for 'promoting terrorist acts' "
    },
    {
        "content": "Feb 5 Twitter Inc said it had suspended over 125 000 accounts since mid-2015 for \"threatening or promoting terrorist acts  primarily related to ISIS.\"",
        "date": "02052016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "REFILE-Twitter suspends over 125 000 accounts for 'promoting terrorist acts' "
    },
    {
        "content": "SAN FRANCISCo Four senior Twitter executives are leaving the media company  CEO Jack Dorsey tweeted late Sunday night  the biggest leadership changes since Dorsey returned as chief executive as he struggles to revive the company's growth. | Video ",
        "date": "01252016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Top Twitter executives to leave company  CEO Dorsey tweets "
    },
    {
        "content": "Twitter Inc  shares closed down almost 5 percent on Monday as a management exodus sparked investor concerns over unsettled leadership and stalled growth at the online social media company. | Video ",
        "date": "01252016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter management departures unnerve investors  stock falls "
    },
    {
        "content": "Jan 24 Social media power Twitter Inc  plans to announce the departure of some major executives on Monday  technology news website Re/code reported on Sunday  citing sources.",
        "date": "01242016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Executive upheavel expected at Twitter  announcements on Monday -Recode "
    },
    {
        "content": "Rupert Murdoch's News Corp said rumors about the company's interest in buying microblogging site Twitter Inc or building a stake in it were untrue.",
        "date": "01202016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "News Corp denies rumors of Twitter bid "
    },
    {
        "content": "FRANKFURT Twitter Inc  said on Tuesday it had reversed a glitchy software update and resolved outages widely reported across Europe  the Middle East  Africa and North America that affected users of the social network on computers and phones.",
        "date": "01192016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter says widespread outages resolved; blames glitchy software update "
    },
    {
        "content": "SAN FRANCISCO  Jan 24 Four senior Twitter executives are leaving the media company  CEO Jack Dorsey tweeted late Sunday night  the biggest leadership changes since Dorsey returned as chief executive as he struggles to revive the company's growth.",
        "date": "01252016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 5-Top Twitter executives to leave company  CEO Dorsey tweets "
    },
    {
        "content": "Jan 20 Rupert Murdoch's News Corp said rumors about the company's interest in buying microblogging site Twitter Inc or building a stake in it were untrue.",
        "date": "01202016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 2-News Corp denies rumors of Twitter bid "
    },
    {
        "content": "FRANKFURT  Jan 19 Twitter Inc said on Tuesday it had reversed a glitchy software update and resolved outages widely reported across Europe  the Middle East  Africa and North America that affected users of the social network on computers and phones.",
        "date": "01192016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 6-Twitter says widespread outages resolved; blames glitchy software update "
    },
    {
        "content": "Jan 19 Former Twitter Inc chief executive  Dick Costolo  said on Tuesday he is starting a new company with Bryan Oki  co founder & chief executive at wellness consulting firm Fitify Inc.",
        "date": "01192016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Ex-Twitter CEO Dick Costolo to start new company "
    },
    {
        "content": "FRANKFURT  Jan 19 Twitter said on Tuesday its social network was suffering outages in some parts of the world and it was working to resolve the issues  which appear to be concentrated in Europe  according to external monitoring sources.",
        "date": "01192016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter users in northern Europe hit by site outage "
    },
    {
        "content": "Jan 12 The news of Rupert Murdoch's engagement to Jerry Hall sent social media into a sometimes snarky whirl on Tuesday  as Twitter users mocked the former supermodel for her plans to marry the elderly media mogul.",
        "date": "01122016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Murdoch  Hall engagement sparks mockery on social media "
    },
    {
        "content": "ISTANBUL Micro-blogging site Twitter filed a lawsuit in an Ankara court on Thursday  seeking to annul a fine by the Turkish authorities for not removing content Turkey says is \"terrorist propaganda\"  a source familiar with the case told Reuters.",
        "date": "01072016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter files lawsuit against Turkish fine over 'terrorist propaganda': source "
    },
    {
        "content": "NEW YORK  Jan 6 The global Twitterati set their sights on Twitter on Wednesday  widely decrying a reported plan by the microblogging site to blow out its length limit to as much as 10 000 characters.",
        "date": "01062016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter 10k? Twitterati say save it for 'War and Peace' "
    },
    {
        "content": "Twitter Inc  is building a new feature that will allow users to post tweets as long as 10 000 characters  well beyond its current 140-character limit  technology news website Re/code reported on Tuesday.",
        "date": "01052016",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter considering 10 000-character limit for tweets - report "
    },
    {
        "content": "* General Motors to invest $500 mln in ride-sharing service Lyft",
        "date": "01042016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 2-GM invests $500 mln in Lyft  sets out self-driving car partnership "
    },
    {
        "content": "ISTANBUL  Jan 7 Micro-blogging site Twitter  filed a lawsuit in an Ankara court on Thursday  seeking to annul a fine by the Turkish authorities for not removing content Turkey says is \"terrorist propaganda\"  a source familiar with the matter told Reuters.",
        "date": "01072016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter files lawsuit against Turkish fine over \"terrorist propaganda\" - source "
    },
    {
        "content": "Twitter Inc is building a new feature that will allow users to post tweets as long as 10 000 characters  well beyond its current 140-character limit  technology news website Re/code reported on Tuesday.",
        "date": "01052016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter considering 10 000-character limit for tweets -report "
    },
    {
        "content": "Jan 5 Twitter Inc is building a new feature that will allow users to post tweets as long as 10 000 characters  well beyond its current 140-character limit  technology news website Re/code reported on Tuesday.",
        "date": "01052016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 3-Twitter considering 10 000-character limit for tweets -report "
    },
    {
        "content": "* General Motors to invest $500 mln in ride-sharing service Lyft",
        "date": "01042016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "GM  Lyft announce $500 mln investment by automaker and strategic alliance "
    },
    {
        "content": "Jan 5 Twitter Inc is building a new feature that will allow users to post tweets as long as 10 000 characters  Re/code reported on Tuesday.",
        "date": "01052016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "CORRECTED-UPDATE 1-Twitter considering 10 000-character limit for tweets - Re/code "
    },
    {
        "content": "SAN FRANCISCO General Motors Inc  said on Monday it will invest $500 million in Lyft Inc and laid out plans to develop an on-demand network of self-driving cars with the ride-sharing service. | Video ",
        "date": "01052016",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "GM invests $500 million in Lyft  sets out self-driving car partnership "
    },
    {
        "content": "Twitter Inc said it was testing a feature to show advertisements to people who read tweets without logging in  as it tries to make good on its long-time ambition to monetize non-active users.",
        "date": "12102015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter looks to make money from ads aimed at logged-out users "
    },
    {
        "content": "Dec 8 Twitter Inc confirmed on Tuesday it is testing a timeline format for its tweets  calling it an experiment.",
        "date": "12082015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter experiments reordering tweets by relevance "
    },
    {
        "content": "* Shares rise as much as 7.8 pct   (Adds background  updates share movement)",
        "date": "12102015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 2-Twitter looks to make money from ads aimed at logged-out users "
    },
    {
        "content": "Dec 10 Twitter Inc said it was testing a feature to show advertising to people who checked Twitter without logging in  to cash in on an additional half a billion people each month.",
        "date": "12102015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter targets ads at logged-out users "
    },
    {
        "content": "Nov 19 Shares of Square Inc  the mobile payments company co-founded and still run by Twitter Inc  Chief Executive Jack Dorsey  opened at $11.20  above offer price of $9.",
        "date": "11192015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Mobile payments company Square rises in market debut "
    },
    {
        "content": "NEW YORK  Nov 23 (Thomson Reuters Foundation) - Social network giant Twitter has banned onsite blood drives in its offices worldwide where regulations do not permit blood donations from gay or bisexual men  a move that LGBT-rights advocates say is a first for a public technology company.",
        "date": "11242015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter bans blood drives in offices worldwide until gays can donate "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc gave a disappointing revenue forecast and reported slower user growth than expected  pushing shares of the microblogging company down about 13 percent. | Video ",
        "date": "10272015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter shares fall on revenue forecast  anemic user growth "
    },
    {
        "content": "SAN FRANCISCO  Oct 27 Twitter Inc gave a disappointing revenue forecast and reported slower user growth than expected  pushing shares of the microblogging company down about 13 percent.",
        "date": "10272015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 4-Twitter shares fall on revenue forecast  anemic user growth "
    },
    {
        "content": "SAN FRANCISCO Former Microsoft Corp  Chief Executive Steve Ballmer has taken a 4 percent stake in Twitter Inc   according to his spokesman  making him the third-biggest individual shareholder in the social media company.",
        "date": "10162015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Steve Ballmer takes 4 percent stake in Twitter  owns more than CEO "
    },
    {
        "content": "BENGALURU/SAN FRANCISCO Twitter Inc  lured Google Inc executive Omid Kordestani to become the social media company's executive chairman  the latest step in the company's turnaround efforts under Jack Dorsey  who last week was named permanent CEO.",
        "date": "10142015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter poaches Google executive Kordestani for chairman post "
    },
    {
        "content": "SAN FRANCISCO Last year  many tech IPOs enjoyed soaring valuations in their Wall Street debut  raining cash on the companies and their investors and boosting concerns about another Silicon Valley bubble. | Video ",
        "date": "10162015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Exclusive: Silicon Valley IPO market boom winding down "
    },
    {
        "content": "* Twitter shares gain about 1 pct   (Updates share price  adds details on Kordestani's role)",
        "date": "10142015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 5-Twitter poaches Google executive Kordestani for chairman post "
    },
    {
        "content": "Twitter Inc  will lay off up to 336 employees  or about 8 percent of its workforce  as co-founder Jack Dorsey readies to revive growth in the microblogging service provider's user base in his second stint as chief executive.",
        "date": "10132015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter announces layoffs as CEO Dorsey looks to revive growth "
    },
    {
        "content": "Oct 14 Twitter Inc's newly appointed Chief Executive Officer Jack Dorsey said in a tweet that the company appointed Google's Chief Business Officer Omid Kordestani as executive chairman.",
        "date": "10142015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter appoints Omid Kordestani as executive chairman "
    },
    {
        "content": "* Indexes down: Dow 0.17 pct  S&P 0.35 pct  Nasdaq 0.33 pct   (Updates prices)",
        "date": "10132015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St slips as China concerns weigh "
    },
    {
        "content": "* Shares rise as much as 6.7 pct   (Adds analyst comment  links to graphics; updates shares)",
        "date": "10132015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 4-Twitter announces layoffs as CEO Dorsey looks to revive growth "
    },
    {
        "content": "DUBAI Saudi Arabian billionaire Prince Alwaleed bin Talal and his investment firm Kingdom Holding now together own more than 5 percent of Twitter Inc  the prince's office said on Wednesday.",
        "date": "10072015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Saudi Prince Alwaleed's Kingdom Holding raises Twitter stake "
    },
    {
        "content": "* Indexes up: Dow 0.13 pct  S&P 0.14 pct  Nasdaq 0.27 pct   (Changes comment  updates prices)",
        "date": "10132015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St recovers but China concerns weigh "
    },
    {
        "content": "Twitter Inc suspended two high-profile accounts that posts highlights while games are on  after major U.S. sports leagues protested  the New York Times reported on Tuesday.",
        "date": "10132015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter suspends two sports accounts after video sharing complaints: NYT "
    },
    {
        "content": "Oct 9 Twitter Inc is planning company-wide layoffs next week  technology news website Re/code reported on Friday  citing sources.",
        "date": "10092015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter plans layoffs next week - Re/code "
    },
    {
        "content": "DUBAI  Oct 7 Saudi Arabian billionaire Prince Alwaleed bin Talal and his investment firm Kingdom Holding  now together own more than 5 percent of Twitter Inc   the prince's office said on Wednesday.",
        "date": "10072015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Saudi Prince Alwaleed's Kingdom Holding raises Twitter stake "
    },
    {
        "content": "DUBAI  Oct 7 Saudi Arabia's Kingdom Holding  has paid $50 million to double its stake in microblogging site Twitter Inc  the Riyadh-based company said on Wednesday.",
        "date": "10072015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Saudi's Kingdom Holding pays $50 mln to raise Twitter stake to 0.72 pct "
    },
    {
        "content": "SAN FRANCISCO  Oct 6 Twitter Inc rolled out its much-anticipated \"Project Lightning\" on Tuesday  a feature that shows users the site's best tweets and content as curated by a Twitter team.",
        "date": "10062015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter rolls out feature that showcases day's best tweets "
    },
    {
        "content": "Oct 13 Twitter Inc suspended two high-profile accounts that posts highlights while games are on  after major U.S. sports leagues protested  the New York Times reported on Tuesday.",
        "date": "10132015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter suspends two sports accounts after video sharing complaints-NYT "
    },
    {
        "content": "* Indexes down: Dow 0.45 pct  S&P 0.48 pct  Nasdaq 0.57 pct   (Updates to open)",
        "date": "10132015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St slips on weak China trade data "
    },
    {
        "content": "Twitter Inc named Jack Dorsey as its permanent CEO but said it would look elsewhere for a chairman  seeking to allay concerns about its co-founder's dual role as head of the mobile payments company Square. | Video ",
        "date": "10062015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter appoints Jack Dorsey CEO  seeks new chairman "
    },
    {
        "content": "* Futures down: Dow 81 pts  S&P 9.5 pts  Nasdaq 25.5 pts   (Adds details  comment  updates prices)",
        "date": "10132015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St set to open lower on weak China trade data "
    },
    {
        "content": "Twitter  is finally waking up to the idea that some things just cannot be summed up in 140 characters.",
        "date": "09292015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter may expand 140-character limit with new product "
    },
    {
        "content": "Sept 28 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "09282015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "PRESS DIGEST- New York Times business news - Sept 28 "
    },
    {
        "content": "SAN FRANCISCO  Sept 30 If Jack Dorsey becomes permanent CEO of both Twitter Inc and mobile payments company Square  he could struggle with conflicts of interest in the business that is key to both companies' futures: e-commerce.",
        "date": "10012015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "As Twitter  Square interests converge  CEO Dorsey risks conflicts "
    },
    {
        "content": "Twitter Inc named Jack Dorsey as its permanent CEO but said it would look elsewhere for a chairman  seeking to allay concerns about its co-founder's dual role as head of the mobile payments company Square.",
        "date": "10052015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter appoints Jack Dorsey CEO  seeks new chairman "
    },
    {
        "content": "Sept 29 Micro-blogging website operator Twitter Inc is working on a product that will allow users to share content longer than 140 characters  technology website Re/code reported on Tuesday.",
        "date": "09292015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter looking beyond 140 characters with new product - Re/code "
    },
    {
        "content": "* Shares rise as much as 6 percent   (Adds details  investor and analyst comment  updates share price)",
        "date": "10052015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 4-Twitter appoints Jack Dorsey CEO  seeks new chairman "
    },
    {
        "content": "SAN FRANCISCO Payments processing company Stripe Inc launched a new tool on Monday that will connect retailers and brands to sell on platforms like Twitter Inc and tap an increasing number of consumers shopping on mobile apps.",
        "date": "09142015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter partners with Stripe to expand 'buy buttons' "
    },
    {
        "content": "SAN FRANCISCO  Sept 14 Payments processing company Stripe Inc launched a new tool on Monday that will connect retailers and brands to sell on platforms like Twitter Inc and tap an increasing number of consumers shopping on mobile apps.",
        "date": "09142015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter partners with Stripe to expand \"buy buttons\" "
    },
    {
        "content": "CHICAGO  Sept 15 Twitter Inc's plans to let users buy goods and make political donations through tweets offer a path to reach new customers and build profit at a time the company has struggled to increase its audience.",
        "date": "09162015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter tries to spur growth with shopping and political donations "
    },
    {
        "content": "SAN FRANCISCO  Sept 4 Ride services Lyft and Uber have poached dozens of key Twitter Inc employees over the past year  including top engineering managers  to help personalize their apps.",
        "date": "09042015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Lyft  Uber poach key Twitter engineers  managers amid turmoil "
    },
    {
        "content": "SAN FRANCISCO  Aug 24 The security researcher who hacked into a moving Jeep earlier this year has resigned as an engineer at Twitter Inc after three years on the job  a person familiar with the matter said.",
        "date": "08242015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Security researcher who hacked moving Jeep leaves Twitter "
    },
    {
        "content": "SINGAPORE Twitter Inc said on Tuesday it plans to accelerate its push for content partnerships in Asia Pacific and the Middle East.",
        "date": "08182015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter to accelerate push for content partnerships in Asia "
    },
    {
        "content": "Aug 7 Twitter Inc's board is weighing a shakeup that could involve the exit of former Chief Executive Dick Costolo  Bloomberg reported  citing people familiar with the matter.",
        "date": "08082015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter considers board shakeup  may include exit of Costolo -Bloomberg "
    },
    {
        "content": "Aug 10 Twitter Inc interim Chief Executive Jack Dorsey joined other insiders in buying more shares in the company in a show of confidence in the stock  which traded at a record-low last week.",
        "date": "08102015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter interim CEO Dorsey buys more shares in show of faith "
    },
    {
        "content": "* Indexes up: Dow 1.3 pct  S&P 1.1 pct  Nasdaq 0.9 pct   (Adds details  changes comment  updates prices)",
        "date": "08102015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St rises on Berkshire deal  China stimulus hopes "
    },
    {
        "content": "The National Football League said it signed a multi-year partnership with microblogging site Twitter Inc  to deliver video and other content to NFL fans on a daily basis.",
        "date": "08102015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter signs multi-year deal with NFL "
    },
    {
        "content": "* Indexes up: Dow 0.71 pct  S&P 0.71 pct  Nasdaq 0.42 pct   (Updates with reaction to Fed statement)",
        "date": "07292015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "US STOCKS-U.S. stocks higher after Fed notes improving economy "
    },
    {
        "content": "July 28 Twitter Inc's shares fell more than 11 percent in extended trade on Tuesday after the microblogging company said its number of monthly average users grew at the slowest pace since it went public in 2013.",
        "date": "07282015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "UPDATE 3-Twitter shares fall as growth of monthly users slows "
    },
    {
        "content": "* Futures up: Dow 36 pts  S&P 2 pts  Nasdaq 7 pts   (Adds details  comment  updates prices)",
        "date": "07292015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St set to open little changed ahead of Fed statement "
    },
    {
        "content": "Twitter Inc's  shares fell more than 11 percent in extended trade on Tuesday after the microblogging company said its number of monthly average users grew at the slowest pace since it went public in 2013.",
        "date": "07292015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter shares fall as growth of monthly users slows "
    },
    {
        "content": "* Indexes close up: Dow 1.09 pct  S&P 1.24 pct  Nasdaq 0.98 pct   (Updates to close)",
        "date": "07282015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall Street ends sharply higher as China jitters ebb "
    },
    {
        "content": "NEW YORK  July 28 The big selloffs in shares of social media companies last quarter following weak results seem to be brushed under the carpet this earnings season as investors focus instead on the success of Facebook Inc.",
        "date": "07282015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Facebook's ascent has investors betting on more gains "
    },
    {
        "content": "NEW YORK  July 28 Investors in social media shares have zeroed-in on Facebook Inc  piling into stock options to add bullish bets on the company in the days ahead of its Wednesday earnings.",
        "date": "07282015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Facebook's ascent has investors betting on more gains "
    },
    {
        "content": "July 22 Herbalife Ltd filed a petition seeking information from micro-blogging company Twitter Inc  to identify an anonymous user who posted defamatory tweets against the weight-loss and nutritional products maker.",
        "date": "07222015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "RPT-Herbalife files petition to seek user information from Twitter "
    },
    {
        "content": "Herbalife Ltd  filed a petition seeking information from micro-blogging company Twitter Inc  to identify an anonymous user who posted defamatory tweets against the weight-loss and nutritional products maker.",
        "date": "07222015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Herbalife files petition to seek user information from Twitter "
    },
    {
        "content": "A report claiming that Twitter Inc  received an offer to be acquired for $31 billion attributed to Bloomberg LP is fake  Twitter and a spokesman for the news and financial data provider said on Tuesday.",
        "date": "07142015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter confirms purported Bloomberg story is false "
    },
    {
        "content": "July 14 A report claiming that Twitter Inc  received an offer to be acquired for $31 billion attributed to Bloomberg LP is fake  Twitter and a spokesman for the news and financial data provider said on Tuesday.",
        "date": "07142015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 4-Twitter confirms purported Bloomberg story is false "
    },
    {
        "content": "* JPMorgan profit beats estimates; Wells Fargo revenue misses",
        "date": "07142015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St notches fourth straight advance as energy gains "
    },
    {
        "content": "* JPMorgan profit beats estimates; Wells Fargo revenue misses",
        "date": "07142015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St higher as healthcare  energy stocks rally "
    },
    {
        "content": "* JPMorgan profit beats estimates; Wells Fargo revenue misses",
        "date": "07142015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St rises as oil prices recovery boosts energy stocks "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc's  next chief executive officer faces a crucial challenge as the company seeks to appease Wall Street after this week's management shakeup - helping disaffected advertisers connect with users.",
        "date": "06152015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "With CEO shakeup  Twitter under pressure to please advertisers "
    },
    {
        "content": "SAN FRANCISCO  June 11 Twitter Inc  Chief Executive Officer Dick Costolo abruptly announced he was stepping down on Thursday amid increasing scrutiny of the company's slow user growth and inability to attract advertisers at the same rate as its competitors.",
        "date": "06112015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "REFILE-UPDATE 4-Twitter's Dick Costolo to step down as CEO in yet another shake-up "
    },
    {
        "content": "SAN FRANCISCO  June 15 Twitter Inc's  next chief executive officer faces a crucial challenge as the company seeks to appease Wall Street after this week's management shakeup - helping disaffected advertisers connect with users.",
        "date": "06152015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "CORRECTED--With CEO shakeup  Twitter under pressure to please advertisers "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc  Chief Executive Officer Dick Costolo abruptly announced he was stepping down on Thursday amid increasing scrutiny of the company's slow user growth and inability to attract advertisers at the same rate as its competitors. | Video ",
        "date": "06112015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter's Dick Costolo to step down as CEO in yet another shake-up "
    },
    {
        "content": "SAN FRANCISCO  June 11 Twitter's Costolo says started discussion of succession with board at end of last year Twitter's Dorsey says board not in hurry to find new CEO  will take time it needs Twitter's Dorsey says focus is on maximizing value as independent company Twitter's Dorsey says does not foresee changes in strategy or direction  believes in course company is on Costolo says twitter is stable  robust  with clear path forward Twitter interim CEO dorsey says objectives and prior",
        "date": "06112015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Costolo's replacement must \"use and love\" Twitter "
    },
    {
        "content": "* Indexes down: Dow 0.8 pct  S&P 0.7 pct  Nasdaq 0.6 pct   (Updates to close)",
        "date": "06122015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St falls as Greece crisis unresolved; energy shares dip "
    },
    {
        "content": "RIYADH Saudi Arabia's Prince Alwaleed bin Talal  one of Twitter's  earlier investors  told Reuters he believed Jack Dorsey would bring continuity to the social messaging firm and he would back him if he wished to become chief executive permanently.",
        "date": "06152015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Alwaleed backs Twitter interim CEO Dorsey  says brings continuity "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.2 pct  Nasdaq 0.1 pct   (Updates to close)",
        "date": "06112015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St climbs after retail sales data; healthcare up "
    },
    {
        "content": "Some things can't be summed up in 140 characters. | Video ",
        "date": "06122015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter seeks new CEO  and more users  as Costolo exits "
    },
    {
        "content": "* Indexes down: Dow 0.8 pct  S&P 0.7 pct  Nasdaq 0.5 pct   (Updates to early afternoon)",
        "date": "06122015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St falls as Greece crisis deepens; Fed meet eyed "
    },
    {
        "content": "June 11 Twitter Inc said it would add more than 100 jobs in its Singapore office over the next few years as it looks to attract more users and advertisers in the Asia-Pacific region.",
        "date": "06112015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter to double workforce in Singapore "
    },
    {
        "content": "* Futures down: Dow 60 pts  S&P 7.5 pts  Nasdaq 23 pts   (Adds details  comment  updates prices)",
        "date": "06122015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St set to open lower as Greek talks falter "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc Chief Executive Officer Dick Costolo abruptly announced he was stepping down on Thursday amid increasing scrutiny of the company's slow user growth and inability to attract advertisers at the same rate as its competitors. | Video ",
        "date": "06122015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter's Dick Costolo to step down as CEO in yet another shake-up "
    },
    {
        "content": "San Francisco  June 11 As Twitter Chief Executive Officer Dick Costolo's departure was cheered by stockholders  his fans struck a different note  flooding the micro-blogging site he has steered for nearly five years with messages of gratitude and support.",
        "date": "06122015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter fans pay tribute to departing CEO as Wall Street cheers his exit "
    },
    {
        "content": "SAN FRANCISCO  June 11 Twitter Inc  Chief Executive Officer Dick Costolo abruptly announced he was stepping down on Thursday amid increasing scrutiny of the company's slow user growth and inability to attract advertisers at the same rate as its competitors.",
        "date": "06122015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 5-Twitter's Dick Costolo to step down as CEO in yet another shake-up "
    },
    {
        "content": "SAN FRANCISCO  May 21 In Goldman Sachs Group Inc's latest move to bolster its street cred as a cool  tech-savvy bank  the firm held its annual shareholder meeting in its San Francisco headquarters on Thursday.",
        "date": "05212015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "CORRECTED-UPDATE 1-Goldman Sachs asks shareholders to 'like' tech push in San Francisco "
    },
    {
        "content": "SAN FRANCISCO  May 21 In Goldman Sachs Group Inc's latest move to bolster its street cred as a cool  tech-savvy bank  it is holding its annual shareholder meeting in San Francisco on Thursday.",
        "date": "05212015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "CORRECTED-RPT-Goldman Sachs asks shareholders to 'like' tech push in San Francisco "
    },
    {
        "content": "SAN FRANCISCO  May 21 In Goldman Sachs Group Inc's latest move to bolster its street cred as a cool  tech-savvy bank  it is holding its annual shareholder meeting in San Francisco on Thursday.",
        "date": "05212015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "CORRECTED-Goldman Sachs asks shareholders to 'like' tech push in San Francisco "
    },
    {
        "content": "Micro-blogging website operator Twitter Inc  reported quarterly revenue below Wall Street expectations  causing shares to drop sharply in the last hour of trading.",
        "date": "04282015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter shares slammed after disappointing results "
    },
    {
        "content": "NEW YORK  April 29 Twitter Inc's  efforts to reassure disaffected ad buyers may hinge on the success of two deals that were announced along with its bleak forecast on Tuesday  advertisers and analysts said.",
        "date": "04292015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter pins ad revenue hopes on new partnership  acquisition "
    },
    {
        "content": "NEW YORK Hillary Clinton's campaign rollout on social media set Twitter abuzz as she likely hoped  but part of the discussion quickly veered away from the candidate herself to her new logo  and it got a hearty \"thumbs down.\"",
        "date": "04122015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter turns Clinton's 'H' logo into target for ridicule "
    },
    {
        "content": "NEW YORK Hillary Clinton's campaign rollout on social media set Twitter abuzz as she likely hoped  but part of the discussion quickly veered away from the candidate herself to her new logo  and it got a hearty \"thumbs down.\"",
        "date": "04132015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Twitter turns Clinton's 'H' logo into target for ridicule "
    },
    {
        "content": "NEW YORK  April 12 Hillary Clinton's campaign rollout on social media set Twitter abuzz as she likely hoped  but part of the discussion quickly veered away from the candidate herself to her new logo  and it got a hearty \"thumbs down.\"",
        "date": "04122015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "UPDATE 1-Twitter turns Clinton's \"H\" logo into target for ridicule "
    },
    {
        "content": "NEW YORK  April 12 Hillary Clinton's campaign rollout on social media set Twitter abuzz as she likely hoped  but part of the discussion quickly veered away from the candidate herself to her new logo  and it got a hearty \"thumbs down.\"",
        "date": "04122015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter turns Clinton's \"H\" logo into target for ridicule "
    },
    {
        "content": "* Previous social media block drew widespread criticism   (Adds court ruling on Google)",
        "date": "04062015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "UPDATE 6-Twitter complies with Turkey's request  ban lifted "
    },
    {
        "content": "ANKARA Twitter has complied with Turkey's request to remove images of an Istanbul prosecutor held at gunpoint by far-left militants and the block of access to is about to be lifted  a Turkish official told Reuters on Monday.",
        "date": "04062015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter complied with Turkey's request  ban to be lifted shortly: Turkish official "
    },
    {
        "content": "ANKARA  April 6 Twitter has complied with Turkey's request to remove images of an Istanbul prosecutor held at gunpoint by far-left militants and the block of access to is about to be lifted  a Turkish official told Reuters on Monday.",
        "date": "04062015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter complied with Turkey's request  ban to be lifted shortly - Turkish official "
    },
    {
        "content": "BEIJING  March 10 Twitter Inc has opened a Hong Kong office  its first in the Greater China region  the company whose microblogging services are blocked on the mainland said on Tuesday.",
        "date": "03102015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter opens Hong Kong office  gains China foothold "
    },
    {
        "content": "MOSCOW A Russian agency that regulates media said on Tuesday the micro-blogging site Twitter had refused 108 requests for account information and was \"consistently not satisfying the requirements of the Russian law\"  the state-run news agency TASS reported.",
        "date": "02102015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "Russian watchdog says Twitter ignoring its requests: TASS "
    },
    {
        "content": "MOSCOW  Feb 10 A Russian agency that regulates media said on Tuesday the micro-blogging site Twitter had refused 108 requests for account information and was \"consistently not satisfying the requirements of the Russian law\"  the state-run news agency TASS reported.",
        "date": "02102015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Russian watchdog says Twitter ignoring its requests - TASS "
    },
    {
        "content": "SAN FRANCISCO  Feb 5 Twitter Inc said on Thursday the social media company is signing up users as quickly as most of last year after a fourth-quarter slowdown  boosting its shares 11 percent.",
        "date": "02052015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "UPDATE 2-Twitter tops Wall Street revenue target  user growth slows "
    },
    {
        "content": "* Indexes up: Dow 1.2 pct  S&P 1 pct  Nasdaq 1 pct   (Updates close with latest volume  LinkedIn  Twitter up after the bell)",
        "date": "02052015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St climbs with energy rebound  Pfizer deal "
    },
    {
        "content": "* Indexes: Dow down 0.3 pct  S&P down 0.3 pct  Nasdaq down 0.4 pct   (Updates to close)",
        "date": "02062015",
        "name": "Twitter Inc",
        "news_type": "topStory",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St ends down on interest rate  Greece jitters "
    },
    {
        "content": "* Indexes: Dow down 0.1 pct  S&P up 0.03 pct  Nasdaq down 0.1 pct   (Updates to afternoon)",
        "date": "02062015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "US STOCKS-Wall St little changed; utilities fall as debt yields rise "
    },
    {
        "content": "SAN FRANCISCO  Feb 5 Twitter Inc's  forecast of re-accelerating user growth helped lift its stock on Thursday  but the goodwill will only temporarily take the heat off embattled Chief Executive Dick Costolo  analysts said.",
        "date": "02062015",
        "name": "Twitter Inc",
        "news_type": "normal",
        "symbol": "TWTR",
        "title": "Twitter CEO wins breathing room from Wall Street critics "
    }
]