[
    {
        "content": "MEXICO CITY  Sept 28 ArcelorMittal  the world's largest steelmaker  will invest $1 billion in Mexico over the next three years  in part to boost its North American trade operations  the company said on Thursday.",
        "date": "09292017",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "UPDATE 2-ArcelorMittal plans $1 bln Mexico investment by 2020 -chairman "
    },
    {
        "content": "* Ternium further develops its industrial system with plans to build new facilities in Mexico and Colombia",
        "date": "09282017",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "BRIEF-Ternium further develops its industrial system with plans to build new facilities in Mexico and Colombia "
    },
    {
        "content": "SAO PAULO  Sept 6 The board of Brazil antitrust agency Cade gave final approval on Wednesday to Ternium SA's acquisition of Thyssenkrupp AG's Brazilian steel mill CSA Cia Siderúrgica do Atlántico SA  rejecting an appeal by a Brazilian rival.",
        "date": "09062017",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "Brazil's Cade gives final okay to Ternium-CSA deal  rejects CSN appeal "
    },
    {
        "content": "SAO PAULO  Aug 2 Brazil's antitrust agency Cade has approved Ternium SA's acquisition of Thyssenkrupp AG's Brazilian steel mill CSA Cia Siderúrgica do Atlántico SA  allowing the German behemoth to end a foray in the Americas that triggered massive losses.",
        "date": "08022017",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "Ternium wins antitrust nod for ThyseenKrupp's Brazil steel unit "
    },
    {
        "content": "* Ternium announces second quarter and first half 2017 results",
        "date": "08012017",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "BRIEF-Ternium qtrly earnings per ADS $1.27 "
    },
    {
        "content": "SAO PAULO Nippon Steel & Sumitomo Metal Corp  wants to implement a system to alternate command at Brazilian steelmaker Usinas Siderúrgicas de Minas Gerais SA  with fellow controlling shareholder Ternium SA  a senior executive said on Tuesday.",
        "date": "05102017",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "Nippon Steel calls for command to alternate at Brazil's Usiminas "
    },
    {
        "content": "* Ternium sa - after a 9 pct sequential increase in steel shipments in Mexico in Q1 2017  co anticipates further growth in shipments during Q2 of year",
        "date": "04252017",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "BRIEF-Ternium Qtrly earnings per ADS $1.33 "
    },
    {
        "content": "* Investment of about USD260 million in new galvanizing and pre-painting lines facility in Pesquería  Mexico; new lines to be operational by 2020  Source text for Eikon:  Further company coverage:",
        "date": "03012017",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "BRIEF-Ternium announces investment in galvanizing  pre-painting lines in Mexico "
    },
    {
        "content": "SAO PAULO/ESSEN Thyssenkrupp AG  has struck a deal to sell money-losing Brazilian steel mill CSA Cia Siderúrgica do Atlántico SA to Ternium SA  for 1.26 billion euros ($1.3 billion)  ending a foray into the Americas that led to years of massive losses.",
        "date": "02222017",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "Thyssenkrupp ends costly Americas venture with CSA sale to Ternium "
    },
    {
        "content": "* Vale  former CSA partner  fails to receive earn-out   (Adds details on Vale earn-out clause in last two paragraphs  updates share price)",
        "date": "02222017",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "UPDATE 4-Thyssenkrupp ends costly Americas venture with CSA sale to Ternium "
    },
    {
        "content": "SAO PAULO Ternium SA has agreed to buy 100 percent of ThyssenKrupp AG's Brazilian mill CSA Cia Siderúrgica do Atlantico SA for 1.26 billion euros ($1.33 billion)  ending five years of unsuccessful efforts by the German company to exit Latin America's largest economy.",
        "date": "02222017",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "Ternium buys ThyssenKrupp's Brazil mill for $1.3 billion "
    },
    {
        "content": "SAO PAULO  Feb 21 Ternium SA has agreed to buy 100 percent of Thyssenkrupp's Brazilian mill CSA  the company said in a statement on Tuesday. Ternium will pay Thyssenkrupp 1.26 billion euros  and assume 0.3 billion euros in CSA's debt.   (Reporting by Tatiana Bautzer; Editing by Sandra Maler)",
        "date": "02222017",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "Ternium to pay 1.26 bln euros to buy Thyssenkrupp's Brazilian mill CSA "
    },
    {
        "content": "* Company reached agreement with Ternium on sale of CSA steel plant in Brazil for eur 1.5 billion.",
        "date": "02212017",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "BRIEF-Thyssenkrupp agreed with Ternium on sale of CSA steel plant for 1.5 bln euros "
    },
    {
        "content": "SAO PAULO  Jan 17 Nippon Steel & Sumitomo Metal Corp does not rule out discussing with partner Ternium SA an amendment of an existing shareholder accord giving them the possibility of exiting Brazilian steelmaker Usinas Siderúrugicas de Minas Gerais SA  a senior executive with the Japanese company said on Tuesday.   (Reporting by Alberto Alerigi Jr; Writing by Guillermo Parra-Bernal; Editing by Chizu Nomiyama)",
        "date": "01172017",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "Nippon Steel mulls discussing exit clause for Brazil's Usiminas "
    },
    {
        "content": "SAO PAULO  Jan 13 Brazilian steelmaker Usinas Siderúrgicas de Minas Gerais SA's plan to tap excess cash from a mining subsidiary that was rejected this week was found not to pose any potential financial risk for the unit  a person briefed on the matter said.",
        "date": "01132017",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "EXCLUSIVE-Brazil's Usiminas unit saw no risk from capital reduction -source "
    },
    {
        "content": "* Expects sequentially lower operating income in last quarter of year",
        "date": "11032016",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "BRIEF-Ternium posts Q3 earnings per ads of $1.17 "
    },
    {
        "content": "SAO PAULO A change of chief executive at Brazilian steelmaker Usiminas has accelerated plans for controlling shareholders Nippon Steel & Sumitomo Metal Corp and Ternium SA to break up the company  a source close to the Japanese firm said on Tuesday.",
        "date": "06012016",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "Nippon Steel looks to break up Usiminas after CEO appointment: source "
    },
    {
        "content": "May 31 Steelmaker Nippon Steel & Sumitomo Metal Corp is planning to hold talks on splitting the production assets of Brazilian steelmaker Usiminas  with fellow shareholder Ternium SA  Nikkei reported without citing sources.",
        "date": "05312016",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "Nippon Steel explores splitting Usiminas' assets with Ternium - Nikkei "
    },
    {
        "content": "SAO PAULO  May 31 A change of chief executive at Brazilian steelmaker Usiminas has accelerated plans for controlling shareholders Nippon Steel & Sumitomo Metal Corp  and Ternium SA to break up the company  a source close to the Japanese firm said on Tuesday.",
        "date": "06012016",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "UPDATE 2-Nippon Steel looks to break up Usiminas after CEO appointment-source "
    },
    {
        "content": "TOKYO  June 1 Japan's biggest steelmaker  Nippon Steel & Sumitomo Metal Corp  said on Wednesday there was no truth to reports that it was planning to break up its Brazilian affiliate Usiminas.",
        "date": "06012016",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "Nippon steel denies reports it plans to break up Usiminas "
    },
    {
        "content": "* Expects a sequentially higher operating income in q2 2016  Source text for Eikon:  Further company coverage:",
        "date": "04272016",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "BRIEF-Ternium announces Q1 earnings $0.48 per ads "
    },
    {
        "content": "BRASILIA  Feb 24 Ternium SA is not considering at this moment selling its stake in Brazilian steelmaker Usiminas  the company's chief executive officer  Daniel Novegil  said on Wednesday.",
        "date": "02252016",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "Ternium not considering selling Usiminas stake -CEO "
    },
    {
        "content": "BRASILIA  May 6 Brazil's anti-trust regulatory agency Cade voted on Wednesday to reject a claim that Luxembourg-based Ternium provided misleading information when it bought a stake in Brazilian steelmaker Usiminas  in 2012.",
        "date": "05062015",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "Brazil's anti-trust regulator rejects Ternium challenge "
    },
    {
        "content": "RIO DE JANEIRO  April 14 Common shares in Brazil's Usiminas jumped over 16 percent on Wednesday after securities industry regulator CVM demanded its two top shareholders extend a tender offer for the rest of the steelmaker's common shares.",
        "date": "04152015",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "UPDATE 3-Usiminas shares jump as Brazil decision forces tender offer "
    },
    {
        "content": "SAO PAULO  April 15 Ternium SA  which is ensnared in a battle for control of Brazil's Usiminas  plans to appeal a regulatory decision that forces it to extend a partial tender offer to other minority shareholders  Usiminas said in a securities filing on Wednesday.   (Reporting by Guillermo Parra-Bernal)",
        "date": "04152015",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "Ternium plans to appeal Brazil decision over tender offer "
    },
    {
        "content": "BRASILIA  April 14 Brazilian markets regulator CVM said on Tuesday that Ternium SA will have to make a public offer for all ordinary shares of Usiminas  after it increased its stake in the Brazilian steelmaker last year.",
        "date": "04152015",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "CORRECTED-Brazil regulator says Ternium has to make offer for Usiminas shares "
    },
    {
        "content": "RIO DE JANEIRO  April 6 Ternium SA will not challenge a decision by Brazilian securities regulator CVM that eight members  instead of seven  should be elected to the board of Brazilian steelmaker Usinas Siderurgicas de Minas Gerais SA on Monday.",
        "date": "04062015",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "Ternium says to not block Brazil regulator Usiminas board ruling "
    },
    {
        "content": "RIO DE JANEIRO  March 30 Nippon Steel & Sumitomo Metal Corp said on Monday it had reported Ternium SA  to Brazil's CVM market regulator for transferring to third parties shares in steelmaker Usiminas  which they jointly control  before a vote to elect a new chairman next week.",
        "date": "04012015",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "CORRECTED-UPDATE 2-Nippon says Ternium transferred shares before Usiminas vote "
    },
    {
        "content": "RIO DE JANEIRO  March 30 Nippon Steel & Sumitomo Metal Corp said on Monday it had reported Ternium SA  to Brazil's CVM market regulator for transferring to third parties shares in steelmaker Usiminas  which they jointly control  before a vote to elect a new chairman next week.",
        "date": "03312015",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "UPDATE 2-Nippon says Ternium transferred shares before Usiminas vote "
    },
    {
        "content": "RIO DE JANEIRO  March 30 Nippon Steel & Sumitomo Metal Corp said on Monday it had reported Ternium  to Brazil's CVM market regulator for transferring to third parties shares in steelmaker Usiminas  which they jointly control  before a vote to elect a new chairman next week.",
        "date": "03302015",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "UPDATE 1-Nippon says Ternium transferred shares before Usiminas vote "
    },
    {
        "content": "RIO DE JANEIRO  March 31 Nippon Steel & Sumitomo Metal Corp said on Tuesday it was seeking an injunction against Ternium SA in Brazil for transferring shares in steelmaker Usiminas  which they jointly control  to third parties.",
        "date": "04012015",
        "name": "Ternium SA",
        "news_type": "normal",
        "symbol": "TX",
        "title": "Nippon Steel says sought injunction against Ternium "
    },
    {
        "content": "SAO PAULO  March 19 Usinas Siderúrgicas de Minas Gerais SA  Brazil's largest listed flat steel producer  unveiled late on Wednesday a list of candidates for its board for an April 6 vote  as a rift between the company's two largest shareholders shows no signs of abating.",
        "date": "03192015",
        "name": "Ternium SA",
        "news_type": "topStory",
        "symbol": "TX",
        "title": "Usiminas unveils candidates for board amid Nippon-Ternium rift "
    }
]