[
    {
        "content": "* Textron Inc files pricing term sheet related to its offering of $350 million floating rate notes due 2020 Source text: (http://bit.ly/2zshfDk) Further company coverage:",
        "date": "11072017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron Inc files pricing term sheet related to its offering of $350 million floating rate notes due 2020 "
    },
    {
        "content": "* ‍Board of Directors declared a quarterly dividend of $0.02 per share on company's common stock​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron sets quarterly dividend of $0.02 per share "
    },
    {
        "content": "Slack demand for business jets from America's rich led to Textron Inc  paring back its full-year profit forecast on Thursday  but the Cessna and Beechcraft jets maker said it would continue to raise prices even at the cost of sales.",
        "date": "10192017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron cuts profit forecast on slack jet demand  but talks price hikes "
    },
    {
        "content": "* Focus on Arctic Cat deal hurts sales of other vehicles (Adds CEO comments and details from conference call)",
        "date": "10192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 3-Textron cuts profit forecast on slack jet demand  but talks price hikes "
    },
    {
        "content": "* Textron reports third quarter 2017 results; updates full-year EPS range and raises cash flow guidance",
        "date": "10192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "BRIEF-Textron reports third quarter 2017 results updates full-year EPS range and raises cash flow guidance "
    },
    {
        "content": "Oct 19 Textron Inc  the maker of Beechcraft and Cessna airplanes  reported a 46.8 percent fall in its profit  partly due to lower sales at its aviation business.",
        "date": "10192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Corporate-jet maker Textron's profit falls 46.8 pct "
    },
    {
        "content": "ZURICH  Oct 13 Marenco Swiss Helicopter plans to raise 150 million Swiss francs ($154 million) in fresh capital as it gears up to deliver its carbon-fibre aircraft to customers starting in 2019  a source familiar with the transaction said.",
        "date": "10132017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Swiss helicopter maker plans $154 mln capital increase -source "
    },
    {
        "content": "* Textron Inc files for offering of $300 million principal amount of its 3.375% notes due 2028‍​ - SEC filing",
        "date": "09122017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron files for offering of $300 mln of its 3.375% notes due 2028‍​ "
    },
    {
        "content": "* Textron Inc - files for potential notes offering due 2028; size not disclosed  - SEC Filing‍​ Source text: (http://bit.ly/2fd8vGo) Further company coverage:",
        "date": "09112017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron inc - files for potential notes offering due 2028 size not disclosed "
    },
    {
        "content": "* Files for potential mixed shelf offering; size not disclosed - sec filing Source text : http://bit.ly/2u2yt3W Further company coverage:",
        "date": "07272017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron files for potential mixed shelf offering; size not disclosed "
    },
    {
        "content": "* Textron Inc - declared a quarterly dividend of $0.02 per share on company's common stock Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron Inc declared $0.02 per share quarterly dividend "
    },
    {
        "content": "* Caterpillar names Chief Human Resources Officer; position will report directly to CEO and be a member of executive office",
        "date": "07172017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Caterpillar names Cheryl Johnson chief human resources officer "
    },
    {
        "content": "Textron Inc  reported a higher-than-expected quarterly profit  benefiting from its Arctic Cat acquisition and strength in the company's Bell helicopter business.",
        "date": "07192017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron's profit beats as it reaps rewards of Arctic Cat buy "
    },
    {
        "content": "* Reaffirms FY adj profit of $2.40-$2.60/shr (Adds share move  conference call details)",
        "date": "07192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 2-Textron's profit beats as it reaps rewards of Arctic Cat buy "
    },
    {
        "content": "* Continue to make progress with the integration of Arctic Cat - CEO on conf call",
        "date": "07192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "BRIEF-Textron continues to make progress with Arctic Cat integration - conf call "
    },
    {
        "content": "* Textron reports second quarter 2017 results; reaffirms 2017 financial outlook",
        "date": "07192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "BRIEF-Textron reports Q2 adjusted earnings per share $0.60 from continuing operations "
    },
    {
        "content": "July 19 Textron Inc  the maker of Beechcraft and Cessna aircraft  reported a 13.6 percent fall in quarterly profit  hurt by lower sales in its aviation business and a pre-tax charge.",
        "date": "07192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Textron profit falls 13.6 pct "
    },
    {
        "content": "* Textron announces Lisa Atherton as president & CEO of Textron Systems",
        "date": "06282017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron announces Lisa Atherton as CEO of Textron Systems "
    },
    {
        "content": "Paris Textron Inc  on Monday introduced at the Paris Air Show a next-generation drone  which offers improved combat capability over its widely-used unmanned aircraft system  Shadow.",
        "date": "06192017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron Systems introduces new drone at Paris Air Show "
    },
    {
        "content": "Paris  June 19 Textron Inc on Monday introduced at the Paris Air Show a next-generation drone  which offers improved combat capability over its widely-used unmanned aircraft system  Shadow.",
        "date": "06192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "AIRSHOW-Textron Systems introduces new drone at Paris Air Show "
    },
    {
        "content": "WASHINGTON Boeing Co's Insitu Inc and Textron Inc's AAI Corp are each being awarded $475 million U.S. defense contracts for Mid-Endurance Unmanned Aircraft Systems intelligence  surveillance  and reconnaissance services  the Pentagon said on Wednesday.",
        "date": "06072017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Boeing's Insitu  Textron's AAI each win $475 million U.S. defense contract: Pentagon "
    },
    {
        "content": "WASHINGTON  June 7 Boeing Co's Insitu Inc and Textron Inc's AAI Corp are each being awarded $475 million U.S. defense contracts for Mid-Endurance Unmanned Aircraft Systems intelligence  surveillance  and reconnaissance services  the Pentagon said on Wednesday. (Reporting by Eric Beech)",
        "date": "06072017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Boeing's Insitu  Textron's AAI each win $475 mln U.S. defense contracts -Pentagon "
    },
    {
        "content": "* Textron Inc - ‍James recently retired as 23rd secretary of United States Air Force​ Source text for Eikon: Further company coverage:",
        "date": "06012017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron elects Deborah Lee James to board of directors "
    },
    {
        "content": "* SETS QUARTERLY DIVIDEND OF $0.02 PER SHARE Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-TEXTRON SETS QUARTERLY DIVIDEND OF $0.02 PER SHARE "
    },
    {
        "content": "Textron Inc  reported lower-than-expected quarterly revenue  hurt by a decline in sales in its aviation and Bell helicopter businesses  and the company lowered full-year earnings forecast to reflect its Arctic Cat Inc acquisition.",
        "date": "04192017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron misses revenue estimates  cuts earnings forecast "
    },
    {
        "content": "* Shares drop as much as 3.2 pct (Adds share move  details from conference call)",
        "date": "04192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 3-Textron misses revenue estimates  cuts earnings forecast "
    },
    {
        "content": "* Textron reports first quarter 2017 results; updates 2017 financial outlook for Arctic Cat acquisition",
        "date": "04192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "BRIEF-Textron reports Q1 2017 revenue of $3.1 billion "
    },
    {
        "content": "April 19 Textron Inc reported a 3.4 percent decline in quarterly revenue  hurt by lower sales in its aviation and Bell helicopter businesses.",
        "date": "04192017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Textron revenue falls 3.4 percent "
    },
    {
        "content": "* Textron announces acquisition of Arctic Cat  a leading company in the recreational vehicle industry  Source text for Eikon: Further company coverage:",
        "date": "03062017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron announces acquisition of Arctic Cat "
    },
    {
        "content": "* Files for potential notes offering due 2027; size not disclosed - sec filing  Source text - http://bit.ly/2m2t9gX Further company coverage:",
        "date": "02272017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron files for potential notes offering due 2027 - SEC filing "
    },
    {
        "content": "* Aces Acquisition Corp - offering to purchase all outstanding shares  par value $0.01 per share of Arctic Cat at a price of $18.50/share - SEC filing",
        "date": "02022017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron unit offers to buy Arctic Cat at $18.50/shr - SEC filing "
    },
    {
        "content": "Textron Inc  said on Wednesday it would buy Arctic Cat Inc  to accelerate its push into the recreational vehicle market amid slowing sales of its Cessna business jets  which weighed on profit in the latest quarter.",
        "date": "01252017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron to buy ATV maker Arctic Cat as Cessna jet sales slow "
    },
    {
        "content": "* Textron shares fall 11 pct  Arctic Cat jumps 42 pct   (Adds details from conference call)",
        "date": "01252017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 3-Textron to buy ATV maker Arctic Cat as Cessna jet sales slow "
    },
    {
        "content": "* Arctic Cat -upon termination of deal under specified circumstances  co will be required to pay Textron a termination fee of $7.4 million   Source text:(http://bit.ly/2kswndd) Further company coverage:",
        "date": "01252017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "BRIEF-Arctic Cat upon termination of deal under specified circumstances to pay Textron of $7.4 mln "
    },
    {
        "content": "* Says Arctic Cat will become part of Textron's specialized vehicles business  Source text for Eikon:  Further company coverage:",
        "date": "01252017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "BRIEF-Arctic Cat says they will become part of Textron's specialized vehicles business "
    },
    {
        "content": "* Textron reports fourth quarter 2016 results; enters agreement to acquire Arctic Cat Inc.; announces 2017 financial outlook",
        "date": "01252017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "BRIEF-Textron sees FY 2017 revenue about $14.3 billion "
    },
    {
        "content": "Textron Inc  is voluntarily recalling about 1 100 Bad Boy off-road utility vehicles to install seat belts to prevent occupants being injured or killed in an accident  the U.S. Consumer Product Safety Commission said on Wednesday.",
        "date": "01112017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron recalls 1 100 off-road utility vehicles to fix seat belts "
    },
    {
        "content": "* U.S. Consumer Product Safety Commission - Textron Inc announces recall of about 1 100 Bad Boy off-road utility vehicles",
        "date": "01112017",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "BRIEF-U.S. CPSC says Textron recalls about 1 100 Bad Boy off-road utility vehicles "
    },
    {
        "content": "WASHINGTON AAI Corp  a unit of Textron Inc   was awarded a $475 million U.S. defense contract for mid-endurance unmanned aircraft systems intelligence  surveillance and reconnaissance services at multiple locations worldwide  the Pentagon said on Monday.",
        "date": "01092017",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron unit AAI Corp wins $475 million U.S. defense contract: Pentagon "
    },
    {
        "content": "ORLANDO  Fla. Cessna Aircraft Co said on Monday it is going ahead with a new large-cabin business jet  the Hemisphere  and will use an engine made by Safran of France that has suffered delays.",
        "date": "11012016",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron goes ahead with new Cessna jet  chooses engines "
    },
    {
        "content": "* Sets quarterly dividend of $0.02 per share  Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron sets quarterly dividend of $0.02 per share "
    },
    {
        "content": "Textron Inc  said on Thursday it would restructure its aviation business  which makes Cessna aircraft  citing a \"stubbornly soft\" market for business jets.",
        "date": "10202016",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron to restructure aviation business as biz jet slump persists "
    },
    {
        "content": "Oct 20 Textron Inc said on Thursday it would restructure its aviation business  which makes Cessna aircraft  citing a \"stubbornly soft\" market for business jets.",
        "date": "10202016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 3-Textron to restructure aviation business as biz jet slump persists "
    },
    {
        "content": "* Textron Inc decided to take additional restructuring actions  principally headcount reductions  in Textron aviation segment",
        "date": "10202016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "BRIEF-Textron says decided to take additional restructuring actions "
    },
    {
        "content": "Oct 20 Textron Inc  the maker of Cessna aircraft and Bell Helicopters  reported a 2.2 rise in quarterly revenue  helped by higher business jets sales.",
        "date": "10202016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Textron revenue rises 2.2 pct on higher business jets sales "
    },
    {
        "content": "* Textron Inc -On September 30  2016  entered into a senior unsecured revolving credit facility",
        "date": "10032016",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron Inc- on September 30  2016  entered into a senior unsecured revolving credit facility-SEC filing "
    },
    {
        "content": "* On August 30  board approved plan to restructure  realign businesses  implemented headcount reductions  facility consolidations - SEC filing",
        "date": "08302016",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "BRIEF-Textron says board approved plan to restructure businesses "
    },
    {
        "content": "Textron Inc   the maker of Cessna aircraft and Bell Helicopters  reported better-than-expected quarterly revenue and profit as the company delivered more business jets.",
        "date": "07222016",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron profit beats on stronger demand for business jets "
    },
    {
        "content": "July 22 Textron Inc  the maker of Cessna aircraft and Bell Helicopters  reported better-than-expected quarterly revenue and profit as the company delivered more business jets.",
        "date": "07222016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 1-Textron profit beats on stronger demand for business jets "
    },
    {
        "content": "July 22 Cessna aircraft maker Textron Inc  reported a 6 percent rise in second-quarter profit on Friday  helped by strong demand for business jets.",
        "date": "07222016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Textron profit rises 6 pct on stronger demand for business jets "
    },
    {
        "content": "RAF FAIRFORD  England U.S. group Textron Inc is launching a new company on Friday that will use its private fleet of older fighter jets and experienced former military pilots to provide combat training for U.S. military forces  the head of the new unit told Reuters.",
        "date": "07082016",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron sees growing demand for air combat training services "
    },
    {
        "content": "Textron Inc   the maker of Beechcraft and Cessna aircraft and Bell helicopters  reported a better-than-expected quarterly profit as demand for business jets remained steady.",
        "date": "04202016",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron profit beats on steady demand for business jets "
    },
    {
        "content": "April 19 A unit of U.S. industrial conglomerate Textron Inc said on Tuesday it has won a contract from Boeing Co to design and manufacture flight simulators for 777X aircraft.",
        "date": "04192016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Textron says it wins Boeing 777X flight simulator contract "
    },
    {
        "content": "* Shares rise as much as 5.7 pct   (Adds CEO  analyst comments  updates shares)",
        "date": "04202016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 3-Textron profit beats on steady demand for business jets "
    },
    {
        "content": "April 20 Textron Inc  the maker of Cessna aircraft and Bell helicopters  posted a 17.2 percent rise in first-quarter profit  helped by higher deliveries of its business jets.",
        "date": "04202016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Textron quarterly profit rises 17.2 pct "
    },
    {
        "content": "Cessna business jet maker Textron Inc  forecast 2016 earnings below analysts' estimates  and warned of flat sales in its commercial helicopters business  in part due to weak demand from oil and gas customers.",
        "date": "01272016",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Cessna jet maker Textron forecasts 2016 profit below estimates "
    },
    {
        "content": "* Shares fall as much as 10 pct   (Adds details from conference call  shares background)",
        "date": "01272016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 2-Cessna jet maker Textron forecasts 2016 profit below estimates "
    },
    {
        "content": "Jan 27 Textron Inc  the maker of Beechcraft and Cessna planes and Bell helicopters  reported a 4.2 percent fall in quarterly revenue  hurt by lower sales of its King Air business jets.",
        "date": "01272016",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Cessna jet maker Textron's revenue falls 4.2 pct "
    },
    {
        "content": "LAS VEGAS Textron Inc said on Monday it plans to develop a new business jet  the Cessna Citation Hemisphere  adding a competitor to the field of large  long-range private aircraft that have captured increasing sales in recent years.",
        "date": "11172015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron plans large-cabin Citation jet  picks Honeywell engine for Longitude "
    },
    {
        "content": "LAS VEGAS - GE Aviation  said on Monday it had teamed up with Textron  to produce an all-new turboprop aircraft and engine for the general aviation market  part of an effort GE expects will generate more than $1 billion in annual sales of engines by 2020.",
        "date": "11162015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "GE  Textron plan to develop new turboprop engine  plane "
    },
    {
        "content": "LAS VEGAS - Textron Inc said on Monday it plans to develop a new business jet  the Cessna Citation Hemisphere  adding another competitor to the field of large  long-range private aircraft that have captured increasing sales in recent years.",
        "date": "11162015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Textron plans large-cabin business jet with 4 500 nautical mile range "
    },
    {
        "content": "LAS VEGAS GE Aviation said on Monday it had teamed up with Textron Aviation to produce an all-new turboprop aircraft and engine for the general aviation market  part of an effort GE expects will generate up to $1 billion in annual sales of engines by around 2020.",
        "date": "11162015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "GE  Textron team up to make new turboprop engine  aircraft "
    },
    {
        "content": "LAS VEGAS  Nov 16 GE Aviation said on Monday it had teamed up with Textron Aviation to produce an all-new turboprop aircraft and engine for the general aviation market  part of an effort GE expects will generate up to $1 billion in annual sales of engines by around 2020.",
        "date": "11162015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "CORRECTED-GE  Textron team up to make new turboprop engine  aircraft "
    },
    {
        "content": "DUBAI Lower oil prices and conflicts in Yemen  Iraq and Syria have focused the attention of many Gulf countries on smaller drones  ground vehicles and other short-term equipment needs  a senior Textron Inc executive said Sunday.",
        "date": "11082015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron sees Gulf demand for drones  ground vehicles "
    },
    {
        "content": "DUBAI  Nov 8 Bell Helicopter  a unit of Textron Inc  said on Sunday  it did not expect a recovery in the commercial helicopter market until the first or second quarter of 2017.",
        "date": "11082015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "AIRSHOW-Bell sees delayed recovery in commercial helicopter market "
    },
    {
        "content": "KIEV Ukrainian state-run defense company Ukroboronprom said on Monday it had agreed a joint venture with U.S. defense group Textron Inc to upgrade military vehicles for Ukraine's army.",
        "date": "09212015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "U.S. group Textron to upgrade Ukraine military vehicles "
    },
    {
        "content": "Textron Inc   the maker of Beechcraft and Cessna planes  reported lower-than-expected quarterly revenue as it delivered fewer King Air Turboprops and Bell helicopters.",
        "date": "07282015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Cessna jets maker Textron's revenue falls on fewer deliveries "
    },
    {
        "content": "July 28 Textron Inc  the maker of Beechcraft and Cessna planes  reported lower-than-expected quarterly revenue as it delivered fewer King Air Turboprops and Bell helicopters.",
        "date": "07282015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 1-Cessna jets maker Textron's revenue falls on fewer deliveries "
    },
    {
        "content": "July 28 Textron Inc  the maker of Beechcraft and Cessna planes and Bell helicopters  reported a 16 percent rise in quarterly profit  helped by lower costs.",
        "date": "07282015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Cessna jets maker Textron's profit rises 16 pct "
    },
    {
        "content": "TOKYO  July 17 Japan has awarded Fuji Heavy Industries and Textron Inc's Bell Helicopters a $3.02 billion deal to build a fleet of military transport aircraft that would also be sold overseas.",
        "date": "07172015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Japan picks Fuji Heavy and Bell to build new military transport helicopter "
    },
    {
        "content": "WASHINGTON  July 14 Japan has agreed to spend $332.5 million to buy an initial five V-22 tiltrotor planes built by Boeing Co and Bell Helicopter  finalizing the first international sale of the \"Osprey\" aircraft  the Pentagon announced on Tuesday.",
        "date": "07142015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 2-U.S.  Japan ink deal for first batch of V-22 tiltrotor planes "
    },
    {
        "content": "WASHINGTON/NEW YORK Lockheed Martin Corp  and Textron Inc  have emerged as final contenders to buy United Technologies Corp's   Sikorsky Aircraft business  which could be valued at around $8 billion  according to people familiar with the matter.",
        "date": "07082015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Exclusive: Lockheed  Textron final suitors for Sikorsky Aircraft - sources "
    },
    {
        "content": "July 9 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Thursday:",
        "date": "07092015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "July 9 As United Technologies Corp nears a decision on how it will divest its Sikorsky helicopter division  the U.S. conglomerate faces challenges to its financial outlook that may limit the lift to its stock in the near term.",
        "date": "07092015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "United Tech faces growth challenges as Sikorsky divestment nears "
    },
    {
        "content": "PARIS Textron Inc  is not interested in selling its Bell Helicopter business  despite the current downturn in the commercial sector  the company's chief executive  Scott Donnelly  said.",
        "date": "06172015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron CEO: No interest in selling Bell Helicopter business "
    },
    {
        "content": "PARIS Airbus Group's  finance director declined to elaborate on the company's stance toward the possible sale of U.S. helicopter maker Sikorsky but noted its own helicopter division was already focusing on various projects.",
        "date": "06172015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Airbus Group CFO declines Sikorsky comment  says helicopter unit busy "
    },
    {
        "content": "PARIS  June 17 Airbus Group's finance director declined to elaborate on the company's stance towards the possible sale of U.S. helicopter maker Sikorsky but noted its own helicopter division was already focusing on various projects.",
        "date": "06172015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "AIRSHOW-Airbus Group CFO declines Sikorsky comment  says helicopter unit busy "
    },
    {
        "content": "Textron Inc   maker of Beechcraft and Cessna airplanes and Bell helicopters  reported lower-than-expected quarterly revenue and profit as helicopter division sales declined.",
        "date": "04282015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "Textron profit  revenue miss estimates as helicopter sales drop "
    },
    {
        "content": "April 28 Textron Inc  maker of Beechcraft and Cessna airplanes and Bell helicopters  reported lower-than-expected quarterly revenue and profit as helicopter division sales declined.",
        "date": "04282015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 1-Textron profit  revenue miss estimates as helicopter sales drop "
    },
    {
        "content": "April 28 Textron Inc  the maker of Beechcraft and Cessna planes and Bell helicopters  reported a 50.6 percent jump in first-quarter profit.",
        "date": "04282015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "CORRECTED-Textron quarterly profit jumps 50.6 pct "
    },
    {
        "content": "BEIJING  April 15 China's civil aviation authority has promised a major \"break through\" to open up airspace for small planes  state media said on Wednesday  a move which could boost sales for planemakers such as Bombardier Inc  and Textron Inc.",
        "date": "04152015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "REFILE-China aviation regulator to push for air space reform -paper "
    },
    {
        "content": "March 12 United Technologies Corp's  Sikorsky helicopter unit could be acquired by another big defense company  but the potential for a big tax bill means the maker of Black Hawk helicopters will more likely be spun off into a standalone company  analysts said.",
        "date": "03122015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Takeover of UTC's Sikorsky helicopter unit seen less likely  for now "
    },
    {
        "content": "United Technologies Corp  will explore spinning off its Sikorsky helicopter unit  in the first major move by the company's new chief executive officer to overhaul the U.S. conglomerate's portfolio of businesses.",
        "date": "03122015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UTC to weigh splitting off of Sikorsky helicopter unit "
    },
    {
        "content": "WASHINGTON  March 12 A spinoff of United Technologies Corp's Sikorsky Aircraft as a standalone company should not have any impact on the U.S. Defense Department's costs  the Pentagon's acquisition chief said Thursday.",
        "date": "03132015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "U.S. arms buyer sees no cost impact from possible Sikorsky spin "
    },
    {
        "content": "WASHINGTON  Feb 6 Northrop Grumman Corp  said on Friday it is designing and already building a new aircraft for the upcoming U.S. Air Force T-X competition to build 350 new training planes  an $11 billion program that analysts say could double in value in coming years.",
        "date": "02062015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Northrop surprises with new design for U.S. Air Force trainer "
    },
    {
        "content": "Jan 28 Textron Inc  maker of Cessna jets and Bell helicopters  reported quarterly revenue below average analyst estimate as deliveries of Bell helicopters declined  and forecast full-year profit and revenue below expectations.",
        "date": "01282015",
        "name": "Textron Inc",
        "news_type": "topStory",
        "symbol": "TXT",
        "title": "UPDATE 1-Textron revenue misses estimate on lower helicopter deliveries "
    },
    {
        "content": "Jan 28 Textron Inc  maker of Cessna jets and Bell helicopters  reported a 27 percent jump in quarterly profit  helped by its acquisition of smaller peer Beechcraft last March.",
        "date": "01282015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "Textron profit up 27 pct "
    },
    {
        "content": "WASHINGTON  Jan 13 The U.S. Navy plans to buy V-22 tiltrotor aircraft built by Boeing Co and Textron Inc's Bell Helicopter unit to replace the older C-2A turboprop aircraft it now uses to ferry passengers and cargo to aircraft carriers  two people  familiar with the issue said late Tuesday.",
        "date": "01142015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "U.S. Navy said to opt for Bell-Boeing V-22s for carrier deliveries "
    },
    {
        "content": "WASHINGTON  Jan 13 The U.S. Navy plans to buy V-22 tiltrotor aircraft built by Boeing Co and Textron Inc's Bell Helicopter unit to replace the older C-2A turboprop aircraft it now uses to ferry passengers and cargo to aircraft carriers  two people  familiar with the issue said late Tuesday.",
        "date": "01142015",
        "name": "Textron Inc",
        "news_type": "normal",
        "symbol": "TXT",
        "title": "UPDATE 1-U.S. Navy said to opt for Bell-Boeing V-22s for carrier deliveries "
    }
]