[
    {
        "content": "Oct 31 Under Armour Inc's third-quarter profit more than halved from a year ago  hit by an $85 million restructuring charge.",
        "date": "10312017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Under Armour profit hit by restructuring charge "
    },
    {
        "content": "Oct 31 Under Armour Inc slashed 2017 forecasts and reported its first quarterly fall in revenue since going public on Tuesday  as the sportswear firm struggled to make inroads against global rivals Nike and Adidas .",
        "date": "10312017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "UPDATE 3-Under Armour chops forecasts as North America slide worsens "
    },
    {
        "content": "Under Armour Inc  co-founder Kip Fulks is taking a sabbatical from the sportswear maker  the company told Reuters on Monday.",
        "date": "10232017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Under Armour says co-founder Kip Fulks taking sabbatical "
    },
    {
        "content": "Oct 23 Under Armour Inc co-founder Kip Fulks is taking a sabbatical from the sportswear maker  the company told Reuters on Monday.",
        "date": "10232017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "UPDATE 1-Under Armour says co-founder Kip Fulks taking sabbatical "
    },
    {
        "content": "Oct 23 Under Armour Inc is mulling exit from its smaller sports categories to combat slowing industry sales and co-founder Kip Fulks is taking a sabbatical  Wall Street Journal reported on Monday  citing people familiar with the matter.",
        "date": "10232017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "Under Armour may exit some categories  co-founder takes sabbatical - WSJ "
    },
    {
        "content": "Shares of Under Armour Inc  sank more than 3 percent on Tuesday  a day after National Basketball Association star Kevin Durant said young players do not like the company's shoes.",
        "date": "08292017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "NBA star Durant takes shot at Under Armour  stock falls "
    },
    {
        "content": "The chief executives of Intel Corp  Merck & Co Inc and Under Armour Inc resigned from U.S. President Donald Trump's American Manufacturing Council on Monday  following Trump's initially tepid response to weekend violence at a rally of white supremacists in Charlottesville  Virginia. | Video ",
        "date": "08152017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Three CEOs resign from Trump council over Charlottesville "
    },
    {
        "content": "Aug 14 The chief executives of Intel Corp   Merck & Co Inc and Under Armour Inc resigned from U.S. President Donald Trump's American Manufacturing Council on Monday  following Trump's initially tepid response to weekend violence at a rally of white supremacists in Charlottesville  Virginia.",
        "date": "08152017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "UPDATE 10-Three CEOs resign from Trump council over Charlottesville "
    },
    {
        "content": "Under Armour Inc   which became a sensation riding the athleisure trend a few years ago  laid out a strategy this week to stanch a steep decline in sales growth but the company's progress could hit roadblocks.",
        "date": "08042017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Under Armour's game plan to revive sales could hit snags "
    },
    {
        "content": "Under Armour Inc's  shares slumped to a record-low after the company trimmed its sales forecast and said it would cut jobs and close stores  underscoring the company's struggles in a fast-changing and fiercely competitive U.S. sportswear market.",
        "date": "08012017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Under Armour shares hit record low after forecast cut "
    },
    {
        "content": "* Stock falls 10 percent to record-low (Adds details  updates shares)",
        "date": "08012017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "UPDATE 5-Under Armour shares hit record low after forecast cut "
    },
    {
        "content": "Aug 1 Sportswear maker Under Armour Inc reported a smaller quarterly loss and launched a restructuring plan that would involve closing facilities and leases and job cuts.",
        "date": "08012017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "Under Armour posts smaller loss  to restructure operations "
    },
    {
        "content": "* Under Armour - on June 23  board approved amendments to bylaws to reflect fact roles of CEO  President will be held by separate individuals - SEC filing",
        "date": "06272017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "BRIEF-Under Armour board approves amendments to bylaws to reflect fact roles of CEO  president will be held by separate individuals "
    },
    {
        "content": "* Under Armour announces Patrik Frisk as president and chief operating officer",
        "date": "06272017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "BRIEF-Under Armour names Patrik Frisk president and COO of the company "
    },
    {
        "content": "* Effective may 8 Kip Fulks  co's co-founder  chief product officer  is assuming role of strategic advisor to co - sec filing Source text (http://bit.ly/2qKNnOX) Further company coverage:",
        "date": "05082017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "BRIEF-Under Armour effective May 8 Kip Fulks  chief product officer  is assuming role of strategic advisor to co "
    },
    {
        "content": "Sportswear maker Under Armour Inc   posted a smaller-than-expected quarterly loss  helped by a jump in sales at its retail outlets - a higher margin business than wholesale - and a bump in profit in Asia Pacific  the only bright spot.",
        "date": "04272017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Under Armour's smaller-than-expected loss eases investor fears "
    },
    {
        "content": "* Asia Pac operating profit up 13 pct  N. America falls 91 pct",
        "date": "04272017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "UPDATE 3-Under Armour's smaller-than-expected loss eases investor fears "
    },
    {
        "content": "* Under Armour executive - sluggish signature market and warm consumer reception led to softer-than-expected results for the Curry 3 sneakers - conf call",
        "date": "04272017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "BRIEF-Under Armour executive says expects Q2 revenue growth rate to be about 1 point higher than Q1 - conf call "
    },
    {
        "content": "April 27 Sportswear maker Under Armour Inc posted a quarterly loss as costs rose and the company discounted more.",
        "date": "04272017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "Under Armour posts quarterly loss "
    },
    {
        "content": "* Under Armour announces nomination of Jerri L. Devard to board of directors",
        "date": "04132017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "BRIEF-Under Armour announces nomination of Jerri Devard to board "
    },
    {
        "content": "NEW YORK  April 13 Some of the actively managed funds that have performed the best since the Nov. 8 presidential election are switching from \"Trump Trade\" bets on financial and infrastructure stocks into beaten-down sectors such as retail  apparel or biotech.",
        "date": "04132017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "CORRECTED-'Trump Trade' winners switch into battered retail  biotech shares "
    },
    {
        "content": "NEW YORK  April 13 Some of the actively managed funds that have performed the best since the Nov. 8 presidential election are switching from \"Trump Trade\" bets on financial and infrastructure stocks into beaten-down sectors such as retail  apparel or biotech.",
        "date": "04132017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "CORRECTED-RPT-'Trump Trade' winners switch into battered retail  biotech shares "
    },
    {
        "content": "* CEO Kevin Plank's 2016 total compensation was $2 million versus $2.4 million in 2015 - SEC filing Source text for Eikon: (http://bit.ly/2p0ttyF) Further company coverage:",
        "date": "04132017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "BRIEF-Under Armour CEO Kevin Plank's 2016 total compensation was $2 mln "
    },
    {
        "content": "NEW YORK Shares of sports apparel and shoe maker Under Armour Inc  could rise 30 percent and the company is likely to increase sales at a double-digit clip for years to come as it has several markets left to tap fully  Barron's said in a report on Sunday.",
        "date": "04032017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Under Armour stock could rise more than 30 percent in a year: Barron's "
    },
    {
        "content": "NEW YORK  April 2 Shares of sports apparel and shoe maker Under Armour Inc could rise 30 percent and the company is likely to increase sales at a double-digit clip for years to come as it has several markets left to tap fully  Barron's said in a report on Sunday.",
        "date": "04032017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "Under Armour stock could rise more than 30 pct in a year -Barron's "
    },
    {
        "content": "Nike Inc  reported lower-than-expected quarterly revenue on Tuesday as the world's largest footwear maker battles for market share in North America with a resurgent Adidas AG and a fast-growing Under Armour Inc.",
        "date": "03212017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Nike's revenue misses estimates as rivals gain ground "
    },
    {
        "content": "March 21 Nike Inc reported lower-than-expected quarterly revenue on Tuesday as the world's largest footwear maker battles for market share in North America with a resurgent Adidas AG and a fast-growing Under Armour Inc.",
        "date": "03212017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "UPDATE 3-Nike's revenue misses estimates as rivals gain ground "
    },
    {
        "content": "March 21 Nike Inc  the world's largest footwear maker  reported lower-than-expected quarterly revenue on Tuesday amid intense competition from a resurgent Adidas AG  and Under Armour Inc in North America.",
        "date": "03212017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "Nike reports lower-than-expected quarterly revenue "
    },
    {
        "content": "* Kohl's sees FY comp sales flat to down 2 pct   (Adds Nordstrom's results  updates shares)",
        "date": "02232017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "UPDATE 4-Lower inventories help Kohl's  Nordstrom top profit estimates "
    },
    {
        "content": "NEW YORK Professional ballet dancer Misty Copeland and wrestler turned-actor Dwayne \"The Rock\" Johnson joined National Basketball Association star Stephen Curry in opposing comments made by the chief executive of their sponsor Under Armour supporting U.S. President Donald Trump. | Video ",
        "date": "02102017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Under Armour-sponsored athletes oppose CEO's pro-Trump comments "
    },
    {
        "content": "NEW YORK  Feb 9 Professional ballet dancer Misty Copeland and wrestler turned-actor Dwayne \"The Rock\" Johnson joined National Basketball Association star Stephen Curry in opposing comments made by the chief executive of their sponsor Under Armour supporting U.S. President Donald Trump.",
        "date": "02092017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "UPDATE 1-Under Armour-sponsored athletes oppose CEO's pro-Trump comments "
    },
    {
        "content": "* Baillie Gifford & Co reports a 9.54 percent passive stake in Under Armour Inc as of Dec 31  2016  -  sec filing  Source text (http://bit.ly/2ku6p5E) Further company coverage:",
        "date": "02102017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "BRIEF-Baillie Gifford & Co reports a 9.54 pct passive stake in Under Armour as of Dec. 31  2016 "
    },
    {
        "content": "NEW YORK  Feb 9 National Basketball Association star Stephen Curry joined a number of other athletes to speak up against President Donald Trump  opposing a comment made by Under Armour Chief Executive Kevin Plank that the president is \"a real asset\" to the country.",
        "date": "02092017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "NBA star Stephen Curry opposes Under Armour chief's Trump comment "
    },
    {
        "content": "Sportswear maker Under Armour Inc   forecast 2017 sales well below analysts' estimates  a sign that the company is finding it tough to replicate the rapid growth it achieved since going public in 2005 as competition intensifies. | Video ",
        "date": "01312017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Under Armour's rapid growth hits speed bump  shares skid "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Under Armour's founder-led approach is wearing thin. The $12 billion athletic-wear maker reported its slowest top-line growth in eight years and signaled more challenges ahead. Its chief financial officer is also bailing. The news wiped a quarter off the company's market value. Chief Executive Kevin Plank's strategy of maintaining power is underperforming badly.",
        "date": "01312017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "Under Armour's founder-led approach wears thin "
    },
    {
        "content": "* Class A shares down 26 pct  Class C shares fall 28 pct   (Adds Breakingviews link)",
        "date": "01312017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "UPDATE 4-Under Armour's rapid growth hits speed bump  shares skid "
    },
    {
        "content": "Under Armour Inc's   revenue increased at breakneck speed for more than six years  averaging a quarterly growth rate of 20 percent  as shoppers couldn't get enough of their Stephen Curry basketball gear and Bandit running shoes.",
        "date": "02012017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "Under Armour's slower revenue growth seen as new normal "
    },
    {
        "content": "Jan 31 Sportswear maker Under Armour Inc   said its Chief Financial Officer Chip Molloy would step down and reported lower-than-expected quarterly sales  hurt by intense competition and slowing growth in North America.",
        "date": "01312017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "Under Armour posts sales miss; CFO to resign "
    },
    {
        "content": "Feb 1 Under Armour Inc's  revenue increased at breakneck speed for more than six years  averaging a quarterly growth rate of 20 percent  as shoppers couldn't get enough of their Stephen Curry basketball gear and Bandit running shoes.",
        "date": "02012017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "UPDATE 1-Under Armour's slower revenue growth seen as new normal "
    },
    {
        "content": "Feb 1 Under Armour Inc's  revenue increased at breakneck speed for more than six years  averaging a quarterly growth rate of 20 percent  as shoppers couldn't get enough of their Stephen Curry basketball gear and Bandit running shoes.",
        "date": "02012017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "Chink in Under Armour: slow down in sales growth seen as new normal "
    },
    {
        "content": "Feb 1 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02012017",
        "name": "Under Armour Inc",
        "news_type": "normal",
        "symbol": "UAA",
        "title": "PRESS DIGEST- Wall Street Journal - Feb 1 "
    },
    {
        "content": "* Under Armour Inc - has signed running back and NFL draft prospect Leonard Fournette to a multi-year partnership  Source text for Eikon:  Further company coverage:",
        "date": "01182017",
        "name": "Under Armour Inc",
        "news_type": "topStory",
        "symbol": "UAA",
        "title": "BRIEF-Under Armour signs running back  NFL draft prospect Leonard Fournette to a multi-year partnership "
    }
]