[
    {
        "content": "Sept 15 Bank of America Corp's Merrill Lynch hired three financial advisers from UBS Group AG  for its Manhattan East complex.",
        "date": "09152016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "MOVES-BofA Merrill Lynch hires three advisers from UBS "
    },
    {
        "content": "Aug 24 PharMerica Corp  a U.S. pharmacy manager for long-term care facilities  is exploring strategic alternatives including a potential sale  according to people familiar with the matter.",
        "date": "08242016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "UPDATE 1-Pharmacy manager PharMerica explores possible sale -sources "
    },
    {
        "content": "Aug 24 PharMerica Corp  a U.S. pharmacy manager for long-term care facilities  is exploring strategic alternatives  including a potential sale  according to people familiar with the matter.",
        "date": "08242016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "Specialty pharmacy PharMerica explores possible sale -sources "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  August 01 (Fitch) UBS Group AG reported resilient profitability in 2Q16  in a difficult market environment as adjusted pre-tax profit rebounded from a  weaker first quarter and increased slightly yoy  says Fitch Ratings. Revenue  generation remained under pressure as client transaction volumes remained low.  Performance in Asia Pacific was particularly affected as revenue declined by  about a third yoy  and pre-tax profit genera",
        "date": "08012016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "Fitch: Resilient 2Q16 Results at UBS "
    },
    {
        "content": "LONDON  Aug 2 (IFR) - UBS Group AG announced the first Additional Tier 1 bond from a European issuer since the UK voted to leave the European Union  prompting a sell-off in risk assets.",
        "date": "08022016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "UPDATE 1-UBS to reopen European Additional Tier 1 market "
    },
    {
        "content": "Swiss bank UBS Group AG appointed Javier Oficialdegui and Laurent Bouvier as co-heads of Europe  Middle East and Africa (EMEA) sector client coverage and origination  according to an internal memo seen by Reuters.",
        "date": "07262016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "UBS names co-heads for EMEA sector client coverage "
    },
    {
        "content": "July 25 Swiss bank UBS Group AG  appointed Javier Oficialdegui and Laurent Bouvier as co-heads of Europe  Middle East and Africa (EMEA) sector client coverage and origination  according to an internal memo seen by Reuters.",
        "date": "07252016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "MOVES-UBS names co-heads for EMEA sector client coverage "
    },
    {
        "content": "Florida-based EverBank Financial Corp  is exploring a sale after receiving interest from a potential buyer  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "07252016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "EverBank working with UBS to explore sale: Bloomberg "
    },
    {
        "content": "July 25 Florida-based EverBank Financial Corp  is exploring a sale after receiving interest from a potential buyer  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "07252016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "UPDATE 1-EverBank working with UBS to explore sale - Bloomberg "
    },
    {
        "content": "July 25 Florida-based EverBank Financial Corp  is exploring a sale after receiving interest from a potential buyer  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "07252016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "EverBank working with UBS to explore sale - Bloomberg "
    },
    {
        "content": "NEW YORK  July 13 UBS Group AG   said on Wednesday it will offer a new type of investment fund called NextShares through its U.S. wealth-management unit  becoming the first major distributor for a product that backers hope will replace mutual funds.",
        "date": "07132016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "UBS will be first major wealth manager to embrace new kind of fund "
    },
    {
        "content": "ZURICH  July 11 Swiss bank UBS Group AG  is freezing new hires in parts of its wealth management business as part of a restructuring process aimed to cut costs  a source familiar with the matter said on Monday.",
        "date": "07112016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "UBS to freeze new hires in parts in wealth management unit -source "
    },
    {
        "content": "NEW YORK  June 16 Swiss bank UBS Group  is expanding an internal hedge fund under new chief investment officer Kevin Russell.",
        "date": "06162016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "UBS hedge fund unit hires from GLG  Citadel  Point72 "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  June 14 (Fitch) Fitch Ratings has upgraded UBS AG's and UBS Switzerland  AG's Long-Term Issuer Default Ratings (IDR) to 'A+' from 'A' while affirming  their Viability Ratings (VR) at 'a' and Short-Term IDRs at 'F1'. The Outlooks  are Stable.  At the same time  UBS Group AG's Long-Term IDR has been affirmed at 'A'  its VR  at 'a' and Short-Term IDR at 'F1'. The Outlook on UBS Group AG is Positive. UBS  Limited's Long-Term IDR has",
        "date": "06142016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "Fitch Upgrades UBS AG's and UBS Switzerland AG's IDRs; Affirms UBS Group AG "
    },
    {
        "content": "SINGAPORE/HONG KONG  May 23 UBS Group AG  has cut a handful of private bankers from operations in Singapore and Hong Kong in recent weeks including a senior catering for the super rich in Southeast Asia  two people familiar with the matter said.",
        "date": "05232016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "UBS cuts \"handful\" of private bankers in Singapore  HK -sources "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 05 (Fitch) Fitch Ratings says that UBS Group AG's (UBS;  A/Positive/a) 1Q16 results highlight the bank's sensitivity to client-driven  transactions  whose lower volumes during the quarter resulted in a decline in  revenue. As a result  all business divisions reported yoy declines in adjusted  pre-tax profit.  UBS's 1Q16 adjusted pre-tax profit declined 40% yoy to CHF1.4bn  excluding  CHF265m restructuring costs and CHF123m f",
        "date": "05052016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "Fitch: UBS 1Q16 Results Highlight Sensitivity to Drop in Client Transactions "
    },
    {
        "content": "* CEO says new wealth management savings part of current cost savings programme -media call  Further company coverage:    (Reporting by Zurich Newsroom)",
        "date": "05032016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "BRIEF-UBS CEO says new wealth management savings part of current cost savings programme "
    },
    {
        "content": "* Says there is no magic bullet to take down billions of costs -analyst call",
        "date": "05032016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "BRIEF-UBS CEO says priority is to protect baseline dividend "
    },
    {
        "content": "* CEO says would expect more moderate growth in net new money for the rest of 2016 -Bloomberg TV  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "05032016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "BRIEF-UBS CEO expects more moderate growth in net new money for the rest of 2016 -BBG TV "
    },
    {
        "content": "* CEO Ermotti says not really commenting on ongoing quarter but doesn't look to me that situation has materially changed so need to ready for continuation of this trend-CNBC  Further company coverage:    (Reporting by Zurich Newsroom)",
        "date": "05032016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "BRIEF-UBS CEO says doesn't look like situation has materially changed in Q2-CNBC "
    },
    {
        "content": "BUENOS AIRES  April 15 Argentina confirmed the seven banks managing its upcoming bond issue in the government's official gazette on Friday as it prepares to return to international credit markets for the first time in 15 years.",
        "date": "04152016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "Argentina confirms seven banks running international bond issue "
    },
    {
        "content": "March 29 UBS Group AG has named Joseph Hershberger a vice chairman in its financial institutions group  where he will focus on global asset management efforts  according to a memo seen by Reuters.",
        "date": "03292016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "MOVES-UBS hires asset management banker Hershberger from Credit Suisse "
    },
    {
        "content": "March 30 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03302016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "MOVES- Standard Life  Marsh & McLennan  UBS "
    },
    {
        "content": "March 31 Swiss bank UBS Group AG  appointed Tracey Woon as vice chairman for UBS Wealth Management in Asia.",
        "date": "03312016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "MOVES-UBS hires Citigroup's Tracey Woon for wealth management business "
    },
    {
        "content": "LONDON  March 14 (IFR) - UBS Group AG is marketing a perpetual non-call 2021 Additional Tier 1 bond at 7%-7.125%  according to a lead.",
        "date": "03142016",
        "name": "UBS AG",
        "news_type": "topStory",
        "symbol": "UBS",
        "title": "UBS marketing US dollar PNC 2021 Additional Tier 1 bond - lead "
    },
    {
        "content": "LONDON  March 14 (IFR) - UBS Group AG is planning to raise an Additional Tier 1 bond issue as early as today  according to a lead.",
        "date": "03142016",
        "name": "UBS AG",
        "news_type": "normal",
        "symbol": "UBS",
        "title": "UBS to open books on Additional Tier 1 US dollar bond "
    }
]