[
    {
        "content": "BRASILIA Shares of Brazil's Ultrapar Participações SA fell the most in two and a half years on Wednesday after antitrust watchdog Cade voted unanimously to reject its proposed acquisition of rival fuel distribution company Alesat Combustíveis SA.",
        "date": "08022017",
        "name": "Ultrapar Participacoes SA",
        "news_type": "topStory",
        "symbol": "UGP",
        "title": "Ultrapar shares tumble as Brazil blocks fuel distributor Ale takeover "
    },
    {
        "content": "BRASILIA  Aug 2 Shares of Brazil's Ultrapar Participações SA fell the most in two and a half years on Wednesday after antitrust watchdog Cade voted unanimously to reject its proposed acquisition of rival fuel distribution company Alesat Combustíveis SA.",
        "date": "08022017",
        "name": "Ultrapar Participacoes SA",
        "news_type": "normal",
        "symbol": "UGP",
        "title": "UPDATE 4-Ultrapar shares tumble as Brazil blocks fuel distributor Ale takeover "
    },
    {
        "content": "BRASILIA  Aug 2 Brazil's antitrust watchdog Cade unanimously rejected on Wednesday the takeover of fuel distributor Alesat Combustíveis SA by a unit of Ultrapar Participações SA.",
        "date": "08022017",
        "name": "Ultrapar Participacoes SA",
        "news_type": "normal",
        "symbol": "UGP",
        "title": "Brazil's Cade unanimously rejects Alesat takeover by Ultrapar "
    },
    {
        "content": "BRASILIA  Aug 2 The rapporteur at Brazil's antitrust watchdog for the acquisition of fuel distribution company Alesat Combustíveis by rival Ultrapar Participações SA defended the rejection of the deal on Wednesday.",
        "date": "08022017",
        "name": "Ultrapar Participacoes SA",
        "news_type": "normal",
        "symbol": "UGP",
        "title": "Brazil antitrust watchdog Cade defends rejection of Ale takeover by Ultrapar "
    },
    {
        "content": "SAO PAULO  June 22 Brazilian antitrust regulators have postponed a deadline for ruling on the acquisition of fuel distributor Alesat Combustíveis SA by a unit of larger rival Ultrapar Participações SA for 30 days to Aug 16.",
        "date": "06222017",
        "name": "Ultrapar Participacoes SA",
        "news_type": "topStory",
        "symbol": "UGP",
        "title": "Brazil regulators postpone ruling on Ultrapar purchase of ALE "
    },
    {
        "content": "SAO PAULO Brasil Pharma SA   the country's third-largest drug retailer  has walked away from talks with Brazilian industrial conglomerate Ultrapar Participações SA  to sell drugstore chain Distribuidora Big Ben SA  two sources with knowledge of the matter told Reuters.",
        "date": "12282016",
        "name": "Ultrapar Participacoes SA",
        "news_type": "topStory",
        "symbol": "UGP",
        "title": "Brazil's Ultrapar talks to buy Big Ben drugstore chain collapse: sources "
    },
    {
        "content": "SAO PAULO Brazil's Petroleo Brasileiro SA  has approved the sale of its liquefied petroleum gas unit to Ultrapar Participações SA   as Brazil's state-controlled firm disposes of assets to reduce the largest debt burden among global oil producers.",
        "date": "11172016",
        "name": "Ultrapar Participacoes SA",
        "news_type": "topStory",
        "symbol": "UGP",
        "title": "Petrobras approves Liquigás sale to Ultrapar "
    },
    {
        "content": "SAO PAULO  Nov 17 Brazil's Petroleo Brasileiro SA has approved the sale of its liquefied petroleum gas unit to Ultrapar Participações SA  as Brazil's state-controlled firm disposes of assets to reduce the largest debt burden among global oil producers.",
        "date": "11172016",
        "name": "Ultrapar Participacoes SA",
        "news_type": "normal",
        "symbol": "UGP",
        "title": "UPDATE 3-Petrobras approves Liquigás sale to Ultrapar "
    },
    {
        "content": "SAO PAULO  Nov 17 Brazil's state-run oil company Petroleo Brasileiro SA is close to announcing the sale of its liquified petroleum gas distribution unit Liquigás Distribuidora SA to industrial group Ultrapar Participações SA   a source close to the matter told Reuters.",
        "date": "11172016",
        "name": "Ultrapar Participacoes SA",
        "news_type": "normal",
        "symbol": "UGP",
        "title": "Petrobras to announce sale of gas distribution unit to Ultrapar -source "
    },
    {
        "content": "SAO PAULO  Oct 14 Brazil's state-controlled oil company Petróleo Brasileiro SA said on Friday it is in advanced talks with Ultrapar Participações SA to sell its gas distribution unit Liquigás Distribuidora SA.   (Reporting by Marcelo Teixeira; Editing by Chris Reese)",
        "date": "10142016",
        "name": "Ultrapar Participacoes SA",
        "news_type": "topStory",
        "symbol": "UGP",
        "title": "Petrobras says in advanced talks with Ultrapar to sell Liquigas "
    },
    {
        "content": "SAO PAULO  Aug 4 Ultrapar Participações SA   a large player in energy and infrastructure in Brazil  said on Thursday it will partner with Chevron Corp  to sell lubricants  additives and coolants in the Brazilian market.",
        "date": "08042016",
        "name": "Ultrapar Participacoes SA",
        "news_type": "normal",
        "symbol": "UGP",
        "title": "Ultrapar to partner with Chevron in Brazil to sell lubricants "
    },
    {
        "content": "SAO PAULO  Aug 10 Ultrapar Participações SA   which owns Brazil's largest natural gas distribution company  is interested in acquiring some assets from state-controlled Petróleo Brasileiro SA that could be listed as early as this year  O Estado de S. Paulo newspaper reported on Monday.",
        "date": "08102015",
        "name": "Ultrapar Participacoes SA",
        "news_type": "topStory",
        "symbol": "UGP",
        "title": "Ultrapar keen to acquire some Petrobras gas assets  paper says "
    }
]