[
    {
        "content": "* Universal Health Services Inc announces dividend and increase to stock repurchase program",
        "date": "11152017",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-Universal Health Services announces dividend and increase to stock repurchase program "
    },
    {
        "content": "* Universal Health Services Inc reports 2017 third quarter financial results and revises 2017 full year earnings guidance",
        "date": "10252017",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-Universal Health Services reports Q3 earnings per share $1.47 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 18 (Fitch) Fitch Ratings has affirmed Universal Health Services  Inc.'s (NYSE: UHS) Issuer Default Rating (IDR) at 'BB+' and its senior secured debt at 'BBB-/RR1'. The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS Low Debt Leverage: Fitch expects UHS will operate with gross debt/EBITDA after net distributions to associates and minorities in the low 2x ran",
        "date": "10182017",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "Fitch Affirms Universal Health at 'BB+'; Outlook Stable "
    },
    {
        "content": "* Universal Health Services  Inc. reports 2017 second quarter financial results and revises 2017 full year earnings guidance",
        "date": "07252017",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-Universal Health Services Q2 earnings per share $1.91 "
    },
    {
        "content": "* Universal Health Services Inc reports 2017 first quarter financial results",
        "date": "04252017",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-Universal Health Services reports Q1 earnings per share $2.12 "
    },
    {
        "content": "April 21 UK's Competition and Markets Authority (CMA):",
        "date": "04212017",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-UK's CMA looks into acqusition by Cygnet Health Care  Universal Health Services "
    },
    {
        "content": "April 18 A Republican senator said on Tuesday he had written to the U.S. Department of Health and Human Services (HHS) raising questions about reports of \"troubling conduct\" by psychiatric hospital operator Universal Health Services Inc .",
        "date": "04182017",
        "name": "Universal Health Services Inc",
        "news_type": "normal",
        "symbol": "UHS",
        "title": "U.S. senator raises questions about hospital operator UHS "
    },
    {
        "content": "Massachusetts Attorney General Maura Healey has accused Universal Health Services Inc of employing unlicensed and unsupervised personnel at mental health centers  leading the company to submit false claims for reimbursement to the state's Medicaid program.",
        "date": "04102017",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "Massachusetts sues Universal Health Services over mental health clinics "
    },
    {
        "content": "* Universal Health Services Inc - CEO Alan B. Miller's total compensation in 2016 was $19.9 million versus $20.5 million in 2015 - SEC filing Source text : [ID:http://bit.ly/2o0vibN] Further company coverage:",
        "date": "04062017",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-Universal Health Services's CEO Alan B. Miller's FY total compensation $19.9 million "
    },
    {
        "content": "* Universal health services inc sees 2017 adjusted eps $7.70 per share to $8.20 per share",
        "date": "02282017",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-Universal Health Q4 EPS $1.78 "
    },
    {
        "content": "* Universal Health Services  Inc. Reports 2016 third quarter financial results and narrows 2016 full year earnings guidance",
        "date": "10262016",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-Universal Health Services Q3 revenue $2.41 billion versus "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 29 (Fitch) Fitch Ratings has affirmed the ratings of Universal  Health Services  Inc. (NYSE: UHS)  including the Issuer Default Rating (IDR) at  'BB+' and the senior secured credit facility and senior secured bond ratings at  'BBB-/RR1'. The Rating Outlook is Stable. A full list of rating actions  which apply to approximately $3.6 billion of debt  outstanding at June 30  2016  is found at the end of this release.  KEY RA",
        "date": "08292016",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "Fitch Affirms Universal Health Services at 'BB+'; Outlook Stable "
    },
    {
        "content": "* Universal Health Services  Inc. announces purchase of third-party minority ownership interests in six acute care hospitals in Las Vegas  Nevada",
        "date": "05022016",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-Universal Health announces purchase of interests in 6 acute care hospitals "
    },
    {
        "content": "* Q1 earnings per share view $1.87 -- Thomson Reuters I/B/E/S",
        "date": "04272016",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-Universal Health Services Q1 shr $1.93 "
    },
    {
        "content": "* CalPERS-Request Universal Health Services shareowners vote for proposal to give class B/D shareowners access to class B/D director nomination process  Source text - http://1.usa.gov/1NmxxAm  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04212016",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "BRIEF-CalPERS-Request Universal Health Services shareowners vote for proposal to give class B/D shareowners access to class B/D director nomination process "
    },
    {
        "content": "NEW YORK  July 6 Humana Inc  fresh from announcing an agreement to be purchased by larger rival Aetna Inc  prompted new investor concerns about the $33 billion deal on Monday by lowering its 2015 financial forecasts.",
        "date": "07062015",
        "name": "Universal Health Services Inc",
        "news_type": "normal",
        "symbol": "UHS",
        "title": "Humana cuts outlook  raising new concerns about Aetna deal "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 24 (Fitch) Fitch Ratings has affirmed Universal Health Services  Inc.'s (UHS) ratings  including the Issuer Default Rating (IDR) at 'BB+'. A  complete list of ratings follows at the end of the release. The ratings apply to  approximately $3.1 billion of debt at March 31  2015. The Rating Outlook is  Stable. KEY RATING DRIVERS --UHS has the strongest balance sheet in the for-profit hospital sector  with  total debt-to-EBITD",
        "date": "06242015",
        "name": "Universal Health Services Inc",
        "news_type": "topStory",
        "symbol": "UHS",
        "title": "Fitch Affirms Universal Health Services' IDR at 'BB+'; Outlook Stable "
    }
]