[
    {
        "content": "* ‍99% OF ALL UNILEVER N.V. PREFERENCE SHARES TENDERED AFTER POST-ACCEPTANCE PERIOD​",
        "date": "11032017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever Plc says ‍99 pct of all Unilever N.V. preference shares tendered after post-acceptance period​ "
    },
    {
        "content": "* ‍DECLARES OFFER FOR ALL PREFERENCE SHARES IN UNILEVER N.V. UNCONDITIONAL​ Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever declares offer for all pref shares "
    },
    {
        "content": "* UNILEVER PLC - FOLLOWING BRITVIC’S ANNOUNCEMENT TO CLOSE MANUFACTURING SITE IN NORWICH  UNILEVER WILL BE LAUNCHING REVIEW OF ITS PRODUCTION AT THE SITE‍​",
        "date": "10032017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever says to review Norwich manufacturing site  options include potential closure "
    },
    {
        "content": "CHICAGO  Oct 2 U.S. agricultural trader Archer Daniels Midland Co on Monday denied a report that it was bidding on Unilever Plc's spreads business  which includes Flora and Stork margarines.",
        "date": "10022017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "ADM says it's not bidding for Unilever's spreads business "
    },
    {
        "content": "Oct 3 Britain's FTSE 100 index is seen opening 3 points higher on Tuesday  according to financial bookmakers  with futures up 0.1 percent ahead of the cash market open.",
        "date": "10032017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Oct 3 "
    },
    {
        "content": "    Oct 3 Britain's FTSE 100 index is seen opening 3 points higher on Tuesday  according to financial bookmakers.          * EU TELECOMS: European Union lawmakers have dashed large telecoms companies' hopes for lighter regulation as part of efforts to encourage investment in superfast internet networks.     * UNILEVER: U.S. agricultural trader Archer Daniels Midland Co on Monday denied a report that it was bidding on Unilever Plc's spreads business  which includes Flora and Stork mar",
        "date": "10032017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UK Stocks-Factors to watch on Oct 3 "
    },
    {
        "content": "* Announces agreement to acquire Brazilian natural and organic food business MAE TERRA; terms of deal not disclosed Source text: http://bit.ly/2fEYvWg Further company coverage:",
        "date": "10022017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Unilever says agreed to acquire Brazilian organic food business Mae Terra "
    },
    {
        "content": "SEOUL/LONDON Unilever  has agreed to pay 2.27 billion euros ($2.71 billion) to buy fast-growing cosmetics company Carver Korea in its latest move to build a global beauty business. | Video ",
        "date": "09252017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "Unilever steps up beauty push with $2.7 billion Carver Korea deal "
    },
    {
        "content": "LONDON  Sept 22 Unilever  and South African investment holding company Remgro on Friday announced a 11.9 billion rand ($901 million) deal that sees Unilever trade its spreads business in southern Africa for Remgro's stake in its South African subsidiary.",
        "date": "09222017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "RPT-Unilever strikes deal over South African spreads business "
    },
    {
        "content": "Sept 20 A group of consumer goods makers and retailers including Kellogg Co  Wal-Mart Stores Inc   Nestle SA and Unilever Plc plans to simplify and standardize food date labels to reduce food wastage.",
        "date": "09202017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Food companies to standardize date labels "
    },
    {
        "content": "* Says Carver is S.Korea's fastest-growing cosmetics business",
        "date": "09252017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UPDATE 3-Unilever steps up beauty push with $2.7 bln Carver Korea deal "
    },
    {
        "content": "SEOUL  Sept 25 Unilever  has agreed to buy a majority stake in South Korean cosmetics firm Carver Korea for $2.9 billion from a consortium of Goldman Sachs and Bain Capital Private Equity  Seoul Economic Daily reported on Monday.",
        "date": "09252017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Unilever to buy majority stake in Carver Korea for $2.9 bln-Seoul Economic Daily "
    },
    {
        "content": "* ‍PROPOSED DISPOSAL OF 25.75% SHAREHOLDING IN UNILEVER SA AND ACQUISITION OF SOUTHERN AFRICA SPREADS PORTFOLIO​",
        "date": "09222017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Remgro says ‍proposed disposal of 25.75% shareholding in Unilever SA "
    },
    {
        "content": "* UNILEVER - ‍BONDS COMPRISE £250 000 000 OF 1.375 PER CENT FIXED RATE NOTES DUE SEPTEMBER 2024 AND £250 000 000 OF 1.875 PER CENT FIXED RATE NOTES DUE SEPT 2029​",
        "date": "09112017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever prices 500 mln stg bonds on sterling market "
    },
    {
        "content": "* Unilever exec says innovation team has reduced number of global projects by 10 percent this year  but increased size of projects by 20 percent",
        "date": "09062017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever exec gives update on savings  efficiencies "
    },
    {
        "content": "Aug 20 Warren Buffett takes pride in naming his price to buy a company  and not paying a nickel more.",
        "date": "08202017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Bankruptcy fight over Oncor to test Warren Buffett's discipline "
    },
    {
        "content": "LONDON  Aug 9 Unilever has agreed to buy certain of its Dutch preference shares and to launch a public offer for the rest that would value them at 450 million euros  as the Anglo-Dutch consumer goods company seeks to simplify its capital structure.",
        "date": "08092017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "Unilever to buy back Dutch preference shares "
    },
    {
        "content": "July 27 Procter & Gamble Co  which is under pressure from activist investor Nelson Peltz  reported another quarter of market-beating profit  helped by cost-cutting  and forecast a full-year profit that topped estimates.",
        "date": "07272017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UPDATE 3-P&G delivers profit  sales beat amid activist pressure "
    },
    {
        "content": "* Unilever ceo says to continue to target m&a across its portfolio",
        "date": "07202017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever cfo says forex would add 1 percent to turnover  2 percent to eps if current spot rates applied for the full year "
    },
    {
        "content": "* Interview-Unilever cfo says margin growth in h2 to be below h1  due to investments in innovation",
        "date": "07202017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Interview-Unilever cfo says more likely that developed market spreads business has more interest from private equity "
    },
    {
        "content": "June 30 The downsized initial public offering of Blue Apron Holdings Inc  the first U.S. meal-kit company to go public  may have disappointed venture capital investors  but food companies with stakes in the sector may still see returns in the form of insight into changing eating habits.",
        "date": "06302017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Big Food hungry for meal kits  despite Blue Apron IPO flop "
    },
    {
        "content": "* Terms of the deal to buy luxury colour cosmetics brand Hourglass were not disclosed Further company coverage:",
        "date": "06192017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever says to buy luxury cosmetics brand Hourglass "
    },
    {
        "content": "* Has on 2 May 2017 priced a quadruple-tranche $3.15 billion bond on u.s. Market",
        "date": "05032017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever prices $3.15 billion bond on the U.S. market "
    },
    {
        "content": "* 95.83 percent votes cast in favor of to approve directors' remuneration policy at AGM  4.17 percent against Source text for Eikon: Further company coverage:",
        "date": "04272017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever says AGM approve directors' remuneration policy "
    },
    {
        "content": "* Signed an agreement to acquire Sir Kensington's  a New York-based condiment maker",
        "date": "04202017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever to buy U.S.-based condiment maker Sir Kensington's "
    },
    {
        "content": "* Unilever cfo says will struggle to get brazil volumes to rise this year  but do expect rise for latin america overall",
        "date": "04202017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Unilever cfo says asia improvement helped by easing laundry battle and e-commerce growth in china  return of pricing growth overall "
    },
    {
        "content": "* Unilever cfo says lead time on new product innovations has been shortened",
        "date": "04202017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Unilever cfo says improvement in pricing looks sustainable  as it is a return to stable pricing from more volatility previously "
    },
    {
        "content": "* Interview-Unilever cfo says q1 results helped by business units sticking to \"business as usual\" during review",
        "date": "04202017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Unilever CFO comments on outlook  spreads unit sale "
    },
    {
        "content": "* Unilever cfo says will now report two margin measures  excluding restructuring costs  for better comparability",
        "date": "04062017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever executive comments "
    },
    {
        "content": "* Interview-Unilever cfo says have spoken to top 50 shareholders ahead of our review",
        "date": "04062017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Interview-Unilever CFO comments on strategy "
    },
    {
        "content": "* Combining foods and refreshment into one organisation  unlocking future growth and faster margin progression",
        "date": "04062017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Unilever to sell spreads business  launch buy-back "
    },
    {
        "content": "* Louise fresco will be retiring from Unilever boards at conclusion of 2017 AGMS  Source text for Eikon:  Further company coverage:",
        "date": "03092017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever says Louise Fresco will be retiring from boards "
    },
    {
        "content": "JOHANNESBURG South Africa's competition watchdog recommended a fine equivalent to 10 percent of Unilever's local turnover for price fixing of edible oils and margarine  it said on Wednesday.",
        "date": "03012017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "South Africa's antitrust watchdog seeks fine for Unilever "
    },
    {
        "content": "JOHANNESBURG  March 1 South Africa's competition watchdog recommended a fine equivalent to 10 percent of Unilever's local turnover for price fixing of edible oils and margarine  it said on Wednesday.    The Competition Commission said it had completed an investigation  which began in 2014 when it raided the local units of Unilever Plc and Sime Darby Bhd because it suspected price fixing.",
        "date": "03012017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UPDATE 1-South Africa's antitrust watchdog seeks fine for Unilever "
    },
    {
        "content": "* Unilever CFO at CAGNY Conference - \"It was clear to us that kraft bid substantially undervalued Unilever\"",
        "date": "02242017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever CFO says Kraft bid was \"trigger moment\" for co  will not waste it "
    },
    {
        "content": "Feb 23 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02232017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "PRESS DIGEST- British Business - Feb 23 "
    },
    {
        "content": "* Management of Unilever now expects core operating margin improvement for 2017 to be at upper end of its 40-80 basis points guidance  Source text for Eikon: Further company coverage:   (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "02222017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever sees 2017 core operating margin at upper end of guidance "
    },
    {
        "content": "Acquire  slash costs  repeat. Billionaire investor Warren Buffet and buyout firm 3G Capital's failed $143 billion bid to combine their food conglomerate Kraft Heinz Co  with Unilever Plc  shows their winning formula now needs a growth boost.",
        "date": "02202017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "Kraft's failed Unilever bid shows it needs growth over cost cuts "
    },
    {
        "content": "Feb 19 Kraft Heinz Co has agreed to withdraw its proposal for a $143 billion merger with larger rival Unilever Plc  the companies said on Sunday.",
        "date": "02192017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Kraft withdraws offer to merge with Unilever "
    },
    {
        "content": "* Fed's Mester talks rate hikes at start of busy week for speeches",
        "date": "02202017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "GLOBAL MARKETS-Asia shares adrift for US holiday  focus on Unilever "
    },
    {
        "content": "LONDON British Prime Minister Theresa May has asked top officials to examine U.S. food company Kraft Heinz's  proposed takeover of Unilever Plc   the Financial Times reported on Sunday without citing any sources.",
        "date": "02192017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UK PM May orders officials to examine Kraft Heinz bid for Unilever: FT "
    },
    {
        "content": "LONDON  Feb 19 British Prime Minister Theresa May has asked top officials to examine U.S. food company Kraft Heinz's proposed takeover of Unilever Plc  the Financial Times reported on Sunday without citing any sources.",
        "date": "02192017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UK PM May orders officials to examine Kraft Heinz bid for Unilever -FT "
    },
    {
        "content": "LONDON U.S. food company Kraft Heinz Co made a surprise $143 billion offer for Unilever Plc in a bid to build a global consumer goods giant  although it was flatly rejected on Friday by the maker of Lipton tea and Dove soap.",
        "date": "02182017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "Kraft Heinz bids $143 bln for Unilever in global brand grab "
    },
    {
        "content": "NEW YORK U.S. food company Kraft Heinz Co  withdrew its proposal for a $143-billion merger with larger rival Unilever Plc   the companies said on Sunday  raising questions about whether Kraft will turn its focus to another target.",
        "date": "02202017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Kraft walks away from 'friendly' bid for Unilever "
    },
    {
        "content": "NEW YORK  Feb 19 U.S. food company Kraft Heinz Co withdrew its proposal for a $143-billion merger with larger rival Unilever Plc  the companies said on Sunday  raising questions about whether Kraft will turn its focus to another target.",
        "date": "02202017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UPDATE 5-Kraft walks away from 'friendly' bid for Unilever "
    },
    {
        "content": "LONDON U.S. food company Kraft Heinz Co made a surprise $143 billion offer for Unilever Plc in a bid to build a global consumer goods giant  although it was flatly rejected on Friday by the maker of Lipton tea and Dove soap. | Video ",
        "date": "02182017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Kraft Heinz bids $143 billion for Unilever in global brand grab "
    },
    {
        "content": "* Unilever shares touch record high; Kraft Heinz stock up 10 pct   (Adds Moody's note)",
        "date": "02182017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UPDATE 8-Kraft Heinz bids $143 bln for Unilever in global brand grab "
    },
    {
        "content": "* Has priced 1.2 billion euro in bonds on european markets today",
        "date": "02082017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever issues 1.2 bln euro bonds on European markets "
    },
    {
        "content": "* Bonds comprise 350 000 000 stg of 1.125 per cent fixed rate notes due February 2022",
        "date": "01302017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever issues bonds worth 350 mln stg "
    },
    {
        "content": "* Unilever cfo says at current exchange rates  currency would be neutral on turnover in 2017  and have a slight positive effect on eps",
        "date": "01262017",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever cfo sees mid single-digit rise in commodity costs in 2017  with a bigger rise in the first half "
    },
    {
        "content": "* Interview-Unilever cfo sees 2017 sales growth in range of 3-5 percent",
        "date": "01262017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Interview-Unilever cfo seesq1 sales below 3-5 percent range  but pace picking up as year progresses "
    },
    {
        "content": "* Full year underlying sales growth 3.7%  ahead of our markets  with price up 2.8% and volume up 0.9%",
        "date": "01262017",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Unilever q4 underlying sales growth 2.2 percent "
    },
    {
        "content": "* Case has now been heard and we have received an adverse judgement by Brazilian Judicial Court",
        "date": "11252016",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever says to appeal judgement in Brazil tax case "
    },
    {
        "content": "HAVANA  Nov 4 Communist-ruled Cuba and global consumer products company Unilever Plc on Friday started work on their new $35 million soap and toothpaste factory  a joint venture in the Mariel special development zone west of Havana.",
        "date": "11042016",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Cuba  Unilever start work on joint soap and toothpaste factory "
    },
    {
        "content": "Oct 13 Unilever Plc CFO on an analyst conference call:",
        "date": "10132016",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever CFO says confident Tesco dispute to end soon "
    },
    {
        "content": "* Priced a dual-tranche $1.25 billion bond on u.s. market. $550 million 1.375 per cent fixed rate notes are due 28 july 2021  with a further $700 million 2.0 per cent fixed rate notes due 28 july 2026.  Source text for Eikon:  Further company coverage:    (Reporting By UK Bureau)",
        "date": "07262016",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever prices $1.25 bln bond on U.S. market "
    },
    {
        "content": "Unilever Plc  is to buy U.S.-based Dollar Shave Club  expanding its presence in the growing market for male grooming products and sharpening its rivalry with Procter & Gamble  which owns the Gillette brand.",
        "date": "07202016",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Unilever sharpens P&G rivalry by buying Dollar Shave Club "
    },
    {
        "content": "* Edgwell now a less attractive an M&A target for others   (Adds Breakingviews link)",
        "date": "07202016",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UPDATE 3-Unilever sharpens P&G rivalry by buying Dollar Shave Club "
    },
    {
        "content": "July 19 Unilever Plc said it has agreed to buy razor-maker Dollar Shave Club in a deal that would expand the consumer goods group's catalogue of men's grooming products.",
        "date": "07202016",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Unilever buys razor-maker Dollar Shave Club "
    },
    {
        "content": "* Says DSC is on track to exceed $200 million in turnover in 2016.",
        "date": "07202016",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "BRIEF-Unilever acquires Dollar Shave Club "
    },
    {
        "content": "KIGALI  May 10 Unilever Plc's < Rwandan subsidiary plans to invest up to $50 million to set up a tea processing factory  develop two tea estates and support small-scale producers in the African country  it said on Tuesday.",
        "date": "05102016",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "Unilever to invest $50 mln in tea factory in Rwanda "
    },
    {
        "content": "* Bonds comprise EUR 300 million of 0 percent fixed rate notes due April 2020  EUR 500 million of 0.5 percent fixed rate notes due April 2024",
        "date": "04252016",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever prices EUR 1.5 bln bonds on european markets "
    },
    {
        "content": "* \u007fIt is proposed that Dr. Marijn Dekkers will succeed Michael Treschow as chairman of Unilever N.V. and Unilever Plc\u007f",
        "date": "02242016",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever says \u007fMarijn Dekkers to succeed Michael Treschow as chairman in April 2016\u007f "
    },
    {
        "content": "HAVANA  Jan 11 Global consumer products company Unilever Plc  will return to Cuba after a several-year absence  agreeing on Monday to build a $35 million soap and toothpaste factory in Cuba's special development zone at the port of Mariel west of Havana.",
        "date": "01112016",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Unilever returns to Cuba in joint venture with state "
    },
    {
        "content": "* Unilever East Africa has entered into a Memorandum of Understanding with Tatu City Limited for acquisition of 70 acres of industrial land",
        "date": "11122015",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever East Africa enters into MoU with Tatu City "
    },
    {
        "content": "MUMBAI Weakening rural demand and low pricing hurt Hindustan Unilever Ltd  as the Indian unit of Anglo-Dutch consumer group Unilever Plc   missed market expectations for quarterly profit  sending its shares down almost 5 percent on Tuesday.",
        "date": "07212015",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "Slowing demand in rural India hurts Hindustan Unilever profit "
    },
    {
        "content": "* Q1 net 10.59 bln rupees versus 11.35 bln estimate of analysts",
        "date": "07212015",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "UPDATE 1-Slowing demand in rural India hurts Hindustan Unilever profit "
    },
    {
        "content": "MUMBAI  July 21 Hindustan Unilever Ltd  the Indian unit of Anglo-Dutch consumer group Unilever Plc    reported a quarterly profit that missed market expectations as customers continued to be thrifty on purchases of soaps  shampoos and other personal care products.",
        "date": "07212015",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Hindustan Unilever misses quarterly profit estimates "
    },
    {
        "content": "* Unilever issues 1.25 billion euros bonds on European markets",
        "date": "05272015",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever issues 1.25 bln euros bonds on European markets "
    },
    {
        "content": "May 8 Hindustan Unilever Ltd  the Indian unit of Anglo-Dutch consumer group Unilever Plc    reported a higher quarterly profit that beat market expectations as shoppers bought more of its soaps  shampoos and other personal care products after months of thrift.",
        "date": "05082015",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "UPDATE 1-Hindustan Unilever profit tops as Indians spend more on personal care "
    },
    {
        "content": "May 8 Hindustan Unilever Ltd  the Indian unit of Anglo-Dutch consumer group Unilever Plc    reported a better-than-expected quarterly profit as shoppers bought more of its soaps  shampoos and other domestic products.",
        "date": "05082015",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Hindustan Unilever posts bigger quarterly profit as demand grows "
    },
    {
        "content": "* Has acquired leading independent prestige skincare brand  Kate Somerville Skincare LLC",
        "date": "05062015",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "BRIEF-Unilever buys U.S. skincare brand Kate Somerville "
    },
    {
        "content": "The Court of Tax Appeals has approved a compromise agreement between the City of Manila and the local arm of consumer goods group Unilever Plc  settling a 10-year dispute over the latter's 284.15 million pesos ($6.38 million) refund claim  BusinessWorld reported  citing an eight-page resolution dated Jan. 5. (http://bit.ly/1DWeZAx)",
        "date": "01202015",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "PHILIPPINES PRESS-Tax court approves settlement of Unilever  Manila city council - BusinessWorld "
    },
    {
        "content": "* Shares fall more than 5 percent   (Adds comments on consumer sentiment)",
        "date": "01192015",
        "name": "Unilever PLC",
        "news_type": "topStory",
        "symbol": "UL",
        "title": "UPDATE 2-Hindustan Unilever cuts prices as thrifty shoppers hurt volumes "
    },
    {
        "content": "MUMBAI  Jan 19 Hindustan Unilever Ltd  the Indian unit of Anglo-Dutch consumer group Unilever Plc    reported an 18 percent rise in quarterly profit  beating estimates  helped by a revival in consumer spending and lower raw material costs.",
        "date": "01192015",
        "name": "Unilever PLC",
        "news_type": "normal",
        "symbol": "UL",
        "title": "Hindustan Unilever Q3 profit beats estimates as India shoppers buy more "
    }
]