[
    {
        "content": "AMSTERDAM Dutch Prime Minister Mark Rutte on Wednesday returned to parliament for the second time in a week to defend a tax cut that benefits Anglo-Dutch multinationals and British equity investors in general.",
        "date": "11152017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Dutch PM defends tax cut seen benefiting Shell  Unilever  UK investors "
    },
    {
        "content": "AMSTERDAM  Nov 15 Dutch Prime Minister Mark Rutte on Wednesday returned to parliament for the second time in a week to defend a tax cut that benefits Anglo-Dutch multinationals and British equity investors in general.",
        "date": "11152017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Dutch PM defends tax cut seen benefiting Shell  Unilever  UK investors "
    },
    {
        "content": "* Swiss firm under pressure from activist shareholder (Adds details on market growth  other companies)",
        "date": "11152017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 3-Nestle shakes up infant nutrition to tackle local rivals "
    },
    {
        "content": "* ‍99% OF ALL UNILEVER N.V. PREFERENCE SHARES TENDERED AFTER POST-ACCEPTANCE PERIOD​",
        "date": "11032017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "BRIEF-Unilever Plc says ‍99 pct of all Unilever N.V. preference shares tendered after post-acceptance period​ "
    },
    {
        "content": "Unilever   said on Thursday it would buy the specialty tea brand Tazo from Starbucks in a deal valued at $384 million.",
        "date": "11022017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever to buy tea brand Tazo from Starbucks for $384 million "
    },
    {
        "content": "Nov 2 Unilever  said on Thursday it would buy the specialty tea brand Tazo from Starbucks in a deal valued at $384 million.",
        "date": "11022017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever to buy tea brand Tazo from Starbucks for $384 mln "
    },
    {
        "content": "* Starbucks drives single tea brand strategy with Teavana; sells Tazo brand to Unilever",
        "date": "11022017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Starbucks ‍enters agreement for Unilever to acquire assets of Tazo brand "
    },
    {
        "content": "AMSTERDAM  Oct 27 The e-commerce director of Ahold Delhaize is leaving the Dutch-Belgian grocer to join Unilever  bringing online expertise at a time when packaged goods makers are figuring out how best to harness the trend of internet and digital shopping.",
        "date": "10272017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Ahold Delhaize's e-commerce chief leaves for Unilever "
    },
    {
        "content": "LONDON  Oct 26 Consumer goods maker Unilever announced on Thursday that its offer to buy back the bulk of its Dutch preference shares for about 450 million euros had been declared unconditional  marking a step toward its goal of simplifying its capital structure.",
        "date": "10262017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever to settle Dutch preference shares buyout "
    },
    {
        "content": "* ‍DECLARES OFFER FOR ALL PREFERENCE SHARES IN UNILEVER N.V. UNCONDITIONAL​ Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Unilever declares offer for all pref shares "
    },
    {
        "content": "* Blackstone/CVC team  BC Partners no longer in race - sources",
        "date": "10252017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "RPT-UPDATE 1-At least three buyout groups seen advancing in Unilever spreads auction - sources "
    },
    {
        "content": "LONDON At least three bidders are expected to be shortlisted for the second round of an auction for Unilever's   margarine and spreads business while two other private equity groups are no longer in the fray  sources told Reuters.",
        "date": "10242017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "At least three buyout groups seen advancing in Unilever spreads auction: sources "
    },
    {
        "content": "Oct 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "10242017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Blackstone/CVC team  BC Partners no longer in race - sources",
        "date": "10242017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-At least three buyout groups seen advancing in Unilever spreads auction - sources "
    },
    {
        "content": "LONDON  Oct 24 At least three bidders are expected to be shortlisted for the second round of an auction for Unilever's  margarine and spreads business while two other private equity groups are no longer in the fray  sources told Reuters.",
        "date": "10242017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "At least three buyout groups seen advancing in Unilever spreads auction - sources "
    },
    {
        "content": "LONDON Unilever   reported disappointing third-quarter sales having lost market share to smaller rivals  dampening hopes that a failed takeover bid by Kraft Heinz  would spark a swift improvement in performance. | Video ",
        "date": "10192017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever sales fall short as competition bites big brands "
    },
    {
        "content": "* Bids for spreads business due on Thursday - sources (Adds CFO comments  background  link to Breakingviews column)",
        "date": "10192017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 3-Unilever sales fall short as competition bites big brands "
    },
    {
        "content": "LONDON  Oct 19 Bankers are working on debt financings of up to €5bn to back a potential sale of the margarine and spreads business of Anglo-Dutch consumer group Unilever  banking sources said.",
        "date": "10192017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "LPC-Banks line up approx €5bn debt for Unilever spreads sale "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Unilever’s struggle gives hope to predators. The consumer giant that fended off a bid from Kraft Heinz earlier this year reported weak third-quarter sales on Thursday. Chief Executive Paul Polman is sprucing up brands  but the more pedestrian Unilever’s performance  the more vulnerable it becomes.",
        "date": "10192017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Breakingviews - Unilever struggle gives hope to predators "
    },
    {
        "content": "LONDON European shares fell across on Thursday as Spain's political showdown with Catalonia deepened  and a batch of third-quarter results brought some disappointments for investors.",
        "date": "10192017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares fall on Catalonia standoff  disappointing Q3 earnings "
    },
    {
        "content": "LONDON  Oct 19 European shares edged down across most bourses and sectors on Thursday as a new batch of third-quarter results brought in some disappointments to investors  notably forecast misses from France's Publicis  Dutch-British Unilever and Germany's Kion.",
        "date": "10192017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares dip as new batch of Q3 earnings unveils disappointments "
    },
    {
        "content": "LONDON  Oct 19 Consumer goods maker Unilever reported a 2.6 percent rise in underlying third-quarter sales on Thursday  blaming poor weather in Europe and natural disasters in the Americas.",
        "date": "10192017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever blames poor weather for slowing growth "
    },
    {
        "content": "Oct 5 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "10052017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Oct 3 Britain's Britvic Plc announced the closure of its Norwich factory on Tuesday  putting 240 jobs at risk and prompting fellow consumer goods producer Unilever to warn it might follow suite with a neighbouring plant.",
        "date": "10032017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "UPDATE 2-Britvic cuts 240 jobs in Norwich closure  Unilever could follow "
    },
    {
        "content": "LONDON Anglo-Dutch consumer group Unilever  has invited private equity bidders to submit tentative offers for its $8 billion margarine and spreads business by a deadline of Oct. 19  two sources close to the matter told Reuters.",
        "date": "10052017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever spreads whets private equity appetite as deadline nears: sources "
    },
    {
        "content": "LONDON  Oct 5 Anglo-Dutch consumer group Unilever has invited private equity bidders to submit tentative offers for its $8 billion margarine and spreads business by a deadline of Oct. 19  two sources close to the matter told Reuters.",
        "date": "10052017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever spreads whets private equity appetite as deadline nears - sources "
    },
    {
        "content": "Oct 3 Unilever said on Tuesday it was considering options including closing its factory in Norwich after Britvic announced it would end operations on the same site.",
        "date": "10032017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever could shut Norwich plant after Britvic withdrawal "
    },
    {
        "content": "* UNILEVER NV ISSUES BONDS AMOUNTING TO GBP 250 MILLION  THAT WILL BE LISTED ON EURONEXT AMSTERDAM AS OF SEPT. 15 - EURONEXT",
        "date": "09142017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "BRIEF-Unilever issues bonds amounting to 250 million pounds "
    },
    {
        "content": "LONDON Nestle  and Unilever  both snapped up small  artisanal brands on Thursday  part of a drive by big food firms to boost slowing sales with products seen as ethical or healthy.",
        "date": "09072017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Nestle  Unilever think small in Big Food's sales quest "
    },
    {
        "content": "* Deals show appetite for healthy  ethical products (Adds context  analyst comment  bullet points)",
        "date": "09072017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Nestle  Unilever think small in Big Food's sales quest "
    },
    {
        "content": "* ANNOUNCED TODAY THAT IT HAS ACQUIRED THE ORGANIC HERBAL TEA BUSINESS  PUKKA HERBS LTD‍​",
        "date": "09072017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Unilever acquires Pukka Herbs‍​ "
    },
    {
        "content": "LONDON  Sept 7 Unilever has acquired Pukka herbal teas  the latest in a string of deals by the Anglo-Dutch consumer giant to add smaller brands promoted as artisanal or healthy.",
        "date": "09072017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever adds Pukka herbal tea to drinks portfolio "
    },
    {
        "content": "LONDON  Aug 9 Unilever has agreed to buy certain of its Dutch preference shares and to launch a public offer for the rest that would value them at 450 million euros  as the Anglo-Dutch consumer goods company seeks to simplify its capital structure.",
        "date": "08092017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever to buy back Dutch preference shares "
    },
    {
        "content": "LONDON  Aug 9 Unilever has agreed to buy back the bulk of its Dutch preference shares and to launch a public offer for the rest  valuing them at 450 million euros  as the Anglo-Dutch consumer goods company seeks to simplify its capital structure.",
        "date": "08092017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Unilever to buy back Dutch preference shares "
    },
    {
        "content": "* ENTERED INTO A DEFINITIVE AGREEMENT TO ACQUIRE WEIS  AN AUSTRALIAN ICE CREAM BUSINESS",
        "date": "08092017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Unilever acquires Weis  an Australian ice cream business "
    },
    {
        "content": "* SIGNED AN IRREVOCABLE AGREEMENT WITH UNILEVER PLC TO ACCEPT A PUBLIC OFFER FOR THE OUTSTANDING 6% AND 7% CUMULATIVE PREFERENCE SHARES IN UNILEVER N.V.",
        "date": "08092017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-NN Group sells preference shares Unilever‍​ "
    },
    {
        "content": "FRANKFURT A German union said cost cuts at Unilever   could lead to up to 1 000 job cuts and possibly the closure of some of its eight factories in Germany.",
        "date": "07312017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever could axe up to 1 000 jobs in Germany: union "
    },
    {
        "content": "FRANKFURT  July 31 A German union said cost cuts at Unilever  could lead to up to 1 000 job cuts and possibly the closure of some of its eight factories in Germany.",
        "date": "07312017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever could axe up to 1 000 jobs in Germany - union "
    },
    {
        "content": "* Clayton Dubilier & Rice and Bain Capital have begun working together on an offer for Unilever's spreads business - Sky News",
        "date": "07252017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "BRIEF-Clayton Dubilier & Rice and Bain Capital have begun working together on an offer for Unilever's spreads business - Sky News "
    },
    {
        "content": "LONDON Unilever   lifted its annual profitability  target on Thursday after cost cuts led to a big improvement in the first half of the year  showing it can boost returns after rebuffing a $143 billion takeover bid. | Video ",
        "date": "07202017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever lifts margin target as industry pressure mounts "
    },
    {
        "content": "* Anglo-Dutch firm's London-listed shares up 1.2 pct (Adds comments on activism  links to other stories)",
        "date": "07202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 3-Unilever lifts margin target as industry pressure mounts "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Unilever is half way there on its Kraft Heinz challenge. The Anglo-Dutch owner of Dove soap and Ben & Jerry’s ice cream cut costs faster than expected in the first half of the year by reducing ad spend and paying its suppliers less. Its 20 percent operating margin target looks reachable. Yet with U.S. rival Kraft Heinz free to go hostile next month  volume growth remains too low for comfort.",
        "date": "07202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever is half way there on Kraft challenge "
    },
    {
        "content": "LONDON Unilever  Chief Executive Paul Polman on Thursday will ask British Prime Minister Theresa May to give businesses more time to adapt to Brexit.",
        "date": "07202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever CEO to ask UK's May for extended Brexit transition "
    },
    {
        "content": "LONDON Anglo-Dutch conglomerate Unilever  is vying with U.S. canned meat producer Hormel Foods Corp  to buy the foods division of British consumer goods maker Reckitt Benckiser  the Sunday Times newspaper reported  citing sources.",
        "date": "07152017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever vies with Hormel to buy Reckitt food unit: Sunday Times "
    },
    {
        "content": "LONDON  July 15 Anglo-Dutch conglomerate Unilever is vying with U.S. canned meat producer Hormel Foods Corp to buy the foods division of British consumer goods maker Reckitt Benckiser  the Sunday Times newspaper reported  citing sources.",
        "date": "07152017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever vies with Hormel to buy Reckitt food unit -Sunday Times "
    },
    {
        "content": "LONDON  June 15 Unilever plans to kick off the auction for its margarine and spreads business this autumn  its chief financial officer said on Thursday.",
        "date": "06152017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever to start auction of spreads business in the autumn "
    },
    {
        "content": "LONDON  May 15 Unilever plans to buy a range of personal and home care brands from Latin American company Quala  it said on Monday.",
        "date": "05152017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever to buy Latin American personal care brands from Quala "
    },
    {
        "content": "LONDON  May 18 Unilever  will launch its previously announced share buyback program on Friday  with plans to purchase 1.5 billion to 2.5 billion euros worth of London-listed shares  and the balance of the 5 billion euro program on its Dutch shares.",
        "date": "05182017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever to kick off share buyback this week "
    },
    {
        "content": "May 8 Warren Buffett said on Monday that United Airlines made a \"terrible mistake\" in handling the fallout after a man was forcibly dragged off a United flight  a bloody confrontation that sparked global outrage.",
        "date": "05082017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Buffett: United made 'terrible mistake' with dragged passenger-CNBC "
    },
    {
        "content": "May 8 Warren Buffett said on Monday 3G Capital  its controversial partner on multiple transactions  follows a \"standard capitalist formula\" when it sweeps away thousands of jobs and imposes deep expense cuts to make the companies it buys more efficient.",
        "date": "05082017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Buffett says deal partner 3G follows 'standard capitalist formula'-CNBC "
    },
    {
        "content": "May 3 As the United States adapts to the presidency of Donald Trump and faces rising tensions abroad  Berkshire Hathaway Inc shareholders will descend on Omaha  Nebraska this weekend seeking reassurance  from Warren Buffett.",
        "date": "05032017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "RPT-Buffett to face big crowd as Berkshire grows bigger "
    },
    {
        "content": "LONDON  May 4 Banks are putting together around €4bn-equivalent of debt financing to back a potential sale of Anglo-Dutch consumer group Unilever’s margarine and spreads business  banking source said.",
        "date": "05042017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "LPC-Banks line up €4bn debt for Unilever spreads sale "
    },
    {
        "content": "May 3 As the United States adapts to the presidency of Donald Trump and faces rising tensions abroad  Berkshire Hathaway Inc shareholders will descend on Omaha  Nebraska this weekend seeking reassurance  from Warren Buffett.",
        "date": "05032017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Buffett to face big crowd as Berkshire grows bigger "
    },
    {
        "content": "SINGAPORE  May 4 Consumer goods maker Unilever signed a joint venture deal with Myanmar's Europe and Asia Commercial Co Ltd (EAC)  combining their home and personal care businesses to accelerate sales in a newly emerging market.",
        "date": "05042017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever forms Myanmar JV for home and personal care products "
    },
    {
        "content": "LONDON Unilever   reported a surprise pick up in quarterly sales growth on Thursday  boosting its argument that it can improve performance on its own after spurning a $143 billion takeover offer from Kraft Heinz  in February. | Video ",
        "date": "04202017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Sales beat boosts Unilever's argument to go it alone "
    },
    {
        "content": "* Shares up 1.5 percent (Adds comments  share activity  background  bullet points)",
        "date": "04202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Sales beat boosts Unilever's argument to go it alone "
    },
    {
        "content": "LONDON  April 20 European shares inched up on Thursday as strong results from Unilever lifted bluechip consumers staple stocks and helped offset weakness in the energy sector.",
        "date": "04202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever  Man Group strength boosts European stocks "
    },
    {
        "content": "ZURICH Swiss food giant Nestle maintained its modest 2-4 percent growth target for underlying sales this year  slightly less than Anglo-Dutch rival Unilever   after growth in the first quarter was hit by weak consumer demand for packaged foods in North America and weaker prices in western Europe.",
        "date": "04202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Nestle settles for modest sales growth target after first-quarter slowdown "
    },
    {
        "content": "LONDON Unilever   and Reckitt Benckiser Group  have picked Morgan Stanley  to advise on their planned food brand disposals  sources said on Thursday  giving the U.S. investment bank a seat at two of the consumer industry's most sought-after tables.",
        "date": "04132017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Morgan Stanley bags big spots on Unilever  Reckitt deals: sources "
    },
    {
        "content": "LONDON  April 13 Unilever  and Reckitt Benckiser Group have picked Morgan Stanley to advise on their planned food brand disposals  sources said on Thursday  giving the U.S. investment bank a seat at two of the consumer industry's most sought-after tables.",
        "date": "04132017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Morgan Stanley bags big spots on Unilever  Reckitt deals - sources "
    },
    {
        "content": "April 20 Britain's blue chip FTSE 100 index is seen opening down 0.16 percent at 7103 points on Thursday  according to financial spreadbetters  with futures down 0.1 percent ahead of the cash market open.",
        "date": "04202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-UK Stocks-Factors to watch on April 20 "
    },
    {
        "content": "LONDON  April 20 Consumer goods maker Unilever reported better than expected first-quarter sales on Thursday  helped by pricing growth.",
        "date": "04202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever first-quarter sales top expectations "
    },
    {
        "content": "(The following statement was released by the rating agency) MILAN/LONDON  April 12 (Fitch) Fitch Ratings has revised the Outlook for Unilever NV and Unilever PLC (together Unilever) to Negative from Stable. The Long-Term Issuer Default Ratings (IDRs) and senior unsecured ratings for Unilever are affirmed at 'A+' and the Short-Term IDRs at 'F1'. The senior unsecured ratings of Unilever Capital Corporation (UCC) and Alberto-Culver Co. are affirmed at 'A+'  and the commercial paper programmes of Un",
        "date": "04122017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Fitch Revises Unilever Outlook to Negative; Affirms at 'A+' "
    },
    {
        "content": "LONDON  April 13 Anglo-Dutch consumer group Unilever has decided to work with Morgan Stanley and Goldman Sachs on the sale of its margarine and spreads business  which was announced last week  sources told Reuters on Thursday.",
        "date": "04132017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever picks Morgan Stanley and Goldman to sell spreads business- sources "
    },
    {
        "content": "LONDON Unilever  promised shareholders a multi-billion euro rewards package on Thursday after February's $143 billion takeover offer from Kraft Heinz jolted it into a corporate makeover aimed at proving it can go it alone.",
        "date": "04062017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Galvanised by Kraft  Unilever keeps shareholders sweet with cash "
    },
    {
        "content": "LONDON Unilever   promised shareholders a multi-billion euro rewards package on Thursday after February's $143 billion takeover offer from Kraft Heinz  jolted it into a corporate makeover aimed at proving it can go it alone. | Video ",
        "date": "04062017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Galvanized by Kraft  Unilever keeps shareholders sweet with cash "
    },
    {
        "content": "* Combining foods/refreshment businesses into one organization (Adds comments  background)",
        "date": "04062017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 5-Galvanised by Kraft  Unilever keeps shareholders sweet with cash "
    },
    {
        "content": "LONDON  April 6 Unilever  said on Thursday it will exit its shrinking spreads business  increase its margin targets  raise its dividend and review its dual-headed legal structure  as it aims to prove it can deliver near-term growth on its own  following its swift rejection in February of a takeover proposal by Kraft Heinz.",
        "date": "04062017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever announces results of business review "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - For fans of explicitly ethical stakeholder capitalism  Unilever’s rebuttal of a takeover approach by Kraft Heinz last month was a great moment. On one side  a company that made a big deal about thinking long term and creating good products as well as profit for shareholders. On the other  a business run by some of the harshest corporate cost-cutters around. With little more than a few phone calls  the Anglo-Dutch consumer product giant saw off the much smaller co",
        "date": "03222017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Hadas: The stakeholder revolution has been delayed "
    },
    {
        "content": "LONDON Unilever   is preparing a 6 billion pound ($7.44 billion) sale of some of its food brands  British newspapers reported on Saturday.",
        "date": "03182017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever prepares 6 billion pound sale of food brands: newspapers "
    },
    {
        "content": "LONDON  March 18 Unilever  is preparing a 6 billion pound ($7.44 billion) sale of some of its food brands  British newspapers reported on Saturday.",
        "date": "03182017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Unilever prepares 6 bln stg sale of food brands - newspapers "
    },
    {
        "content": "LONDON  March 18 Unilever  is preparing a 6 billion pound ($7.44 billion) sale of some of its food brands  British newspapers reported on Saturday  without citing sources.",
        "date": "03182017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever prepares 6 bln stg sale of food brands - newspapers "
    },
    {
        "content": "LONDON Unilever   is considering returning cash to shareholders  making medium-sized acquisitions and more aggressive cost cuts as part of its business review  the Financial Times reported.",
        "date": "03152017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever review covers costs  deals  balance sheet: FT "
    },
    {
        "content": "LONDON Fresh from defending Unilever  against an unsolicited $143 billion takeover attempt by Kraft Heinz   CEO Paul Polman said the British government should ensure a level playing field for target companies.",
        "date": "03142017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever CEO urges UK to provide 'level playing field' after Kraft bid "
    },
    {
        "content": "LONDON  March 15 Unilever  is considering returning cash to shareholders  making medium-sized acquisitions and more aggressive cost cuts as part of its business review  the Financial Times reported.",
        "date": "03152017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever review covers costs  deals  balance sheet -FT "
    },
    {
        "content": "LONDON  March 14 Fresh from defending Unilever  against an unsolicited $143 billion takeover attempt by Kraft Heinz  CEO Paul Polman said the British government should ensure a level playing field for target companies.",
        "date": "03142017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Unilever CEO urges UK to provide 'level playing field' after Kraft bid "
    },
    {
        "content": "LONDON  March 14 Unilever CEO Paul Polman said there should be a level playing field for companies facing takeover bids such as Kraft Heinz's failed $143 billion attempt to buy the Anglo-Dutch company  the FT reported on Tuesday.",
        "date": "03142017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever CEO calls for 'level playing field' after Kraft's failed $143 bln bid - FT "
    },
    {
        "content": "JOHANNESBURG  March 1 South Africa's competition watchdog recommended a fine equivalent to 10 percent of Unilever's local turnover for price fixing of edible oils and margarine  it said on Wednesday.   (Reporting by Tiisetso Motsoeneng  editing by Louise Heavens)",
        "date": "03012017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "South Africa's antitrust watchdog seeks fine against Unilever "
    },
    {
        "content": "LONDON Unilever   is proposing changes to how it pays executives and directors in order to make them think more like owners of the business  less than two weeks after seeing off a $143 billion takeover pursuit by U.S. rival Kraft Heinz .",
        "date": "02282017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever seeks changes to pay to give managers owner's mindset "
    },
    {
        "content": "LONDON  Feb 27 U.S. food company Kraft Heinz  is not targeting any other large deals for now after being snubbed by Unilever because valuations in the sector are too high  major shareholder Warren Buffett told CNBC news on Monday.",
        "date": "02272017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Buffett says no backup deal for Kraft after Unilever snub - CNBC "
    },
    {
        "content": "* Incentive plan to adopt longer-term horizon   (Adds more details  background; changes headline)",
        "date": "02282017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Unilever seeks changes to pay to give managers owner's mindset "
    },
    {
        "content": "LONDON  Feb 28 Unilever  on Tuesday proposed changes to how it pays executive directors that it says are meant to ensure alignment with long-term shareholder value creation.",
        "date": "02282017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever proposes changes to how directors are paid "
    },
    {
        "content": "Kraft Heinz's  bid has jolted Unilever  into focusing more on delivering on its strategy in the short-term  the Anglo-Dutch company's finance chief said on Friday.",
        "date": "02242017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Kraft's shock bid triggers Unilever focus on short-term value "
    },
    {
        "content": "* Sees no strategic rationale to combine with Kraft   (Adds share price and valuation details)",
        "date": "02242017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Kraft's shock bid triggers Unilever focus on short-term value "
    },
    {
        "content": "Feb 24 Kraft Heinz's bid has jolted Unilever into focusing more on delivering on its strategy in the short-term  the Anglo-Dutch company's finance chief said on Friday.",
        "date": "02242017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "CORRECTED-UPDATE 1-Kraft's shock bid triggers Unilever focus on short-term value "
    },
    {
        "content": "LONDON Unilever  sought to show shareholders it can go it alone on Wednesday after rejecting Kraft Heinz's  $143 billion bid  with the promise of a swift  far-reaching review.",
        "date": "02222017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever spurred into speedy value review by Kraft bid "
    },
    {
        "content": "LONDON Kraft Heinz Co's  rapid retreat from its surprise $143 billion bid for Unilever   in the face of stiff resistance knocked the Anglo-Dutch company's shares on Monday as investors assessed the impact of the failed approach. | Video ",
        "date": "02212017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Kraft backs out of Unilever bid after hostile reception "
    },
    {
        "content": "LONDON U.S. food company Kraft Heinz Co made a surprise $143 billion offer for Unilever Plc in a bid to build a global consumer goods giant  although it was flatly rejected on Friday by the maker of Lipton tea and Dove soap. | Video ",
        "date": "02182017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Kraft Heinz bids $143 billion for Unilever in global brand grab "
    },
    {
        "content": "NEW YORK  Feb 17 Options on the U.S-listed shares of Unilever drew unusually large and bullish trading activity ahead of Friday's disclosure by Kraft Heinz Co  that it had made a $143 billion bid for the Anglo-Dutch food company.",
        "date": "02172017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Options bets on Unilever surged ahead of Kraft Heinz bid "
    },
    {
        "content": "LONDON  Feb 24 Unilever said the shock of Kraft Heinz's opportunistic approach had jolted it to re-examine its strategy  and all aspects of the consumer goods giant's business were up for review to increase shareholder value.",
        "date": "02242017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever says Kraft's shock bid to spur focus on short-term value "
    },
    {
        "content": "* Miners lose ground on weaker metals prices   (Adds details  closing prices)",
        "date": "02222017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever  Lloyds help Britain's FTSE edge higher "
    },
    {
        "content": "LONDON Kraft Heinz's  dropped bid to buy Unilever  is the third-largest M&A deal to collapse  according to Thomson Reuters data  adding to a recent run of failures that highlights the appetite for the pursuit of audacious mega-mergers.",
        "date": "02212017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Collapse of Kraft-Unilever tie-up extends run of failed mega-deals "
    },
    {
        "content": "* Unilever shares touch record high; Kraft Heinz stock up 10 pct   (Adds Moody's note)",
        "date": "02182017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 8-Kraft Heinz bids $143 bln for Unilever in global brand grab "
    },
    {
        "content": "* Live coverage: cpurl://apps.cp./cms/?pageId=livemarkets   (Recasts  adds quote and detail  updates prices at close)",
        "date": "02172017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares post second weekly gain as Unilever soars "
    },
    {
        "content": "LONDON British Prime Minister Theresa May's office was not involved in Kraft Heinz's  decision to withdraw its $143 billion bid for Unilever   her spokesman said on Monday.",
        "date": "02202017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "UK PM May's office was not involved in Kraft withdrawing Unilever offer: spokesman "
    },
    {
        "content": "* Follows rejection of $143 bln Kraft takeover bid   (Adds detail from statements  banker quote  investor quote  background  adds bullet points  updates shares)",
        "date": "02222017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Unilever spurred into speedy value review by Kraft bid "
    },
    {
        "content": "LONDON  Feb 22 Anglo-Dutch consumer goods group Unilever said it was reviewing its options to increase shareholder value  just days after it swiftly rejected a surprise $143 billion takeover bid from Kraft Heinz.",
        "date": "02222017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Fresh from fending off Kraft  Unilever to review strategy "
    },
    {
        "content": "LONDON British Prime Minister Theresa May's office was not involved in Kraft Heinz's  decision to withdraw its $143 billion bid for Unilever   her spokesman said on Monday.",
        "date": "02212017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UK PM May's office was not involved in Kraft withdrawing Unilever offer: spokesman "
    },
    {
        "content": "LONDON  Feb 20 Kraft Heinz's dropped bid to buy Unilever is the third-largest M&A deal to collapse  according to Thomson Reuters data  adding to a recent run of failures that highlights the appetite for the pursuit of audacious mega-mergers.",
        "date": "02212017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "RPT-Collapse of Kraft-Unilever tie-up extends run of failed mega-deals "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - The world's wiliest takeover artists have found their biggest target yet. Kraft Heinz  the Kool-Aid-to-Velveeta conglomerate  has offered $143 billion for Unilever  its Anglo-Dutch rival. Even for 3G Capital  the private investment firm behind Kraft Heinz  beer giant Anheuser-Busch InBev and Burger King owner Restaurant Brands International  it's an audacious move. To land Unilever  which rejected the offer  Kraft Heinz may need to pass the hat around to shareh",
        "date": "02172017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Kraft Heinz may have to pass hat to buy Unilever "
    },
    {
        "content": "LONDON  Feb 17 Britain's top share index ended higher on Friday as Unilever rallied after a surprise $143 billion takeover bid from Kraft Heinz Co  leading the index to its third straight week of gains.",
        "date": "02172017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "FTSE gains for third week as Unilever rises  Coca Cola HBC sets record "
    },
    {
        "content": "LONDON  Feb 20 Kraft Heinz's dropped bid to buy Unilever is the third-largest M&A deal to collapse  according to Thomson Reuters data  adding to a recent run of failures that highlights the appetite for the pursuit of audacious mega-mergers.",
        "date": "02202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Collapse of Kraft-Unilever tie-up extends run of failed mega-deals "
    },
    {
        "content": "LONDON  Feb 17 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "02172017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares fall; Unilever adds $19 bln in market cap. For more see the LiveMarkets blog "
    },
    {
        "content": "* Pearson hit by broker target price cut   (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon  see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "02202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "FTSE steadies after setting 1-month high  Unilever slumps "
    },
    {
        "content": "LONDON  Feb 20 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "02202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares up  Unilever and Pearson weigh on FTSE - For more see the European equities LiveMarkets blog "
    },
    {
        "content": "LONDON  Feb 17 Unilever said it saw no merit in a proposed merger with U.S. food group Kraft Heinz Co  after rejecting a $143 billion offer  saying it \"fundamentally undervalues\" the Anglo-Dutch consumer goods giant.",
        "date": "02172017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever rejects $143 bln Kraft offer as bid too low "
    },
    {
        "content": "LONDON  Feb 17 U.S. food company Kraft Heinz Co  has proposed a merger with Unilever   but the Anglo-Dutch company has declined  Kraft said on Friday.",
        "date": "02172017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Kraft Heinz proposes merger deal which Unilever rejects "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Close shaves sometimes leave scars. Unilever boss Paul Polman can keep his M&A defence powder dry following Kraft Heinz's decision on Feb. 19 to walk away from its spurned bid. But the shock to the system will have an effect on the Anglo-Dutch food and household goods company.",
        "date": "02202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Kraft Heinz is a good fire drill for Unilever "
    },
    {
        "content": "* Kraft camp had told UK Business Secretary details of plan   (Adds details on Kraft's interaction with UK government)",
        "date": "02202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Kraft backs out of Unilever bid after hostile reception "
    },
    {
        "content": "LONDON  Feb 20 Shares in Anglo-Dutch consumer goods group Unilever  dropped 8 percent on Monday after U.S. rival Kraft Heinz Co abruptly ditched its surprise $143 billion merger proposal.",
        "date": "02202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever shares tumble 8 pct after Kraft ditches bid "
    },
    {
        "content": "MILAN  Feb 20 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "02202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares seen up; eyes on Unilever as Kraft walks away. For more see the LiveMarkets blog "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Almost nothing made by Kraft Heinz or Unilever has an expiration date of just two days – except  that is  for their $143 billion merger. Kraft  the American ketchup-and-cheese concern controlled by Brazilian investment firm 3G  withdrew an offer to acquire its Anglo-Dutch counterpart on Sunday after an inopportune leak put the knickers of British politicians and unions in a twist. But the idea of pairing 3G's ruthless cost management with Unilever's innovative ",
        "date": "02202017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Kraft Heinz has to settle for marinating Unilever "
    },
    {
        "content": "LONDON Consumer goods maker Unilever   reported lower-than-expected fourth-quarter sales on Thursday  blaming the demonetisation in India and weak economy in Brazil.",
        "date": "01262017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever ends 2016 with sales growth below estimates on India  Brazil "
    },
    {
        "content": "* Shares have worst day in almost a year   (Adds details on spreads business  background)",
        "date": "01262017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Unilever ends 2016 with sales growth below estimates on India  Brazil "
    },
    {
        "content": "LONDON  Jan 26 Consumer goods producer Unilever   plans to keep its shrinking spreads business as long as it continues to make financial sense  Chief Executive Paul Polman said on Thursday.",
        "date": "01262017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever CEO says keeping spreads business makes sense "
    },
    {
        "content": "Jan 26 Britain's FTSE 100 index is seen opening up 13 to 18 points  or as much as 0.3 percent higher  according to financial bookmakers  with futures up 0.2 percent ahead of the cash market open.",
        "date": "01262017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Jan 26 "
    },
    {
        "content": "LONDON  Jan 26 Unilever   reported lower-than-expected fourth-quarter sales on Thursday  hurt by demonetisation in India and an economic slowdown in Brazil.",
        "date": "01262017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever ends the year with sales growth below estimates "
    },
    {
        "content": "LONDON Consumer goods maker Unilever said on Saturday all of its plastic packaging would be fully reusable  recyclable or compostable by 2025.",
        "date": "01152017",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever commits to 100 percent recyclable plastic "
    },
    {
        "content": "LONDON  Jan 14 Consumer goods maker Unilever   said on Saturday all of its plastic packaging would be fully reusable  recyclable or compostable by 2025.",
        "date": "01152017",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "CORRECTED-Unilever commits to 100 pct recyclable plastic "
    },
    {
        "content": "LONDON Unilever   said on Friday it would buy Living Proof  a premium hair care business  for an undisclosed price  the latest in a string of small deals for the company's personal care business.",
        "date": "12162016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever says to buy Living Proof hair care brand "
    },
    {
        "content": "LONDON  Oct 28 British supermarket chain Morrison has raised the price of Marmite yeast spread by 12 percent  passing on to consumers an increase sought by its maker Unilever that led to a row with retailer Tesco  this month dubbed \"Marmitegate\".",
        "date": "10282016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "UPDATE 1-Morrison raises Marmite price by 12 pct after \"Marmitegate\" "
    },
    {
        "content": "LONDON  Oct 18 British housebuilder Bellway  expects some of its suppliers to seek price rises after the Brexit-induced fall in the pound  echoing consumer goods group Unilever's move to recoup currency losses through higher prices.",
        "date": "10182016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "UPDATE 1-British builder Bellway expects supplier price squeeze "
    },
    {
        "content": "LONDON Britain's biggest retailer  Tesco   settled a pricing row with Unilever  after halting online sales of goods produced by the Anglo-Dutch giant in a dispute caused by a plunge in the pound since Britons voted to leave the EU. | Video ",
        "date": "10132016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Tesco  Unilever settle prices row after pound's Brexit dive "
    },
    {
        "content": "LONDON  Oct 13 Unilever said on Thursday it has now settled its pricing dispute with Tesco   Britain's biggest supermarkets operator.",
        "date": "10132016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever says supply situation with Tesco now resolved "
    },
    {
        "content": "(The following statement was released by the rating agency) MILAN/LONDON  October 13 (Fitch) Fitch Ratings has affirmed Unilever NV's and  Unilever PLC's (together Unilever) Long-Term Issuer Default Ratings (IDR) and  senior unsecured ratings at 'A+' and their Short-Term IDRs at 'F1'. The Outlooks  on the Long-Term IDRs are Stable.  Fitch has also affirmed the senior unsecured ratings of debt issued by Unilever  Capital Corporation (UCC) and Alberto Culver at 'A+' and of the commercial paper  pr",
        "date": "10132016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Fitch Affirms Unilever at 'A+'; Outlook Stable "
    },
    {
        "content": "LONDON  Oct 13 Price increases at Unilever   which have sparked a row with British supermarket Tesco  helped the maker of Ben & Jerry's ice cream and Dove soap report a smaller-than-expected slowdown in third-quarter sales on Thursday.",
        "date": "10132016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Price rises help Unilever top sales forecasts but spark Tesco row "
    },
    {
        "content": "LONDON  Oct 13 Unilever Chief Financial Officer Graeme Pitkethly said price increases taken to offset rising costs are a normal part of doing business  but he declined to comment specifically on a row with Tesco",
        "date": "10132016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever CFO says price increases are normal "
    },
    {
        "content": "LONDON  Oct 13 Price increases helped Unilever  report a smaller-than-expected slowdown in third-quarter sales on Thursday.",
        "date": "10132016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever price rises help it beat third-quarter sales forecasts "
    },
    {
        "content": "LONDON Unilever  will buy Seventh Generation  a U.S.-based maker of \"green\" home and personal care goods  it said on Monday  its latest deal aimed at boosting the faster-growing part of its business.",
        "date": "09192016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever to buy U.S.-based Seventh Generation "
    },
    {
        "content": "LONDON  Sept 19 Unilever will buy Seventh Generation  a U.S.-based maker of \"green\" home and personal care goods  it said on Monday  its latest deal aimed at boosting the faster-growing part of its business.",
        "date": "09192016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Unilever to buy U.S.-based Seventh Generation "
    },
    {
        "content": "* Unilever is in talks to acquire Jessica Alba's Honest Co.; Unilever is seeking discount to company's recent $1.7 billion valuation - CNBC  citing DJ",
        "date": "09152016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "BRIEF-Unilever is in talks to acquire Jessica Alba's Honest Co. - CNBC  citing DJ "
    },
    {
        "content": "LONDON  Sept 19 Unilever is to buy Seventh Generation  a U.S.-based maker of soaps and detergents  it said on Monday  as it expands its home and personal care businesses.",
        "date": "09192016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever to boost home business with acquisition of Seventh Generation "
    },
    {
        "content": "LONDON  Aug 16 Unilever plans to buy Sweden's Blueair  stepping into the air purification business  the company said on Tuesday.",
        "date": "08162016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever to buy Blueair air purifiers "
    },
    {
        "content": "* Terms of the deal were not disclosed  Source text: http://bit.ly/2aVR7AS Further company coverage:    (Gdynia Newsroom)",
        "date": "08162016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Unilever to acquire Blueair "
    },
    {
        "content": "July 21 Unilever Executive Says Net Revenue Management Initiative Should Cover 50 Pct Of Turnover By Year",
        "date": "07212016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "BRIEF-Unilever executive comments "
    },
    {
        "content": "July 19 Indian shares traded flat on Tuesday  as sentiment was subdued after falling oil prices hit Asian markets and after retail heavyweight Hindustan Unilever posted disappointing volume growth.",
        "date": "07192016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Indian shares trade flat; Hindustan Unilever hit by results "
    },
    {
        "content": "LONDON  July 21 European shares were steady on Thursday  propped up by gains at consumer goods group Unilever  and aluminum producer Norsk Hydro  although airline stocks slumped.",
        "date": "07212016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares steadied by Unilever but airline stocks slump "
    },
    {
        "content": "July 21 Britain's FTSE 100 index is seen opening down 16 points  or 0.2 percent  on Thursday  according to financial bookmakers  with futures down 0.2 pct ahead of cash market open.",
        "date": "07212016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-UK Stocks-Factors to watch on July 21 "
    },
    {
        "content": "* Unilever CFO says weak sterling increases costs of imported goods on uk business  but also reduces domestic hq costs",
        "date": "07212016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Interview-Unilever CFO stands by full-year forecast after Q2 beat "
    },
    {
        "content": "LONDON  July 21 Consumer goods giant Unilever  reported higher-than-expected second-quarter sales growth on Thursday  helped by market share gains.",
        "date": "07212016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever reports better-than-expected sales "
    },
    {
        "content": "LONDON Unilever   Chief Executive Paul Polman and his three predecessors have expressed support for Britain remaining in the European Union  saying the Anglo-Dutch consumer goods giant would be \"negatively impacted\" by Brexit.",
        "date": "06162016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever boss and predecessors want UK to remain in EU "
    },
    {
        "content": "LONDON  June 16 Unilever  Chief Executive Paul Polman and his three predecessors have expressed support for Britain remaining in the European Union  saying the Anglo-Dutch consumer goods giant would be \"negatively impacted\" by Brexit.",
        "date": "06162016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Unilever boss and predecessors want UK to remain in EU "
    },
    {
        "content": "LONDON  June 16 Unilever  Chief Executive Paul Polman and his three predecessors have expressed support for Britain's membership of the European Union  saying the consumer goods giant would be \"negatively impacted\" by Brexit.",
        "date": "06162016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever's CEOs say they hope UK remains in EU "
    },
    {
        "content": "LOS ANGELES  June 2 Anheuser-Busch and Starbucks announced a deal on Thursday to produce  bottle  distribute and market Teavana ready-to-drink teas in the United States  with products expected to be available in the first half of next year.",
        "date": "06022016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Starbucks  Anheuser-Busch to partner on bottled Teavana teas "
    },
    {
        "content": "Johnson & Johnson  said on Thursday it would acquire Vogue International for $3.3 billion  adding brands such as OGX shampoos and FX hair styling products to its consumer portfolio that includes Neutrogena and Clean & Clear.",
        "date": "06022016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "J&J to buy hair care products maker Vogue for $3.3 billion "
    },
    {
        "content": "* Has been chosen by Unilever for storage and order fulfilment of its recently introduced tea-brewing machine launched under premium brand of T.O by Lipton  Source text: http://bit.ly/1NEKNAr Further company coverage:    (Gdynia Newsroom)",
        "date": "04292016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "BRIEF-Kuehne und Nagel International to manage e-commerce centre for Unilever premium brand "
    },
    {
        "content": "LONDON  April 27 (IFR) - The race to print the first negative yielding corporate bond in euros is on after Unilever narrowly missed out earlier this week  as news of the ECB's corporate purchase plan drives funding costs to all-time lows.",
        "date": "04272016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Corporates race to print first euro negative yield "
    },
    {
        "content": "* Nestle's sales surprise  driven by volumes rather than price   (Adds details on new initiatives  bullet points  analyst comment)",
        "date": "04142016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "UPDATE 2-Unilever leaves sales target unchanged despite strong start to year "
    },
    {
        "content": "LONDON  April 14 Weak oil prices and a fall in the shares of Burberry and Unilever held back European stock markets on Thursday.",
        "date": "04142016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares held back by falls at Burberry and Unilever "
    },
    {
        "content": "April 14 Britain's FTSE 100 index is seen opening up 3 points  or 0.05 percent  on Thursday  according to financial bookmakers  with futures up 0.3 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "04142016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-UK Stocks-Factors to watch on April 14 "
    },
    {
        "content": "LONDON  April 14 Unilever still expects full-year underlying sales to rise in a range of 3 to 5 percent this year  its chief financial officer told Reuters after the company posted a 4.7 percent gain in the first quarter.",
        "date": "04142016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever CFO stands by full-year sales forecast "
    },
    {
        "content": "LONDON  April 14 European equity futures rose on Thursday  with gains on Asian and U.S. markets expected to keep European equities near their highest level in a month.",
        "date": "04142016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European Factors to Watch-Equity futures rise "
    },
    {
        "content": "LONDON  April 14 Consumer goods maker Unilever   reported first-quarter underlying sales growth in line with expectations on Thursday  with increases in both pricing and volume.",
        "date": "04142016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever first-quarter sales in line with estimates "
    },
    {
        "content": "* Spreads continue to disappoint   (Adds shares  analyst reaction)",
        "date": "01192016",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "UPDATE 2-Unilever sees more volatility after sales top forecasts "
    },
    {
        "content": "** Unilever up 2 pct at 2-wk high after its FY sales beat analyst expectations",
        "date": "01192016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BUZZ-Unilever: FY sales beat estimates "
    },
    {
        "content": "LONDON Consumer goods group Unilever  said it was preparing itself for tougher market conditions and another year of volatility in 2016 after it outperformed the wider market with better-than-expected 2015 sales growth.",
        "date": "01192016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever sees more volatility after steering through 2015 "
    },
    {
        "content": "LONDON  Jan 19 Unilever   reported a 4 percent rise in underlying full-year sales on Tuesday  just ahead of expectations  but said it was preparing itself for tougher market conditions and high volatility in 2016.",
        "date": "01192016",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever posts 4 percent rise in underlying full-year sales\u007f "
    },
    {
        "content": "LONDON  Nov 27 Consumer goods maker Unilever  said it would switch to using only renewable energy by 2030 and would stop using energy from coal by 2020  as businesses jostle to highlight their green credentials ahead of a global climate summit.",
        "date": "11272015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever aims to use only renewable energy by 2030 "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/MILAN  October 15 (Fitch) Fitch Ratings has affirmed Unilever NV's and  Unilever PLC's (together Unilever) Long-term Issuer Default Ratings (IDR) and  senior unsecured ratings at 'A+' and their Short-term IDRs at 'F1'. The Outlook  on the Long-term IDRs is Stable.  Fitch has also affirmed at 'A+' the senior unsecured ratings of debt issued by  Unilever Capital Corporation (UCC) and Alberto Culver as well as the 'F1' rating  of th",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Fitch Affirms Unilever at 'A+'; Outlook Stable "
    },
    {
        "content": "LONDON  Oct 15 Britain's top equity index climbed higher on Thursday  boosted by Unilever which rose following solid sales growth  although luxury goods group Burberry slumped after its sales figures missed forecasts.",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever and ARM help FTSE to rebound  but Burberry battered "
    },
    {
        "content": "LONDON Consumer goods maker Unilever  said it expects sluggish global markets will continue to weigh on performance with no let-up in sight  though a series of one-off benefits lifted third-quarter sales way past expectations.",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever says global markets tough but sales beat expectations "
    },
    {
        "content": "LONDON  Oct 15 Britain's top equity index climbed higher on Thursday  boosted by Unilever which rose after solid sales growth  but luxury goods group Burberry  slumped after its sales figures missed forecasts.",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Britain's FTSE rises but Burberry battered by weak sales growth "
    },
    {
        "content": "* Transaction could be worth 3 bln euros -source   (Adds analyst comments)",
        "date": "10052015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Nestle confirms in talks to merge international ice cream ops with R&R "
    },
    {
        "content": "* Without one-time benefits  Q3 sales would've been in 3.5-4 percent range",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Unilever CFO comments "
    },
    {
        "content": "MILAN  Oct 15 European shares rose on Thursday following three days of losses  tracking gains in Asia on growing expectations the U.S. will delay any interest rate hike until 2016  with retailer Casino among the top performers.",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares open higher led by Casino; Burberry slumps "
    },
    {
        "content": "** Unilever  maker of Knorr soup  Lipton tea and Dove soap  up c.4 pct & top gainer on a positive Stoxx 600 Personal Goods and Household index",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BUZZ-Unilever: soars on better-than-expected Q3 "
    },
    {
        "content": "MILAN  Oct 15 European shares are expected to open higher on Thursday following three days of losses  tracking gains in Asia on growing expectations that the U.S. Federal Reserve will delay any interest rate increase until 2016.",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European Factors to Watch-Shares seen up on U.S. rates outlook "
    },
    {
        "content": "MILAN  Oct 1 Unilever has agreed to buy Italian high-end ice cream maker GROM  the consumer product giant said on Thursday adding the acquisition would strengthen its ice cream portfolio with a premium brand.",
        "date": "10012015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever buys premium Italian ice cream maker GROM "
    },
    {
        "content": "LONDON  Oct 15 Britain's FTSE 100 futures contract were up 0.3 percent on Thursday. For more on the factors affecting European stocks  please click on.",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UK Factors-FTSE futures rise  Unilever sales rise "
    },
    {
        "content": "LONDON  Oct 15 Consumer goods maker Unilever  reported better than expected third-quarter sales on Thursday.",
        "date": "10152015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever Q3 sales top expectations "
    },
    {
        "content": "MILAN  Oct 1 Consumer goods giant Unilever  has agreed to buy Italian ice cream maker GROM  adding another premium brand to its frozen product offering after the acquisition of U.S.-based Talenti less than a year ago.",
        "date": "10012015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Unilever buys premium Italian ice cream maker GROM "
    },
    {
        "content": "* GROM has over 60 gelato shops in Italy and around the world   Source text: http://bit.ly/1M45TB9 Further company coverage:    (Gdynia Newsroom)",
        "date": "10012015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Unilever acquires Italian gelato business GROM "
    },
    {
        "content": "(The following statement was released by the rating agency) JAKARTA  September 14 (Fitch) Fitch Ratings Indonesia has affirmed  Indonesia-based plastic packaging manufacturer PT Berlina Tbk's (Berlina)  National Long-Term Rating at 'A-(idn)' with a Stable Outlook. The agency has  also affirmed the ratings on Berlina's IDR200bn medium-term notes due in  December 2017 at 'A-(idn)'. 'A' National Ratings denote expectations of low default risk relative to other  issuers or obligations in the same co",
        "date": "09142015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Fitch Affirms Berlina at 'A-(idn) '; Stable Outlook "
    },
    {
        "content": "LONDON  Aug 12 Britain's top share index was dragged lower on Wednesday by Unilever  hit after a broker downgrade  and by mining companies suffering from a slump in metal prices due to China's devaluation of the yuan.",
        "date": "08122015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Britain's FTSE dragged lower by miners and Unilever "
    },
    {
        "content": "MUMBAI  Aug 4 An Indian rapper has gone viral with a music video calling on consumer products giant Unilever  to clean up alleged toxic waste from a forested southern hill station and compensate residents.",
        "date": "08042015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Indian rapper goes viral with toxic waste gibes at Unilever "
    },
    {
        "content": "MUMBAI  Aug 4 An Indian rapper has gone viral with a music video calling on consumer products giant Unilever  to clean up alleged toxic waste from a forested southern hill station.",
        "date": "08042015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Indian rapper goes viral with toxic waste gibes at Unilever "
    },
    {
        "content": "SAN FRANCISCO  July 19 Chinese ecommerce company Alibaba Group Holdings Ltd announced on Sunday that it had signed a strategic partnership agreement with Unilever NV  to help the consumer products group reach more Chinese shoppers.",
        "date": "07202015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Alibaba  Unilever announce partnership to reach Chinese consumers "
    },
    {
        "content": "* Unilever  Kingfisher see improved sales   (Adds detail  closing prices)",
        "date": "07232015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Britain's FTSE edges lower after Aberdeen AM hit by outflows "
    },
    {
        "content": "* Unilever  Kingfisher see improved sales   (Recasts  adds detail  quote)",
        "date": "07232015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Britain's FTSE edges lower after Aberdeen Asset hit by outflows "
    },
    {
        "content": "* Stands by full-year outlook even as beauty business grows   (Adds details on beauty business  CEO comments)",
        "date": "07232015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Beauty buys to brighten Unilever as markets lack shine "
    },
    {
        "content": "GM earnings more than doubles on U.S. truck demand; shares jump",
        "date": "07232015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Reuters Business News Schedule at 1230 GMT/0830 AM ET "
    },
    {
        "content": "* Aberdeen Asset Management hit as inflows fall   (Recasts  adds detail  quotes )",
        "date": "07232015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Britain's FTSE supported by Pearson after it confirms FT sale talks "
    },
    {
        "content": "LONDON  July 23 Britain's top share index edged slightly higher on Thursday as better-than-expected results from several companies  including Unilever  overshadowed disappointing updates from Aberdeen Asset Management and SSE.",
        "date": "07232015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever leads Britain's FTSE slightly higher "
    },
    {
        "content": "LONDON  July 23 European shares edged higher on Thursday as Credit Suisse  Unilever and others reported better-than-expected results  as the quarterly earnings season accelerated in Europe.",
        "date": "07232015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares steady as Credit Suisse results beat expectations "
    },
    {
        "content": "* H1 turnover increased by 12 pct to 27.0 billion euros  ($29.5 billion) including a positive currency impact of 10 pct",
        "date": "07232015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Unilever H1 net profit drops 11 pc to 2.7 bln euros "
    },
    {
        "content": "LONDON  July 23 Unilever   reported higher-than-expected second-quarter sales on Thursday  driven by increases in its home and personal care businesses.",
        "date": "07232015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever's second-quarter sales top estimates "
    },
    {
        "content": "July 12 Anglo-Dutch consumer products group Unilever  is searching for a new chairman to replace Michael Treschow  who has been in the job since 2007  Sky News reported on Sunday.",
        "date": "07122015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever in search for new chairman - Sky News "
    },
    {
        "content": "July 2 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07022015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON  July 2 Anglo-Dutch consumer goods giant Unilever is to buy U.S. skincare company Murad  its fourth premium skincare deal in recent months.",
        "date": "07022015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever to acquire Murad to expand skincare business "
    },
    {
        "content": "June 15 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Monday:",
        "date": "06152015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "ZURICH Swiss chocolate maker Barry Callebaut has appointed Unilever food business head Antoine de Saint-Affrique as its new chief executive  replacing Juergen Steinemann  who is stepping down in August.",
        "date": "06102015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Barry Callebaut names Unilever food boss as new CEO "
    },
    {
        "content": "ZURICH  June 10 Swiss chocolate maker Barry Callebaut has appointed Unilever food business head Antoine de Saint-Affrique as its new chief executive  replacing Juergen Steinemann  who is stepping down in August.",
        "date": "06102015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 1-Barry Callebaut names Unilever food boss as new CEO "
    },
    {
        "content": "ZURICH  June 10 Swiss chocolate maker Barry Callebaut said on Wednesday it is naming Unilever  executive Antoine de Saint-Affrique as its new Chief Executive effective in October  replacing Juergen Steinemann  who is stepping down in August.",
        "date": "06102015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Barry Callebaut names Unilever food head De Saint-Affrique as CEO "
    },
    {
        "content": "LONDON  June 3 Britain's top equity index slightly underperformed its euro zone peers on Wednesday as a survey of the dominant services sector came in sharply below forecasts.",
        "date": "06032015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Top UK shares rise despite subdued data "
    },
    {
        "content": "LONDON  June 3 Britain's top equity index underperformed its eurozone peers on Wednesday after a services-sector survey came in sharply below forecasts  partly offsetting a rebound in confidence across Europe on hopes of a Greek deal.",
        "date": "06032015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Top UK shares underperform Europe after subdued data "
    },
    {
        "content": "LONDON  June 3 Britain's top equity index made little progress on Wednesday as a rise in bond yields hit utility and property shares  whose typically high debt levels make them particularly vulnerable to credit market jitters.",
        "date": "06032015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Weaker property and utility stocks weigh on Britain's FTSE "
    },
    {
        "content": "LONDON Unilever  the maker of Dove soap  Lipton tea and Ben & Jerry's ice cream  has picked the vice president of its UK business Graeme Pitkethly to succeed Jean-Marc Huet as chief financial officer later this year.",
        "date": "05192015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Unilever promotes UK vice president to finance chief "
    },
    {
        "content": "* Unilever showing signs of recovery after tough 2014   (Adds analyst comment  background  shares)",
        "date": "05192015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Unilever promotes UK vice president to finance chief "
    },
    {
        "content": "LONDON  May 21 Britain's biggest retailer Tesco  paid new chief executive Dave Lewis 4.1 million pounds ($6.4 million) in the six months after luring him from consumer goods group Unilever and tasking him with turning around the firm.",
        "date": "05212015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Tesco paid new boss 4 mln pounds in first six months "
    },
    {
        "content": "* Jean-Marc Huët to leave Unilever in October and Graeme Pitkethly to succeed him as chief financial officer",
        "date": "05192015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "BRIEF-Pitkethly to succeed Huët as Unilever CFO "
    },
    {
        "content": "* Want tough action from Paris U.N. summit in December   (Updates with quotes from Kerry  Fabius  DSM)",
        "date": "05212015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Top EU companies urge drastic cuts in greenhouse gas emissions "
    },
    {
        "content": "* Companies urge goal of \"net zero\" emissions well before 2100",
        "date": "05212015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Top EU companies urge drastic cuts in greenhouse gas emissions "
    },
    {
        "content": "LONDON  May 19 Unilever  the Anglo-Dutch maker of Dove soap  Lipton tea and Ben & Jerry's ice cream  said chief financial officer Jean-Marc Huët would quit the company later this year and be succeeded by current UK vice president Graeme Pitkethly.",
        "date": "05192015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever names Pitkethly as new CFO after Huet quits "
    },
    {
        "content": "* Opening of offer to increase its equity stake in Unilever Nigeria Plc from 50.10 pct up to a maximum of 75 pct",
        "date": "05072015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "BRIEF-Unilever opens offer to increase stake in Unilever Nigeria "
    },
    {
        "content": "* Most sustainable brands accounted for half 2014 sales growth",
        "date": "05052015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "RPT-Unilever says its socially responsible brands outperform rest "
    },
    {
        "content": "* Most sustainable brands accounted for half 2014 sales growth",
        "date": "05052015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever says its socially responsible brands outperform rest "
    },
    {
        "content": "* FTSE closes down 0.5 pct at 7 060.45 points     * Index had earlier hit record high of 7 119.35 points     * Pearson hit by report of possible LA contract glitch     * Unilever rises after solid sales     * Rise in gold boosts Fresnillo and Randgold      By Sudip Kar-Gupta     LONDON  April 16 Britain's top share index slipped off record highs on Thursday  with media group Pearson  underperforming after a newspaper report of a glitch in a lucrative contract.     The blue-chip FTSE ",
        "date": "04162015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "Pearson penalised as UK's FTSE slips off record high "
    },
    {
        "content": "* FTSE down 0.3 pct after touching record high     * Pearson hit by report of possible LA contract glitch     * Unilever rises after solid sales     * Rise in gold boosts Fresnillo and Randgold      By Sudip Kar-Gupta     LONDON  April 16 Britain's top share index slipped off record highs on Thursday  with media group Pearson  underperforming after a newpaper report of a glitch in a lucrative contract.     The blue-chip FTSE 100 index initially rose to an all-time high of 7 119.35 po",
        "date": "04162015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Pearson lags as UK's FTSE slips off record high "
    },
    {
        "content": "LONDON Unilever reported better than expected first quarter sales and struck a positive tone on the rest of the year  citing brighter signs in major markets such as the United States  China and India.",
        "date": "04162015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever sees tailwinds boosting sales hopes "
    },
    {
        "content": "* Now aiming for '15 sales growth in top half of 2-4 pct range",
        "date": "04162015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Unilever sees tailwinds boosting sales hopes "
    },
    {
        "content": "LONDON  April 16 European equities retreated from a 14-year high on Thursday  with media stocks leading the market lower after Pearson fell sharply following troubles with one of its educational technology projects.",
        "date": "04162015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Media stocks drag down European equities from highs "
    },
    {
        "content": "LONDON  April 16 Britain's top share index touched a record high  then retreated on Thursday  as mixed results at consumer-goods companies led to a pause in the market's rally.",
        "date": "04162015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Diageo and BAE fall as UK's FTSE backs off from record high "
    },
    {
        "content": "LONDON  April 16 Britain's top share index touched a new record high before turning lower on Thursday  with mixed corporate earnings in the consumer staple sector prompting a pause in an impressive year-to-date rally.",
        "date": "04162015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Britain's FTSE pauses at new record high "
    },
    {
        "content": "PARIS  April 16 European stocks slipped in early trading on Thursday  halting their recent sharp rally  with shares in Diageo dropping after it posted a fall in sales.",
        "date": "04162015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "European shares halt rally; Diageo dips after sales fall "
    },
    {
        "content": "LONDON  April 16 Unilever   chief financial officer narrowed the consumer goods giant's sales growth goal on Thursday after a strong start to the year  helped by an early Easter holiday and a better-than-expected performance in China.",
        "date": "04162015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever CFO sees 2015 sales growth likely in top half of range "
    },
    {
        "content": "LONDON  March 3 Malcolm Rifkind  the British politician embroiled in a cash-for-access scandal  will not stand for re-election to the board of Unilever    the company said on Tuesday.",
        "date": "03032015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "UK politician Rifkind to step down from Unilever board "
    },
    {
        "content": "LONDON  March 2 Unilever  has agreed to buy Britain's REN Skincare brand  it said on Monday  as the company expands its personal care business.",
        "date": "03022015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever to buy UK's REN Skincare "
    },
    {
        "content": "* Shares fall more than 5 percent   (Adds comments on consumer sentiment)",
        "date": "01192015",
        "name": "Unilever NV",
        "news_type": "topStory",
        "symbol": "UN",
        "title": "UPDATE 2-Hindustan Unilever cuts prices as thrifty shoppers hurt volumes "
    },
    {
        "content": "* EM exposure hits Unilever  CCH   (Updates prices  adds comment)",
        "date": "01202015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UK stocks gain on China's growth; Unilever keeps confidence in check "
    },
    {
        "content": "LONDON Consumer goods group Unilever expects another sluggish year  after a slowdown in emerging markets and flagging developed economies curbed demand for everything from soup to soap in 2014. | Video ",
        "date": "01202015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever sees no improvement after weak 2014 "
    },
    {
        "content": "LONDON  Jan 20 Britain's top share index rose for its fourth straight session on Tuesday to hit its highest level in three weeks  buoyed by growth-sensitive stocks after Chinese data beat expectations.",
        "date": "01202015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Chinese boost helps Britain's FTSE hit 3-week high "
    },
    {
        "content": "LONDON  Jan 20 Consumer goods group Unilever   expects another sluggish year  after a slowdown in emerging markets and flagging developed economies curbed demand for everything from soup to soap in 2014.",
        "date": "01202015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "UPDATE 2-Unilever sees no improvement after weak 2014 "
    },
    {
        "content": "LONDON  Jan 20 Consumer goods giant Unilever   reported lower than expected fourth-quarter underlying sales growth  as the emerging market downturn that rocked performance earlier in the year failed to improve.",
        "date": "01202015",
        "name": "Unilever NV",
        "news_type": "normal",
        "symbol": "UN",
        "title": "Unilever posts weaker-than-expected fourth quarter "
    }
]