[
    {
        "content": "* Union Pacific Corporation announces a 10 percent dividend increase for fourth quarter 2017",
        "date": "11162017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific Corporation announces 10% dividend increase for Q4 2017 "
    },
    {
        "content": "DETROIT American businesses  jobs and consumers would suffer if the United States pulls out of NAFTA instead of reaching an enhanced trade treaty  railroad Union Pacific Corp's  top executive said on Thursday.",
        "date": "10262017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific CEO: NAFTA withdrawal impact would be 'disastrous' "
    },
    {
        "content": "Union Pacific Corp  on Thursday reported a better-than-expected profit as higher freight revenue offset the impact of Hurricane Harvey which battered the No. 1 U.S. railroad's network in southeast Texas in August.",
        "date": "10262017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific profit beats estimates despite Harvey impact "
    },
    {
        "content": "Oct 26 Union Pacific Corp reported a better-than-expected quarterly profit on Thursday  driven by higher freight revenue as it transported more industrial products.",
        "date": "10262017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 1-Union Pacific profit beats estimates "
    },
    {
        "content": "Oct 26 The No. 1 U.S. railroad Union Pacific Corp on Thursday reported a higher third-quarter net profit  driven by a 4 percent rise in freight revenue including a 26 percent jump in industrial products.",
        "date": "10262017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific quarterly profit rises 5.6 pct "
    },
    {
        "content": "* Q3 earnings per share view $1.49 -- Thomson Reuters I/B/E/S",
        "date": "10262017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific reports Q3 EPS $1.50  business vols fall 1 pct "
    },
    {
        "content": "A U.S. appeals court on Friday rejected a former Union Pacific Corp vice president's claim that the railroad improperly based his pension benefits on wages he would have earned while he was disabled and not working.",
        "date": "09152017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "3rd Circuit derails Union Pacific retiree's case over pension payments "
    },
    {
        "content": "* Union Pacific Corp files pricing term sheet related to offering of $500 mln‍​ 3.600 pct notes due 2037 - SEC filing Source text: [http://bit.ly/2wZsPo9] Further company coverage:",
        "date": "09122017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific files pricing term sheet "
    },
    {
        "content": "A week before Hurricane Harvey walloped Houston  workers for Union Pacific Corp  began moving rail cars out of the railroad's Englewood switching yard near downtown and brought in enough generators to fill 70 tractor trailers to keep signal systems running.",
        "date": "09072017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "U.S. freight movers rethink how to guard against floods "
    },
    {
        "content": "HOUSTON No. 1 U.S. railroad Union Pacific Corp  has repaired most of the damage caused to its network by catastrophic flooding brought by Hurricane Harvey to Houston late last month and its network should be fully operational around the end of September  the company's top executive said on Wednesday.",
        "date": "09072017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific CEO sees pent-up demand in Harvey recovery "
    },
    {
        "content": "HOUSTON  Sept 6 Catastrophic flooding brought by Hurricane Harvey to Houston late last month should shave around 5 cents per share off Union Pacific Corp's third-quarter earnings but pent-up demand in the region should boost the No. 1 U.S. railroad's business in the fourth quarter  the company's top executive said on Wednesday.",
        "date": "09062017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific CEO says Harvey to impact Q3 EPS  lift demand in Q4 "
    },
    {
        "content": "* Says it expects Gulf Coast weather to cost around five cents per share on its Q3 results - SEC filing ​",
        "date": "09062017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific sees Gulf Coast weather costing around 5 cents/share on Q3 results "
    },
    {
        "content": "HOUSTON  Sept 2 Union Pacific Corp said on Saturday repairs to a rail line damaged by Tropical Stormy Harvey are being hindered by a fire at an Arkema chemical plant in Crosby  Texas.",
        "date": "09022017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific says Arkema chemical plant fire hindering line repairs "
    },
    {
        "content": "Union Pacific Corp and BNSF Railway are making progress restoring limited rail service and repairing facilities in parts of southeastern Texas hit by Hurricane Harvey  the two leading U.S. railroads said on Thursday.",
        "date": "09012017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Top U.S. railroads resume limited operations in storm-hit Texas "
    },
    {
        "content": "Aug 31 Union Pacific Corp and BNSF Railway are making progress restoring limited rail service and repairing facilities in parts of southeastern Texas hit by Hurricane Harvey  the two leading U.S. railroads said on Thursday.",
        "date": "09012017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 2-Top U.S. railroads resume limited operations in storm-hit Texas "
    },
    {
        "content": "Aug 31 No. 1 U.S. railroad Union Pacific Corp said on Thursday workers completed repairs on rail infrastructure between storm-battered Houston and outlying Bryan to the north and Angleton to the south.",
        "date": "08312017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific says repairs completed on lines out of Houston "
    },
    {
        "content": "* Union Pacific Corp says ‍on August 30  Union Pacific Railroad Company completed a real estate sale​ - SEC filing",
        "date": "08302017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific Corp says ‍on August 30  Union Pacific Railroad Company completed a real estate sale​ - SEC filing "
    },
    {
        "content": "DETROIT  Aug 29 No. 1 U.S. railroad Union Pacific Corp said on Tuesday that a key rail gateway in Texas linking the United States and Mexico remains open  allowing the company to keep running trains north and south.",
        "date": "08292017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific re-routing rail freight between Mexico  Texas "
    },
    {
        "content": "DETROIT  Aug 30 Union Pacific Corp said on Wednesday it should begin cleanup operations at two rail freight yards in Houston on Wednesday or Thursday but warned that areas east of the city are \"still inaccessible at this time.\"",
        "date": "08302017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific eyes Houston clean-up  inspecting damaged track "
    },
    {
        "content": "Aug 16 Union Pacific Corp said on Wednesday it will cut roughly 500 management jobs and 250 railroad workers by mid-September as the No. 1 U.S. railroad continues broader cost-cutting.",
        "date": "08162017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific to layoff 750 U.S. employees amid broader cost-cutting "
    },
    {
        "content": "* Approved and commenced a management and administrative personnel reorganization plan​",
        "date": "08162017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific ‍approves & commences a personnel reorganization plan​ "
    },
    {
        "content": "* Qtrly net profit 402.9 million baht versus 384.7 million baht Source text for Eikon: Further company coverage:",
        "date": "08152017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Saha-Union Pcl posts qtrly net profit of 402.9 mln baht "
    },
    {
        "content": "* Union Pacific elects Bhavesh \"Bob\" V. Patel to board of directors Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific elects Bhavesh Patel to the board "
    },
    {
        "content": "DETROIT The No. 1 U.S. railroad Union Pacific Corp  reported a better-than-expected quarterly net profit on Thursday  driven by an 11 percent increase in freight revenue  and said it expected business volumes would pick up in the second half of the year.",
        "date": "07202017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Rising freight lifts Union Pacific profit  beats expectations "
    },
    {
        "content": "DETROIT  July 20 The No. 1 U.S. railroad Union Pacific Corp reported a better-than-expected quarterly net profit on Thursday  driven by an 11 percent increase in freight revenue  and said it expected business volumes would pick up in the second half of the year.",
        "date": "07202017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 3-Rising freight lifts Union Pacific profit  beats expectations "
    },
    {
        "content": "DETROIT  July 20 No. 1 U.S. railroad Union Pacific Corp on Thursday reported a higher quarterly net profit  driven by a 11 percent increase in freight revenue  including a 25 percent jump in coal.",
        "date": "07202017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific quarterly profit rises "
    },
    {
        "content": "* Q2 earnings per share view $1.39 -- Thomson Reuters I/B/E/S",
        "date": "07202017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific Q2 earnings per share $1.45 "
    },
    {
        "content": "U.S. retailers may see a much-needed boost from the coming back-to-school shopping season if the pickup in incoming merchandise traffic from Asia seen by the largest U.S. railroad is any guide.",
        "date": "06282017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "U.S. back-to-school shipments returning to normal: Union Pacific CEO "
    },
    {
        "content": "* Sets quarterly dividend of $0.605 per share Source text for Eikon: Further company coverage:",
        "date": "05112017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific sets quarterly dividend of $0.605 per share "
    },
    {
        "content": "DETROIT Union Pacific Corp  on Thursday reported better-than-expected quarterly profit  lifted in particular by a 25 percent jump in coal freight volume  and said it expects its freight business to grow in the low single digits in 2017.",
        "date": "04272017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific profit lifted by rising coal volumes "
    },
    {
        "content": "DETROIT  April 27 Union Pacific Corp on Thursday reported better-than-expected quarterly profit  lifted in particular by a 25 percent jump in coal freight volume  and said it expects its freight business to grow in the low single digits in 2017.",
        "date": "04272017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 2-Union Pacific profit lifted by rising coal volumes "
    },
    {
        "content": "* Union pacific corp - q1 business volumes  as measured by total revenue carloads  increased 2 percent compared to 2016",
        "date": "04272017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific Q1 EPS $1.32 "
    },
    {
        "content": "April 27 Union Pacific Corp  No. 1 U.S. railroad  reported a 9.5 percent rise in quarterly profit  led by higher freight revenue from coal.",
        "date": "04272017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific profit rises 9.5 pct "
    },
    {
        "content": "* Union Pacific Corp files for offering of notes due 2027 and 2047; size not disclosed - SEC filing Source: (http://bit.ly/2nv8bpg) Further company coverage:",
        "date": "03292017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific Corp files for offering of notes due 2027 and 2047 "
    },
    {
        "content": "* Recent weather challenges on western part of network not expected to change 2017 capital plan of about $3.1 billion",
        "date": "03082017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific expects weather challenges to reduce earnings in Q1 by about three to four cents per share "
    },
    {
        "content": "Ordering a bottle of Corona beer at a bar in the United States is a simple proposition.",
        "date": "01282017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "What it takes to get a Corona from Mexico to a U.S. heartland bar "
    },
    {
        "content": "DETROIT No. 1 U.S. railroad Union Pacific Corp  on Thursday reported a better-than-expected quarterly net profit and said 2017 looked like a better year for the railroad's business following two tough years of slumping coal freight volumes  sending its stock up nearly 5 percent.",
        "date": "01192017",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific profit beats estimates  'optimistic' about 2017 "
    },
    {
        "content": "DETROIT  Jan 19 The top executive at Union Pacific Corp said on Thursday that the No. 1 U.S. railroad remains opposed to mergers between major railroads in the United States.",
        "date": "01192017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 1-Union Pacific CEO: 'we are opposed to' major railroad mergers "
    },
    {
        "content": "DETROIT  Jan 19 The top executive at Union Pacific Corp said on Thursday that the No. 1 U.S. railroad remains opposed to mergers between major railroads in the United States.",
        "date": "01192017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific CEO- \"we are opposed to\" major railroad mergers "
    },
    {
        "content": "DETROIT  Jan 19 No. 1 U.S. railroad Union Pacific Corp on Thursday reported a better-than-expected quarterly net profit and said 2017 looked like a better year for the railroad's business following two tough years of slumping coal freight volumes  sending its stock up nearly 5 percent.",
        "date": "01192017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 2-Union Pacific profit beats estimates  \"optimistic\" about 2017 "
    },
    {
        "content": "DETROIT  Jan 19 No. 1 U.S. railroad Union Pacific Corp on Thursday reported a higher quarterly net profit  as improved efficiency and lower costs offset a slight drop in revenue.",
        "date": "01192017",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific quarterly profit rises "
    },
    {
        "content": "* Union Pacific appoints Eric Butler executive vice president and chief administrative officer  Beth Whited executive vice president and chief marketing officer  Source text for Eikon:  Further company coverage:",
        "date": "11172016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific appoints Eric Butler executive VP and chief administrative officer "
    },
    {
        "content": "* Union Pacific Corporation announces new share repurchase authorization and a 10 percent dividend increase for fourth quarter 2016",
        "date": "11172016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific announces new share repurchase authorization  10 pct dividend increase for Q4 "
    },
    {
        "content": "DETROIT Union Pacific Corp reported a lower-than-expected quarterly profit as freight volumes declined and it forecast a further drop in the current period due partly to the strong U.S. dollar and soft demand for consumer goods.",
        "date": "10202016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Falling freight hurts Union Pacific third quarter profit; stock slides "
    },
    {
        "content": "DETROIT The top executive of railroad Union Pacific Corp said on Thursday that despite negative election campaign rhetoric about free trade agreements  they have benefited the U.S. economy and he is optimistic Congress will pass the Trans Pacific Partnership.",
        "date": "10202016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Despite U.S. campaign rhetoric  Union Pacific CEO upbeat on TPP "
    },
    {
        "content": "DETROIT  Oct 20 Union Pacific Corp  reported a lower-than-expected quarterly profit as freight volumes declined and it forecast a further drop in the current period due partly to the strong U.S. dollar and soft demand for consumer goods.",
        "date": "10202016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 4-Falling freight hurts Union Pacific 3rd-qtr profit; stock slides "
    },
    {
        "content": "* Q3 earnings per share view $1.40 -- Thomson Reuters I/B/E/S",
        "date": "10202016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific Q3 EPS $1.36 "
    },
    {
        "content": "DETROIT  Oct 20 No. 1 U.S. railroad Union Pacific Corp on Thursday reported a lower quarterly net profit  citing a 6 percent drop in freight volumes amid a 14 percent decline in coal.",
        "date": "10202016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific Q3 profit falls as freight volumes drop 6 percent "
    },
    {
        "content": "* Select Sands enters into an agreement including option to purchase dry plant  operating equipment  and sand inventory located near Select Sands' Sandtown quarry on Union Pacific Rail Line",
        "date": "10042016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Select Sands agrees to purchase dry plant  operating equipment  sand inventory located on Union Pacific Rail Line "
    },
    {
        "content": "* Expiration of private offers to exchange certain of its outstanding notes and debentures  expired on September 29  2016",
        "date": "09302016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific announces expiration of exchange offers "
    },
    {
        "content": "* Pricing terms of private offers to exchange certain outstanding notes  debentures for a combination of new notes due 2051  Source text for Eikon:  Further company coverage:",
        "date": "09162016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union pacific reports pricing terms of exchange offers "
    },
    {
        "content": "* Union Pacific Corporation announces results to date of exchange offers and increase in size of exchange offers limit",
        "date": "09162016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific announces results to date of exchange offers and increase in size of exchange offers limit "
    },
    {
        "content": "* Files for potential notes offering; size not disclosed - sec filing  Source text : http://bit.ly/2aH9iP3 Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "08012016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific files for potential notes offering size not disclosed "
    },
    {
        "content": "CHICAGO Union Pacific Corp  on Thursday posted a lower quarterly net profit that was hurt by slumping freight volumes - especially coal - and warned the strong U.S. dollar  soft global economy and weak consumer demand would weigh on the No. 1 U.S. railroad's business in the second half of 2016.",
        "date": "07212016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific profit falls  freight seen weak for rest of 2016 "
    },
    {
        "content": "CHICAGO Full-year 2016 freight volumes at Union Pacific Corp  could fall between 6 percent and 8 percent from 2015  driven by declining coal volumes  weak shale oil business and the strong U.S. dollar  the company's top executive said on Thursday.",
        "date": "07212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific CEO says 2016 freight volumes could drop 6-8 percent "
    },
    {
        "content": "CHICAGO  July 21 Union Pacific Corp on Thursday posted a lower quarterly net profit that was hurt by slumping freight volumes - especially coal - and warned the strong U.S. dollar  soft global economy and weak consumer demand would weigh on the No. 1 U.S. railroad's business in the second half of 2016.",
        "date": "07212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 4-Union Pacific profit falls  freight seen weak for rest of 2016 "
    },
    {
        "content": "CHICAGO  July 21 Full-year 2016 freight volumes at Union Pacific Corp could fall between 6 percent and 8 percent from 2015  driven by declining coal volumes  weak shale oil business and the strong U.S. dollar  the company's top executive said on Thursday.",
        "date": "07212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 1-Union Pacific CEO says 2016 freight volumes could drop 6-8 pct "
    },
    {
        "content": "* Union Pacific Corp says Q2 operating ratio of 65.2 percent  up 1.1 points",
        "date": "07212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific Q2 EPS $1.17 "
    },
    {
        "content": "CHICAGO  July 21 Union Pacific Corp on Thursday reported a lower quarterly net profit  citing lower freight volumes led by a 27 percent decline in coal revenue for the No. 1 U.S. railroad.",
        "date": "07212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific quarterly profit hurt by falling freight "
    },
    {
        "content": "A Union Pacific train carrying crude oil derailed and burst into flames along Oregon's scenic Columbia River gorge on Friday in the first major rail accident involving crude in a year. | Video ",
        "date": "06062016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Oregon derailment likely to reignite oil-by-rail safety concerns "
    },
    {
        "content": "June 3 A Union Pacific train carrying crude oil derailed and burst into flames along Oregon's scenic Columbia River gorge on Friday in the first major rail accident involving crude in a year.",
        "date": "06042016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "UPDATE 6-Oregon derailment likely to reignite oil-by-rail safety concerns "
    },
    {
        "content": "* Company now expects total volumes to be down in low teens in Q2 of 2016 versus prior year",
        "date": "05172016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "BRIEF-Union Pacific expects Q2 total volumes to be down in low teens "
    },
    {
        "content": "CHICAGO Union Pacific Corp  on Thursday posted an unexpectedly higher first-quarter profit as it cut costs to meet falling demand  but the No. 1 U.S. railroad said it remained challenged by low energy prices  a strong U.S. dollar and weak retail sales.",
        "date": "04212016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific profit beats expectations on cost cuts "
    },
    {
        "content": "CHICAGO No. 1 U.S. railroad Union Pacific Corp  said on Thursday that it was trimming its planned capital expenditures for 2016 by 2 percent and could further cut investments depending on demand in a weak freight market across most of its segments.",
        "date": "04212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific CEO: 'more downward pressure' than upward on capex "
    },
    {
        "content": "CHICAGO  April 21 No. 1 U.S. railroad Union Pacific Corp said on Thursday that it was trimming its planned capital expenditures for 2016 by 2 percent and could further cut investments depending on demand in a weak freight market across most of its segments.",
        "date": "04212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 1-Union Pacific CEO: \"more downward pressure\" than upward on capex "
    },
    {
        "content": "CHICAGO  April 21 No. 1 U.S. railroad Union Pacific Corp said on Thursday that it was trimming its planned capital expenditures for 2016 by 2 percent and could further cut investments depending on demand in a weak freight market across most of its segments.",
        "date": "04212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific CEO: falling freight could push 2016 capex lower "
    },
    {
        "content": "CHICAGO  April 21 Union Pacific Corp on Thursday posted an unexpectedly higher first-quarter profit as it cut costs to meet falling demand  but the No. 1 U.S. railroad said it remained challenged by low energy prices  a strong U.S. dollar and weak retail sales.",
        "date": "04212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 2-Union Pacific profit beats expectations on cost cuts "
    },
    {
        "content": "CHICAGO  April 21 Union Pacific Corp on Thursday posted a lower quarterly profit due to falling freight volumes  driven primarily by declines in coal  but the results came in above expectations as the No. 1 U.S. railroad cut costs to match falling demand.",
        "date": "04212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific profit falls  beats expectations "
    },
    {
        "content": "CHICAGO Facing a freight recession caused by slumping commodity prices and industrial output  No. 1 U.S. railroad Union Pacific Corp  said Thursday hopes of strong economic growth have so far been undermined by a key missing ingredient - the American consumer.",
        "date": "01212016",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific CEO says consumers 'just don't seem to be showing up' "
    },
    {
        "content": "CHICAGO Union Pacific Corp reported a lower quarterly profit on Thursday as slumping commodities prices and ailing industrial production hurt freight volumes  and the No. 1 U.S. railroad warned 2016 does not look much better for its business.",
        "date": "01212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Falling freight hurts Union Pacific profit  outlook bleak; shares drop "
    },
    {
        "content": "CHICAGO  Jan 21 Union Pacific Corp  reported a lower quarterly profit on Thursday as slumping commodities prices and ailing industrial production hurt freight volumes  and the No. 1 U.S. railroad warned 2016 does not look much better for its business.",
        "date": "01212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 3-Falling freight hurts Union Pacific profit  outlook bleak; shares drop "
    },
    {
        "content": "CHICAGO  Jan 21 No. 1 U.S. railroad Union Pacific Corp on Thursday posted a lower quarterly profit amid a 9 percent drop in freight volumes.",
        "date": "01212016",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific quarterly profit drops with freight volumes "
    },
    {
        "content": "A Union Pacific freight train carrying cement derailed in Texas on Saturday as flood waters covered the tracks about 55 miles (90 km) south of Dallas  putting locomotives and some of its rail cars on their side  according to a company spokesman and TV footage. | Video ",
        "date": "10242015",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific freight train derails in Texas on flooded tracks "
    },
    {
        "content": "Oct 24 A Union Pacific freight train carrying cement derailed in Texas on Saturday as flood waters covered the tracks about 55 miles (90 km) south of Dallas  putting locomotives and some of its rail cars on their side  according to a company spokesman and TV footage.",
        "date": "10242015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 1-Union Pacific freight train derails in Texas on flooded tracks "
    },
    {
        "content": "Oct 24 A Union Pacific freight train derailed in southeast Texas early Saturday morning as flood waters covered the tracks about 55 miles south of Dallas  putting a locomotive and rail cars on their side  according to a company spokesman and TV footage.",
        "date": "10242015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific freight train derails in Texas "
    },
    {
        "content": "CHICAGO/NEW YORK  Sept 28 Investors in U.S. railroad stocks  who have been punished in 2015 by an accelerating decline in high-margin coal shipments  now are pinning their long-term hopes on a resurgence in consumer spending.",
        "date": "09282015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "After calamitous year for coal  U.S. consumers hold key for rails "
    },
    {
        "content": "CHICAGO Union Pacific Corp   a railroad contending with declining coal  energy-related and agricultural freight volumes  sees some signs that consumer demand for cars and other big-ticket items will help boost business  its top executive said on Thursday.",
        "date": "07232015",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific CEO waiting for a consumer-led U.S. recovery "
    },
    {
        "content": "CHICAGO No. 1 U.S. railroad Union Pacific Corp  reported a lower quarterly net profit on Thursday as freight volumes dropped 6 percent  sending shares down more than 2 percent in early trading.",
        "date": "07232015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific profit hit by lower freight volumes  shares drop "
    },
    {
        "content": "CHICAGO  July 23 No. 1 U.S. railroad Union Pacific Corp reported a lower quarterly net profit on Thursday as freight volumes dropped 6 percent  sending shares down more than 2 percent in early trading.",
        "date": "07232015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 2-Union Pacific profit hit by lower freight volumes  shares drop "
    },
    {
        "content": "CHICAGO  July 23 No. 1 U.S. railroad Union Pacific Corp on Thursday reported a lower quarterly net profit due to a 6 percent drop in freight volumes led by a sharp decline in coal shipments.",
        "date": "07232015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific profit driven down by lower coal freight "
    },
    {
        "content": "HOUSTON Union Pacific Corp will impose a $1 200 per-car surcharge on oil shippers that move crude in older railcars  the company told customers this week  becoming at least the second U.S. railroad to charge extra amid widespread safety concerns.",
        "date": "07012015",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Union Pacific imposing hefty surcharge on older crude railcars "
    },
    {
        "content": "HOUSTON  July 1 Union Pacific Corp will impose a $1 200 per-car surcharge on oil shippers that move crude in older railcars  the company told customers this week  becoming at least the second U.S. railroad to charge extra amid widespread safety concerns.",
        "date": "07012015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 1-Union Pacific imposing hefty surcharge on older crude railcars "
    },
    {
        "content": "AUSTIN  Texas  May 15 A Union Pacific Corp  freight train carrying gravel derailed south of San Antonio on Friday with no reported of injuries  the railroad company said.",
        "date": "05152015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Freight train carrying gravel derails south of San Antonio "
    },
    {
        "content": "CHICAGO Union Pacific Corp is scrambling to cope with opposing trends across its network after a drop in freight volumes in the first quarter  the No. 1 U.S. railroad's top executive said on Thursday.",
        "date": "04232015",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "After tumultuous quarter  Union Pacific works to adjust network "
    },
    {
        "content": "CHICAGO  April 22 Union Pacific Corp  said on Thursday its first quarter results were hurt by a drop in coal volumes and the company warned coal would continue to weigh on its results throughout the year.",
        "date": "04232015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 2-Weak coal volumes help propel earnings miss at Union Pacific "
    },
    {
        "content": "CHICAGO No. 1 U.S. railroad Union Pacific Corp  on Thursday reported a higher quarterly net profit as lower fuel costs and pricing gains offset falling freight volumes  but results fell short of market expectations.",
        "date": "04232015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific profit rises but misses expectations "
    },
    {
        "content": "CHICAGO  April 22 No. 1 U.S. railroad Union Pacific Corp on Thursday reported a higher quarterly net profit  as lower fuel costs and pricing gains offset falling freight volumes.",
        "date": "04232015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific quarterly profit rises "
    },
    {
        "content": "A Texas judge has dismissed a lawsuit against Union Pacific Corp  brought in connection with a 2012 collision between a freight train and a parade float that killed four veterans in Texas.",
        "date": "02132015",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Lawsuit against Union Pacific over deadly Texas collision dismissed "
    },
    {
        "content": "Feb 12 A Texas judge has dismissed a lawsuit against Union Pacific Corp brought in connection with a 2012 collision between a freight train and a parade float that killed four veterans in Texas.",
        "date": "02122015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Lawsuit against Union Pacific over deadly Texas collision dismissed "
    },
    {
        "content": "WASHINGTON  Feb 2 U.S. railroads expect to boost spending to $29 billion this year to lay track  add engines and otherwise upgrade a national network tested by a surge in energy and agriculture deliveries  the leading industry trade group said on Monday.",
        "date": "02022015",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "CORRECTED-U.S. rail sector plans to boost infrastructure spending as volumes rise "
    },
    {
        "content": "CHICAGO The recent drop in oil prices has left No. 1 U.S. railroad Union Pacific Corp  cautiously optimistic about U.S. economic prospects for 2015  anticipating a good year for auto sales and consumer spending  with an eye on oil output in North Dakota.",
        "date": "01222015",
        "name": "Union Pacific Corporation",
        "news_type": "topStory",
        "symbol": "UNP",
        "title": "Oil price drop leaves Union Pacific cautiously upbeat on economy "
    },
    {
        "content": "CHICAGO  Jan 22 The recent drop in oil prices has left No. 1 U.S. railroad Union Pacific Corp  cautiously optimistic about U.S. economic prospects for 2015  anticipating a good year for auto sales and consumer spending  with an eye on oil output in North Dakota.",
        "date": "01222015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "UPDATE 3-Oil price drop leaves Union Pacific cautiously upbeat on economy "
    },
    {
        "content": "CHICAGO  Jan 22 No. 1 U.S. railroad Union Pacific Corp on Thursday reported a 22 percent jump in quarterly profit that beat analyst estimates  driven by rising freight volumes and higher revenue from increased freight rates.",
        "date": "01222015",
        "name": "Union Pacific Corporation",
        "news_type": "normal",
        "symbol": "UNP",
        "title": "Union Pacific quarterly profit jumps  beats estimates "
    }
]