[
    {
        "content": "* UPS and Shopify Inc announce a platform integration that make UPS's premium services available to small businesses​ Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS and Shopify Inc announce platform integration "
    },
    {
        "content": "* UPS - ‍board adopted amended bylaws including proxy access​ Source text for Eikon: Further company coverage:",
        "date": "11172017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS adopts proxy bylaw "
    },
    {
        "content": "* UPS and NYSERDA to convert UPS diesel delivery trucks in NYC to electric",
        "date": "11092017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS and NYSERDA to convert UPS diesel delivery trucks in NYC to electric "
    },
    {
        "content": "* UPS - ‍announced launch of an ebike that will deliver packages in Pittsburgh​ Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS launches ebike solution in Pittsburgh "
    },
    {
        "content": "* UPS - ‍declared a regular quarterly dividend of $0.83 per share on all outstanding class A and class B shares​ Source text for Eikon: Further company coverage:",
        "date": "11022017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS board announces quarterly dividend "
    },
    {
        "content": "* UPS - ‍announced construction of a new package distribution facility in Aurora that will create more than 700 new jobs when fully operational",
        "date": "10312017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS reports construction of a new package distribution facility in Aurora "
    },
    {
        "content": "DETROIT  Oct 25 United Parcel Service Inc said on Wednesday it would raise rates across many of its U.S. services by 4.9 percent later this year  with surcharge increases for next year's peak season focused mainly on residential addresses.",
        "date": "10252017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS announces U.S. rate hikes  new peak surcharges for 2018 "
    },
    {
        "content": "United Parcel Service Inc  reported a slightly lower quarterly net profit on Thursday due to U.S. hurricanes and higher costs for Saturday delivery but lifted its full-year forecast  citing global shipping strength and expectations for the crucial holiday season.",
        "date": "10262017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS hit by hurricanes but rosy on holiday shipping "
    },
    {
        "content": "United Parcel Service Inc  told customers about extra holiday charges for 2018 much earlier than it did this year to give major retailers a full year to plan shipping schedules and defray costs  Chief Executive David Abney said on Thursday.",
        "date": "10262017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS CEO says early peak charges reflect retailer demands "
    },
    {
        "content": "Oct 26 United Parcel Service Inc reported a slightly lower quarterly net profit on Thursday due to U.S. hurricanes and higher costs for Saturday delivery but lifted its full-year forecast  citing global shipping strength and expectations for the crucial holiday season.",
        "date": "10262017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 3-UPS hit by hurricanes but rosy on holiday shipping "
    },
    {
        "content": "* UPS - ‍UPS plans to deliver more than 750 million packages globally in 25 days between Thanksgiving and New Year's Eve​",
        "date": "10262017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS plans to deliver more than 750 million packages globally between Thanksgiving and New Year's Eve​ "
    },
    {
        "content": "Oct 26 United Parcel Service Inc reported a quarterly net profit on Thursday that was pulled down by the impact of hurricanes that hit the U.S. South in August and September.",
        "date": "10262017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS quarterly results impacted by hurricanes "
    },
    {
        "content": "DETROIT The top executive of United Parcel Service Inc  said on Wednesday he is optimistic the U.S.  Canadian and Mexican governments can successfully renegotiate NAFTA  and said not having a free trade agreement in place would not be good for the three countries' economies.",
        "date": "10182017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS CEO says updated NAFTA better for economy than no trade treaty "
    },
    {
        "content": "* UPS and the International Brotherhood Of Teamsters begin contract negotiations",
        "date": "10092017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS and the International Brotherhood Of Teamsters begin contract negotiations "
    },
    {
        "content": "Oct 5 Shares of United Parcel Service Inc and FedEx Corp fell on Thursday after a report that Amazon.com Inc was testing its own delivery service  potentially encroaching on the territory of the package delivery companies.",
        "date": "10052017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS  FedEx down on report of Amazon's own delivery service "
    },
    {
        "content": "* ‍polonez Parcel Service says co  UPS announce agreement to make shipping to Poland \"easier for customers\"​ Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-Polonez Parcel Services and UPS enters deal to make shipping to Poland  easier "
    },
    {
        "content": "Oct 5 U.S. package delivery service UPS has re-established shipping to the bulk of Puerto Rico's postal areas  the company said on Thursday  although power outages and blocked roads continue to hamper deliveries.",
        "date": "10052017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS restores Puerto Rico delivery routes "
    },
    {
        "content": "* UPS says has reestablished delivery service to Puerto Rico after Hurricane Maria",
        "date": "10052017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS says has re-established delivery service to Puerto Rico after Hurricane Maria "
    },
    {
        "content": "DETROIT United Parcel Service Inc  and Chinese express delivery company SF Holding  said on Thursday they have received approval from Chinese regulators for an international package delivery services joint venture.",
        "date": "09282017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "China regulator OKs joint venture of UPS  SF Holding "
    },
    {
        "content": "* UPS expands flight training infrastructure  strategic investment to fuel growth",
        "date": "10022017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS expands flight training infrastructure  strategic investment "
    },
    {
        "content": "DETROIT  Sept 28 United Parcel Service Inc and Chinese express delivery company SF Holding said on Thursday they have received approval from Chinese regulators for an international package delivery services joint venture. The two companies have been working together since 2015 and announced their planned alliance \"to collaborate on development and provision of international delivery services\" back in May. With approval from China's Ministry of Commerce  the firms said in a statement ",
        "date": "09282017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-China regulator OKs joint venture of UPS  SF Holding "
    },
    {
        "content": "DETROIT  Sept 28 United Parcel Service Inc and Chinese express delivery company SF Holding said on Thursday they have received approval from Chinese regulators for an international package delivery services joint venture. Under the joint venture  the two companies will initially provide package delivery services from China to the United States  which will be expanded to other countries in the future. (Reporting By Nick Carey; Editing by Chizu Nomiyama)",
        "date": "09282017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "China regulator approves UPS  SF Holding joint venture "
    },
    {
        "content": "Sept 20 Package delivery company United Parcel Service Inc said it expected to hire about 95 000 seasonal employees for its crucial peak holiday season for the fourth straight year.",
        "date": "09202017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS expects to hire about 95 000 workers for holiday season "
    },
    {
        "content": "* ‍Moody's says UPS  FedEx peak-season surcharges will partially offset rising e-commerce delivery costs​",
        "date": "09262017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-‍Moody's says UPS  FedEx peak-season surcharges will partially offset rising e-commerce delivery costs​ "
    },
    {
        "content": "* Teamsters says about 1 300 employees who maintain ups' air fleet filed request with nmb asking to be released from mediated contract negotiations with co Further company coverage:",
        "date": "09212017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-Teamsters says about 1 300 employees who maintain UPS' air fleet filed request with NMB "
    },
    {
        "content": "Sept 20 U.S. package delivery company United Parcel Service Inc said on Wednesday it expected to hire about 95 000 seasonal employees for the upcoming  crucial peak holiday season.",
        "date": "09202017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-UPS expects to hire about 95 000 workers for holiday season "
    },
    {
        "content": "    By Tom Hals     WILMINGTON  Del  Sept 5 Roughly 34 000 union members who work for United Parcel Service Inc         and other logistics companies in New York will decide on Wednesday whether to accept deep pension cuts in what could be the start of a wave of benefit reductions to shore up union retirement plans.     If approved  pensions for retired teamsters from nine New York local unions will be cut 29 percent  which the plan's trustees have said will lower the typical monthly",
        "date": "09062017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "NY teamsters weigh pension cuts in groundbreaking vote "
    },
    {
        "content": "United Parcel Service Inc  and FedEx Corp  said they resumed flights at Houston's main airport on Thursday afternoon and restarted some Texas operations crippled by Hurricane Harvey.",
        "date": "08312017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS  FedEx resume operations in some parts of storm-battered Texas "
    },
    {
        "content": "Aug 31 United Parcel Service Inc and FedEx Corp said they resumed flights at Houston's main airport on Thursday afternoon and restarted some Texas operations crippled by Hurricane Harvey.",
        "date": "08312017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 4-UPS  FedEx resume operations in some parts of storm-battered Texas "
    },
    {
        "content": "Aug 31 United Parcel Service Inc said on Thursday it resumed operations in Austin and some parts of Corpus Christi  Texas  that were halted due to Hurricane Harvey  though operations remained closed in the storm-battered Houston area.",
        "date": "08312017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS resumes operations in some parts of storm-battered Texas "
    },
    {
        "content": "* UPS -  UPS access point network now includes more than 1 000 locations offering package services in Canada Source text for Eikon: Further company coverage:",
        "date": "08162017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS access point network now includes more than 1 000 locations offering package services in Canada "
    },
    {
        "content": "* It will offer UPS returns manager  a free online tool that allows e-commerce merchants to customize return shipments according to their policy​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "08082017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS says to offer customizable return shipment online tool "
    },
    {
        "content": "United Parcel Service Inc has agreed to pay $2 million to nearly 90 current and former workers to settle claims that it discriminated against disabled employees  the Equal Employment Opportunity Commission announced on Tuesday.",
        "date": "08092017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS agrees to pay $2 mln to settle EEOC allegations of disability bias "
    },
    {
        "content": "* launch of a new online business-to-business payment service powered by Payoneer Source text for Eikon: Further company coverage:",
        "date": "08072017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS announces online business-to-business payment service "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.83 per share Source text for Eikon: Further company coverage:",
        "date": "08032017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS sets regular qtrly dividend of $0.83/shr "
    },
    {
        "content": "FedEx Corp  said on Thursday it will not charge customers extra fees for most packages delivered to homes during the peak holiday shopping season this year  challenging rival United Parcel Service  which plans more widespread peak-season surcharges.",
        "date": "08032017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "FedEx will not charge extra for most holiday home deliveries "
    },
    {
        "content": "Aug 3 FedEx Corp said on Thursday it will not charge customers extra fees for most packages delivered to homes during the peak holiday shopping season this year  challenging rival United Parcel Service  which plans more widespread peak-season surcharges.",
        "date": "08032017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-FedEx will not charge extra for most holiday home deliveries "
    },
    {
        "content": "* ‍INVESTCAMP SP. Z O.O. UPS STAKE TO 3.7 PERCENT IN COMPANY​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "08012017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-Investcamp ups stake to 3.7 pct in Arteria "
    },
    {
        "content": "* Ups says ‍expanding its ability to ship alcohol  wine and beer to consumers around world​ Source text for Eikon: Further company coverage:",
        "date": "07312017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS ‍expanding its ability to ship alcohol  wine and beer "
    },
    {
        "content": "SEATTLE Republican U.S. President Donald Trump's efforts to renegotiate or scrap longstanding global trade deals are not protectionist and are more focused on winning better terms for American businesses  the top executive of United Parcel Service  said on Thursday.",
        "date": "07272017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "Trump's 'America First' push not protectionist: UPS CEO "
    },
    {
        "content": "* UPS - ‍looking to fill nearly 1 900 current part-time and full-time openings in three facilities in Columbus and Toledo areas​ Source text for Eikon: Further company coverage:",
        "date": "08032017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS ‍looking to fill part-time  full-time openings in Columbus  Toledo "
    },
    {
        "content": "SEATTLE/DETROIT United Parcel Service Inc on Thursday reported a higher-than-expected quarterly net profit due to rising ecommerce deliveries but investors worried about the company's performance in the back-half of the year and shares fell 4 percent.",
        "date": "07272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "U.S. ecommerce  price hikes lift UPS profit but shares fall on outlook "
    },
    {
        "content": "SEATTLE/DETROIT  July 27 United Parcel Service Inc on Thursday reported a higher-than-expected quarterly net profit due to rising ecommerce deliveries but investors worried about the company's performance in the back-half of the year and shares fell 4 percent.",
        "date": "07272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 5-U.S. ecommerce  price hikes lift UPS profit but shares fall on outlook "
    },
    {
        "content": "DETROIT  July 27 United Parcel Service Inc on Thursday reported a higher quarterly net profit due largely to a jump in ecommerce deliveries in its U.S. domestic package service.",
        "date": "07272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS quarterly profit rises on U.S. ecommerce deliveries "
    },
    {
        "content": "* UPS reports 2Q EPS of $1.58 as revenue grows across all segments",
        "date": "07272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS Q2 earnings per share $1.58 "
    },
    {
        "content": "* Anixter International Inc reports second quarter 2017 results",
        "date": "07252017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-Anixter International Q2 sales $2.0 billion "
    },
    {
        "content": "* XARUS HOLDINGS UPS STAKE TO 57.68 PERCENT IN COMPANY Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07062017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-Xarus Holdings ups stake to 57.68 pct in ZPC Otmuchow "
    },
    {
        "content": "* UPS - on june 23  co's unit amended the ups retirement plan and the ups excess coordinating benefit plan - sec filing",
        "date": "06272017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS says co's unit amended the UPS retirement plan and the UPS excess coordinating benefit plan "
    },
    {
        "content": "June 27 United Parcel Service Inc said on Tuesday it would add more vehicles that run on non-conventional power to its fleet by 2025  as the package delivery company looks to cut its greenhouse emissions.",
        "date": "06272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS looks to add more green vehicles to its fleet by 2025 "
    },
    {
        "content": "* UPS - announced new sustainability goals to add more alternative fuel  advanced technology vehicles to fleet while increasing its reliance on renewable energy sources",
        "date": "06272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS announces new sustainability goals to its fleet "
    },
    {
        "content": "DETROIT United Parcel Service Inc said on Monday it will levy surcharges on U.S. residential packages during its crucial peak holiday season this year as it seeks to combat the spiraling costs of delivering e-commerce packages.",
        "date": "06192017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS to levy holiday surcharges to battle e-commerce costs "
    },
    {
        "content": "DETROIT  June 19 United Parcel Service Inc said on Monday it will levy surcharges on U.S. residential packages during its crucial peak holiday season this year as it seeks to combat the spiraling costs of delivering e-commerce packages.",
        "date": "06192017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-UPS to levy holiday surcharges to battle e-commerce costs "
    },
    {
        "content": "June 19 United Parcel Service Inc said on Monday one or more peak surcharges will apply on packages shipped in the United States in addition to all other applicable charges  in selected weeks in the upcoming holiday season in November and December.",
        "date": "06192017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS announces peak surcharges in the U.S. for holiday season "
    },
    {
        "content": "* UPS - announced new peak charge applicable during selected weeks in Nov  Dec 2017 for U.S. residential  large packages and packages over maximum limits",
        "date": "06192017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS establishes new peak shipping charge "
    },
    {
        "content": "PARIS  June 19 Boeing will convert three second-hand 767 passenger planes to freighters on behalf of package delivery company United Parcel Service  the companies said on Monday.",
        "date": "06192017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS selects Boeing to convert three 767 jets into freighters "
    },
    {
        "content": "* Boeing  UPS announce agreement for 767 passenger to freighter conversions",
        "date": "06192017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-Boeing  UPS announce agreement for 767 passenger to freighter conversions "
    },
    {
        "content": "SAN FRANCISCO A UPS driver opened fire with a handgun inside a United Parcel Service Inc  delivery center in San Francisco on Wednesday  killing three co-workers before fatally shooting himself as police closed in  authorities and company officials said. | Video ",
        "date": "06152017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS worker kills three colleagues in San Francisco  turns gun on himself "
    },
    {
        "content": "SAN FRANCISCO  June 14 A UPS driver opened fire with a handgun inside a United Parcel Service Inc delivery center in San Francisco on Wednesday  killing three co-workers before fatally shooting himself as police closed in  authorities and company officials said.",
        "date": "06152017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 9-UPS worker kills 3 colleagues in San Francisco  turns gun on himself "
    },
    {
        "content": "A U.S. appeals court on Friday ordered United Parcel Service Inc to deliver information on how it tracks workers' medical conditions to the Equal Employment Opportunity Commission  marking the third time in recent weeks that a court has rejected a challenge to a subpoena from the agency.",
        "date": "06092017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "6th Circuit says UPS must comply with EEOC subpoena on medical records "
    },
    {
        "content": "NEW YORK  June 8 The United Parcel Service Inc said it will suspend the transit of goods to and from Qatar in Saudi Arabia  Egypt  the United Arab Emirates and Bahrain amid an ongoing dispute in the region.",
        "date": "06082017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS suspends transit of goods to and from Qatar in four Arab nations "
    },
    {
        "content": "* Plans for a new package processing hub in Goodyear  Arizona​",
        "date": "06012017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS ‍plans for a new package processing hub in Goodyear  Arizona​ "
    },
    {
        "content": "* Through this agreement parties will leverage their complementary networks  service portfolios  technologies and logistics expertise",
        "date": "05262017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS and SF Holding to establish joint venture "
    },
    {
        "content": "* UPS - construction is underway at Lenexa  Kansas hub in nation's midsection to add 200 000 square feet and more than 42 percent new processing capacity",
        "date": "05232017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS says construction underway at Lenexa  Kansas hub to add capacity "
    },
    {
        "content": "May 25 A federal judge ordered United Parcel Service Inc to pay nearly $247 million in damages and penalties for \"illegally shipping\" large volumes of untaxed cigarettes in New York state and City  a court filing showed on Thursday.",
        "date": "05262017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "U.S. court fines UPS $247 mln over illegal cigarette shipments "
    },
    {
        "content": "* U.S. Judge orders UPS to pay nearly $247 million in damages in New York lawsuit over illegal shipments of cigarettes – Court ruling",
        "date": "05262017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-U.S. court fines UPS $247 mln over illegal cigarette shipments "
    },
    {
        "content": "A federal judge ordered United Parcel Service Inc to pay nearly $247 million in damages and penalties for \"illegally shipping\" large volumes of untaxed cigarettes in New York state and City  a court filing showed on Thursday.",
        "date": "05262017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "U.S. court fines UPS $247 million over illegal cigarette shipments "
    },
    {
        "content": "May 25 United Parcel Service Inc on Thursday announced plans to form a joint venture agreement with Chinese express delivery firm SF Holdings  laying the groundwork to expand shipping services from China to the United States.",
        "date": "05262017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS  SF Holdings plan to join forces in Chinese shipping market "
    },
    {
        "content": "* UPS-Integrated customer-facing chatbot with ups my choice letting customers get information about incoming packages  deliveries without a tracking number Source text for Eikon: Further company coverage:",
        "date": "05152017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS integrates chatbot with UPS my choice "
    },
    {
        "content": "* UPS - offering C$750 million of 2.125% senior notes due 2024 - sec filing",
        "date": "05162017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service announces offering of C$750 mln of senior notes "
    },
    {
        "content": "* UPS files final term sheet with u.s. Sec related to its $600 million 2.350% senior notes offering due 2022 - sec filing Source text (http://bit.ly/2q8sYSH) Further company coverage:",
        "date": "05112017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS files final term sheet with U.S. SEC related to its $600 mln 2.350 pct senior notes offering due 2022 "
    },
    {
        "content": "* UPS - launched in Europe for urgent  time-critical shipments that require special handling such as aircraft parts or surgical tools Source text for Eikon: Further company coverage:",
        "date": "05102017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS Express Critical Service launches in Europe "
    },
    {
        "content": "* UPS files for potential floating rate senior notes and senior notes offering  size not disclosed - SEC filing Source text: (http://bit.ly/2q8F1hg) Further company coverage:",
        "date": "05112017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS files for potential floating rate senior notes and senior notes offering - SEC filing "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.83per share Source text for Eikon: Further company coverage:",
        "date": "05042017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS Board says regular quarterly dividend of $0.83 per share "
    },
    {
        "content": "* UPS - shareowners rejected shareholder proposal that sought to require board to reduce voting power of class A stock from 10 votes per share to 1 vote per share Source text for Eikon: Further company coverage:",
        "date": "05042017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS holds shareowners’ meeting  re-elects board members "
    },
    {
        "content": "April 30 A union representing 1 200 U.S. air maintenance workers at United Parcel Service Inc turned up pressure on the company on Sunday to settle a three-year contract dispute  saying it would seek clearance to strike.",
        "date": "04302017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS air maintenance workers threaten strike ahead of shareholders meeting "
    },
    {
        "content": "* Ups says to deploy a prototype extended range fuel cell electric vehicle in its rolling laboratory fleet of alternative fuel  advanced technology vehicles Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS unveils first extended range  fuel cell electric delivery vehicle "
    },
    {
        "content": "April 30 A union representing 1 200 U.S. air maintenance workers at United Parcel Service Inc turned up pressure on the company on Sunday to settle a three-year contract dispute  saying it would seek clearance to strike.",
        "date": "04302017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-UPS air maintenance workers threaten strike ahead of shareholders meeting "
    },
    {
        "content": "* UPS names Juan Perez Chief Information and Engineering Officer",
        "date": "04242017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS appoints Juan Perez as Chief Information and Engineering Officer "
    },
    {
        "content": "United Parcel Service Inc  reported a higher-than-expected quarterly net profit on Thursday as revenue grew across its domestic and international package delivery segments and as well as freight and supply chain operations.",
        "date": "04272017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS first-quarter profit tops estimates as revenue rises "
    },
    {
        "content": "April 27 United Parcel Service Inc reported a higher-than-expected quarterly net profit on Thursday as revenue grew across its domestic and international package delivery segments and as well as freight and supply chain operations.",
        "date": "04272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 4-UPS 1st-qtr profit tops estimates as revenue rises "
    },
    {
        "content": "NEW YORK UPS  chief executive David Abney on Thursday said the 15 percent corporate tax rate proposed by President Donald Trump would be \"very very positive\" for the company.",
        "date": "04272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Lower corporate tax rate would be 'very very positive': UPS CEO "
    },
    {
        "content": "NEW YORK  April 27 UPS chief executive David Abney on Thursday said the 15 percent corporate tax rate proposed by President Donald Trump would be \"very very positive\" for the company.",
        "date": "04272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Lower corporate tax rate would be \"very very positive\" - UPS CEO "
    },
    {
        "content": "* UPS generates 6.2% revenue growth and increases Q1 eps to $1.32",
        "date": "04272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS reports Q1 earnings per share $1.32 "
    },
    {
        "content": "NEW YORK  April 27 United Parcel Service Inc reported a higher quarterly net profit on Thursday as revenue grew across its domestic  international and supply chain and freight segments.",
        "date": "04272017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS sees higher profit as revenue grows "
    },
    {
        "content": "* Expanded its global dangerous goods shipping program by adding more than 400 new commodities",
        "date": "04122017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS expanded global dangerous goods shipping program "
    },
    {
        "content": "* UPS boosts Saturday operations  to increase e-commerce delivery speed",
        "date": "04032017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS boosts Saturday operations to increase e-commerce delivery speed "
    },
    {
        "content": "* UPS- under agreement from March 28  underwriters agreed to purchase $142.1 million aggregate principal amount of floating rate senior notes due 2067 Source text (http://bit.ly/2nEZYz9) Further company coverage:",
        "date": "03312017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS- under agreement from March 28  underwriters agreed to purchase $142.1 mln aggregate principal amount of floating rate senior notes due 2067 "
    },
    {
        "content": "* Ups - addition of six stations to its preferred full and less-than-container load multimodal rail service between europe and china  Source text for Eikon:  Further company coverage:",
        "date": "03282017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS expands China-Europe rail service "
    },
    {
        "content": "NEW YORK  March 24 A federal judge on Friday said United Parcel Service Inc is liable for having illegally shipped hundreds of thousands of cartons of untaxed cigarettes in New York  depriving the state and New York City of millions of dollars of taxes.",
        "date": "03242017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Judge finds UPS liable to New York over cigarette shipments "
    },
    {
        "content": "NEW YORK  March 24 A federal judge on Friday held United Parcel Service Inc liable for having illegally shipped hundreds of thousands of cartons of untaxed cigarettes in New York  depriving the state and New York City of millions of dollars of taxes.",
        "date": "03242017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-Judge finds UPS liable to New York over cigarette shipments "
    },
    {
        "content": "* UPS invests more than $90 million in natural gas vehicles and infrastructure",
        "date": "03152017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS says invests more than $90 mln in natural gas vehicles  infrastructure "
    },
    {
        "content": "* In New York lawsuit over alleged illegal shipments of cigarettes -- court ruling",
        "date": "03242017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS found liable after NY cigarette shipments trial  damages to be determined later "
    },
    {
        "content": "BRUSSELS An EU court agreed with United Parcel Service  on  Tuesday that the EU had wrongly blocked its takeover of Dutch peer TNT four years ago  potentially allowing the world's largest package delivery company to sue regulators for damages.",
        "date": "03072017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS wins court challenge against EU block to TNT bid "
    },
    {
        "content": "BRUSSELS  March 7 An EU court agreed with United Parcel Service on  Tuesday that the EU had wrongly blocked its takeover of Dutch peer TNT four years ago  potentially allowing the world's largest package delivery company to sue regulators for damages.",
        "date": "03072017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS wins court challenge against EU block to TNT bid "
    },
    {
        "content": "BRUSSELS  March 7 Europe's second highest court annulled on Tuesday a 2013 decision by EU regulators to block U.S. package delivery company United Parcel Service's bid for Dutch peer TNT  citing a procedural irregularity in the process.",
        "date": "03072017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "EU court annuls EU rejection of UPS  TNT merger "
    },
    {
        "content": "* UPS- will build a new regional operations hub in salt lake city",
        "date": "02232017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS says will build new regional operations hub in Salt Lake City "
    },
    {
        "content": "Package delivery company United Parcel Service Inc said on Tuesday it will consider raising prices across the board in coming years to offset pressure on margins  particularly from the rising costs of delivering packages to e-commerce customers.",
        "date": "02212017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS tests drone deliveries  eyes future price changes "
    },
    {
        "content": "Feb 21 Package delivery company United Parcel Service Inc said on Tuesday it will consider raising prices across the board in coming years to offset pressure on margins  particularly from the rising costs of delivering packages to e-commerce customers.",
        "date": "02212017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-UPS tests drone deliveries  eyes future price changes "
    },
    {
        "content": "* UPS accelerates transformation of its smart logistics network",
        "date": "02212017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS announces long-term financial targets  logistics expansion plan "
    },
    {
        "content": "Feb 21 Package delivery company United Parcel Service Inc tested home delivery by drone in Lithia  Florida  on Monday  the first step in what the company hopes will be a move toward more automated delivery.",
        "date": "02212017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS tests drone deliveries in Florida with eye to cost cuts "
    },
    {
        "content": "NEW YORK Package delivery company United Parcel Service Inc is launching Saturday ground operations in the United States  chief executive David Abney said at an investor event on Tuesday.",
        "date": "02212017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS launching Saturday ground operations in U.S.: CEO "
    },
    {
        "content": "NEW YORK  Feb 21 Package delivery company United Parcel Service Inc is launching Saturday ground operations in the United States  chief executive David Abney said at an investor event on Tuesday.",
        "date": "02212017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-UPS launching Saturday ground operations in U.S.- CEO "
    },
    {
        "content": "NEW YORK  Feb 21 Package delivery company United Parcel Service Inc is launching Saturday ground operations in the United States on a rolling basis  chief executive David Abney said at an investor event on Tuesday.   (Reporting by Luciana Lopez)",
        "date": "02212017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS launching Saturday ground operations in U.S.- CEO "
    },
    {
        "content": "* UPS - Moison's appointment to UPS board brings total number of directors to 12",
        "date": "02082017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS names Franck Moison to board of directors "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.83 per share  Source text for Eikon:  Further company coverage:",
        "date": "02082017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS board increases quarterly dividend "
    },
    {
        "content": "* Installations in eight of co's U.S. Facilities will be completed by end of 2017  Source text for Eikon:  Further company coverage:",
        "date": "02072017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS invests $18 million in on-site solar "
    },
    {
        "content": "* United Parcel Service Inc - announced addition of origin labeling capability for ups trade direct air and ocean services",
        "date": "02022017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service announces addition of origin labeling capability for UPS trade direct air  ocean services "
    },
    {
        "content": "SAN FRANCISCO Amazon.com Inc plans to invest $1.49 billion to build a large air cargo hub in northern Kentucky  state officials said on Tuesday  stoking expectations it may one day opt to directly compete with FedEx Corp and United Parcel Service Inc. | Video ",
        "date": "02012017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "Amazon to spend $1.49 billion on air cargo hub  fans talk of bigger ambitions "
    },
    {
        "content": "CHICAGO Facing lower margins from its rising e-commerce business  package delivery company United Parcel Service Inc  said on Tuesday that it would pull forward investments in automation and technology and could raise prices to offset the reduced profits from delivering packages to consumers.",
        "date": "01312017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "Facing rising e-commerce  UPS looks to automation  higher prices "
    },
    {
        "content": "SAN FRANCISCO  Jan 31 Amazon.com Inc  plans to invest $1.49 billion to build a large air cargo hub in northern Kentucky  state officials said on Tuesday  stoking expectations it may one day opt to directly compete with FedEx Corp and United Parcel Service Inc.",
        "date": "02012017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Amazon to spend $1.49 bln on air cargo hub  fans talk of bigger ambitions "
    },
    {
        "content": "CHICAGO  Jan 31 Facing lower margins from its rising e-commerce business  package delivery company United Parcel Service Inc said on Tuesday that it would pull forward investments in automation and technology and could raise prices to offset the reduced profits from delivering packages to consumers.",
        "date": "01312017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 5-Facing rising e-commerce  UPS looks to automation  higher prices "
    },
    {
        "content": "CHICAGO  Jan 31 Package delivery company United Parcel Service Inc on Tuesday posted a quarterly loss caused by a mark-to-market pension charge.",
        "date": "01312017",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Pension charge causes quarterly loss at UPS "
    },
    {
        "content": "* UPS acquires Freightex to accelerate expansion of U.K. and European truckload brokerage business",
        "date": "01092017",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS acquires Freightex to accelerate expansion of U.K. and European truckload brokerage business "
    },
    {
        "content": "ADDISON  Ill. In an unassuming building in the Chicago suburb of Addison  United Parcel Service Inc  engineers design custom boxes for retailers as part of a joint effort to tackle a vexing issue: the high cost of delivering e-commerce packages.",
        "date": "12152016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "Shippers  online retailers seek way around rising delivery costs "
    },
    {
        "content": "United Parcel Service Inc violated federal labor law when it fired a driver in Pennsylvania for his union activities and criticism of the company on social media  a National Labor Relations judge in Washington D.C. ruled on Friday.",
        "date": "11292016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS fired driver for union activities  social media use - NLRB judge "
    },
    {
        "content": "* United Parcel Service Inc -  launched a beta version of a chatbot which helps users find UPS locations  get shipping rates and track packages",
        "date": "11212016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service launches a beta version of a chatbot which helps users find UPS locations  get shipping rates and track packages "
    },
    {
        "content": "* United Parcel Service Inc - UPS forecasts holiday delivery of more than 700 million packages.",
        "date": "11152016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS forecasts record-breaking holiday shipments "
    },
    {
        "content": "CHICAGO  Nov 14 Air maintenance workers at United Parcel Service Inc have voted overwhelmingly to authorize a strike against the world's largest package delivery company as contract talks remained deadlocked over health-care benefits  the workers' union said on Monday.",
        "date": "11142016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS air maintenance workers vote 98 percent to authorize strike "
    },
    {
        "content": "CHICAGO  Nov 14 Air maintenance workers at United Parcel Service Inc have voted overwhelmingly to authorize a strike against the world's largest package delivery company as contract talks remained deadlocked over health-care benefits  the workers' union said on Monday.",
        "date": "11142016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-UPS air maintenance workers vote 98 percent to authorize strike "
    },
    {
        "content": "* When completed in fall of 2019  capacity will increase by one-third to more than 80 000 packages processed per hour",
        "date": "11112016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS to invest $196 mln to expand  modernize Jacksonville hub "
    },
    {
        "content": "* Ups announces new 1.2 million square foot regional hub in atlanta",
        "date": "11102016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS announces new 1.2 mln square foot regional hub in Atlanta "
    },
    {
        "content": "A U.S. appeals court on Friday reinstated a jury verdict against United Parcel Service Inc for subjecting a female employee to a hostile work environment.",
        "date": "11072016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "9th Circuit reinstates hostile work environment verdict against UPS "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.78 per share  Source text for Eikon:  Further company coverage:",
        "date": "11032016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS board announces quarterly dividend "
    },
    {
        "content": "New York state and city authorities sparred with United Parcel Service Inc on Wednesday during closing arguments in a trial over whether the world's largest package delivery company should be fined for allegedly delivering untaxed cigarettes from smoke shops on Native-American reservations.",
        "date": "11022016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "New York  UPS spar over proposed $872 mln fine for cigarette shipments "
    },
    {
        "content": "New York state and city authorities sparred with United Parcel Service Inc  on Wednesday during closing arguments in a trial over whether the world's largest package delivery company should be fined for allegedly delivering untaxed cigarettes from smoke shops on Native-American reservations.",
        "date": "11022016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "New York  UPS spar over proposed $872 million fine for cigarette shipments "
    },
    {
        "content": "Nov 2 New York state and city authorities sparred with United Parcel Service Inc on Wednesday during closing arguments in a trial over whether the world's largest package delivery company should be fined for allegedly delivering untaxed cigarettes from smoke shops on Native-American reservations.",
        "date": "11022016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-New York  UPS spar over proposed $872 mln fine for cigarette shipments "
    },
    {
        "content": "Nov 2 New York city and state authorities urged a federal judge on Wednesday to impose a fine of $872 million against United Parcel Service for delivering untaxed cigarettes from smoke shops on Indian reservations.",
        "date": "11022016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "NY authorities seek $872 mln fine on UPS for cigarette shipments "
    },
    {
        "content": "CHICAGO  Oct 27 United Parcel Service Inc  on Thursday said it expects another record-breaking holiday delivery season this year  but warned that a pension charge could hit fourth-quarter results.",
        "date": "10272016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPDATE 4-UPS expects record holiday deliveries  flags possible pension charge "
    },
    {
        "content": "CHICAGO United Parcel Service Inc  on Thursday reported a higher quarterly net profit that met analyst expectations and reiterated its full-year 2016 earnings outlook  but warned its fourth-quarter results could be affected by a year-end mark-to-market pension accounting adjustment.",
        "date": "10272016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS meets profit estimates  reiterates 2016 EPS outlook "
    },
    {
        "content": "NEW YORK/CHICAGO United Parcel Service Inc  said on Thursday it ordered 14 Boeing  747-8 cargo jets  a deal worth $5.3 billion at list prices that potentially breathes new life into an aircraft Boeing had warned it might cancel.",
        "date": "10272016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS CEO says $5.3 bln order for Boeing 747 freighters reflects demand "
    },
    {
        "content": "NEW YORK/CHICAGO  Oct 27 United Parcel Service Inc said on Thursday it ordered 14 Boeing 747-8 cargo jets  a deal worth $5.3 billion at list prices that potentially breathes new life into an aircraft Boeing had warned it might cancel.",
        "date": "10272016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS CEO says $5.3 bln order for Boeing 747 freighters reflects demand "
    },
    {
        "content": "* Agreement also includes an option to purchase an additional 14 of cargo airplanes  Source text for Eikon:  Further company coverage:",
        "date": "10272016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-Boeing  UPS announce order for 14 747-8 Freighters "
    },
    {
        "content": "NEW YORK  Oct 27 United Parcel Service Inc  said on Thursday it ordered 14 Boeing 747-8 cargo jets  a deal worth $5.3 billion at list prices that potentially breathes new life into an aircraft Boeing had warned it might cancel.",
        "date": "10272016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS places $5.3 bln order for 14 Boeing 747 cargo jets "
    },
    {
        "content": "* UPS forecasts holiday delivery of more than 700 million packages",
        "date": "10272016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS forecasts holiday delivery of more than 700 mln packages "
    },
    {
        "content": "* Files for senior notes offering of up to $500.0 million 2.400 percent senior notes due 2026",
        "date": "10212016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service files for senior notes offering "
    },
    {
        "content": "CHICAGO  Oct 27 Package delivery company United Parcel Service Inc on Thursday reported a higher quarterly net profit as revenue rose across all of its services  led by its key U.S. domestic package business.",
        "date": "10272016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS 3rd-qtr profit rises on higher revenue "
    },
    {
        "content": "* Q3 earnings per share view $1.44 -- Thomson Reuters I/B/E/S",
        "date": "10272016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS Q3 earnings per share $1.44 "
    },
    {
        "content": "* Files for senior notes offering of up to EUR 500.0 million - SEC filing",
        "date": "10212016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service files for senior notes offering of up to EUR 500 mln "
    },
    {
        "content": "HONG KONG Chinese logistics company ZTO Express is turning up the chance of a much more lucrative share listing at home in favor of an overseas IPO that lets its founder retain control and its investors cash out more easily.",
        "date": "10212016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "ZTO spurns huge China valuations for benefits of U.S. listing "
    },
    {
        "content": "* ZTO selling 72.1 mln ADS in New York in $16.50-$18.50 range",
        "date": "10212016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "ZTO spurns huge China valuations for benefits of US listing "
    },
    {
        "content": "* United Parcel Service Inc says  expansion of its earliest morning package delivery service  UPS worldwide express plus  Source text for Eikon:  Further company coverage:",
        "date": "10132016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS to expand its worldwide express plus "
    },
    {
        "content": "* Files for mixed shelf  size undisclosed - sec filing  Source text: [Ihttp://bit.ly/2dOxVcR] Further company coverage:",
        "date": "10112016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service files for mixed shelf  size undisclosed - sec filing "
    },
    {
        "content": "* UPS to open advanced technology package center in Compton  CA",
        "date": "09212016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS to open advanced technology package center in Compton  CA "
    },
    {
        "content": "United Parcel Service Inc's launch this week of drone test flights simulating emergency medical-supply deliveries highlights a race for data to prove such deliveries can be performed safely.",
        "date": "09232016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "With U.S. drone rules set  firms race for flight data "
    },
    {
        "content": "BEVERLY  Mass.  Sept 23 United Parcel Service Inc said it began testing the use of drones for emergency deliveries of medical supplies this week with a flight in rural Massachusetts  which the company hopes will eventually lead to federal approval of drones as a regular delivery option.",
        "date": "09232016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS launches U.S. drone test flights for urgent medical deliveries "
    },
    {
        "content": "NEW YORK  Sept 19 New York state and city authorities took United Parcel Service Inc to trial on Monday  urging a federal judge to make the company pay more than $872 million for making illegal deliveries of more than 683 000 cartons of untaxed cigarettes.",
        "date": "09192016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "New York seeks $872 mln from UPS in cigarette shipments trial "
    },
    {
        "content": "LOUISVILLE  Ky.  Sept 16 United Parcel Service  plans to expand its 3D printing service to Asia and Europe  the U.S. shipping company has told Reuters  in a bid to fully embrace and get ahead of a trend that threatens to eat away a small but lucrative part of its business.",
        "date": "09162016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Sensing threat  UPS plans to expand its 3D printing operations "
    },
    {
        "content": "NEW YORK New York state and city authorities took United Parcel Service Inc  to trial on Monday  urging a federal judge to make the company pay more than $872 million for making illegal deliveries of more than 683 000 cartons of untaxed cigarettes.",
        "date": "09192016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "New York seeks $872 million from UPS in cigarette shipments trial "
    },
    {
        "content": "CHICAGO  Sept 19 Package delivery company United Parcel Service Inc said on Monday it will expand its 3D printing services to Asia with a new facility in Singapore run by its partner Fast Radius that will open by the end of 2016.",
        "date": "09192016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS  Fast Radius to open 3D printing factory in Singapore "
    },
    {
        "content": "* UPS to hire about 95 000 for holiday season  Source text for Eikon:  Further company coverage:",
        "date": "09142016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS to hire about 95 000 for holiday season "
    },
    {
        "content": "CHICAGO  Sept 14 Package delivery company United Parcel Service Inc said on Wednesday it plans to hire around 95 000 seasonal employees for its crucial peak holiday season this year  unchanged from the past two years as improvements to its network should help it handle rising ecommerce volumes.",
        "date": "09142016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS plans peak season hiring of 95 000 for third year straight "
    },
    {
        "content": "LOUISVILLE  Ky.  Sept 19 United Parcel Service  plans to expand its 3D printing service to Asia and Europe  the U.S. shipping company has told Reuters  in a bid to fully embrace and get ahead of a trend that threatens to eat away a small but lucrative part of its business.",
        "date": "09192016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "RPT-Sensing threat  UPS plans to expand its 3D printing operations "
    },
    {
        "content": "* Says  effective December 26  2016  UPS U.S. Ground service daily rate will increase by an average net 4.9 percent",
        "date": "09012016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service announces U.S. rate changes "
    },
    {
        "content": "Aug 31 United Parcel Service Inc's  pilots ratified a new five-year labor contract that includes immediate pay hikes  the company and the union representing the pilots said.",
        "date": "08312016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS pilots ratify new five-year labor contract "
    },
    {
        "content": "* Independent pilots association says new labor agreement becomes amendable on Sept. 1  2021.  Source text for Eikon:  Further company coverage:",
        "date": "08312016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS pilots ratify new contract "
    },
    {
        "content": "* On August 19  2016  United Parcel Service  inc entered into an agreement with underwriters - sec filing",
        "date": "08242016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service to sell $34.6 mln of floating rate senior notes "
    },
    {
        "content": "* Files for potential floating rate senior notes due 2066; size not disclosed - SEC filing  Source text : http://bit.ly/2bnsYVe Further company coverage:",
        "date": "08192016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS files for potential floating rate senior notes due 2066 "
    },
    {
        "content": "* Worldwide Express Freight Service is now offered in 66 origin and 64 destination countries and territories.  Source text for Eikon:  Further company coverage:",
        "date": "08092016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS says Worldwide Express Freight service now offered in 66 origin and 64 destination countries and territories "
    },
    {
        "content": "* United parcel service inc outlook revised to negative on weaker-than-expected credit metrics; ratings affirmed",
        "date": "08082016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-S&P revises United Parcel Service outlook to negative "
    },
    {
        "content": "* Declared a regular quarterly dividend of $0.78 per share on all outstanding Class A and Class B shares  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08052016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS declares regular qtrly dividend of $0.78/shr "
    },
    {
        "content": "Aug 5 Spain's competition watchdog said it was investigating logistics companies including United Parcel Service Inc  FedEx Corp  Deutsche Post's DHL Group and Britain's Royal Mail Plc for possible anti-competitive practices.",
        "date": "08052016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "REFILE-Spanish competition watchdog probes FedEx  UPS  DHL  Royal Mail "
    },
    {
        "content": "CHICAGO United Parcel Service Inc  reported a higher quarterly net profit on Friday that met analyst expectations as revenue grew across its business units  and the company reaffirmed its full-year earnings outlook despite global economic uncertainty.",
        "date": "07292016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "Rising revenue boosts UPS profit; 2016 forecast confirmed "
    },
    {
        "content": "CHICAGO  July 29 United Parcel Service Inc  reported a higher quarterly net profit on Friday as revenue grew across all its business units and the company benefited from cost-cutting measures.",
        "date": "07292016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS quarterly profit climbs on revenue growth  cost cuts "
    },
    {
        "content": "* Qtrly international operating profit jumped more than 11% to $613 million  Source text for Eikon:  Further company coverage:",
        "date": "07292016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service affirms FY 2016 EPS outlook of $5.70 to $5.90 "
    },
    {
        "content": "* Expansion of its UPS Worldwide Express\u007f package service to reach 117 countries and territories  Source text for Eikon:  Further company coverage:",
        "date": "07182016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS announces expansion of UPS Worldwide Express package service to reach 117 countries and territories "
    },
    {
        "content": "A federal judge in Brooklyn has allowed the Equal Employment Opportunity Commission to proceed with its lawsuit accusing the United Parcel Service Inc of discriminating against male workers and job applicants who wore beards or long hair for religious reasons.",
        "date": "07212016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "Judge allows EEOC's religious bias lawsuit against UPS to proceed "
    },
    {
        "content": "* UPS expands clinical trial logistics capabilities to support drug  vaccine research  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07052016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS expands clinical trial logistics capabilities to support drug  vaccine research "
    },
    {
        "content": "ATLANTA The United Kingdom's vote last week to exit the European Union should have little short-term impact on trade flows  as long  as negotiations on the country's split with the trade bloc do not drag on too long  the top executive of UPS  said on Thursday.",
        "date": "06302016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS CEO: Prompt resolution of British EU exit in interest of trade "
    },
    {
        "content": "ATLANTA  June 30 United Parcel Service Inc  has reached a tentative five-year agreement with its pilots' union after nearly five years of talks  the world's largest package delivery company said on Thursday.",
        "date": "06302016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS reaches tentative five-year deal with pilots union "
    },
    {
        "content": "* UPS  pilots reach tentative agreement on new labor contract",
        "date": "06302016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-Independent Pilots Association announces tentative agreement on 5-yr labor contract with UPS "
    },
    {
        "content": "* Says to build a new package sorting and delivery facility in Corbeil-Essonnes/Evry",
        "date": "06242016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service announces record investment in France "
    },
    {
        "content": "* On June 6 entered into agreement with underwriters to sell $73.5 million aggregate principal amount of floating rate senior notes due 2066 - SEC filing  Source text - (http://1.usa.gov/23c1mqA) Further company coverage:",
        "date": "06152016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS to sell $73.5 mln amount of floating rate senior notes "
    },
    {
        "content": "* Files for potential floating rate senior notes due 2066  size not disclosed - SEC filing  Source - (http://bit.ly/25HJaqt) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06062016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service Inc files for potential floating rate senior notes due 2066 "
    },
    {
        "content": "* Files for floating rate senior notes due 2066 of up to $73.1 million - SEC filing  Source text: (http://1.usa.gov/1Od00sW) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06082016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service files for floating rate senior notes "
    },
    {
        "content": "* Package processing facility will include automated sorting systems and will house approximately 300 UPS delivery vehicles",
        "date": "05132016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS to invest more than $70 mln in new Texas facility "
    },
    {
        "content": "* Creates global partnership with Zipline and Gavi to transform delivery of humanitarian aid and life-saving vaccines with drones",
        "date": "05092016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS in partnership to deliver humanitarian aid  vaccines with drones "
    },
    {
        "content": "* Project will add capacity for more than 150 more delivery vehicles - called \"package cars\"",
        "date": "05102016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-UPS expands operations at San Antonio Facility "
    },
    {
        "content": "* UPS board announces quarterly dividend and reauthorizes share repurchase program",
        "date": "05052016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service announces new $8 bln share buyback program "
    },
    {
        "content": "* Declared a regular quarterly dividend of $0.78 per share on all outstanding Class A and Class B shares  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05052016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service declares qtrly dividend of $0.78 per share "
    },
    {
        "content": "* Shareowners rejected proposal requiring board to reduce voting power of class A stock from 10 votes/share to 1 vote/share",
        "date": "05052016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS says shareowners didn't approve proposal that would have required more disclosure concerning co's lobbying activities "
    },
    {
        "content": "CHICAGO United Parcel Service Inc  reported a better-than-expected quarterly profit on Thursday  as rising U.S. ecommerce and cost cutting helped the package delivery company shrug off a mixed economy and reiterate its full-year 2016 earnings outlook.",
        "date": "04282016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "Ecommerce gives UPS profit a lift despite mixed U.S. economy "
    },
    {
        "content": "CHICAGO United Parcel Service Inc  is confident China's economic growth rate has stabilized and the world's largest package delivery company is offering more ecommerce and export services to small and medium-sized businesses there  a top executive said on Thursday.",
        "date": "04282016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS comfortable with China growth  Brexit a worry: CFO "
    },
    {
        "content": "CHICAGO  April 28 United Parcel Service Inc  is confident China's economic growth rate has stabilized and the world's largest package delivery company is offering more ecommerce and export services to small and medium-sized businesses there  a top executive said on Thursday.",
        "date": "04282016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-UPS comfortable with China growth  Brexit a worry -CFO "
    },
    {
        "content": "CHICAGO  April 28 United Parcel Service Inc  reported a better-than-expected quarterly profit on Thursday  as rising U.S. ecommerce and cost cutting helped the package delivery company shrug off a mixed economy and reiterate its full-year 2016 earnings outlook.",
        "date": "04282016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 3-Ecommerce gives UPS profit a lift despite mixed US economy "
    },
    {
        "content": "CHICAGO  April 28 Package delivery company United Parcel Service Inc is confident China's economic growth rate has stabilized and the company is expanding its services by offering more ecommerce and export options to Chinese small and medium-sized businesses  a top executive said on Thursday.",
        "date": "04282016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS comfortable with China growth  concerned about Brexit - CFO "
    },
    {
        "content": "* Affirms full-year 2016 eps guidance of $5.70 to $5.90  Source text for Eikon:  Further company coverage:",
        "date": "04282016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel service- FY 2016 EPS guidance of $5.70 to $5.90 "
    },
    {
        "content": "CHICAGO  April 28 Package delivery company United Parcel Service Inc on Thursday reported a higher quarterly net profit  citing a rise in ecommerce packages in its crucial U.S. domestic business and improved margins on the back of cost cutting.",
        "date": "04282016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS profit rises on higher margins  ecommerce "
    },
    {
        "content": "BRUSSELS  April 6 - Thwarted in its bid to acquire Dutch peer TNT three years ago  U.S. package delivery company UPS took its case to court on Wednesday  asking judges to overturn the EU veto because of \"manifest errors\" made by antitrust regulators.",
        "date": "04062016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS asks EU court to annul EU veto of its 2013 TNT bid "
    },
    {
        "content": "* Underwriters agreed to purchase $118 180 000 aggregate principal amount of floating rate senior notes due 2066 from company  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04012016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service says underwriters to purchase $118 180 000 aggregate principal amount of floating rate senior notes due 2066 from company "
    },
    {
        "content": "* Ups appoints Juan R. Perez chief information officer as Dave Barnes announces retirement",
        "date": "03312016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "BRIEF-United Parcel Service says chief information officer retiring "
    },
    {
        "content": "United Parcel Service Inc  on Tuesday announced a $100 million plan to buy hundreds of new trucks that will run on compressed natural gas  saying it did not want to lose momentum on alternative fuels even though diesel prices have tanked.",
        "date": "03152016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS expands alternative fuels momentum with $100 million CNG investment "
    },
    {
        "content": "March 15 United Parcel Service Inc on Tuesday announced a $100 million plan to buy hundreds of new trucks that will run on compressed natural gas  saying it did not want to lose momentum on alternative fuels even though diesel prices have tanked.",
        "date": "03152016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-UPS expands alternative fuels momentum with $100 mln CNG investment "
    },
    {
        "content": "March 15 United Parcel Service Inc on Tuesday extended its commitment to compressed natural gas vehicles with a $100 million plan to build 12 fueling stations and add 380 CNG trucks to its fleet.",
        "date": "03152016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS makes $100 million investment in CNG vehicles "
    },
    {
        "content": "* UPS invests $100 million in compressed natural gas  CNG vehicles and related infrastructure",
        "date": "03152016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "BRIEF-UPS invests $100 mln in CNG  CNG vehicles and related infrastructure "
    },
    {
        "content": "March 9 Amazon.com Inc said on Wednesday it had signed a deal to lease 20 Boeing 767 widebody freighter aircraft to handle more of its own deliveries in the United States.",
        "date": "03092016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 3-Amazon to start air delivery network with leasing deal "
    },
    {
        "content": "CHICAGO/SAN FRANCISCO  Feb 24 United Parcel Service Inc is investing in Deliv Inc as a way to study the same-day delivery startup's business model and see how that segment of the market evolves  the world's largest package delivery company said on Wednesday.",
        "date": "02242016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "With Deliv investment  UPS hopes to study same-day delivery market "
    },
    {
        "content": "CHICAGO United Parcel Service Inc  on Tuesday reported a significantly higher quarterly net profit on a strong performance during the crucial holiday season and gave a solid 2016 earnings outlook despite warning of uncertain economic conditions.",
        "date": "02022016",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS profit jumps on better margins  gives robust outlook "
    },
    {
        "content": "CHICAGO Despite signs of slowing growth and increasing pessimism from many in the corporate world about where the U.S. economy is headed  package delivery company UPS should continue to see growth in 2016 thanks to rising e-commerce sales and a continued focus on improving operations  a top executive said on Tuesday.",
        "date": "02022016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Online sales  internal fixes to lift UPS despite U.S. economy: CFO "
    },
    {
        "content": "CHICAGO  Feb 2 United Parcel Service Inc  on Tuesday reported a significantly higher quarterly net profit on a strong performance during the crucial holiday season and gave a solid 2016 earnings outlook despite warning of uncertain economic conditions.",
        "date": "02022016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS profit jumps on better margins  gives robust outlook "
    },
    {
        "content": "CHICAGO  Feb 2 Package delivery company United Parcel Service Inc on Tuesday reported a significantly higher quarterly net profit as the company boosted its margins and performed well during its peak holiday season.",
        "date": "02022016",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS fourth quarter profit surges "
    },
    {
        "content": "CHICAGO  Dec 29 After two consecutive years of problems during its holiday peak package season  UPS delivered on time at Christmas this year while its main rival FedEx had a last-minute stumble that left some gifts undelivered until after the holiday.",
        "date": "12292015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Third time's a charm for UPS at Christmas  but FedEx stumbles "
    },
    {
        "content": "WASHINGTON  Dec 13 As the holiday shopping season peaks  U.S. apartment complexes are being flooded with packages  from HD televisions to children's scooters  inundating lobbies and forcing building managers to take measures to extremes.",
        "date": "12132015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "FEATURE-Online holiday package tsunami swamping U.S. apartment buildings "
    },
    {
        "content": "NEW YORK A New York lawyer \"lied over and over\" to lenders and others to help a felon fraudulently raise money to buy Maxim magazine  a federal prosecutor told jurors on Wednesday at the close of a trial.",
        "date": "12102015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "U.S. seeks N.Y. lawyer's conviction over Maxim magazine deal fraud "
    },
    {
        "content": "NEW YORK  Dec 9 A New York lawyer \"lied over and over\" to lenders and others to help a felon fraudulently raise money to buy Maxim magazine  a federal prosecutor told jurors on Wednesday at the close of a trial.",
        "date": "12102015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "REFILE-U.S. seeks N.Y. lawyer's conviction over Maxim magazine deal fraud "
    },
    {
        "content": "NEW YORK  Dec 9 A New York lawyer \"lied over and over\" to lenders and others to help a felon fraudulently raise money to buy Maxim magazine  a federal prosecutor told jurors on Wednesday at the close of a trial.",
        "date": "12092015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "U.S. seek N.Y. lawyer's conviction over Maxim magazine deal fraud "
    },
    {
        "content": "CHICAGO Package delivery company United Parcel Service Inc  posted a higher quarterly profit on Tuesday  despite its revenue being hurt by the strong U.S. dollar  and reiterated its full-year earnings outlook. | Video ",
        "date": "10272015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS profit tops estimates as dollar weighs on revenue "
    },
    {
        "content": "CHICAGO  Oct 26 After two years of disappointing profits from the holiday season  United Parcel Service Inc  is hoping a network of mom-and-pop retailers will help it avoid a third blue Christmas.",
        "date": "10262015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS counting on small retailers to save Christmas "
    },
    {
        "content": "CHICAGO After having difficulties getting its holiday peak season right for the past two years running  this year executives at United Parcel Service Inc  insist they have a winning formula.",
        "date": "10272015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS CFO: We're ready for peak season and we will deliver "
    },
    {
        "content": "CHICAGO  Oct 27 Package delivery company United Parcel Service Inc posted a higher quarterly profit on Tuesday  despite its revenue being hurt by the strong U.S. dollar  and reiterated its full-year earnings outlook.",
        "date": "10272015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS profit tops estimates as dollar weighs on revenue "
    },
    {
        "content": "CHICAGO  Oct 27 Package delivery company United Parcel Service Inc posted a higher quarterly profit on Tuesday despite a dip in revenue caused by the strong U.S. dollar and lower fuel surcharge revenue.",
        "date": "10272015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS third-quarter profit rises  tops estimates "
    },
    {
        "content": "NEW YORK A federal judge said New York State and New York City may pursue a lawsuit accusing United Parcel Service Inc  of illegally delivering more than 683 000 cartons of untaxed cigarettes in the state  depriving them of millions of dollars in taxes.",
        "date": "09162015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS must face New York lawsuit over illegal cigarette shipments "
    },
    {
        "content": "NEW YORK  Sept 16 A federal judge said New York State and New York City may pursue a lawsuit accusing United Parcel Service Inc of illegally delivering more than 683 000 cartons of untaxed cigarettes in the state  depriving them of millions of dollars in taxes.",
        "date": "09162015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS must face New York lawsuit over illegal cigarette shipments "
    },
    {
        "content": "CHICAGO  Sept 15 United Parcel Service Inc  plans to hire up to 95 000 workers to handle additional business during the holiday season this year  the package delivery company said on Tuesday.",
        "date": "09152015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS to hire up to 95 000 workers for holiday season "
    },
    {
        "content": "Sept 9 The union representing pilots at package delivery company United Parcel Service Inc said it had urged them to vote to authorize a strike.",
        "date": "09092015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Union urges UPS pilots to vote on authorizing strike "
    },
    {
        "content": "Sept 9 The union representing pilots at package delivery company United Parcel Service Inc said it had urged them to vote to authorize a strike.",
        "date": "09092015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-Union urges UPS pilots to vote on authorizing strike "
    },
    {
        "content": "Aug 14 French shipping and transit company Geodis SA is near a deal to pay close to $800 million for U.S. contract shipping provider Ozburn-Hessey Logistics  LLC in what would be the latest in a string of logistics tie-ups this year  people familiar with the deal said.",
        "date": "08142015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "France's Geodis nears $800 mln deal for OHL -sources "
    },
    {
        "content": "United Parcel Service Inc  said it would buy Coyote Logistics from private equity firm Warburg Pincus for $1.8 billion to expand its full-truckload services  the latest deal in a rapidly consolidating logistics industry.",
        "date": "07312015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS bolsters full-truckload business with $1.8 billion deal "
    },
    {
        "content": "Package delivery company UPS  on Tuesday reported a better-than-expected second-quarter profit on improved margins  and said U.S. economic growth was being hampered by a strong dollar and an expected interest rate hike. | Video ",
        "date": "07282015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS second-quarter profit tops estimates; sees sluggish U.S. economy "
    },
    {
        "content": "* Deal could spur further M&A speculation - analyst   (Adds analyst comment  industry details; updates shares)",
        "date": "07312015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS bolsters full-truckload business with $1.8 bln deal "
    },
    {
        "content": "July 28 Package delivery company UPS on Tuesday reported a better-than-expected second-quarter profit on improved margins  and said U.S. economic growth was being hampered by a strong dollar and an expected interest rate hike.",
        "date": "07282015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS 2nd-qtr profit tops estimates; sees sluggish U.S. economy "
    },
    {
        "content": "CHICAGO  July 28 Package delivery company United Parcel Service Inc on Tuesday reported a higher quarterly net profit  as improved margins offset a slight drop in revenue.",
        "date": "07282015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS quarterly profit rises "
    },
    {
        "content": "July 31 United Parcel Service Inc said it would buy Coyote Logistics from private equity firm Warburg Pincus for $1.8 billion to expand its full-truckload services.",
        "date": "07312015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS to buy Coyote Logistics for $1.8 bln from Warburg Pincus "
    },
    {
        "content": "July 22 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "07222015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "CHICAGO/NEW YORK Package delivery United Parcel Service Inc  is in talks to buy Chicago-based Coyote Logistics LLC for at least $1.8 billion  a source familiar with negotiations said on Wednesday.",
        "date": "07222015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS in talks to buy Coyote Logistics for at least $1.8 billion: source "
    },
    {
        "content": "CHICAGO/NEW YORK  July 22 Package delivery United Parcel Service Inc is in talks to buy Chicago-based Coyote Logistics LLC for at least $1.8 billion  a source familiar with negotiations said on Wednesday.",
        "date": "07222015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS in talks to buy Coyote Logistics for at least $1.8 bln - source "
    },
    {
        "content": "NEW YORK The U.S. Equal Employment Opportunity Commission has sued United Parcel Service Inc  accusing the world's largest package delivery company of discriminating against male workers and job applicants who wore beards or long hair because of their religion.",
        "date": "07152015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "EEOC sues UPS for religious bias against bearded men "
    },
    {
        "content": "NEW YORK The U.S. Equal Employment Opportunity Commission has sued United Parcel Service Inc  accusing the world's largest package delivery company of discriminating against male workers and job applicants who wore beards or long hair because of their religion.",
        "date": "07152015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "U.S. EEOC sues UPS for religious bias against bearded men "
    },
    {
        "content": "NEW YORK  July 15 The U.S. Equal Employment Opportunity Commission has sued United Parcel Service Inc   accusing the world's largest package delivery company of discriminating against male workers and job applicants who wore beards or long hair because of their religion.",
        "date": "07152015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-U.S. EEOC sues UPS for religious bias against bearded men "
    },
    {
        "content": "NEW YORK  July 15 United Parcel Service Inc  was sued on Wednesday by the U.S. Equal Employment Opportunity Commission  which accused the package delivery company of discriminating against employees and job applicants whose religious practices conflicted with its uniform and appearance policy.",
        "date": "07152015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "EEOC sues UPS for alleged religious discrimination "
    },
    {
        "content": "FRANKFURT  June 25 The top executives of many a corporate giant must feel like the fictional character Gulliver  waking up to find themselves under attack from modern-day Lilliputians  small start-up companies which overwhelm their established rivals with new technologies.",
        "date": "06252015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Many big companies live in fear for their future in digital age "
    },
    {
        "content": "WASHINGTON UPS has agreed to pay $25 million to settle some  allegations that it submitted false claims to the U.S. government in an attempt to hide late deliveries  according to court documents unsealed on Tuesday and released by the U.S. Department of Justice.",
        "date": "05192015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS to pay $25 million to settle some allegations over delivery times "
    },
    {
        "content": "WASHINGTON  May 19 UPS has agreed to pay $25 million to settle some  allegations that it submitted false claims to the U.S. government in an attempt to hide late deliveries  according to court documents unsealed on Tuesday and released by the U.S. Department of Justice.",
        "date": "05192015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS to pay $25 mln to settle some allegations over delivery times "
    },
    {
        "content": "WASHINGTON UPS has agreed to pay $25 million to settle some  allegations that it submitted false claims to the U.S. government in an attempt to hide late deliveries  according court documents unsealed on Tuesday and released by the U.S. Department of Justice.",
        "date": "05192015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS to pay $25 mln to settle some allegations over delivery times "
    },
    {
        "content": "CHICAGO Package delivery giant UPS does not expect to change its current expansion plan in Europe despite a recent acquisition bid by main rival FedEx that would knock the firm into third place on the continent  a top executive said on Tuesday.",
        "date": "04282015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS CFO - Europe plans unchanged by possible TNT deal "
    },
    {
        "content": "CHICAGO United Parcel Service Inc  on Tuesday reported higher first-quarter net profit due to price increases and productivity improvements  and reaffirmed its earnings outlook for 2015.",
        "date": "04282015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS profit lifted by pricing  maintains 2015 earnings outlook "
    },
    {
        "content": "CHICAGO  April 28 United Parcel Service Inc  on Tuesday reported higher first-quarter net profit due to price increases and productivity improvements  and reaffirmed its earnings outlook for 2015.",
        "date": "04282015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS profit lifted by pricing  maintains 2015 earnings outlook "
    },
    {
        "content": "CHICAGO  April 28 United Parcel Service Inc  on Tuesday reported a higher quarterly net profit  which rose thanks to price increases and productivity improvements.",
        "date": "04282015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS quarterly profit rises  helped by price increases "
    },
    {
        "content": "BERLIN United Parcel Service Inc.  plans to invest 1 billion euros ($1.06 billion) in Europe to expand its package delivery network  German magazine Wirtschaftswoche reported on Sunday  without citing its sources.",
        "date": "04122015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS to invest $1.06 billion in Europe: Wirtschaftswoche "
    },
    {
        "content": "BERLIN  April 12 United Parcel Service Inc.  plans to invest 1 billion euros ($1.06 billion) in Europe to expand its package delivery network  German magazine Wirtschaftswoche reported on Sunday  without citing its sources.",
        "date": "04122015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS to invest 1 bln euros in Europe -Wirtschaftswoche "
    },
    {
        "content": "April 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04072015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "AMSTERDAM FedEx Corp  is to buy Dutch package delivery firm TNT Express  for an agreed 4.4 billion euros ($4.8 billion)  stepping up the challenge to rivals United Parcel Service  and Deutsche Post  in Europe. | Video ",
        "date": "04072015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "FedEx to buy TNT for $4.8 billion to take on rivals in Europe "
    },
    {
        "content": "CHICAGO  April 7 FedEx Corp's $4.8 billion bid Tuesday for TNT Express took the world's last large potential package delivery acquisition target off the table  marking a victory in FedEx's battle to gain market share from rival United Parcel Service Inc.",
        "date": "04072015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "In TNT  FedEx may get last major package target UPS once sought "
    },
    {
        "content": "* GRAPHIC: http://link.reuters.com/rub54w   (Adds quotes from FedEx executives from analyst call)",
        "date": "04072015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 7-FedEx to buy TNT for $4.8 bln to take on rivals in Europe "
    },
    {
        "content": "AMSTERDAM  April 7 TNT Express  Chairman Antony Burgmans said on Tuesday he is highly confident that the FedEx offer to buy TNT Express will not meet the same fate as a bid from UPS which was blocked by European regulators in 2013.",
        "date": "04072015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "REFILE-TNT Express chairman \"certain\" EU will approve FedEx deal "
    },
    {
        "content": "NEW YORK  April 1 A New York lawyer was arrested on Wednesday for his alleged role in a scheme by the son of a former United Parcel Service Inc executive to fraudulently obtain millions of dollars to finance the purchase of Maxim magazine  the lawyer's counsel said.",
        "date": "04012015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "N.Y. lawyer charged for alleged role in scheme over Maxim magazine "
    },
    {
        "content": "NEW YORK  April 1 A New York lawyer was charged on Wednesday over his alleged role in a scheme by a former United Parcel Service Inc executive's son to fraudulently obtain millions of dollars to finance the purchase of Maxim magazine.",
        "date": "04012015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-N.Y. lawyer charged for alleged role in scheme over Maxim magazine "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Wednesday sided with a former driver for UPS Inc by giving her another chance to argue that the package delivery company discriminated against her when it refused to lighten her work duties while she was pregnant.",
        "date": "03252015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "U.S. Supreme Court revives pregnant worker’s case against UPS "
    },
    {
        "content": "NEW YORK  March 6 U.S. consumers battered by the wretched winter weather still afflicting much of the eastern half of the country have responded by ordering in rather than eating out  flying more frequently to Florida and cutting out trips to the mall  according to a Reuters review of company data.",
        "date": "03062015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "CORRECTED--Weather-battered US consumers skip mall  order in and head south "
    },
    {
        "content": "NEW YORK  March 6 U.S. consumers battered by the wretched winter weather still afflicting much of the eastern half of the country have responded by ordering in rather than eating out  flying more frequently to Florida and cutting out trips to the mall  according to a Reuters review of company data.",
        "date": "03062015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "Weather-battered US consumers skip mall  order in and head south "
    },
    {
        "content": "New York City and New York state sued United Parcel Service Inc. on Wednesday  seeking over $180 million in damages and penalties against the shipping company for allegedly delivering nearly 700 000 cartons of untaxed cigarettes across the state.",
        "date": "02182015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "NYC and state sue UPS for illegally shipping cigarettes "
    },
    {
        "content": "NEW YORK  Feb 18 New York City and New York state sued United Parcel Service Inc. on Wednesday  seeking over $180 million in damages and penalties against the shipping company for allegedly delivering nearly 700 000 cartons of untaxed cigarettes across the state.",
        "date": "02182015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 1-NYC and state sue UPS for illegally shipping cigarettes "
    },
    {
        "content": "NEW YORK  Feb 18 New York city and state plan to sue United Parcel Service Inc. on Wednesday  seeking over $180 million in damages and penalties against the shipping company for allegedly delivering nearly 700 000 cartons of untaxed cigarettes across the state.",
        "date": "02182015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "NYC and state to sue UPS for illegally shipping cigarettes "
    },
    {
        "content": "United Parcel Service Inc  said on Tuesday it will start applying surcharges for residential packages this year after its costs soared during the recent disappointing holiday season.",
        "date": "02032015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "UPS to apply surcharges to residential packages after costs surge "
    },
    {
        "content": "Feb 3 United Parcel Service Inc on Tuesday reported a disappointing peak holiday season and warned that U.S. online shopping habits are hard to predict and getting it wrong will slice into profits.",
        "date": "02032015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS warns e-commerce volume hard to forecast  to add surcharge "
    },
    {
        "content": "Feb 3 United Parcel Service Inc said on Tuesday it will start applying surcharges for residential packages this year after its costs soared during the recent disappointing holiday season.",
        "date": "02032015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 2-UPS to apply surcharges to residential packages after costs surge "
    },
    {
        "content": "DETROIT  Feb 3 United Parcel Service Inc  on Tuesday reported a slightly lower quarterly profit after a disappointing peak holiday season during which its costs were higher than expected.",
        "date": "02032015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS profit hit by high costs during holiday season "
    },
    {
        "content": "* Dow down 0.79 pct  S&P 500 off 0.55 pct  Nasdaq up 0.16 pct   (Updates to close)",
        "date": "01232015",
        "name": "United Parcel Service Inc",
        "news_type": "topStory",
        "symbol": "UPS",
        "title": "US STOCKS-Wall St falls on miners  UPS; indexes up for week "
    },
    {
        "content": "NEW YORK  Jan 23 U.S. stocks fell on Friday  pressured by underwhelming corporate news including guidance from economic activity bellwether UPS and as materials stocks fell after bearish research notes.",
        "date": "01232015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "US STOCKS SNAPSHOT-UPS weighs on Wall St but indexes up for week "
    },
    {
        "content": "* Dow down 0.5 pct  S&P 500 off 0.35 pct  Nasdaq up 0.2 pct   (Updates to afternoon trading)",
        "date": "01232015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "US STOCKS-Wall St dips on UPS  miners; Starbucks jumps "
    },
    {
        "content": "* Dow down 0.2 pct  S&P 500 off 0.1 pct  Nasdaq up 0.4 pct   (Updates to early afternoon)",
        "date": "01232015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "US STOCKS-Wall St dips weighed by UPS  miners; Starbucks shines "
    },
    {
        "content": "CHICAGO United Parcel Service Inc  on Friday said its fourth-quarter performance was hurt as lackluster holiday demand pushed up costs  and that it will likely raise prices for this year's peak season.",
        "date": "01232015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPS hurt by disappointing holiday season  eyes costs  pricing "
    },
    {
        "content": "CHICAGO  Jan 23 United Parcel Service Inc  on Friday said its fourth-quarter performance was hurt as lackluster holiday demand pushed up costs  and that it will likely raise prices for this year's peak season.",
        "date": "01232015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "UPDATE 3-UPS hurt by disappointing holiday season  eyes costs  pricing "
    },
    {
        "content": "* Dow  S&P 500 down 0.3 pct  Nasdaq up 0.1 pct   (Updates to market open)",
        "date": "01232015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "US STOCKS-Wall St dips on earnings  but set to end week strong "
    },
    {
        "content": "* Futures down: Dow 7 pts  S&P 3 pts  Nasdaq 3 pts   (Updates with UPS outlook)",
        "date": "01232015",
        "name": "United Parcel Service Inc",
        "news_type": "normal",
        "symbol": "UPS",
        "title": "US STOCKS-Futures point to flat open on weak earnings "
    }
]