[
    {
        "content": "A federal appeals court has revived part of a Hawaii property owner's lawsuit alleging that U.S. Bank tried to discourage competitive bidding when it sold her house at foreclosure so it could buy it for itself at a bargain price.",
        "date": "11092017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "9th Circuit revives part of foreclosure lawsuit against U.S. Bank "
    },
    {
        "content": "* ‍TIER 1 US BANK SELECTS TEMENOS T24 CORE BANKING FOR GLOBAL CASH MANAGEMENT BACKBONE​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "11062017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-Temenos Group says ‍Tier 1 US bank selects Temenos T24 core banking "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 18 (Fitch) U.S. Bancorp's (USB) (rated 'AA'/'F1+'/Outlook Stable) third quarter 2017 (3Q17) net income increased 4.1% year-over-year to $1.6 billion due to higher net interest income (NII) amid higher short-term interest rates and better loan growth over the course of the year. USB's return on average assets (ROAA) was strong at 1.38% in 3Q17 a 2 basis point increase year-over-year. Similarly  the company's return on av",
        "date": "10182017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: U.S. Bancorp Earnings Up in 3Q17; Strong Loan Growth "
    },
    {
        "content": "* U.S. Bancorp reports record revenue and net income for the third quarter of 2017",
        "date": "10182017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp reports Q3 earnings per share of $0.88 "
    },
    {
        "content": "* Richard P. McKenney joins U.S. Bancorp board of directors Source text for Eikon: Further company coverage:",
        "date": "10172017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-Richard McKenney joins U.S. Bancorp board of directors "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 03 (Fitch) Fitch Ratings has affirmed U.S. Bancorp's (USB) ratings at 'AA/F1+'. The Rating Outlook is Stable. The affirmation and Stable Outlook are driven by the company's continued better-than-peer operating performance  solid liquidity position  and stable capital ratios. The rating action follows a periodic review of the large regional banking group  which includes BB&T Corporation (BBT)  Capital One Finance Corpora",
        "date": "10032017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch Affirms U.S. Bancorp at 'AA/F1+'; Outlook Stable "
    },
    {
        "content": "Current and former branch managers at hundreds of U.S. Bancorp branches located inside retail stores cannot pursue claims as a group that they were improperly denied overtime pay  a federal judge in San Diego ruled.",
        "date": "10032017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "Judge rejects collective action by U.S. Bancorp branch managers "
    },
    {
        "content": "* U.S. Bancorp announces a 7.1 percent increase in quarterly common stock dividends",
        "date": "09192017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp announces 7.1 pct increase in qtrly common stock dividends "
    },
    {
        "content": "Sept 12 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "09122017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES- US Bancorp  TPG Capital  Barclays  Global Bankers Insurance Group  UBS "
    },
    {
        "content": "Three municipal employee pension funds that invested $25 million in a now worthless bond offering have sued U.S. Bank for negligence  alleging that it released bond proceeds to a criminal enterprise that pocketed the money.",
        "date": "08242017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Pension funds allege U.S. Bank negligent in $25 mln bond fraud "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 19 (Fitch) U.S. Bancorp's (USB) second quarter 2017 (2Q17) net income of $1.5 billion was down 1.4% year-over-year as growth in net interest income (NII) amid higher short-term interest rates was offset by a decline in non-interest income and incrementally higher expenses  according to Fitch Ratings. USB's return on average assets (ROAA) was a still strong 1.35% in 2Q17 but down 8 basis points from 1.43% in the prior year'",
        "date": "07192017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: USB 2Q17 Earnings Down  Despite Loan Growth and Higher Rates "
    },
    {
        "content": "July 19 U.S. Bancorp reported a better-than-expected quarterly profit on Wednesday as the largest U.S. regional bank benefited from higher interest rates  following rate increases by the Federal Reserve.",
        "date": "07192017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "U.S. Bancorp's profit beats on higher rates "
    },
    {
        "content": "July 19 U.S. Bancorp reported a better-than-expected quarterly profit on Wednesday as the largest U.S. regional bank benefited from higher interest rates.",
        "date": "07192017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "UPDATE 1-U.S. Bancorp's profit beats on higher rates "
    },
    {
        "content": "* U.S. Bank National Association says redemption on July 23  2017  of all of its outstanding floating rate senior notes due August 23  2017​",
        "date": "07132017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bank announces redemption of senior notes "
    },
    {
        "content": "* Q2 earnings per share view $0.84 -- Thomson Reuters I/B/E/S",
        "date": "07192017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp reports Q2 earnings per share $0.85 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK/CHICAGO  June 29 (Fitch) The results of the 2017 Comprehensive Capital Adequacy Review (CCAR)  alongside the earlier Dodd-Frank Stress Test (DFAST) results  highlight continued capital strength among large U.S. bank holding companies (BHCs) and will enable many of them to significantly increase capital payouts  says Fitch Ratings. Fitch has anticipated increased payout ratios and  therefore  they should not have near-term credi",
        "date": "06292017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: CCAR Results Enables Big Rise in US Bank Capital Payouts "
    },
    {
        "content": "* U.S. Bancorp - ‍company expects to recommend a q3 dividend of $0.30 per common share  a 7.1 percent increase over current dividend rate​",
        "date": "06282017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp receives no objection to its 2017 capital plan "
    },
    {
        "content": "* u.s. Bank names Tim Welsh vice chairman of consumer banking sales and support",
        "date": "06162017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp names Tim Welsh vice chairman of consumer banking sales and support "
    },
    {
        "content": "June 7 U.S. Bank Wealth Management  a unit of U.S. Bancorp  named Eric Contreras senior private banker for the Private Client Reserve of U.S. Bank in San Francisco.",
        "date": "06072017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-Private Client Reserve of US Bank hires new senior private banker "
    },
    {
        "content": "* U.S. Bancorp - on June 7  co issued EUR 1 billion aggregate principal amount of 0.850% medium-term notes  series X (senior)  due June 7  2024 - sec filing Source text for Eikon: Further company coverage:",
        "date": "06072017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp says issued EUR 1 bln aggregate principal amount of 0.850% medium-term notes "
    },
    {
        "content": "A federal judge has rejected U.S. Bancorp's bid to dismiss a lawsuit in which the bond insurer Ambac Financial Group Inc sought to halt what it deemed a lowball settlement between investors and Bank of America Corp over poorly underwritten mortgage securities.",
        "date": "06012017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Judge rejects U.S. Bancorp bid to dismiss Ambac lawsuit over BofA pact "
    },
    {
        "content": "* Fitch says U.S. Bank deregulation advances  but hurdles remain",
        "date": "05242017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-Fitch says U.S. bank deregulation advances  but hurdles remain "
    },
    {
        "content": "(The following statement was released by the rating agency) Link to Fitch Ratings' Report: U.S. Bank Deregulation Advances  But Hurdles Remain https://www.fitchratings.com/site/re/898807 NEW YORK  May 24 (Fitch) The momentum for U.S. bank deregulation continues to grow  but it is becoming more likely that it will take the form of multiple smaller bills targeting relief for specific segments of the financial sector as opposed to a single  comprehensive bill  says Fitch Ratings. The Financial Choi",
        "date": "05242017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "Fitch: U.S. Bank Deregulation Advances  But Hurdles Remain "
    },
    {
        "content": "MEXICO CITY A tough U.S. proposal on bilateral sugar trade with Mexico sets a bad precedent for an impending renegotiation of the North American Free Trade Agreement (NAFTA)  the head of Mexico's sugar chamber  Juan Cortina  said on Tuesday.",
        "date": "05092017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Mexico sugar industry warns U.S. tough line sets bad NAFTA precedent "
    },
    {
        "content": "* Canadian Solar secures project financing from Prudential Capital Group and U.S. Bank",
        "date": "04252017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-Canadian Solar secures project financing from Prudential Capital group and U.S. Bank "
    },
    {
        "content": "MEXICO CITY The United States has offered to help fund Mexico's efforts to eradicate opium poppies  the U.S. assistant secretary for International Narcotics and Law Enforcement Affairs (INL) said on Friday  as Mexican heroin output increased again last year.",
        "date": "04212017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Exclusive: U.S. offers to fund Mexico heroin fight as 2016 output jumps - U.S. official "
    },
    {
        "content": "* Q1 earnings per share view $0.80 -- Thomson Reuters I/B/E/S",
        "date": "04192017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp reports Q1 earnings per share $0.82 "
    },
    {
        "content": "CAPE CANAVERAL  Fla. A U.S. astronaut and two Russian cosmonauts made a parachute landing in Kazakhstan on Monday  wrapping up a nearly six-month mission aboard the International Space Station  a NASA TV broadcast showed. | Video ",
        "date": "04102017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "U.S.  Russian crew lands after six-month stay on space station "
    },
    {
        "content": "* U.S. Bancorp - redemption on April 15  2017  of all of its outstanding 1.65% medium-term notes  series t due May 15  2017",
        "date": "04052017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp announces redemption of medium-term notes "
    },
    {
        "content": "LONDON  April 5 The head of U.S. bank JPMorgan Chase said on Tuesday the bank is not planning to move many jobs out of Britain in the next two years in a softening of tone on the likely impact from Brexit.",
        "date": "04052017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "JPMorgan softens tone on Brexit jobs warning "
    },
    {
        "content": "TOKYO The new head of Japan's Sumitomo Mitsui Banking Corp (SMBC) said it is \"actively studying\" an acquisition of a U.S. bank  as part of efforts to seek a reliable dollar funding source for future growth.",
        "date": "03312017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "New chief of Japan's SMBC bank 'actively studying' acquisition of US bank "
    },
    {
        "content": "* To offer mobile payments for Visa commercial cards  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp says to offer mobile payments for Visa commercial cards "
    },
    {
        "content": "* U.S. Bancorp raises prime lending rate to 4.00 percent from 3.75 percent effective March 16  2017  Source text for Eikon:  Further company coverage:",
        "date": "03152017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bank raises prime lending rate to 4.00 pct from 3.75 pct effective March 16 "
    },
    {
        "content": "* Jamie Walker to lead U.S. Bancorp subsidiary  Elavon Inc as CEO",
        "date": "03162017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-Jamie Walker to lead U.S. Bancorp subsidiary  Elavon as CEO "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK/CHICAGO  March 06 (Fitch) Potential federal corporate tax cuts may aid  US bank earnings over the long run  according to Fitch Ratings. However  they  could also result in deferred tax asset (DTA) and liability (DTL) revaluations   causing one-time earnings and capital impacts. While some of the one-time  noncash charges from DTA revaluations could be significant  the potential  earnings benefit from lower taxes over time could",
        "date": "03062017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: Corporate Tax Changes May Aid US Bank Earnings "
    },
    {
        "content": "* U.S. Bancorp announces redemption of all outstanding depositary shares representing interests in its series g non-cumulative perpetual preferred stock  Source text for Eikon:  Further company coverage:",
        "date": "03032017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp announces redemption of all outstanding depositary shares "
    },
    {
        "content": "The bond insurer Ambac Financial Group Inc has sued U.S. Bancorp to stop the bank from accepting a lowball settlement between investors and Bank of America Corp over shoddy mortgage securities.",
        "date": "01232017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Ambac sues U.S. Bancorp  says is shortchanged by BofA pact "
    },
    {
        "content": "Jan 17 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01172017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES- U.S. Bancorp  Carmignac  New York Life "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 18 (Fitch) U.S. Bancorp's (USB) fourth quarter 2016 (4Q16) net  income declined 1.6% from the sequential quarter and was flat relative to the  year-ago quarter  according to Fitch Ratings. For the full year USB's net income  was flat relative to the prior year. USB's 4Q16 annualized return on average assets (ROAA) was 1.32%  down from 1.36%  in prior quarter and 1.41% in the year-ago quarter. ROAA for the full year 2016",
        "date": "01182017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: U.S. Bancorp's Earnings Flat; Signals Management Change "
    },
    {
        "content": "Jan 17 U.S. regional bank U.S. Bancorp  said Chief Operating Officer Andy Cecere would succeed Richard Davis as chief executive officer  effective April 18.",
        "date": "01172017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "MOVES-U.S. Bancorp says Andy Cecere to succeed Richard Davis as CEO "
    },
    {
        "content": "* U.S. Bancorp reports fourth quarter and full year 2016 earnings",
        "date": "01182017",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp reports fourth quarter and full year 2016 earnings "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 10 (Fitch) Fitch expects large U.S. banks' 4Q16 results will  be mixed. Large trading banks' earnings likely benefited from election-related  market volatility; however  overall loan growth likely remained muted during the  quarter. The Federal Reserve's decision to increase short-term rates 25bps came  late in the quarter  such that net interest margins did not likely benefit.  Fitch expects credit trends remained fai",
        "date": "01102017",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: 4Q US Bank Earnings to be Mixed  Volatility Lifts Trading "
    },
    {
        "content": "* On November 18  2016  company entered into amendment no. 1 to credit agreement - SEC filing",
        "date": "11222016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bank extends maturity date of First Busey existing loan facility "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 19 (Fitch) U.S. Bancorp's (USB) third quarter 2016 (3Q16)  earnings were good and remain near the top of its large regional peer group and  the industry according to Fitch Ratings.  This level of operating performance  continues to support USB's high ratings. USB's annualized return on average assets (ROA) was a still good 1.36% in 3Q16   down from 1.43% in the sequential quarter  and down from 1.44% in the year-ago  qu",
        "date": "10192016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: Solid 3Q16 Earnings for U.S. Bancorp "
    },
    {
        "content": "LONDON  Oct 19 (IFR) - Bank of America Merrill Lynch has reshuffled its debt capital markets team  appointing Andrew Karp and Brendan Hanley as co-heads of global DCM  according to an internal memo seen by IFR.",
        "date": "10192016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "MOVES-BAML reshuffles debt capital markets "
    },
    {
        "content": "* Expects net interest income to increase on a linked-quarter basis - conf call",
        "date": "10192016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp expects net interest income to increase in Q4 - Conf call "
    },
    {
        "content": "Minneapolis-based U.S. Bancorp  reported a 4.7 percent rise in quarterly revenue helped by strength in its mortgage banking unit and higher interest income.",
        "date": "10192016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "U.S. Bancorp's quarterly revenue rises 4.7 percent "
    },
    {
        "content": "Oct 19 Minneapolis-based U.S. Bancorp  reported a 4.7 percent rise in quarterly revenue helped by strength in its mortgage banking unit and higher interest income.",
        "date": "10192016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "UPDATE 1-U.S. Bancorp's quarterly revenue rises 4.7 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 04 (Fitch) Fitch Ratings has affirmed U.S. Bancorp's (USB)  ratings at 'AA/F1+'. The Rating Outlook is Stable. The affirmation and Stable  Outlook are driven by the company's continued good operating performance  solid  liquidity position  and stable capital ratios. The rating action follows a periodic review of the large regional banking group   which includes BB&T Corporation (BBT)  Capital One Finance Corporation (CO",
        "date": "10042016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch Affirms U.S. Bancorp at 'AA/F1+'; Outlook Stable "
    },
    {
        "content": "* Announced redemption on October 14  2016  of all of its outstanding 2.20% medium-term notes  series T   due Nov 15  Source text for Eikon:  Further company coverage:",
        "date": "10042016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp announced redemption of outstanding 2.20% medium-term notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK/CHICAGO  September 23 (Fitch) A flattening yield curve could continue  to pressure US bank margins following the latest Federal Reserve open market  committee (FOMC) meeting where the medium-term projection for the Fed funds  target rate was lowered again  says Fitch Ratings.  The uncertainty over the rate trajectory and terminal rate  coupled with the  unprecedented length of this low rate period  remain key challenges and sou",
        "date": "09232016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: Yield Curve Flattening Remains a Risk to US Bank Margins "
    },
    {
        "content": "* Issued $1.35 billion aggregate principal amount of its 2.375% medium-term notes  series V (senior) due July 22  2026- SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07222016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp issued $1.35 bln principal amount of 2.375 pct notes "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 15 (Fitch) U.S. Bancorp's (USB) second quarter 2016 (2Q16)  earnings continued to be strong and near the top of the banking industry   according to Fitch Ratings. This level of operating performance continues to  support USB's ratings of 'AA/F1+'  which are the highest in Fitch's Global Bank  Ratings Universe.  USB's annualized return on average assets (ROAA) remained strong at 1.43% in  2Q16  up from 1.32% in the sequenti",
        "date": "07152016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: Solid 2Q16 Earnings for U.S. Bancorp "
    },
    {
        "content": "NEW YORK  July 15 (IFR) - Spreads on US bank bonds have lagged the rally in corporate credit  and that could offer investors a chance for decent pick-up as banks hit the market post-earnings in the days ahead.",
        "date": "07152016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "Lagging US bank sector could appeal to bond investors "
    },
    {
        "content": "* Fitch: Flat yield curve will pressure U.S. Bank margins in second half 2016",
        "date": "07112016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-Fitch: Flat yield curve will pressure U.S. Bank margins in second half 2016 "
    },
    {
        "content": "* U.S. Bancorp receives results of comprehensive capital analysis and review; Federal Reserve did not object to company's capital distribution plan",
        "date": "06292016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp says Federal Reserve did not object to capital distribution plan "
    },
    {
        "content": "* U.S. Bancorp appoints Terry Dolan as Chief Financial Officer; Dolan is currently Vice Chairman  Wealth Management & Securities Services",
        "date": "06132016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp names Terry Dolan CFO "
    },
    {
        "content": "* Basel committee's  proposal could impact internationally active U.S. Credit card banks CET1 ratios on average by 375 basis points  Source text (http://bit.ly/1UVswAo)   (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05122016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-Fitch says Basel proposals could impact U.S. Bank credit card lines "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK/CHICAGO  May 12 (Fitch) The Basel Committee's (BCBS) proposal to apply  higher capital charges for \"unconditionally cancellable lines of credit\" (UCCs)  could impact internationally active US credit card banks CET1 ratios on average  by 375 basis points  absent any remedial measures from affected institutions   says Fitch Ratings. If implemented by the US authorities  the measures will  encourage US banks to reduce unused lines",
        "date": "05122016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "Fitch: Basel Proposals Could Impact US Bank Credit Card Lines "
    },
    {
        "content": "* Given U.S. macroeconomic environment  number of future rate hikes is looking less certain",
        "date": "04282016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "BRIEF-Fitch: weaker 1Q US bank results reflect macro-challenges "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 20 (Fitch) U.S. Bancorp's (USB) first quarter 2016 (1Q16)  earnings continued to be strong and near the top of the industry despite some  higher provision expenses related to the company's energy loan portfolio  which  Fitch Ratings notes represents only 1.3% of the company's total loans  outstanding. Overall  USB's annualized return on average assets (ROAA) was a good 1.32% in  1Q16  though down from 1.41% in the sequent",
        "date": "04202016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: Good Earnings for U.S. Bancorp Despite Higher Energy Provisioning "
    },
    {
        "content": "Regional lender U.S. Bancorp  reported a 3 percent fall in quarterly profit  weighed down by higher costs and increased reserves for bad loans to the energy industry.",
        "date": "04202016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "U.S. Bancorp profit slips on energy loan provisions "
    },
    {
        "content": "April 20 Regional lender U.S. Bancorp  reported a 3 percent fall in quarterly profit  weighed down by higher costs and increased reserves for bad loans to the energy industry.",
        "date": "04202016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "UPDATE 1-U.S. Bancorp profit slips on energy loan provisions "
    },
    {
        "content": "* Q1 earnings per share view $0.76 -- Thomson Reuters I/B/E/S",
        "date": "04202016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "BRIEF-U.S. Bancorp Q1 earnings per share $0.76 "
    },
    {
        "content": "April 20 Regional lender U.S. Bancorp  reported a 3 percent fall in quarterly profit  weighed down by higher costs and increased reserves for bad loans to the energy industry.",
        "date": "04202016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "U.S. Bancorp's profit falls 3 pct "
    },
    {
        "content": "April 4 U.S. Bancorp  the parent company of U.S. Bank  said it appointed Jennifer Thompson as senior vice president  investor relations.",
        "date": "04042016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-U.S. Bancorp names Jennifer Thompson as investor relations head "
    },
    {
        "content": "WASHINGTON The U.S. Comptroller's office said on Tuesday that U.S. Bank will pay a $10 million penalty and Santander a $3.4 million penalty to lift 2011 consent orders related to mortgage practices.",
        "date": "02092016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "U.S. Bank  Santander to pay penalties over mortgage practices "
    },
    {
        "content": "WASHINGTON  Feb 9 The U.S. Comptroller's office said on Tuesday that U.S. Bank will pay a $10 million penalty and Santander a $3.4 million penalty to lift 2011 consent orders related to mortgage practices.",
        "date": "02092016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "UPDATE 1-U.S. Bank  Santander to pay penalties over mortgage practices "
    },
    {
        "content": "WASHINGTON  Feb 9 The U.S. Comptroller's office said on Tuesday that U.S. Bank will pay a $10 million penalty and Santander a $3.4 million penalty in order to lift consent orders originally issued in April 2011  related to how the banks serviced mortgages.",
        "date": "02092016",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "U.S. gov't levies penalties on U.S. Bank  Santander over mortgages "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 15 (Fitch) U.S. Bancorp's (USB) fourth quarter 2015 (4Q15) and  full year 2015 earnings continued to be strong and support the company's  ratings  which are the highest in Fitch Ratings' global bank rating universe.   USB's 4Q15 return on average assets (ROAA) 1.41%  down modestly from the 1.44%  in 3Q15.  The company's 2015 full year ROAA was 1.44% relative to 1.54% in the  prior year period. Given the impact low inter",
        "date": "01152016",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: USB's Good Performance in 4Q15 Supportive of its High Ratings "
    },
    {
        "content": "Dec 1 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "12012015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-Credit Suisse  Axcel  Franklin Square  U.S. Bank "
    },
    {
        "content": "Dec 1 U.S. Bank  a subsidiary of U.S. Bancorp   appointed Liza Tainton chief risk officer of its wealth management business.",
        "date": "12012015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "MOVES-Liza Tainton joins U.S. Bank as chief risk officer for wealth management "
    },
    {
        "content": "Oct 23 U.S. Bank Wealth Management  part of U.S. Bancorp  appointed Campbell Reynolds as private banker for The Private Client Reserve of U.S. Bank in Las Vegas.",
        "date": "10232015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-US Bancorp's wealth unit names Campbell Reynolds as private banker "
    },
    {
        "content": "Oct 21 U.S. Bank Wealth Management  part of U.S. Bancorp  said Anthony Gillaizeau has been named wealth management consultant for The Private Client Reserve of U.S. Bank in San Francisco.",
        "date": "10212015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-US Bank names Anthony Gillaizeau wealth management consultant "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 15 (Fitch) U.S. Bancorp's (USB) third quarter 2015 (3Q15)  continued to be strong and support Fitch Ratings' upgrade of the company's  Viability Rating (VR) to 'aa' earlier this month. USB's 3Q15 return on average assets (ROAA) came in at 1.44% and its return on  average equity (ROAE) was a strong 14.1%. Given the impact low interest rates are having on earnings across the banking  industry as well as the continued inc",
        "date": "10152015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: Good Performance in USB's 3Q15 Results "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 05 (Fitch) Fitch Ratings has upgraded U.S. Bancorp's (USB)  long-term Issuer Default Rating (IDR) to 'AA' from 'AA-'. The Rating Outlook is  Stable. With this upgrade  USB's ratings are at the top of Fitch's global bank  rating universe. The rating action follows a periodic review of the large regional banking group   which includes BB&T Corporation (BBT)  Capital One Finance Corporation (COF)   Comerica Incorporated (C",
        "date": "10052015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch Upgrades U.S. Bancorp's L-T IDR at 'AA' Following Large Regional Bank Review; Outlook Stable "
    },
    {
        "content": "Sept 2 U.S. Bank Wealth Management  a part of U.S. Bancorp  appointed Dawn Ripkey a wealth management adviser in its  Private Client Reserve unit in Milwaukee.",
        "date": "09022015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "CORRECTED-MOVES-Dawn Ripkey joins U.S. Bank Wealth Management as adviser "
    },
    {
        "content": "SYDNEY Australia is seeking a guaranteed slice of any growth in demand in the U.S. sugar market in talks with Washington on the Trans-Pacific Partnership (TPP) trade pact  a source with knowledge of the Australian position said.",
        "date": "08042015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Australia wants exposure to future U.S. sugar demand in trade pact: source "
    },
    {
        "content": "July 30 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "07302015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES- ANZ  Lazard  US Bank  BTIG "
    },
    {
        "content": "NEW YORK  July 17 U.S. Bank  the bond trustee for Puerto Rico's Public Finance Corp  said it has hired a law firm to advise it after the agency failed to make a transfer of $94 million it should have made on Wednesday ahead of a payment to investors on Aug. 1  according to a regulatory filing posted by the bank late Thursday.",
        "date": "07172015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Bond trustee hires law firm after Puerto Rico misses payment "
    },
    {
        "content": "July 1 The wealth management unit of U.S. Bancorp appointed Jim Kirk as wealth management adviser for the private client reserve of U.S. Bank in St. Paul  Minnesota.",
        "date": "07012015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank Wealth Management appoints Jim Kirk as adviser "
    },
    {
        "content": "June 29 The wealth management unit of U.S. Bancorp appointed Andy Fent as an adviser for the private client reserve of U.S. Bank in Kansas City.",
        "date": "06292015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank Wealth Management names Andy Fent as adviser "
    },
    {
        "content": "June 24 U.S. Bank  the fifth-largest U.S. commercial bank  promoted Jenna Guenther to managing director of wealth strategy in its wealth management unit  Ascent Private Capital Management.",
        "date": "06242015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank promotes Jenna Guenther to wealth strategy MD at Ascent Private "
    },
    {
        "content": "NEW YORK A unit of Minneapolis-based U.S. Bancorp has agreed to pay $44.5 million to settle a class action brought by former customers of brokerage Peregrine Financial Group  which failed in 2012 after its funds were siphoned off in a long-running fraud.",
        "date": "06232015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "U.S. Bancorp unit to pay $44.5 mln in Peregrine settlement "
    },
    {
        "content": "NEW YORK A unit of Minneapolis-based U.S. Bancorp has agreed to pay $44.5 million to settle a class action brought by former customers of brokerage Peregrine Financial Group  which failed in 2012 after its funds were siphoned off in a long-running fraud.",
        "date": "06232015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "U.S. Bancorp unit to pay $44.5 million in Peregrine settlement "
    },
    {
        "content": "NEW YORK  June 23 A unit of Minneapolis-based U.S. Bancorp has agreed to pay $44.5 million to settle a class action brought by former customers of brokerage Peregrine Financial Group  which failed in 2012 after its funds were siphoned off in a long-running fraud.",
        "date": "06232015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "UPDATE 1-U.S. Bancorp unit to pay $44.5 mln in Peregrine settlement "
    },
    {
        "content": "NEW YORK  June 23 A unit of Minneapolis-based U.S. Bancorp has agreed to pay $44.5 million to settle a class action brought by former customers of brokerage Peregrine Financial Group  which failed in 2012 after its funds were siphoned off in a long-running fraud.",
        "date": "06232015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "U.S. Bancorp unit to pay $44.5 mln in Peregrine settlement -court filing "
    },
    {
        "content": "WASHINGTON A U.S. bank regulator on Wednesday said it imposed restrictions on mortgage servicing against HSBC  Wells Fargo and four others because they failed to meet all of the requirements of a major settlement.",
        "date": "06172015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "U.S. regulator limits mortgage servicing activities at six banks "
    },
    {
        "content": "WASHINGTON  June 17 A U.S. bank regulator on Wednesday said it imposed restrictions on mortgage servicing against HSBC  Wells Fargo and four others because they failed to meet all of the requirements of a major settlement.",
        "date": "06172015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "U.S. regulator limits mortgage servicing activities at 6 banks "
    },
    {
        "content": "June 1 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06012015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-Morgan Stanley  Citigroup  BoFA  Prudential "
    },
    {
        "content": "June 1 U.S. Bank  the fifth-largest U.S. commercial bank  named Steve Bellman managing director of investments in its wealth management unit  Ascent Private Capital Management.",
        "date": "06012015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank names Bellman MD-investments at wealth management unit "
    },
    {
        "content": "May 27 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05272015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES- Goldman Sachs  Abu Dhabi Investment Authority  U.S. Bank "
    },
    {
        "content": "May 4 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05042015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES- U.S. Bancorp  Franklin Financial  Wells Fargo  First Foundation "
    },
    {
        "content": "May 4 U.S. Bank  a part of U.S. Bancorp  appointed Rex Rudy the head of its commercial real estate division.",
        "date": "05042015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank names Rex Rudy head of commercial real estate "
    },
    {
        "content": "April 13 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04132015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-JPMorgan  U.S. Bancorp "
    },
    {
        "content": "April 13 The Private Client Reserve  a division of U.S. Bancorp's Wealth Management unit  has appointed Mark Benskin managing director.",
        "date": "04132015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "MOVES-Mark Benskin named managing director of U.S. Bancorp division "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 15 (Fitch) U.S. Bancorp continued to deliver good performance in  the first quarter of 2015 (1Q'15) with a return on average assets (ROAA) of  1.44% and a return on average equity (ROAE) of 14.1%.  Fitch considers these  results to be strong and believes them to be near the top of the banking  industry  though also notes that these were modestly lower performance numbers  than in the sequential or year-ago quarters. Relat",
        "date": "04152015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch:  Continued Good Performance For U.S. Bancorp in 1Q'15 "
    },
    {
        "content": "April 7 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04072015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-Barclays  BofA Merrill Lynch  U.S. Bank  Standard Chartered "
    },
    {
        "content": "April 7 U.S. Bank  the fifth largest U.S. commercial bank  moved Brad Scott to lead its team advising high-net-worth clients in Cincinnati  Ohio from the same position in Kansas City.",
        "date": "04072015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank appoints Brad Scott to lead high-net-worth client team in Cincinnati "
    },
    {
        "content": "U.S. Bancorp named Pilar Pettys vice president  wealth management adviser  of its Private Client Reserve in Los Angeles.",
        "date": "03172015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "U.S. Bank names Pilar Pettys VP  wealth management adviser  Private Client Reserve "
    },
    {
        "content": "March 17 U.S. Bancorp named Pilar Pettys vice president  wealth management adviser  of its Private Client Reserve in Los Angeles.",
        "date": "03172015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank names Pilar Pettys VP  wealth management adviser  Private Client Reserve "
    },
    {
        "content": "March 9 U.S. Bancorp hired Debra Ruth and Jennifer Maschke as private bankers for the Private Client Reserve in Minneapolis.",
        "date": "03092015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank appoints Debra Ruth and Jennifer Maschke as private bankers "
    },
    {
        "content": "March 2 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03022015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES- U.S. Bancorp  Financial Reporting Council  JP Morgan "
    },
    {
        "content": "March 2 U.S. Bancorp named Brian Lee as a portfolio manager in its Private Client Reserve business in New York.",
        "date": "03022015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank names Lee as Private Client Reserve portfolio manager "
    },
    {
        "content": "Feb 3 U.S. Bancorp's wealth management arm appointed Jan Hendrickson as regional managing director of its private wealth management division  Ascent Private Capital Management  in Seattle.",
        "date": "02032015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank hires new MD for Seattle wealth management unit "
    },
    {
        "content": "U.S. Bancorp agreed to pay $18 million to former customers of Peregrine Financial Group Inc to resolve claims that the large U.S. bank aided a massive fraud by the failed futures brokerage's now-imprisoned founder  Russell Wasendorf Sr.",
        "date": "02042015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "U.S. Bancorp to pay $18 mln to customers of failed Peregrine "
    },
    {
        "content": "NEW YORK/WASHINGTON  Feb 4 U.S. Bancorp agreed to pay $18 million to former customers of Peregrine Financial Group Inc to resolve claims that the large U.S. bank aided a massive fraud by the failed futures brokerage's now-imprisoned founder  Russell Wasendorf Sr.",
        "date": "02042015",
        "name": "US Bancorp",
        "news_type": "normal",
        "symbol": "USB",
        "title": "UPDATE 1-U.S. Bancorp to pay $18 mln to customers of failed Peregrine "
    },
    {
        "content": "Jan 23 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01232015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES- UBS  U.S. BANK "
    },
    {
        "content": "Jan 22 U.S. Bank  the wealth management division of U.S. Bancorp  named Dan Farley regional investment director for its Private Client Reserve.",
        "date": "01222015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "MOVES-U.S. Bank names regional investment director at Private Client Reserve "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 21 (Fitch) U.S. Bancorp's (USB) fourth quarter 2014 (4Q'14)  earnings remained strong  according to Fitch Ratings.  The company's 4Q return  on average assets (ROA) was good at 1.50%  essentially unchanged from the  sequential quarter but down from 1.62% in the year-ago quarter.  Similarly the  company's return on average equity (ROE) was 14.4% in 4Q'14  essentially  unchanged from the sequential quarter  but down from ",
        "date": "01212015",
        "name": "US Bancorp",
        "news_type": "topStory",
        "symbol": "USB",
        "title": "Fitch: Strong Loan Growth Evident in U.S. Bancorp's Fourth Quarter Earnings "
    }
]