[
    {
        "content": "DUBAI The United States is in talks to sell F-35 fighter jets to partner nations  a senior U.S. military official said on Friday during a visit to the United Arab Emirates  without giving details.",
        "date": "11102017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United States discussing sale of F-35s to partners  U.S. official says in UAE "
    },
    {
        "content": "DUBAI  Nov 10 The United States is in talks to sell F35 fighter jets to partner nations  a senior U.S. military official said during a visit to the United Arab Emirates  without giving details.",
        "date": "11102017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United States discussing sale of F-35s to partner nations  U.S. official says in UAE "
    },
    {
        "content": "Nov 2 United Technologies Corp's Kidde unit is recalling more than 40 million fire extinguishers mainly in the United States  a U.S. consumer safety agency said on Thursday  following reports that they failed to work and caused one death in 2014.",
        "date": "11022017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UTC unit recalls 40 million fire extinguishers in US  Canada "
    },
    {
        "content": "MONTREAL  Nov 2 Bombardier Inc's Chief Executive Alain Bellemare told analysts that engine delays that have reduced deliveries of the company's CSeries jets this year are a \"short-term issue\" that supplier Pratt & Whitney is \"actively addressing.\"",
        "date": "11022017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Bombardier CEO says CSeries jet engine delays are \"short-term\" "
    },
    {
        "content": "Oct 26 Spare parts for Lockheed Martin Corp's stealthy F-35 fighter jets are not keeping up with demand according to a report out on Thursday from the U.S. Government Accountability Office.",
        "date": "10262017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed's F-35 fighter jet program has spare parts shortage -GAO "
    },
    {
        "content": "* Will provide full update on Nov. 2  when it issues Q3 results",
        "date": "10252017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 3-Bombardier reviewing CSeries deliveries due to UTC engine fixes "
    },
    {
        "content": "United Technologies Corp  raised its full-year forecasts for the second time this year on Tuesday and said it was making progress in resolving issues with engines at its Pratt & Whitney business  allaying concerns of key aircraft customers.",
        "date": "10242017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies progresses on engine fixes  raises forecasts "
    },
    {
        "content": "* Ups low end of 2017 sales forecast to $59.0 bln from $58.5 bln",
        "date": "10242017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 3-United Technologies progresses on engine fixes  raises forecasts "
    },
    {
        "content": "NEW YORK  Oct 24 U.S. industrial sector roared to a record high on Tuesday following strong financial results from stalwarts 3M Co and Caterpillar Inc  even as shares of General Electric Co continued to struggle.",
        "date": "10242017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "U.S. industrial shares hit record high as earnings shine "
    },
    {
        "content": "Oct 24 Bombardier Inc said it was reviewing delivery plans for its CSeries jets for 2017  after U.S. engine parts maker United Tech said it was resolving issues with its geared turbofan (GTF) engines to make them more durable.",
        "date": "10242017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Bombardier reviewing CSeries deliveries after UTC engine fixes "
    },
    {
        "content": "* UTC reports third quarter 2017 results  raises 2017 outlook",
        "date": "10242017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-UTC reports third quarter 2017 results  raises 2017 outlook "
    },
    {
        "content": "Oct 24 United Technologies Corp reported a 7.8 percent drop in quarterly profit on Tuesday  partly as it spends on increasing production of its fuel-saving geared turbofan aircraft engines.",
        "date": "10242017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech's quarterly profit slumps 8 pct "
    },
    {
        "content": "* Meghan L. O'sullivan  of Harvard University  to join United Technologies board of directors",
        "date": "10112017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies adds Meghan O'Sullivan to its board "
    },
    {
        "content": "* Sets quarterly dividend of $0.70 per share Source text for Eikon: Further company coverage:",
        "date": "10112017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United technologies sets quarterly dividend of $0.70/share "
    },
    {
        "content": "* Says United Tech Corp's unit Carrier International (maurititus) sold balance shareholding in co‍​ Source text - http://bit.ly/2xKAneI Further company coverage:",
        "date": "09292017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-Cyient says United Tech's unit Carrier International (Maurititus) sells balance shareholding in co‍​ "
    },
    {
        "content": "* COMAC  UAC announce name of joint wide-body jet (Updates with details  quote)",
        "date": "09292017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-China's C919 jet could do 3rd test flight within days -COMAC exec "
    },
    {
        "content": "* Says United Technologies Corporation sells its minority equity stake in Cyient Source text - http://bit.ly/2fQCzI5 Further company coverage:",
        "date": "09272017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-Cyient says United Technologies Corp sells minority equity stake in co "
    },
    {
        "content": "* Deal could face regulatory scrutiny - analyst (Adds Aerojet share price; M&A data)",
        "date": "09182017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 4-Northrop Grumman to buy missile maker Orbital for $7.8 bln "
    },
    {
        "content": "NEW YORK U.S. defense contractor Northrop Grumman Corp  is poised to announce a purchase of missile and rocket maker Orbital ATK Inc  as soon as Monday  a person familiar with the transaction said on Sunday.",
        "date": "09182017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Northrop Grumman nears deal to purchase Orbital ATK: source "
    },
    {
        "content": "NEW YORK  Sept 17 U.S. defense contractor Northrop Grumman Corp is poised to announce a purchase of missile and rocket maker Orbital ATK Inc as soon as Monday  a person familiar with the transaction said on Sunday.",
        "date": "09182017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 3-Northrop Grumman nears deal to purchase Orbital ATK -source "
    },
    {
        "content": "* Expects to grow adjusted EPS in 2018 after the impact of accounting standards change  - presentation‍​ Source text: (http://bit.ly/2wZ2FCR) Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "09142017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies expects to grow adjusted EPS in 2018 after impact of accounting standards change "
    },
    {
        "content": "Sept 4 Jet-engine maker United Technologies Corp has agreed to buy aircraft parts manufacturer Rockwell Collins Inc for $30 billion  the companies said.",
        "date": "09042017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "REFILE-United Tech to buy Rockwell Collins for $30 bln in stock and cash "
    },
    {
        "content": "* United Technologies to buy Rockwell Collins for $23 billion  United Technologies will pay $140 share in cash and stock- WSJ  citing sources Source text : http://on.wsj.com/2vGxeNB",
        "date": "09042017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies to buy Rockwell Collins for $23 bln- WSJ "
    },
    {
        "content": "NEW YORK  Sept 6 United Technologies Corp launched a US$6.5bn loan on Wednesday to support the aerospace and industrial company’s US$23bn purchase of avionics supplier Rockwell Collins Inc  the largest merger ever in the aerospace sector  sources said.",
        "date": "09062017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "LPC: United Tech launches US$6.5bn loan for Rockwell Collins buy "
    },
    {
        "content": "NEW YORK  Sept 5 Investors and Boeing Co gave two thumbs down on Tuesday to aerospace and industrial company United Technologies Corp $23 billion plan to buy avionics maker Rockwell Collins Inc.",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UPDATE 5-UTC touts $23 bln deal as stock drops  Boeing turns critic "
    },
    {
        "content": "NEW YORK Investors and Boeing Co gave two thumbs down on Tuesday to aerospace and industrial company United Technologies Corp $23 billion plan to buy avionics maker Rockwell Collins Inc. | Video ",
        "date": "09062017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UTC touts $23 billion deal as stock drops  Boeing turns critic "
    },
    {
        "content": "* United Tech falls as Boeing raises concerns about Rockwell deal",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "US STOCKS-Wall St falls more than 1 pct on rising N.Korea worries "
    },
    {
        "content": "NEW YORK Boeing Co said on Tuesday it would look closely at United Technologies Corp's $23 billion acquisition of Rockwell Collins Inc  breaking its month-long silence on a deal.",
        "date": "09062017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Boeing raises concern about $23 billion United Tech-Rockwell deal "
    },
    {
        "content": "Aerospace supplier United Technologies Corp  has struck a $30 billion agreement to buy avionics and interiors maker Rockwell Collins Inc   the companies said on Monday  in a deal that bulks up UTC's power with plane makers by creating one of the world's largest makers of civilian and defense aircraft components. | Video ",
        "date": "09062017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech to buy Rockwell Collins for $30 billion "
    },
    {
        "content": "NEW YORK  Sept 5 Boeing Co said on Tuesday it would look closely at United Technologies Corp's $23 billion acquisition of Rockwell Collins Inc  breaking its month-long silence on a deal.",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Boeing raises concern about $23 bln United Tech-Rockwell deal "
    },
    {
        "content": "NEW YORK  Sept 5 Boeing Co said on Tuesday it would look closely at United Technologies Corp's $23 billion acquisition of Rockwell Collins Inc  breaking its month-long silence on a deal.",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Boeing raises concern about $23 bln United Tech-Rockwell deal "
    },
    {
        "content": "PARIS/NEW YORK/WASHINGTON U.S. aerospace and industrial company United Technologies Corp  faces a long road to win approval for its $23 billion plan to buy avionics maker Rockwell Collins Inc   and the biggest bumps could be in Brussels rather than Washington.",
        "date": "09062017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech  Rockwell deal faces bumpy road to approval  especially in the EU "
    },
    {
        "content": "* United Tech down after its $30 bln deal to buy Rockwell Collins",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "US STOCKS-Wall St lower as North Korea tensions weigh "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - United Technologies isn't staying fully grounded in its quest for scale. The U.S. industrial conglomerate is paying $30 billion including debt for aerospace supplier Rockwell Collins. The strategy makes sense but  with a weak return on investment  United Technologies is paying up for the privilege of getting bigger.",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Breakingviews - United Tech breathes rarefied air to bulk up "
    },
    {
        "content": "PARIS/NEW YORK/WASHINGTON  Sept 5 U.S. aerospace and industrial company United Technologies Corp faces a long road to win approval for its $23 billion plan to buy avionics maker Rockwell Collins Inc  and the biggest bumps could be in Brussels rather than Washington.",
        "date": "09062017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "CORRECTED-United Tech  Rockwell deal faces bumpy road to approval  especially in the EU "
    },
    {
        "content": "* United Technologies CEO Greg Hayes on CNBC says anti-trust risk is very low on deal with Rockwell Collins",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies CEO Greg Hayes on CNBC says anti-trust risk is very low on deal with Rockwell Collins "
    },
    {
        "content": "* United Tech down after its $30 bln deal to buy Rockwell Collins",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "US STOCKS-Wall St opens lower on North Korea tensions "
    },
    {
        "content": "* United Tech down after its $30 bln deal to buy Rockwell Collins",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "US STOCKS-Wall St set to open lower as N. Korea tensions rise "
    },
    {
        "content": "NEW YORK  Sept 5 Aerospace and industrial company United Technologies Corp said on Tuesday it is not planning quick divestments of businesses after it agreed to acquire avionics supplier Rockwell Collins Inc in a $23 billion deal.",
        "date": "09052017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech sees limited divestment; needs cash flow to reduce debt "
    },
    {
        "content": "PARIS/NEW YORK  Aug 30 Airbus has urged supplier United Technologies Corp to stay focused on fixing industrial problems that have delayed new aircraft deliveries even if it presses ahead with plans to buy avionics and seats maker Rockwell Collins Inc.",
        "date": "08312017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "RPT-UPDATE 1-Airbus hopes M&A talk does not distract United Tech from operations "
    },
    {
        "content": "PARIS/NEW YORK  Aug 30 Airbus has urged supplier United Technologies Corp to stay focused on fixing industrial problems that have delayed new aircraft deliveries even if it presses ahead with plans to buy avionics and seats maker Rockwell Collins Inc.",
        "date": "08302017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UPDATE 1-Airbus hopes M&A talk does not distract United Tech from operations "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - United Technologies’ avionics bid looks airworthy. The conglomerate’s potential acquisition of Rockwell Collins should deliver enough cost savings to justify paying a reported price tag of nearly $23 billion. Greater size also promises increased negotiating heft with Boeing and Airbus. Investors have good reason to clear this deal for takeoff.",
        "date": "08302017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Breakingviews - United Technologies’ avionics bid looks airworthy "
    },
    {
        "content": "United Technologies Corp   owner of jet-engine maker Pratt & Whitney  has made progress in its talks to acquire aircraft component manufacturer Rockwell Collins Inc  as it seeks to bulk up its aerospace business  a person familiar with the matter said on Tuesday.",
        "date": "08292017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech makes progress in Rockwell Collins talks: source "
    },
    {
        "content": "PARIS  Aug 30 Airbus has urged United Technologies to stay focused on fixing industrial problems that have delayed aircraft deliveries even if it presses ahead with reported plans to buy avionics supplier Rockwell Collins",
        "date": "08302017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Airbus says hopes M&A talk will not distract United Tech from operational priorities "
    },
    {
        "content": "Aug 29 United Technologies Corp  owner of jet-engine maker Pratt & Whitney  has made progress in its talks to acquire aircraft component manufacturer Rockwell Collins Inc as it seeks to bulk up its aerospace business  a person familiar with the matter said on Tuesday.",
        "date": "08292017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-United Tech makes progress in Rockwell Collins talks -source "
    },
    {
        "content": "* Sales would be boost for aerospace  defense M&A activity (Recasts lead  adds Excelitas sale  background)",
        "date": "08252017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Veritas Capital explores sale of nearly $3 bln in high-tech portfolio assets -sources "
    },
    {
        "content": "Aug 29 United Technologies Corp  which makes Pratt and Whitney engines and Otis Elevators  is nearing a deal to buy aircraft component maker Rockwell Collins Inc for more than $20 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08292017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech nears deal to buy Rockwell Collins -WSJ "
    },
    {
        "content": "* United Tech. nears deal to buy Rockwell Collins  discuss price of $140 per share or less - CNBC  citing DJ Further company coverage:",
        "date": "08292017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies nears deal to buy Rockwell Collins - CNBC  citing DJ "
    },
    {
        "content": "United Technologies Corp   the U.S. maker of Otis Elevators and Carrier air conditioners  has submitted an offer to acquire aircraft component manufacturer Rockwell Collins Inc   a person familiar with the matter said on Friday.",
        "date": "08042017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies in bid to acquire Rockwell Collins: source "
    },
    {
        "content": "Aug 4 United Technologies Corp  the U.S. maker of Otis Elevators and Carrier air conditioners  has submitted an offer to acquire aircraft component manufacturer Rockwell Collins Inc  a person familiar with the matter said on Friday.",
        "date": "08042017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-United Technologies in bid to acquire Rockwell Collins -source "
    },
    {
        "content": "Aug 4 United Technologies Corp has submitted an offer to acquire aircraft component maker Rockwell Collins Inc  a person familiar with the matter said on Friday.",
        "date": "08042017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies in bid to acquire Rockwell Collins -source "
    },
    {
        "content": "* United Technologies weighs deal for Rockwell Collins - Bloomberg  citing sources",
        "date": "08042017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies weighs deal for Rockwell Collins - Bloomberg "
    },
    {
        "content": "* United Technologies Corp - ‍philippe Delpech  president of Otis elevator  has elected to leave company Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies reports leadership change at Otis "
    },
    {
        "content": "United Technologies Corp   maker of Otis Elevators  Pratt & Whitney engines and Carrier air conditioners  on Tuesday reported a 2.7 percent rise in quarterly revenue  helped by higher sales in three of its four business units.",
        "date": "07252017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech sales up 2.7 percent amid engine issues  weak markets "
    },
    {
        "content": "July 25 United Technologies Corp may need to raise prices on its engines and other aerospace products if plane makers such as Boeing Co and Airbus SE push too aggressively into the business of selling parts and service  United Tech's  chief executive officer said on Tuesday.",
        "date": "07252017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech CEO says battle with plane makers could push up prices "
    },
    {
        "content": "* Q2 earnings per share view $1.78 -- Thomson Reuters I/B/E/S",
        "date": "07252017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-UTC reports Q2 EPS $1.80 "
    },
    {
        "content": "July 25 United Technologies Corp  the maker of Otis Elevators  Pratt & Whitney engines and Carrier air conditioners  reported a 2.7 percent rise in quarterly revenue  helped by higher sales in three of its four business units.",
        "date": "07252017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech quarterly revenue rises 2.7 percent "
    },
    {
        "content": "WASHINGTON  July 11 Northrop Grumman Corp and United Technologies Corp have each been awarded $409 million U.S. defense contracts for next generation thermal  power and controls  the Pentagon said on Tuesday. (Reporting by Eric Beech; Editing by David Alexander)",
        "date": "07112017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Northrop Grumman  United Technologies each win $409 mln U.S. defense contracts "
    },
    {
        "content": "WASHINGTON  July 11 Northrop Grumman Corp has been awarded a $409 million U.S. defense contract for next generation thermal  power and controls  the Pentagon said on Tuesday.",
        "date": "07122017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "CORRECTED-(OFFICIAL)-Northrop Grumman wins $409 mln U.S. defense contract "
    },
    {
        "content": "* United Technologies Corp says issues response to recent reports regarding co's Carrier Indianapolis manufacturing facility​",
        "date": "06272017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies issues response regarding Carrier Indianapolis facility​ "
    },
    {
        "content": "PARIS Russia's United Aircraft Corporation (UAC) said on Tuesday it hoped a long-range  widebody plane it is developing with the Commercial Aircraft Corporation of China (COMAC) would sell more than 600 over a 20-year period.",
        "date": "06202017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Russia's UAC targets sales of more than 600 long-range planes "
    },
    {
        "content": "* MB Aerospace Group says signed 10-year contract with United Technologies Corp with potential value of up to $1 billion over life of contract Source text for Eikon: Further company coverage:",
        "date": "06182017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-MB Aerospace says signed 10-year contract with United Technologies "
    },
    {
        "content": "PARIS  June 20 Russia's United Aircraft Corporation (UAC) said on Tuesday it hoped a long-range  widebody plane it is developing with the Commercial Aircraft Corporation of China (COMAC) would sell more than 600 over a 20-year period.",
        "date": "06202017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "AIRSHOW-Russia's UAC targets sales of more than 600 long-range planes "
    },
    {
        "content": "PARIS  June 20 Russia's United Aircraft Corporation (UAC) is aiming for a first test flight of its long-range widebody jet in 2023 with a view to delivering the first plane two years later  UAC's president said on Tuesday.",
        "date": "06202017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "AIRSHOW-Russia's UAC targets 2023 test flight for new widebody jet "
    },
    {
        "content": "June 12 About a quarter of the F-35 fighter jets made by Lockheed Martin Corp  or 55 planes  have stopped flying until further notice because of irregularities in pilots' oxygen supplies  U.S. Air Force spokesman Captain Mark Graff said on Monday.",
        "date": "06122017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-One-quarter of F-35 fighter jets grounded over oxygen issues "
    },
    {
        "content": "June 9 The stealthy F-35 fighter jets made by Lockheed Martin Corp were temporarily grounded at a U.S. Air Force base in Arizona on Friday because of irregularities in pilots' oxygen supplies  an Air Force spokesman said.",
        "date": "06092017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-F-35 jets grounded at U.S. Air Force base in Arizona -officials "
    },
    {
        "content": "* Says reaffirms 2017 organic sales growth forecast of 2-4 percent  led by Pratt & Whitney",
        "date": "05232017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Tech says don't see value in splitting up co's businesses - EPG 2017 Conf "
    },
    {
        "content": "* Aim to take 10 pct of market from Boeing 787  Airbus A350 (Adds quotes  details of JV)",
        "date": "05222017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UPDATE 2-China  Russia set up wide-body jet firm in new challenge to Boeing  Airbus "
    },
    {
        "content": "May 22 Russia's United Aircraft Corp (UAC) president Yuri Slyusar said in Shanghai on Monday:",
        "date": "05222017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-UAC aims to complete maiden flight  first delivery of wide-body jet between 2025-2028 "
    },
    {
        "content": "LONDON  May 2 (IFR) - AT&T is expected to tap the European bond market soon to help finance its US$85.4bn acquisition of Time Warner  according to several market participants.",
        "date": "05022017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Investors expect AT&T to hit debt market "
    },
    {
        "content": "* United Technologies Corp says has priced an offering of $1 000 million aggregate principal amount of 1.900% notes due 2020",
        "date": "05012017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies prices offering of $1 000 mln aggregate principal amount of 1.900 pct notes due 2020 "
    },
    {
        "content": "United Technologies Corp still plans to deliver 350 to 400 Pratt & Whitney Geared Turbofan engines to plane makers this year  and does not expect the total to be reduced by JetBlue's decision to defer some Airbus aircraft with those engines  United Tech's chief financial officer told Reuters on Wednesday.",
        "date": "04262017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech engine deliveries not changed by JetBlue deferral: CFO "
    },
    {
        "content": "United Technologies Corp   the maker of Otis elevators  Pratt & Whitney aircraft engines and Carrier air conditioners  beat analysts' expectations with a 17.8 percent rise in first-quarter profit  helped by higher sales in all four of its business units.",
        "date": "04262017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech profit rises 17.8 percent  affirms full-year forecast "
    },
    {
        "content": "April 26 United Technologies Corp  the maker of Otis elevators  Pratt & Whitney aircraft engines and Carrier air conditioners  beat analysts' expectations with a 17.8 percent rise in first-quarter profit  helped by higher sales in all four of its business units.",
        "date": "04262017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-United Tech profit rises 17.8 pct  affirms full-year forecast "
    },
    {
        "content": "April 26 United Technologies Corp  the maker of Otis Elevators  Pratt & Whitney engines and Carrier air conditioners  reported an 17.8 percent rise in first-quarter profit  helped by higher sales in all its four business units.",
        "date": "04262017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies quarterly profit rises 17.8 pct "
    },
    {
        "content": "* Sets quarterly dividend of $0.66 per share Source text for Eikon: Further company coverage:",
        "date": "04242017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies sets quarterly dividend of $0.66 per share "
    },
    {
        "content": "* United Technologies Corp - reaffirms 2017 expectations for adjusted EPS of $6.30 to $6.60 on sales of $57.5 billion to $59 billion",
        "date": "04262017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-UTC Q1 adjusted earnings per share $1.48 "
    },
    {
        "content": "WASHINGTON April 10  The Pentagon and Lockheed Martin Corp could shave at least 5 percent off the price of stealthy F-35 fighter jets in their upcoming annual purchase contract as the standard version of the plane heads toward a price of below $80 million  people familiar with the talks told Reuters.",
        "date": "04102017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Pentagon seeks at least 5 pct savings on Lockheed F-35 jet  sources "
    },
    {
        "content": "* United Bancshares Inc - on March 22 co  Benchmark Bancorp entered into an agreement and plan of merger - SEC filing",
        "date": "03222017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Bancshares  Benchmark Bancorp enter plan of merger on March 22 - SEC filing "
    },
    {
        "content": "* United Technologies Corp - CEO Gregory Hayes's 2016 total compensation was $13.4 million versus $10.5 million - sec filing  Source text (http://bit.ly/2msTOBG) Further company coverage:",
        "date": "03102017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies Corp - CEO's 2016 total compensation was $13.4 mln vs. $10.5 mln "
    },
    {
        "content": "March 2 U.S. specialty metals maker Arconic Inc  said on Thursday it appointed former United Technologies Corp executive David Hess as an independent director on its board amid a proxy battle with hedge fund Elliott Management Corp.",
        "date": "03022017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Arconic names former UTC exec to board amid proxy fight with Elliott "
    },
    {
        "content": "* United Technologies announces secondary offering of its position in Watsco common stock",
        "date": "02232017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies announces secondary offering of its position in Watsco common stock "
    },
    {
        "content": "Feb 23 United Technologies Corp's Carrier unit expanded a recall of some air conditioners and heat pumps as their power cord plugs can overheat  posing a fire risk  the U.S. Consumer Product Safety Commission said on Thursday.",
        "date": "02232017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Carrier expands recall of air conditioners  heat pumps "
    },
    {
        "content": "WASHINGTON  Feb 16 The cost of Lockheed Martin Corp's stealthy F-35 jet could fall 16 percent to around $80 million in future purchases  according to the Department of Defense's head of the program.",
        "date": "02162017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Lockheed F-35 jet cost could drop 16 percent -Pentagon official "
    },
    {
        "content": "* SETS QUARTERLY DIVIDEND OF $0.66 PER SHARE  Source text for Eikon:  Further company coverage:",
        "date": "02062017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-UNITED TECHNOLOGIES SETS QUARTERLY DIVIDEND OF $0.66 PER SHARE "
    },
    {
        "content": "* United Technologies Corp - quarterly dividend of $0.70per share represents a 6.1 percent increase over prior quarter's dividend amount Source text for Eikon: Further company coverage:",
        "date": "06142017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-UTC board of directors increases dividend "
    },
    {
        "content": "United Technologies Corp  faced new questions about its Geared Turbofan engine on Wednesday  noting problems about durability and with the company's ability to receive parts on time.",
        "date": "01252017",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech details engine problems  affirms 2017 forecast "
    },
    {
        "content": "Jan 25 United Technologies Corp faced new questions about its Geared Turbofan engine on Wednesday  noting problems about durability and with the company's ability to receive parts on time.",
        "date": "01252017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-United Tech details engine problems  affirms 2017 forecast "
    },
    {
        "content": "SEATTLE  Jan 25 United Technologies Corp  expects to deliver between 350 and 400 Pratt & Whitney Geared Turbofan engines in 2017  Chief Financial Officer Akhil Johri said on Wednesday  affirming that it is on track to resolving issues with producing fan blades.",
        "date": "01252017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech sees 350-400 Pratt GTF engine deliveries in 2017 -CFO "
    },
    {
        "content": "Jan 25 United Technologies Corp  the maker of Otis Elevators and Carrier air conditioners  posted a fourth-quarter profit  compared with a year-ago loss  driven by better sales at its Pratt & Whitney aircraft engines unit.",
        "date": "01252017",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies posts Q4 profit on demand for aircraft engines "
    },
    {
        "content": "WASHINGTON United Technologies Corp   parent company of Carrier Corp  got a \"good deal\" with President-elect Donald Trump that allowed it to shift most jobs at two Indiana plants to Mexico  its chief executive said on Monday in an interview with CNBC.",
        "date": "12062016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UTC CEO says no 'quid pro quo' on keeping Indiana plant open "
    },
    {
        "content": "WASHINGTON Indiana state officials have agreed to give United Technologies Corp  $7 million worth of tax breaks to encourage the company to keep at least 1 069 jobs at its Carrier unit in Indianapolis  Carrier and the state said on Thursday. | Video ",
        "date": "12022016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Indiana agrees $7 million tax break to keep Carrier jobs in state: company "
    },
    {
        "content": "WASHINGTON  Nov 29 United Technologies Corp  has reached a deal with President-elect Donald Trump and Vice President-elect Mike Pence to keep close to 1 000 jobs at its Carrier Corp air conditioner plant in Indianapolis  roughly halving the number of U.S. jobs it planned to move to Mexico.",
        "date": "11302016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UPDATE 3-Carrier to keep about 1 000 U.S. factory jobs in deal with Trump "
    },
    {
        "content": "* United Technologies Corp unit Carrier says reached deal with President-Elect Trump & Vp-Elect Pence to keep close to 1 000 jobs in Indiana - tweet   Further company coverage:",
        "date": "11302016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-UTC unit Carrier says reached deal with Trump to keep about 1 000 jobs in Indiana - tweet "
    },
    {
        "content": "Nov 29 U.S. President-elect Donald Trump will visit Indiana on Thursday to announce a deal with United Technologies Corp on keeping close to 1 000 factory jobs in its Carrier plant  CNBC reported  citing sources.",
        "date": "11302016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Trump to keep close to 1 000 factory jobs in UTX's Carrier plant -CNBC "
    },
    {
        "content": "WEST PALM BEACH  Fla.  Nov 26 U.S. Senator Bernie Sanders turned up the pressure on President-elect Donald Trump on Saturday about his pledge to try to stop an Indiana air conditioner manufacturer from moving 1 400 jobs to Mexico.",
        "date": "11262016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Sanders to Trump: use defense contracts as leverage for Carrier jobs "
    },
    {
        "content": "ZHUHAI  Nov 2 Commercial Aircraft Corporation of China (COMAC) said on Wednesday it has set up a joint venture with Russia's United Aircraft Corporation (UAC) as part of ambitious plans to jointly develop a widebody jet.",
        "date": "11022016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "AIRSHOW-China's COMAC  Russia's UAC set up JV to develop widebody jet "
    },
    {
        "content": "ZHUHAI  China  Nov 2 Engine maker Pratt & Whitney  a unit of United Technologies Corp  said on Wednesday that it had won nearly $800 million in contracts from carriers Air China and Shenzhen Airlines to supply engines for their Airbus Group A320ceo aircraft.",
        "date": "11022016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "REFILE-UPDATE 1-AIRSHOW-Pratt & Whitney says it has won nearly $800 mln in contracts from China airlines "
    },
    {
        "content": "* Issued $650 million aggregate principal amount of 1.500 pct notes due 2019  $750 million aggregate principal amount of 1.950 pct notes due 2021",
        "date": "11012016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies issues $650 mln principal amount notes "
    },
    {
        "content": "NEW YORK United Technologies Corp  beat analysts' profit and sales estimates with third-quarter results on Tuesday  and notched up the low end of its full-year profit forecast  sending shares higher.",
        "date": "10252016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech beats forecasts  lifts low end of 2016 guidance "
    },
    {
        "content": "NEW YORK  Oct 25 United Technologies Corp  beat analysts' profit and sales estimates with third-quarter results on Tuesday  and notched up the low end of its full-year profit forecast  sending shares higher.",
        "date": "10252016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 3-United Tech beats forecasts  lifts low end of 2016 guidance "
    },
    {
        "content": "NEW YORK  Oct 25 United Technologies  said earnings at its Pratt & Whitney engine division are likely to be flat next year as it absorbs $300 million in costs from negative profit margins and $100 million in pension expenses.",
        "date": "10252016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies CEO sees flat Pratt & Whitney earnings in 2017 "
    },
    {
        "content": "Oct 25 United Technologies Corp reported a 4.1 percent rise in quarterly revenue  helped by higher sales in its Pratt & Whitney and aerospace systems divisions.",
        "date": "10252016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies quarterly revenue rises 4.1 pct "
    },
    {
        "content": "* Wesco Aircraft announces multiple agreements with United Technologies Corporation",
        "date": "10192016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-Wesco announces agreements with United Technologies "
    },
    {
        "content": "* Sets quarterly dividend of $0.66 per share  Source text for Eikon:  Further company coverage:",
        "date": "10122016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United technologies sets quarterly dividend of $0.66 per share "
    },
    {
        "content": "Oct 6 United Technologies Corp  maker of Pratt & Whitney engines  said on Thursday it would cut the overall size of its pension liabilities by about $1.77 billion in 2016.",
        "date": "10062016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech to cut pension liabilities by $1.77 bln "
    },
    {
        "content": "* Announced two related actions that are expected to reduce overall size of its pension obligations by approximately $1.77 billion.",
        "date": "10062016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United Techn to reduce pension liabilities by $1.77 bln "
    },
    {
        "content": "United Technologies Corp  maker of Pratt & Whitney engines  said on Thursday it would cut the overall size of its pension liabilities by about $1.77 billion in 2016.",
        "date": "10072016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech to cut pension liabilities by $1.77 billion "
    },
    {
        "content": "Oct 6 United Technologies Corp  maker of Pratt & Whitney engines  said on Thursday it would cut the overall size of its pension liabilities by about $1.77 billion in 2016.",
        "date": "10072016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-United Tech to cut pension liabilities by $1.77 bln "
    },
    {
        "content": "* To sell 5 550 000 shares of Bioerg SA for total of 2.8 million zlotys ($730 669.87)",
        "date": "09292016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United to sell 5 550 000 shares of Bioerg "
    },
    {
        "content": "CHICAGO United Technologies Corp  plans retrain U.S. workers at its Carrier Corp air conditioning unit who will lose their jobs once production moves to Mexico  the company's top executive said on Tuesday.",
        "date": "10042016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies will retrain Carrier workers: CEO "
    },
    {
        "content": "CHICAGO  Oct 4 United Technologies Corp  plans retrain U.S. workers at its Carrier Corp air conditioning unit who will lose their jobs once production moves to Mexico  the company's top executive said on Tuesday.",
        "date": "10042016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies will retrain Carrier workers -CEO "
    },
    {
        "content": "* Said on Monday that United decided to lower its stake in Bioerg via sale of 11 950 000 Bioerg's shares to Profit Investments LLC",
        "date": "09272016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United plans to sell 11 950 000 Bioerg's shares to Profit Investments LLC "
    },
    {
        "content": "NEW YORK  Sept 16 United Technologies Corp's  chief executive officer said on Friday the company plans to deliver 150 Pratt & Whitney engines this year  down from its earlier target of 200.",
        "date": "09162016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech CEO lowers forecast for Pratt & Whitney engine deliveries "
    },
    {
        "content": "* Neil G. Mitchill  Jr. Has been named vice president and chief financial officer of Pratt & Whitney.  Source text - http://bit.ly/2cYOSzy Further company coverage:",
        "date": "09142016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies: Neil Mitchill named chief financial officer of Pratt & Whitney. "
    },
    {
        "content": "* United Technologies board elects Gregory J. Hayes chairman  Edward A. Kangas named lead director",
        "date": "09142016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies board elects Gregory Hayes chairman "
    },
    {
        "content": "* Affirms its previously disclosed 2016 expectations of adjusted EPS of $6.45 to $6.60",
        "date": "08292016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies affirms its previously disclosed forecast "
    },
    {
        "content": "NEW YORK United Technologies Corp's  beat analysts estimates for quarterly profit and revenue and raised the low end of its full-year forecast  sending shares up more than 2 percent.",
        "date": "07262016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies lifts forecasts  shares jump "
    },
    {
        "content": "NEW YORK  July 26 United Technologies Corp's  beat analysts estimates for quarterly profit and revenue and raised the low end of its full-year forecast  sending shares up more than 2 percent.",
        "date": "07262016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 3-United Technologies lifts forecasts  shares jump "
    },
    {
        "content": "* United Technologies CEO Greg Hayes says starting to see traction on aerospace side of business - CNBC    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "07262016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies CEO Greg Hayes says starting to see traction on aerospace side of business - CNBC "
    },
    {
        "content": "July 26 United Technologies Corp  reported a 1.25 percent rise in quarterly revenue  helped by higher sales at Pratt & Whitney and its aerospace systems businesses.",
        "date": "07262016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech's quarterly revenue rises 1.25 pct "
    },
    {
        "content": "* After registration of the company's capital increase  United SA lowers its stake in Inventi to 0.2 percent from 16.24 percent",
        "date": "07222016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-Inventi Announces change in shareholding structure "
    },
    {
        "content": "* Shares hit record high   (Adds analyst comment  background; updates shares)",
        "date": "07192016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-Lockheed Martin raises forecast as quarterly sales beat "
    },
    {
        "content": "* United Technologies Corp - Pratt & Whitney signs deal for up to 64 engines; Split order between Purepower\u007f Geared Turbofan\u007f and V2500\u007f engines",
        "date": "07142016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies - Pratt & Whitney signs deal for up to 64 engines "
    },
    {
        "content": "* United Technologies Corp CEO Greg Hayes \"we don't need M&A to grow our business\"  - CNBC",
        "date": "07112016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies CEO Hayes says \"don't need M&A to grow our business\" - CNBC "
    },
    {
        "content": "WASHINGTON United Technologies Corp unit Pratt and Whitney has been awarded an $873.17 million cost-plus-incentive-fee contract to design  make  integrate and test turbofan adaptive aircraft engines  the Pentagon said on Thursday.",
        "date": "06302016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies unit wins $873 mln U.S. defense contract: Pentagon "
    },
    {
        "content": "WASHINGTON  June 30 United Technologies Corp  unit Pratt and Whitney has been awarded an $873.17 million cost-plus-incentive-fee contract to design  make  integrate and test turbofan adaptive aircraft engines  the Pentagon said on Thursday.   (Reporting by Eric Walsh; Editing by Eric Beech)",
        "date": "06302016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies unit wins $873 mln U.S. defense contract -Pentagon "
    },
    {
        "content": "MONTREAL Honeywell International Inc  would not rule out bidding for another major aerospace supplier  among other possible acquisition targets  after merger talks collapsed in March with rival United Technologies Corp   the company's chief executive said on Monday.",
        "date": "06132016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Honeywell won't rule out aerospace M&A targets "
    },
    {
        "content": "* Sets quarterly dividend of $0.66 per share  Source text for Eikon:  Further company coverage:",
        "date": "06082016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies sets quarterly dividend of $0.66 per share "
    },
    {
        "content": "* Reported on Tuesday that it has signed datio in solutum agreement with its debtor  NCF SA",
        "date": "06012016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United signs datio in solutum agreement with its debtor "
    },
    {
        "content": "* Sees 2016 adjusted earnings per share (eps) of $6.30 to $6.60 on sales of $56 billion to $58 billion",
        "date": "05172016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Tech affirms previously announced 2016 financial forecast "
    },
    {
        "content": "* United technologies corp files for mixed shelf offering; size not disclosed  Source (http://bit.ly/1TaL8XP) Further company coverage:",
        "date": "04292016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies files for mixed shelf offering "
    },
    {
        "content": "* New dividend represents a 3.1 percent increase over prior quarter's dividend amount  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04252016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Technologies Corp sets quarterly dividend of $0.66 per share "
    },
    {
        "content": "NEW YORK United Technologies Corp saw an uptick in equipment orders in China in the first quarter  Chief Executive Greg Hayes said in an interview on Wednesday  as the company posted results that beat analyst estimates.",
        "date": "04272016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech sees sales uptick in China; posts profit beat "
    },
    {
        "content": "* United SA acquired 6.4 million shares for 2.8 million zlotys ($745 275) in total  Source text for Eikon:  Further company coverage:   ($1 = 3.7570 zlotys)   (Gdynia Newsroom)",
        "date": "04122016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United acquired 6.4 million shares of Bioerg "
    },
    {
        "content": "WASHINGTON  April 11 United Technologies Corp  unit Pratt & Whitney Military Engines is being awarded a $1.04 billion modification to a previously awarded contract for propulsion systems for the F-35 Lightning II fighter jet  the Defense Department said on Monday.",
        "date": "04112016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UTC wins $1.04 bln Pentagon contract for F-35 Lightning II propulsion systems "
    },
    {
        "content": "ZURICH Elevator maker Schindler is selling its Japanese business to United Technologies' Otis unit after its new installations in the country were halted following a 2006 accident.",
        "date": "04052016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Schindler sells Japanese business to Otis after accident "
    },
    {
        "content": "ZURICH  April 5 Elevator maker Schindler  is selling its Japanese business to United Technologies' Otis unit after its new installations in the country were halted following a 2006 accident.",
        "date": "04052016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Schindler sells Japanese business to Otis after accident "
    },
    {
        "content": "* ERG said on Tuesday that it has negotiated the sale of 5.6 million shares of Bioerg to United SA for 2.2 million zlotys ($585 120)",
        "date": "03302016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-ERG sells 66 pct of Bioerg for 2.2 mln zlotys "
    },
    {
        "content": "* Says its parent company ERG SA signed preliminary agreement to sell 5.6 million shares of Bioerg to United SA",
        "date": "03292016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-ERG to sell 5.6 mln shares of Bioerg to United SA "
    },
    {
        "content": "WASHINGTON  March 15 Lockheed Martin Corp  has \"no regrets\" about buying Sikorsky for $9 billion even though sliding oil prices have taken a bigger bite than expected from the company's commercial helicopter sales  Chief Executive Marillyn Hewson said Tuesday.",
        "date": "03162016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-Lockheed CEO still likes Sikorsky despite slumping sales to energy sector "
    },
    {
        "content": "NEW YORK United Technologies Corp   maker of jet engines  aircraft components and building systems  said it is open to doing a large acquisition despite rejecting a merger proposed by Honeywell International Inc .",
        "date": "03112016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech looks for a big deal after rebuffing Honeywell "
    },
    {
        "content": "NEW YORK  March 10 United Technologies Corp   maker of jet engines  aircraft components and building systems  said it is open to doing a large acquisition despite rejecting a merger proposed by Honeywell International Inc .",
        "date": "03102016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UPDATE 3-United Tech looks for a big deal after rebuffing Honeywell "
    },
    {
        "content": "NEW YORK  March 10 United Technologies Corp  said on Thursday that its aerospace parts business is open to making a large acquisition as well as smaller deals that fill in its product lines.",
        "date": "03102016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies aerospace says 'we're ready for an acquisition' "
    },
    {
        "content": "* Says reaffirms 2016 outlook for adjusted eps of $6.30 to $6.60",
        "date": "03102016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United Tech reaffirms 2016 and Q1 guidance "
    },
    {
        "content": "WASHINGTON  March 7 The U.S. Air Force on Monday named Pratt & Whitney as the engine maker for the new Northrop Grumman Corp long-range strike bomber  and defended the plane's \"cost plus incentive fee\" contract that has been challenged by U.S. lawmakers.",
        "date": "03072016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-U.S. Air Force says Pratt to build engines for new bomber "
    },
    {
        "content": "BRUSSELS  March 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03032016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "EU mergers and takeovers (March 3) "
    },
    {
        "content": "March 2 Aircraft parts maker Honeywell International Inc on Wednesday reaffirmed its 2016 outlook and forecast 2017 sales above analysts' estimates  a day after it scrapped its $90.7 billion offer to buy rival United Technologies Corp.",
        "date": "03022016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Honeywell backs 2016 outlook  sees 2017 sales above estimates "
    },
    {
        "content": "Aircraft parts maker Honeywell International Inc  said Tuesday it scrapped its $90.7 billion offer to buy rival United Technologies Corp   citing the company's unwillingness to engage in negotiations.",
        "date": "03012016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech keeps to solo path as Honeywell drops bid "
    },
    {
        "content": "NEW YORK  Feb 28 Honeywell International Inc's  proposal to buy rival United Technologies Corp  would create an industrial giant bigger than aircraft makers Boeing Co or Airbus Group  potentially changing the balance of power between manufacturer and supplier.",
        "date": "02282016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "RPT-Proposed Honeywell-United Tech deal could result in greater pricing power "
    },
    {
        "content": "* United Tech shares down 2.8 pct  Honeywell up 3.2 pct   (Adds industry quotes  background  details  UTC statement  updates shares)",
        "date": "03012016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 3-United Tech keeps to solo path as Honeywell drops bid "
    },
    {
        "content": " ",
        "date": "03012016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Honeywell scraps offer to buy United Tech "
    },
    {
        "content": "NEW YORK  Feb 26 Honeywell International Inc's  proposal to buy rival United Technologies Corp  would create an industrial giant bigger than aircraft makers Boeing Co or Airbus Group  potentially changing the balance of power between manufacturer and supplier.",
        "date": "02272016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Proposed Honeywell-United Tech deal could result in greater pricing power "
    },
    {
        "content": " ",
        "date": "02262016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Honeywell says had offered to buy United Tech for $108 per share "
    },
    {
        "content": "Feb 24 Honeywell International Inc is seeking a buyer for its building solutions business  the Wall Street Journal reported  adding that the business could fetch $3 billion to $4 billion.",
        "date": "02242016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-Honeywell seeking buyer for building solutions business - WSJ "
    },
    {
        "content": "Feb 23 Honeywell International Inc  confirmed on Tuesday that it had engaged in deal talks with United Technologies Corp over the past year  and said it did not see regulatory process as a \"material obstacle\" to the deal.",
        "date": "02232016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Honeywell does not see regulatory hurdles for United Tech deal "
    },
    {
        "content": "Feb 24 Honeywell International Inc is seeking a buyer for its building solutions business  CNBC reported  citing Dow Jones.",
        "date": "02242016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Honeywell seeking buyer for building solutions business - CNBC "
    },
    {
        "content": "Feb 23 Aerospace component supplier Honeywell International Inc confirmed on Tuesday that it had engaged in deal talks with United Technologies Corp over the past year  and said it did not see regulatory process as a \"material obstacle\" to the deal.",
        "date": "02232016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Honeywell does not see regulatory hurdles for United Tech deal "
    },
    {
        "content": "* \"We do not see the regulatory process as a material obstacle to a transaction\"",
        "date": "02232016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "CORRECTED-BRIEF-Honeywell confirms that over past year in talks with United Technologies Corp over possible combination "
    },
    {
        "content": "Feb 22 Honeywell International Inc and United Technologies Corp have held talks about a merger  CNBC reported  citing people familiar with the situation.",
        "date": "02222016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Honeywell  United Technologies held merger talks - CNBC "
    },
    {
        "content": "United Technologies Corp  on Monday disclosed merger talks with fellow aerospace component supplier Honeywell International Inc  but said a deal would \"face insurmountable regulatory obstacles.\"",
        "date": "02232016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech says a deal with Honeywell would face major challenges "
    },
    {
        "content": "Feb 23 Thales CEO Patrice Caine at annual results news conference:",
        "date": "02232016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-Thales CEO says UTC-Honeywell would have posed anti-trust problems "
    },
    {
        "content": "Feb 22 United Technologies Corp on Monday disclosed merger talks with fellow aerospace component supplier Honeywell International Inc but said a deal would \"face insurmountable regulatory obstacles.\"",
        "date": "02232016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 5-United Tech says a deal with Honeywell would face major challenges "
    },
    {
        "content": "WASHINGTON Republican presidential candidate Donald Trump said he would impose taxes on Carrier air conditioning units manufactured in Mexico in light of the company's decision to move production from Indiana  a position in line with his strong opposition to international trade deals.",
        "date": "02142016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Trump would tax Carrier air conditioning units for moving to Mexico "
    },
    {
        "content": "HAMBURG Any technical problems with the engines of Airbus's  A320neo jetliner should be solved in the coming weeks  the head of engine manufacturer Pratt & Whitney  said.",
        "date": "02122016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Airbus A320neo's engine problems to be solved by April: Pratt CEO "
    },
    {
        "content": "BRUSSELS  Feb 11 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02112016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "EU mergers and takeovers (Feb 11) "
    },
    {
        "content": "United Technologies Corp  which makes Pratt & Whitney aircraft engines and Otis elevators  on Wednesday reported a 4.5 percent decline in fourth-quarter revenue  hurt by a strong dollar.",
        "date": "01272016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies quarterly revenue falls 4.5 percent "
    },
    {
        "content": "WASHINGTON Lockheed Martin Corp  on Tuesday said commercial helicopter sales for its Sikorsky Aircraft unit this year were expected to be about $375 million  half the level projected last summer  due to the sustained drop in world oil prices.",
        "date": "01262016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Oil drop dims Lockheed unit's commercial helicopter outlook "
    },
    {
        "content": "Jan 27 United Technologies Corp reported a 4.5 percent decline in quarterly revenue  hurt by a strong dollar.",
        "date": "01272016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies quarterly revenue falls 4.5 pct "
    },
    {
        "content": "WASHINGTON  Jan 26 Lockheed Martin Corp  on Tuesday announced a $5 billion tax-free deal to combine its information systems and government services business with Leidos Holdings Inc  and forecast a lower-than-expected profit in 2016.",
        "date": "01262016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-Lockheed seals services deal with Leidos  forecasts profit below view "
    },
    {
        "content": "WASHINGTON  Jan 26 Lockheed Martin Corp  on Tuesday said commercial helicopter sales for its Sikorsky Aircraft unit this year were expected to be about $375 million  half the level projected last summer  due to the sustained drop in world oil prices.",
        "date": "01262016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Oil drop dims Lockheed unit's commercial helicopter outlook "
    },
    {
        "content": "WASHINGTON  Jan 26 Lockheed Martin Corp  on Tuesday said it would combine its information systems and government services business with Leidos Holdings Inc  receiving a one-time payment of $1.8 billion and a 50.5 percent equity stake in Leidos.",
        "date": "01262016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed to get $1.8 bln from services merger with Leidos "
    },
    {
        "content": "Leidos Holdings Inc  is nearing a deal to merge with the government information technology and services businesses being shed by Lockheed Martin Corp  in a deal that could value these assets at around $5 billion  people familiar with the matter said.",
        "date": "01192016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Exclusive: Leidos nears $5 billion deal for Lockheed's IT businesses - sources "
    },
    {
        "content": "Jan 19 Leidos Holdings Inc is nearing a deal to merge with the government information technology and services businesses being shed by Lockheed Martin Corp  in a deal that could value these assets at around $5 billion  people familiar with the matter said.",
        "date": "01192016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "EXCLUSIVE-Leidos nears $5 bln deal for Lockheed's IT businesses -sources "
    },
    {
        "content": "NEW YORK  Jan 14 United Technologies Corp  on Thursday named Robert Leduc as president of its Pratt & Whitney aircraft engine division  succeeding Paul Adams  who is retiring.",
        "date": "01142016",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies names new head of Pratt & Whitney engine unit "
    },
    {
        "content": "Jan 6 United Technologies Corp said its Pratt & Whitney unit  which makes aircraft engines  recorded a pre-tax charge of about $870 million in the fourth quarter of 2015.",
        "date": "01062016",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies to record $870 mln in pre-tax charge in Q4 "
    },
    {
        "content": "United Technologies Corp  forecast a slight profit rise next year and announced a $1.5 billion restructuring plan to reduce costs  sending its shares up in extended trading.",
        "date": "12112015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies unveils $1.5 billion restructuring plan to cut costs "
    },
    {
        "content": "United Technologies Corp  raised the lower end of its full-year adjusted earnings forecast and announced a $1.5 billion restructuring plan aimed at reducing costs  mainly through factory consolidation.",
        "date": "12102015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies unveils $1.5 billion restructuring plan to cut costs "
    },
    {
        "content": "* Forecasts 2016 adjusted EPS $6.30-$6.60  revenue $56-$58 bln",
        "date": "12112015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 3-United Technologies unveils $1.5 bln restructuring plan to cut costs "
    },
    {
        "content": "* Shares up 1.4 pct in extended trading   (Adds details  analysts estimates  background)",
        "date": "12102015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-United Technologies unveils $1.5 bln restructuring plan to cut costs "
    },
    {
        "content": "DUBAI  Nov 10 Lockheed Martin Corp on Tuesday said it was in initial talks with Saudi Arabia about the sale of 20 more Sikorsky MH-60R helicopters in addition to a $1.9 billion deal for 10 helicopters that should be finalized by year's end.",
        "date": "11102015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "AIRSHOW-Lockheed in initial talks with Saudi Arabia about more helicopters "
    },
    {
        "content": "WASHINGTON Lockheed Martin Corp  said on Friday it has closed its $9 billion acquisition of Sikorsky Aircraft from United Technologies Corp .",
        "date": "11062015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Lockheed  United Technologies close Sikorsky deal "
    },
    {
        "content": "DUBAI Lockheed Martin Corp  said it does not expect any immediate layoffs as a result of its takeover of Sikorsky Aircraft from United Technologies Corp   which closed Friday.",
        "date": "11062015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed sees no immediate layoffs after Sikorsky merger "
    },
    {
        "content": "DUBAI  Nov 6 Lockheed Martin Corp said it does not expect any immediate layoffs as a result of its takeover of Sikorsky Aircraft from United Technologies Corp   which closed Friday.",
        "date": "11062015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Lockheed sees no immediate layoffs after Sikorsky merger "
    },
    {
        "content": "WASHINGTON  Nov 3 Lockheed Martin Corp  said it expects to close its $9 billion acquisition of Sikorsky Aircraft from United Technologies Corp on Friday  now that it has received final regulatory approval from China.",
        "date": "11032015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed  United Tech to close Sikorsky deal by Friday "
    },
    {
        "content": "WASHINGTON Nov 6 Lockheed Martin Corp  said on Friday it has closed its $9 billion acquisition of Sikorsky Aircraft from United Technologies Corp.",
        "date": "11062015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Lockheed  United Technologies close Sikorsky deal "
    },
    {
        "content": "DUBAI  Nov 6 Lockheed Martin Corp said it does not expect any layoffs as a result of its takeover of Sikorsky Aircraft from United Technologies Corp  which closed Friday.",
        "date": "11062015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed says does not expect any layoffs as result of takeover of Sikorsky "
    },
    {
        "content": "WASHINGTON  Nov 3 Lockheed Martin Corp  said it expects to close its $9 billion acquisition of Sikorsky Aircraft from United Technologies Corp on Friday  now that it has received final regulatory approval from China.",
        "date": "11032015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Lockheed  United Tech to close Sikorsky deal by Friday "
    },
    {
        "content": "WASHINGTON  Oct 29 Lockheed Martin Corp  on Thursday said Jeff Babione would head the company's F-35 fighter jet program  the Pentagon's single largest arms project  effective Jan. 1.",
        "date": "10292015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Lockheed promotes Babione to head F-35 fighter jet program "
    },
    {
        "content": "NEW YORK - U.S. stocks ended slightly lower on Tuesday as a decline in healthcare and biotech stocks offset gains in United Technologies and Verizon.",
        "date": "10212015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "United Technologies Corp  reported a drop in third-quarter profit that still beat analyst expectations  and its chief executive said the industrial manufacturer would announce a significant restructuring before the end of the year.",
        "date": "10202015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Technologies profit beats forecasts; buyback  restructuring planned "
    },
    {
        "content": "* Still mulling $1 billion-$5 billion acquisitions -CEO   (Adds analyst comments  further remarks on restructuring)",
        "date": "10202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 4-United Technologies profit beats forecasts; buyback  restructuring planned "
    },
    {
        "content": "Lockheed Martin Corp   the Pentagon's No. 1 weapons supplier  reported better-than-expected quarterly results on higher demand for its F-35 fighter jets  and said it expects full-year revenue at the higher end of its forecast.",
        "date": "10202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed tops third-quarter profit view on increased sales of F-35 jets "
    },
    {
        "content": "WASHINGTON  Oct 20 Lockheed Martin Corp  and United Technologies Corp on Tuesday said they expected to finalize Lockheed's acquisition of Sikorsky Aircraft by the end of the year.",
        "date": "10202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed  United Tech say close to finalizing Sikorsky deal "
    },
    {
        "content": "Oct 20 United Technologies Corp will still look at acquisitions in the $1 billion to $5 billion range  its chief executive said on Tuesday  even as the company announced a new $12 billion share buyback plan.",
        "date": "10202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UTC CEO says still has some acquisition capacity despite buyback "
    },
    {
        "content": "Oct 20 United Technologies Corp on Tuesday posted a decline in quarterly profit  hurt by foreign currency swings  and announced plans to buy back $12 billion worth of its shares.",
        "date": "10202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech profit falls as company reveals $12 bln buyback plan "
    },
    {
        "content": "WASHINGTON The U.S. government has approved the possible sale to Saudi Arabia of nine UH-60M Black Hawk helicopters built by Sikorsky Aircraft  a unit of United Technologies Corp  in a deal valued at $495 million  the Pentagon said on Wednesday.",
        "date": "10142015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "U.S. okays $495 million sale of Sikorsky helicopters to Saudi Arabia "
    },
    {
        "content": "WASHINGTON  Oct 13 The pending takeover of United Technologies Corp's Sikorsky Aircraft by Lockheed Martin Corp will not affect prototype work on an aircraft that will replace thousands of helicopters  U.S. Army acquisitions chief Heidi Shyu said on Tuesday.",
        "date": "10132015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Sikorsky takeover will not affect helicopter program -U.S. Army "
    },
    {
        "content": "WASHINGTON  Oct 14 Lockheed Martin Corp's  $9 billion purchase of Sikorsky Aircraft from United Technologies Corp could close by late October or early November  well before the initial year-end target  three sources familiar with the matter said on Wednesday.",
        "date": "10142015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed-Sikorsky deal could close by late October -sources "
    },
    {
        "content": "WASHINGTON  Oct 14 Saudi Arabia signed an agreement last week with the U.S. government for the purchase of 320 more Patriot PAC-3 missiles built by Lockheed Martin Corp   and may accelerate its plans to buy the longer-range THAAD system  a senior Lockheed official told Reuters this week.",
        "date": "10142015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Saudi Arabia signs deal for 320 PAC-3 missiles - Lockheed "
    },
    {
        "content": "WASHINGTON  Oct 14 The U.S. government has approved the possible sale to Saudi Arabia of nine UH-60M Black Hawk helicopters built by Sikorsky Aircraft  a unit of United Technologies Corp  in a deal valued at $495 million  the Pentagon said on Wednesday.",
        "date": "10142015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "U.S. okays $495 mln sale of Sikorsky helicopters to Saudi Arabia "
    },
    {
        "content": "Lockheed Martin Corp is exploring merging some of its information technology and services businesses  with a value of about $4 billion  with another government services contractor  people familiar with the matter said on Friday.",
        "date": "10022015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed Martin mulls merger of some services units with peer -sources "
    },
    {
        "content": "WASHINGTON  Sept 30 Pentagon officials warned on Wednesday against further consolidation in the U.S. weapons industry because fewer defense contractors could lead to higher costs  decreased innovation and less competition.",
        "date": "09302015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Pentagon warns against further consolidation among big arms makers "
    },
    {
        "content": "WASHINGTON  Sept 30 The Pentagon's chief arms buyer on Wednesday issued a sharp warning against further consolidation in the U.S. weapons industry  and said recent moves toward fewer defense contractors was not a positive trend.",
        "date": "09302015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Pentagon warns against further consolidation among big arms makers "
    },
    {
        "content": "* Indexes down: Dow 0.6 pct  S&P down 0.4 pct  Nasdaq 0.2 pct   (Adds details  comment  updates prices)",
        "date": "09232015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "US STOCKS-Wall St dragged down by material and industrial stocks "
    },
    {
        "content": "BEIJING China and Russia are set to sign an agreement on developing a wide-bodied airliner before the end of the year  the China Daily reported on Monday  quoting the president of Russia's state-controlled United Aircraft Corp  Yury Slyusar.",
        "date": "09212015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "China  Russia to sign jet agreement by end-2015: newspaper "
    },
    {
        "content": "BRUSSELS  Sept 24 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09242015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "EU mergers and takeovers (Sept 24) "
    },
    {
        "content": "United Technologies Corp  is unlikely to hit its traditional target of growing earnings by at least 10 percent in 2016  as it confronts challenges to its jet engine and China businesses  the U.S. conglomerate's chief executive officer said on Thursday.",
        "date": "09172015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech unlikely to grow earnings by 10 percent in 2016  CEO says "
    },
    {
        "content": "Sept 17 United Technologies Corp is unlikely to hit its traditional target of growing earnings by at least 10 percent in 2016  as it confronts challenges to its jet engine and China businesses  the U.S. conglomerate's chief executive officer said on Thursday.",
        "date": "09172015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-United Tech unlikely to grow earnings by 10 pct in 2016  CEO says "
    },
    {
        "content": "Sept 17 United Technologies Corp is unlikely to hit its traditional target of growing earnings by at least 10 percent in 2016  as it confronts challenges to its jet engine and China businesses  the U.S. conglomerate's chief executive officer said on Thursday.",
        "date": "09172015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech unlikely to grow earnings by 10 pct in 2016  CEO says "
    },
    {
        "content": "NATIONAL HARBOR  Md.  Sept 14 Pratt & Whitney  a unit of United Technologies Corp  on Monday said it is working closely with suppliers to prepare for a large ramp-up in production in coming years of the F135 engine that powers the Lockheed Martin Corp F-35 fighter jet.",
        "date": "09152015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Pratt prepping for big production increase on F-35 jet engines "
    },
    {
        "content": "Sept 8 Goldman Sachs Group Inc said on Tuesday its merchant banking division hired the former head of U.S. conglomerate United Technologies Corp  Louis Chenevert  as an exclusive adviser.",
        "date": "09082015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Goldman unit hires ex-United Tech CEO Chenevert as adviser "
    },
    {
        "content": "United Technologies Corp  said on Thursday it would operate its Otis elevator and climate controls and security divisions as stand-alone units  the latest organizational shake-up by the U.S. conglomerate under Chief Executive Greg Hayes.",
        "date": "09102015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech reorganizes elevator  building systems operations "
    },
    {
        "content": "Sept 10 United Technologies Corp said on Thursday it would operate its Otis elevator and climate controls and security divisions as stand-alone units  the latest organizational shake-up by the U.S. conglomerate under Chief Executive Greg Hayes.",
        "date": "09102015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-United Tech reorganizes elevator  building systems operations "
    },
    {
        "content": "Sept 9 Lockheed Martin Corp  the maker of F-35 fighter jets  said it would cut about 500 jobs in its IT services unit by mid-November.",
        "date": "09092015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Lockheed to cut about 500 jobs in IT services unit "
    },
    {
        "content": "Sept 10 United Technologies Corp said it is reorganizing its business by operating its Otis elevator and climate  controls and security divisions as stand-alone units.",
        "date": "09102015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech reorganizes operations  names presidents for units "
    },
    {
        "content": "WASHINGTON  Sept 9 Lockheed Martin Corp  will announce plans on Wednesday to lay off about 500 people across its information systems and government services division  which it plans to sell or spin off later this year  a person familiar with the plans said.",
        "date": "09092015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed Martin to lay off 500 in information systems  gov't services unit -source "
    },
    {
        "content": "Aug 25 United Aircraft Corporation and Rostelecom :",
        "date": "08252015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United Aircraft Corporation  Rostelecom sign agreement on development of IT-infrastructure "
    },
    {
        "content": "United Technologies Corp  is in talks to buy residential products maker Nortek Inc   the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08202015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech in talks to buy Nortek: WSJ "
    },
    {
        "content": "Aug 20 United Technologies Corp is in talks to buy residential products maker Nortek Inc  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-United Tech in talks to buy Nortek - WSJ "
    },
    {
        "content": "Aug 20 United Technologies Corp is in talks to buy residential products maker Nortek Inc  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech in talks to buy Nortek - WSJ "
    },
    {
        "content": "July 27 The executive in charge of United Technologies Corp's building systems business  Geraud Darnis  is leaving the company in the latest management change at the U.S. conglomerate.",
        "date": "07272015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech top building systems executive to depart "
    },
    {
        "content": "July 24 The U.S. Department of Justice has informed Sikorsky Aircraft that it has started a criminal investigation into allegations the helicopter maker overbilled the U.S. Navy for a contract  Sikorsky's parent company  United Technologies Corp  said on Friday.",
        "date": "07242015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UPDATE 1-U.S. DOJ starts criminal probe into Sikorsky Navy contract "
    },
    {
        "content": "NEW YORK - U.S. stocks closed lower on Tuesday as results from IBM and United Technologies dampened early optimism over earnings season and after-the-bell declines in major tech shares suggested losses would continue on Wednesday.",
        "date": "07222015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "WASHINGTON  July 22 Lockheed Martin Corp's  decision to buy helicopter maker Sikorsky Aircraft and sell $6 billion in lower-margin units marks a clear turning point for Lockheed CEO Marillyn Hewson  who is shaking up the world's largest weapons maker.",
        "date": "07222015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed Sikorsky deal marks turning point for more assertive CEO "
    },
    {
        "content": "NEW YORK  July 23 Many U.S. consumer companies are brushing aside worries that China's weakening economy and sputtering stock market will dramatically damage their bottom lines even with early trouble signs in recent earnings reports.",
        "date": "07232015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "China slowdown? Depends on where you look "
    },
    {
        "content": "WASHINGTON Lockheed Martin Corp  has agreed to buy United Technologies Corp's  Sikorsky Aircraft for over $8 billion  two sources said on Sunday  cementing a deal that would confirm Lockheed's dominance in weapons making and giving the Black Hawk helicopter to the maker of the F-35 fighter jet.",
        "date": "07192015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Exclusive: Lockheed to buy United Tech's Sikorsky for over $8 billion "
    },
    {
        "content": "WASHINGTON Lockheed Martin Corp said Monday it would buy Black Hawk maker Sikorsky Aircraft from United Technologies Corp for $9 billion  cementing Lockheed's dominance in weapons making. | Video ",
        "date": "07202015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Lockheed to buy Black Hawk maker Sikorsky for $9 billion "
    },
    {
        "content": "United Technologies Corp   which agreed on Monday to sell its Sikorsky helicopter business  cut its full-year profit outlook on Tuesday as it warned of pressures in its aerospace systems and Otis elevators businesses.",
        "date": "07212015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech cuts outlook on aerospace  elevator pressures "
    },
    {
        "content": "WASHINGTON Lockheed Martin Corp on Monday said Pentagon officials planned a detailed review of the company's bid to acquire Sikorsky Aircraft  the helicopter unit of United Technologies Corp  but it did not expect major obstacles.",
        "date": "07202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed expects positive Pentagon view on Sikorsky buy "
    },
    {
        "content": "WASHINGTON  July 20 Lockheed Martin Corp  on Monday said Pentagon officials planned a detailed review of the company's bid to acquire Sikorsky Aircraft  the helicopter unit of United Technologies Corp  but it did not expect major obstacles.",
        "date": "07202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Lockheed expects positive Pentagon view on Sikorsky buy "
    },
    {
        "content": "July 21 A day after sealing the signature move of his eight-month tenure  United Technologies Corp  Chief Executive Greg Hayes suffered his toughest day on Wall Street.",
        "date": "07212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech CEO has rough day with third profit outlook cut "
    },
    {
        "content": "WASHINGTON  July 20 Sikorsky Aircraft will face some revenues and earnings pressures for several years  but should see improved market conditions in the commercial sector and growth in new military production around late 2018 or 2019  Lockheed Martin Corp's chief financial officer said on Monday.",
        "date": "07202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed CFO sees Sikorsky turnaround around late 2018 or 2019 "
    },
    {
        "content": "July 20 Now that United Technologies Corp  Chief Executive Greg Hayes has closed a deal to sell the conglomerate's Sikorsky helicopter unit  he may become an acquirer in his own right.",
        "date": "07202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "With Sikorsky sale done  United Technologies eyes acquisitions "
    },
    {
        "content": "July 20 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "07202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "U.S. stocks closed lower on Tuesday as results from IBM and United Technologies dampened early optimism over earnings season and after-the-bell declines in major tech shares suggested losses would continue on Wednesday.",
        "date": "07212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "IBM  United Tech drag Dow; Apple results weigh on futures "
    },
    {
        "content": "WASHINGTON  July 20 Lockheed Martin Corp  said Monday it would buy Black Hawk maker Sikorsky Aircraft from United Technologies Corp for $9 billion  cementing Lockheed's dominance in weapons making.",
        "date": "07202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 4-Lockheed to buy Black Hawk maker Sikorsky for $9 bln "
    },
    {
        "content": "* Indexes down: Dow 1.00 pct  S&P 0.43 pct  Nasdaq 0.21 pct   (Updates to close  adds Microsoft and Yahoo shares)",
        "date": "07212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "US STOCKS-IBM  United Tech drag Dow; Apple results weigh on futures "
    },
    {
        "content": "* Indexes down: Dow 1.00 pct  S&P 0.43 pct  Nasdaq 0.21 pct   (Updates to close  adds Microsoft and Yahoo shares)",
        "date": "07212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "US STOCKS-IBM  United Tech drag Dow; Apple earnings on deck "
    },
    {
        "content": "WASHINGTON  July 20 Lockheed Martin Corp  on Monday said Pentagon officials planned a detailed review of the company's bid to acquire Sikorsky Aircraft  the helicopter unit of United Technologies Corp  but it did not expect major obstacles.",
        "date": "07202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed sees positive Pentagon view on Sikorsky buy "
    },
    {
        "content": "July 21 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "07212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "United Technologies Corp  is ready to \"turn up the heat on M&A\" now that the U.S. conglomerate has agreed to sell its Sikorsky helicopter business  Chief Executive Greg Hayes said in an interview on Tuesday.",
        "date": "07212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech CEO says ready to 'turn up the heat' on acquisitions "
    },
    {
        "content": "* Indexes down: Dow 1.13 pct  S&P 0.45 pct  Nasdaq 0.18 pct   (Updates to late afternoon  changes byline)",
        "date": "07212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "US STOCKS-Wall St lower as IBM  United Tech results weigh "
    },
    {
        "content": "* Polish American Investment Fund LLC has its stake in the company reduced to 6.27 percent from 10.36 percent  following the company's capital increase",
        "date": "07152015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-Polish American Investment Fund lowers stake in United to 6.27 pct "
    },
    {
        "content": "WASHINGTON  July 14 The U.S. Defense Department said on Tuesday it was \"closely monitoring\" the potential sale of helicopter maker Sikorsky Aircraft by its parent company  United Technologies Corp and that it would evaluate any deal on a case-by-case basis.",
        "date": "07142015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Pentagon says 'closely monitoring' potential Sikorsky sale "
    },
    {
        "content": "WASHINGTON  July 14 The U.S. Defense Department said on Tuesday it was \"closely monitoring\" the potential sale of helicopter maker Sikorsky Aircraft by its parent company  United Technologies Corp and that it would evaluate any deal on a case-by-case basis.",
        "date": "07142015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Pentagon says 'closely monitoring' potential Sikorsky sale "
    },
    {
        "content": "July 14 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "07142015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Lockheed Martin Corp  is the leading candidate to buy United Technologies Corp's  Sikorsky helicopter unit in a deal that could value the business at more than $8 billion  a source familiar with the situation said on Friday.",
        "date": "07102015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Lockheed in the lead to buy Sikorsky from United Tech: source "
    },
    {
        "content": "July 10 Lockheed Martin Corp is the leading candidate to buy United Technologies Corp's  Sikorsky helicopter unit in a deal that could value the business at more than $8 billion  a source familiar with the situation said on Friday.",
        "date": "07102015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Lockheed in the lead to buy Sikorsky from United Tech-source "
    },
    {
        "content": "WASHINGTON/NEW YORK Lockheed Martin Corp  and Textron Inc  have emerged as final contenders to buy United Technologies Corp's   Sikorsky Aircraft business  which could be valued at around $8 billion  according to people familiar with the matter.",
        "date": "07082015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Exclusive: Lockheed  Textron final suitors for Sikorsky Aircraft - sources "
    },
    {
        "content": "United Continental Holdings Inc  said on Thursday its pretax profit margin for the second quarter will be in the lower range of its earlier outlook and said the strong U.S. dollar has hurt demand from travelers abroad.",
        "date": "07092015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Airlines expects profit margin in lower range of outlook "
    },
    {
        "content": "WASHINGTON/NEW YORK The U.S. Department of Justice said on Wednesday it is investigating whether U.S. airlines worked together illegally to keep airfares high by signaling plans to limit flights.",
        "date": "07012015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "U.S. probing whether airlines collude to keep airfares high "
    },
    {
        "content": "July 9 As United Technologies Corp nears a decision on how it will divest its Sikorsky helicopter division  the U.S. conglomerate faces challenges to its financial outlook that may limit the lift to its stock in the near term.",
        "date": "07092015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech faces growth challenges as Sikorsky divestment nears "
    },
    {
        "content": "July 9 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Thursday:",
        "date": "07092015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "PARIS Eileen Drake  the new chief executive of Aerojet Rocketdyne Holdings Inc   on Sunday vowed to keep a \"huge focus\" on cutting overhead costs in coming years  including a 10-percent workforce reduction and possible facility closings.",
        "date": "06142015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Aerojet CEO vows to cut overhead  eyes 10 percent cut in workforce "
    },
    {
        "content": "PARIS United Technologies Corp  said on Monday it was exiting the helicopter business and would decide by the end of the third quarter whether to spin off or sell its $8 billion Sikorsky Aircraft unit  the U.S. military's largest helicopter maker.",
        "date": "06162015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech to exit Sikorsky helicopter business "
    },
    {
        "content": "PARIS United Technologies Corp  said on Monday it was exiting the helicopter business and would decide by the end of the third quarter whether to spin off or sell its $8 billion Sikorsky Aircraft unit  the U.S. military's largest helicopter maker.",
        "date": "06152015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech to exit Sikorsky helicopter business "
    },
    {
        "content": "PARIS  June 15 United Technologies Corp  said on Monday it was exiting the helicopter business and would decide by the end of the third quarter whether to spin off or sell its $8 billion Sikorsky Aircraft unit  the U.S. military's largest helicopter maker.",
        "date": "06152015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 3-United Tech to exit Sikorsky helicopter business "
    },
    {
        "content": "PARIS  June 15 Saudi Arabia is looking at a possible further order of new helicopters from Sikorsky Aircraft  a unit of United Technologies Corp  after a 10-helicopter purchase announced last month  the company said.",
        "date": "06152015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-Sikorsky says Saudi Arabia looking at bigger helicopter order "
    },
    {
        "content": "United Technologies Corp's  board of directors is scheduled to meet later this week to review options for its $8 billion Sikorsky aircraft business after receiving offers for it  people familiar with the matter said on Tuesday.",
        "date": "06092015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UTC to review Sikorsky options following offers "
    },
    {
        "content": "HERZLIYA  Israel  June 8 Airbus is \"watching with interest\" to see whether United Technologies Corp (UTC) puts its Sikorsky helicopter business up for sale  the head of Airbus' U.S. division said on Monday.",
        "date": "06082015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Airbus watching whether UTC will sell Sikorsky helicopter unit "
    },
    {
        "content": "PARIS  June 15 Saudi Arabia is looking at a possible further order of new helicopters from Sikorsky Aircraft  a unit of United Technologies Corp  after a 10-helicopter purchase announced last month  the company said.",
        "date": "06152015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Sikorsky says Saudi Arabia looking at bigger helicopter order "
    },
    {
        "content": "June 9 United Technologies Corp's board of directors is scheduled to meet later this week to review options for its $8 billion Sikorsky aircraft business after receiving offers for it  people familiar with the matter said on Tuesday.",
        "date": "06092015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UTC to review Sikorsky options following offers -sources "
    },
    {
        "content": "PARIS Bob Leduc  president of Sikorsky Aircraft  on Monday said he remained confident about the longer-term outlook for the $8 billion helicopter maker despite a sharp downturn in the commercial market and a decision by its parent  United Technologies Corp   to sell or spin off the company.",
        "date": "06152015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Sikorsky sees commercial helicopter downturn lasting 18-24 months "
    },
    {
        "content": "PARIS  June 15 Bob Leduc  president of Sikorsky Aircraft  on Monday said he remained confident about the longer-term outlook for the $8 billion helicopter maker despite a sharp downturn in the commercial market and a decision by its parent  United Technologies Corp  to sell or spin off the company.",
        "date": "06152015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "AIRSHOW-Sikorsky sees commercial helicopter downturn lasting 18-24 months "
    },
    {
        "content": "PARIS  June 15 Russia's United Aircraft Corporation wants a new wide-body aircraft it is developing with a Chinese company to be flying by 2025  as part of an ambitious project to take on Western planemakers Airbus and Boeing Co.",
        "date": "06152015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "AIRSHOW-Russia's United Aircraft Corp eyes new wide-body jet with Chinese by 2025 "
    },
    {
        "content": "June 4 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "06042015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "PARIS Russia's United Aircraft Corp said its Sukhoi unit signed a contract to deliver three additional Superjet 100 aircraft to Yakutia Airlines.",
        "date": "06152015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Sukhoi signs deal to deliver three extra Superjets to Yakutia Airlines "
    },
    {
        "content": "United Technologies Corp's finance chief said on Thursday he expects a decision on whether the conglomerate will divest its Sikorsky helicopter unit in the \"next couple of months.\"",
        "date": "06042015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UTC CFO sees decision on Sikorsky fate in 'next couple of months' "
    },
    {
        "content": "June 4 United Technologies Corp's  finance chief said on Thursday he expects a decision on whether the conglomerate will divest its Sikorsky helicopter unit in the \"next couple of months.\"",
        "date": "06042015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UTC CFO sees decision on Sikorsky fate in \"next couple of months\" "
    },
    {
        "content": "WASHINGTON Sikorsky Aircraft  a unit of United Technologies Corp  on Tuesday said it would cut 1 400 jobs and consolidate facilities  with lower oil prices sharply reducing demand for helicopters in the oil and gas sectors  and international military orders down.",
        "date": "06022015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Sikorsky Aircraft cutting jobs  consolidating facilities "
    },
    {
        "content": "WASHINGTON  June 2 Sikorsky Aircraft  a unit of United Technologies Corp  on Tuesday said it would cut 1 400 jobs and consolidate facilities  with lower oil prices sharply reducing demand for helicopters in the oil and gas sectors  and international military orders down.",
        "date": "06022015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-Sikorsky Aircraft cutting jobs  consolidating facilities "
    },
    {
        "content": "WASHINGTON  June 2 Sikorsky Aircraft said a major restructuring announced Tuesday is \"completely unrelated\" to an ongoing review by its parent company  United Technologies Corp  about strategic options for Sikorsky  including a possible spinoff.",
        "date": "06022015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Sikorsky says layoffs \"unrelated\" to United Tech's strategic review "
    },
    {
        "content": "United Technologies Corp  is in talks with potential buyers for its Sikorsky Aircraft business  according to four people familiar with the situation.",
        "date": "05202015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UTC in talks with potential buyers for its Sikorsky business: sources "
    },
    {
        "content": "May 19 United Technologies Corp is in talks with potential buyers for its Sikorsky Aircraft business  according to four people familiar with the situation.",
        "date": "05202015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UTC in talks with potential buyers for its Sikorsky business - sources "
    },
    {
        "content": "United Continental Holdings Inc  on Wednesday announced plans to lease up to 25 used aircraft from AerCap Holdings NV  one of the world's largest aircraft lessors   to reduce its dependence on smaller  50-seat jets.",
        "date": "05132015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Airlines to lease up to 25 used aircraft from AerCap Holdings "
    },
    {
        "content": "* Said on Thursday that it received an offer to sale 100 percent stakes in NCF Group SP. z o.o. and NCF SA",
        "date": "05082015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United to start negotiating sale of its two units "
    },
    {
        "content": "A plane with an engine on fire was forced to make an emergency landing on Tuesday at Philadelphia International Airport  where it landed safely  according to the airport and the U.S. Federal Aviation Administration.",
        "date": "04292015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Express flight with engine fire forced to land in Philadelphia "
    },
    {
        "content": "A slew of Dow 30 companies report results in the week: Chemicals conglomerate DuPont  industrial conglomerate United Technologies Corp  property and casualty insurer Travelers Companies Inc and wireless carrier Verizon Communications Inc on Tuesday; McDonald's Corp  AT&T Inc  Boeing Co and Coca-Cola Co on Wednesday; and diversified manufacturer 3M Co  Procter & Gamble and Microsoft Corp on Thursday. While DuPont is expected to report lower first-quarter results  Travelers Companies Inc's first-q",
        "date": "04172015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UPDATE 1-What to Watch in the Week Ahead and on Monday  April 20 "
    },
    {
        "content": "April 21 United Technologies Corp is nearing a decision on whether to spin off its Sikorsky helicopter unit as the business is struggling with its financial performance.",
        "date": "04212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Sikorsky sputters as United Tech nears decision on spinoff "
    },
    {
        "content": "* Said on Monday that on April 2 Delmont Capital LLC sold 187 118 shares of the company",
        "date": "04142015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-Delmont Capital sells shares of United "
    },
    {
        "content": "United Technologies Corp  posted a higher-than-expected  quarterly profit on Tuesday  helped by gains in its unit selling climate control and security systems for buildings  even as a stronger dollar weighed on sales.",
        "date": "04212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Strong dollar weighs on United Tech sales  but profit rises "
    },
    {
        "content": "April 21 United Technologies Corp posted a higher-than-expected  quarterly profit on Tuesday  helped by gains in its unit selling climate control and security systems for buildings  even as a stronger dollar weighed on sales.",
        "date": "04212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-Strong dollar weighs on United Tech sales  but profit rises "
    },
    {
        "content": "* Dow components Verizon  DuPont and United Tech beat estimates",
        "date": "04212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "US STOCKS-Wall St set to rise as results beat low expectations "
    },
    {
        "content": "April 21 United Technologies Corp posted higher quarterly profit on Tuesday  helped by gains in its unit selling climate control and security systems for buildings.",
        "date": "04212015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech profit rises  helped by climate-control unit "
    },
    {
        "content": "* Delmont Capital LLC decreases stake in company to 7.96 percent from 15.57 percent via sale of 477 674 shares in open market transactions  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "04132015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-Delmont Capital decreases stake in United to 7.96 pct "
    },
    {
        "content": "* Delmont Capital LLC decreased its stake in company to 15.67 pct (equal to 983 790 shares) from 29.50 pct",
        "date": "04032015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-Delmont Capital decreased its stake in United to 15.67 pct "
    },
    {
        "content": "United Technologies Corp  said it brought back Robert Leduc to be president of its Sikorsky helicopter unit  which the company is planning to spin off.",
        "date": "04022015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Robert Leduc returns to United Tech as Sikorsky president "
    },
    {
        "content": "April 3 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04032015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "PRESS DIGEST- New York Times business news - April 3 "
    },
    {
        "content": "April 6 United Technologies Corp on Monday won the reversal of a $657 million judgment imposed over decades-old claims accusing its Pratt & Whitney unit of overcharging the federal government on jet engines for the military.",
        "date": "04062015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies wins reversal of $657 mln award over engine prices "
    },
    {
        "content": "April 2 United Technologies Corp said it brought back Robert Leduc to be president of its Sikorsky helicopter unit  which the company is planning to spin off.",
        "date": "04022015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "CORRECTED-Robert Leduc returns to United Tech as Sikorsky president "
    },
    {
        "content": "United Technologies Corp on Monday won the reversal of a $657 million judgment imposed over decades-old claims accusing its Pratt & Whitney unit of overcharging the federal government on jet engines for the military.",
        "date": "04062015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies wins reversal of $657 million award over engine prices "
    },
    {
        "content": "MOSCOW  March 27 Russian state-controlled United Aircraft Corporation will get a capital boost of 100 billion roubles ($1.75 billion) from state revenues  TASS news agency quoted Russia's President Vladimir Putin as saying on Friday.",
        "date": "03272015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Russia's United Aircraft Corporation to get capital boost from state- TASS "
    },
    {
        "content": "* Said on Thursday that following decision on the reorganization of the company's capital group  buys 100 pct stake (100 000 shares) in NCF SA from its unit NCF Group Sp. z o.o. for 100 000 zlotys ($26 650)",
        "date": "03272015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United reorganizes its capital group  plans to spin-off NCF SA "
    },
    {
        "content": "* Przemys\u007faw Marczak increases stake in the company to 8.39 percent from 3.54 percent via purchase of 304 676 shares  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "03192015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-Marczak increases stake in United to 8.39 pct "
    },
    {
        "content": "* Said on Tuesday that its management board resolved to raise company's capital by 8.2 million zlotys ($2.1 million)  to 20.7 million zlotys via issue of 4 082 625 series H shares",
        "date": "03182015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United to issue 4 082 625 series H shares "
    },
    {
        "content": "NEW YORK United Technologies Corp's  chief executive officer said on Thursday that a sale of its Sikorsky helicopter unit would be \"very hard\" due to the heavy tax liability that would come with such a disposition.",
        "date": "03132015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech CEO: Sale of Sikorsky would be hard due to taxes "
    },
    {
        "content": "WASHINGTON  March 12 A spinoff of United Technologies Corp's Sikorsky Aircraft as a standalone company should not have any impact on the U.S. Defense Department's costs  the Pentagon's acquisition chief said Thursday.",
        "date": "03132015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "U.S. arms buyer sees no cost impact from possible Sikorsky spin "
    },
    {
        "content": "NEW YORK  March 12 United Technologies Corp's  chief executive officer said on Thursday that a sale of its Sikorsky helicopter unit would be \"very hard\" due to the heavy tax liability that would come with such a disposition.",
        "date": "03122015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech CEO: Sale of Sikorsky would be hard due to taxes "
    },
    {
        "content": "March 11 United Technologies Corp will explore strategic options to split off its Sikorsky helicopter unit  including a potential spinoff into a standalone company  the U.S. manufacturer said.",
        "date": "03112015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UTC to weigh split off of Sikorsky helicopter unit "
    },
    {
        "content": "NEW YORK  March 12 United Technologies Corp's  chief executive officer said on Thursday that a sale of its Sikorsky helicopter unit would be \"very hard\" due to the heavy tax liability that would come with such a disposition.",
        "date": "03122015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-United Tech CEO: Sale of Sikorsky would be hard due to taxes "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  Discount retailer Dollar General Corp reports fourth-quarter results. The company recently lost out on its bid for Family Dollar to smaller rival Dollar Tree. Analysts expect Dollar General to make smaller acquisitions and accelerate its store roll",
        "date": "03112015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "What to Watch in the Day Ahead - Thursday  March 12 "
    },
    {
        "content": "NEW YORK  March 12 Oil and gas customers of helicopter company Sikorsky have passed on options for aircraft amid the sharp slide in oil prices  the president of the United Technologies Corp unit said on Thursday.",
        "date": "03122015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Sikorsky sees oil customers pass on options amid price slide "
    },
    {
        "content": "NEW YORK United Technologies Corp's  chief executive officer said on Thursday that the company will spend $1 billion on acquisitions this year  \"maybe a little bit more \" even as he eyes bigger targets.",
        "date": "03122015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies CEO sees $1 billion in acquisitions in 2015 "
    },
    {
        "content": "NEW YORK  March 12 United Technologies Corp's  chief executive officer said on Thursday that the company will spend $1 billion on acquisitions this year  \"maybe a little bit more \" even as he eyes bigger targets.",
        "date": "03122015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-United Technologies CEO sees $1 bln in acquisitions in 2015 "
    },
    {
        "content": "NEW YORK  March 12 United Technologies Corp's  chief executive officer said on Thursday that the company will spend $1 billion on acquisitions this year  \"maybe a little bit more.\"",
        "date": "03122015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Technologies CEO sees $1 bln in acquisitions in 2015 "
    },
    {
        "content": "United Technologies Corp  will explore spinning off its Sikorsky helicopter unit  in the first major move by the company's new chief executive officer to overhaul the U.S. conglomerate's portfolio of businesses.",
        "date": "03122015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UTC to weigh splitting off of Sikorsky helicopter unit "
    },
    {
        "content": "March 11 United Technologies Corp will explore spinning off its Sikorsky helicopter unit  in the first major move by the company's new chief executive officer to overhaul the U.S. conglomerate's portfolio of businesses.",
        "date": "03122015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-UTC to weigh splitting off of Sikorsky helicopter unit "
    },
    {
        "content": "WASHINGTON  March 2 United Technologies Corp's  Sikorsky Aircraft said on Monday it was in discussions with the U.S. Army about servicing its UH-60 Black Hawk helicopters under a performance-based logistics agreement  and could reach a contract deal in 2016.",
        "date": "03022015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UPDATE 1-Sikorsky in talks with U.S. Army about Black Hawk maintenance "
    },
    {
        "content": "* The Warsaw Stock Exchange (WSE) suspends trading of the company's shares to March 12 from Feb. 27 due to the share consolidation process   Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "02242015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-WSE suspends trading of United's shares to March 12 "
    },
    {
        "content": "LONDON/PARIS  Feb 23 Signs of a long-awaited recovery in Europe are starting to show through in the profits of leading global companies  even if their bosses are still giving most of the credit to strong demand in Asia or the United States.",
        "date": "02232015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Below the radar  growth in Europe starts swelling company profits "
    },
    {
        "content": "ABU DHABI  Feb 25 Sikorsky Aircraft Corp  a unit of United Technologies Corp  expects to sell around 400 helicopters in the Middle East over the next five to ten years  roughly as many as it has delivered to the region to date  its regional head said on Wednesday.",
        "date": "02252015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Sikorsky eyes sale of 400 helicopters in Mideast over 5-10 yrs -exec "
    },
    {
        "content": "BENGALURU  India  Feb 19 Sikorsky Aircraft Corp  a unit of United Technologies Corp  is keen to sell VVIP transport helicopters to the Indian government  a company executive told Reuters.",
        "date": "02192015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "AIRSHOW-Sikorsky willing to supply VVIP helicopters to India "
    },
    {
        "content": "* Applied to the Warsaw Stock Exchange (WSE) for suspension of trading of its shares due to consolidation between Feb. 27 and March. 12  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "02202015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United applied to WSE for shares trading suspension between Feb 27 and March 12 "
    },
    {
        "content": "BENGALURU  Feb 19 Russia could assemble the Sukhoi Superjet regional jet in India to take advantage of lower production costs  the president of the plane's maker United Aircraft Co (UAC) said on Thursday.",
        "date": "02192015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "AIRSHOW-Russia considers Superjet production in India "
    },
    {
        "content": "WASHINGTON  Feb 13 GenCorp Inc Chief Executive Officer Scott Seymour on Friday took over as head of the company's Aerojet Rocketdyne unit after the abrupt departure of its president  Warren Boley.",
        "date": "02142015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 3-GenCorp CEO to head Aerojet Rocketdyne after Boley departure "
    },
    {
        "content": "United Technologies Corp's  chief executive officer said on Wednesday that he was interested in international deals that would use the company's \"trapped cash\" overseas  as the U.S. conglomerate focuses on exploring acquisition opportunities of at least $5 billion.",
        "date": "02182015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech CEO eyes acquisitions internationally  at least $5 billion "
    },
    {
        "content": "Feb 18 United Technologies Corp's chief executive officer said on Wednesday that he was interested in international deals that would use the company's \"trapped cash\" overseas  as the U.S. conglomerate focuses on exploring acquisition opportunities of at least $5 billion.",
        "date": "02182015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 1-United Tech CEO eyes acquisitions internationally  at least $5 bln "
    },
    {
        "content": "Feb 18 United Technologies Corp's chief executive said on Wednesday that he would \"love to do\" an international deal to use the company's \"trapped cash\" overseas  as the U.S. conglomerate focuses on exploring larger acquisition opportunities.",
        "date": "02182015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech CEO says seeks international deal to use \"trapped cash\" "
    },
    {
        "content": "WASHINGTON  Feb 12 Pratt & Whitney  a unit of United Technologies Corp  on Thursday named Mark Buongiorno to run the F135 military jet engine program  replacing Chris Flynn  who will move to a newly created position overseeing quality for the entire company.",
        "date": "02132015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Pratt & Whitney names new head of F135 engine program "
    },
    {
        "content": "WASHINGTON  Feb 13 GenCorp Inc on Friday said Warren Boley has left his position as president of the company's Aerojet Rocketdyne unit  and Scott Seymour would assume that role while continuing to serve as chief executive and president of the parent company.",
        "date": "02132015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-GenCorp CEO to head Aerojet Rocketdyne after Boley departure "
    },
    {
        "content": "WASHINGTON  Feb 5 Sikorsky Aircraft  a unit of United Technologies Corp  is seeing a big spike in demand for its UH-60 Black Hawk helicopters from Eastern Europe  a top company executive said on Thursday.",
        "date": "02052015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "Sikorsky sees spike in helicopter demand from Eastern Europe "
    },
    {
        "content": "United Technologies Corp could see savings of as much as $75 million this year from lower prices for oil and other commodities  although it may have to cede some of those benefits  to customers  its finance chief said on Wednesday.",
        "date": "02042015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech may see $75 million cost benefit from lower commod prices - CFO "
    },
    {
        "content": "Feb 4 United Technologies Corp could see savings of as much as $75 million this year from lower prices for oil and other commodities  although it may have to cede some of those benefits  to customers  its finance chief said on Wednesday.",
        "date": "02042015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-United Tech may see $75 mln cost benefit from lower commod prices-CFO "
    },
    {
        "content": "Feb 4 United Technologies Corp could see savings of as much as $75 million this year from lower prices for oil and other commodities  although it may have to cede some of those benefits  to customers  its finance chief said on Wednesday.",
        "date": "02042015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech sees possible cost benefit from low commodity prices "
    },
    {
        "content": "WASHINGTON  Feb 5 The Pentagon's plans to fund 50 percent more F-35 fighter jets in fiscal 2016 will help drive down the price of the new plane and its engine  a top official at engine maker Pratt & Whitney  a unit of United Technologies Corp  said on Thursday.",
        "date": "02062015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "UPDATE 1-Pratt says growth in F-35 production will help cut costs "
    },
    {
        "content": "* Said on Tuesday that its estimated FY 2014 revenue is over 19 million zlotys ($5.2 million)  up 70 pct year on year",
        "date": "02042015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "BRIEF-United FY 2014 revenue up 70 pct yoy "
    },
    {
        "content": "WASHINGTON  Feb 5 The Pentagon's plans to fund 50 percent more F-35 fighter jets in fiscal 2016 will help drive down the price of the new plane and its engine  a top official with enginemaker Pratt & Whitney  a unit of United Technologies Corp  said Thursday.",
        "date": "02062015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "Pratt says growth in F-35 production will help cut costs "
    },
    {
        "content": "United Technologies Corp  on Monday cut its full-year outlook because of the negative impact of a stronger dollar even as the U.S. conglomerate reported higher quarterly earnings on a rise in profit at its aerospace businesses.",
        "date": "01262015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech cuts 2015 forecasts on currency worries "
    },
    {
        "content": "Jan 26 United Technologies Corp on Monday cut its full-year outlook because of the negative impact of a stronger dollar even as the U.S. conglomerate reported higher quarterly earnings on a rise in profit at its aerospace businesses.",
        "date": "01262015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "UPDATE 2-United Tech cuts 2015 forecasts on currency worries "
    },
    {
        "content": "Jan 26 United Technologies Corp said on Monday that quarterly earnings edged up  helped by higher profit at its aerospace businesses  but the U.S. conglomerate cut its full-year outlook because of a negative impact of the stronger dollar.",
        "date": "01262015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech profit rises  but cuts 2015 view on currency worries "
    },
    {
        "content": "Jan 20 United Technologies Corp said on Tuesday that the former head of its Pratt & Whitney jet engine division was returning in a new senior aerospace post  as the company's new chief executive  Greg Hayes  shapes his management team.",
        "date": "01202015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "CORRECTED (OFFICIAL)-United Tech brings back ex-Pratt chief as aerospace executive "
    },
    {
        "content": "A top aerospace executive at United Technologies Corp is leaving in the latest management change at the U.S. conglomerate.",
        "date": "01152015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "United Tech aerospace executive leaving in wake of CEO change "
    },
    {
        "content": "Jan 15 A top aerospace executive at United Technologies Corp is leaving in the latest management change at the U.S. conglomerate.",
        "date": "01152015",
        "name": "United Technologies Corporation",
        "news_type": "normal",
        "symbol": "UTX",
        "title": "United Tech aerospace exec leaving in wake of CEO change "
    },
    {
        "content": "* Said on Wednesday that Delmont Capital LLC bought 31.85 stake (or 39 997 881 shares) in the company",
        "date": "01082015",
        "name": "United Technologies Corporation",
        "news_type": "topStory",
        "symbol": "UTX",
        "title": "BRIEF-United announces changes in its shareholding structure "
    }
]