[
    {
        "content": "* Temasek Holdings (Private) Ltd ups share stake in Mastercard to 923 068 class a shares from 267 006 class a shares",
        "date": "11142017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Temasek Holdings (Private) Ltd ups share stake in Mastercard  Visa and Monsanto "
    },
    {
        "content": "* Visa introduces new payment wearables for fans attending the Olympic Winter Games Pyeongchang 2018 Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa introduces payment wearables for Olympic Winter Games Pyeongchang 2018 "
    },
    {
        "content": "* Facebook joins the Visa digital enablement program Source text for Eikon: Further company coverage:",
        "date": "10242017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Facebook joins the Visa digital enablement program "
    },
    {
        "content": "Visa Inc  beat Wall Street's quarterly profit expectations on Wednesday helped by more people using its world-wide network to pay for everything from groceries to Uber rides  sending its shares to a record.",
        "date": "10252017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa's profit beats on higher card swipes  stock at record "
    },
    {
        "content": "* Shares hit record  rise as much as 2 pct (Adds analyst quote  shares  background)",
        "date": "10252017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 3-Visa's profit beats on higher card swipes  stock at record "
    },
    {
        "content": "* Qtrly ‍​net operating revenues of $4.9 billion  an increase of 14%",
        "date": "10252017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa Inc reports ‍​qtrly GAAP share of $0.90 "
    },
    {
        "content": "* Visa Inc declares quarterly dividend  increases dividend rate by 18%  and announces record date for the 2018 annual meeting of stockholders",
        "date": "10182017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa Inc declares quarterly dividend  increases dividend rate by 18 pct "
    },
    {
        "content": "Oct 19 Sharp growth in mobile payments led PayPal Holdings Inc to report a better-than-expected third-quarter profit on Thursday and lift its guidance for earnings through the rest of the year.",
        "date": "10192017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 3-PayPal tops profit estimates  lifts target on mobile payments growth "
    },
    {
        "content": "Oct 25 Visa Inc  the world's largest payments network operator  reported an 11 percent increase in fourth-quarter profit on Wednesday  driven higher by its purchase of Visa Europe  and as more people made payments using its network.",
        "date": "10252017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa quarterly profit rises 11 percent "
    },
    {
        "content": "* Announced partnership with Billtrust to help streamline reconciliation of B2B payments and increase automation of virtual card payments",
        "date": "10172017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa and Billtrust partner to simplify B2B virtual card acceptance "
    },
    {
        "content": " (This October 8 story has been corrected to show survey was published on Monday  not Friday)",
        "date": "10092017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UK consumer spending spikes up in September  but trend gloomy: Visa "
    },
    {
        "content": "NEW YORK  Oct 2 American Express Co has won the dismissal of a lawsuit accusing the credit card services company of defrauding shareholders about the loss in 2015 of a lucrative co-branding relationship with Costco Wholesale Corp .",
        "date": "10022017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "American Express wins dismissal of lawsuit over lost Costco contract "
    },
    {
        "content": "* Vantiv Inc - Vantiv and Visa launch new small business merchant settlement service  fastaccess funding​ Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Vantiv and Visa launch new small business merchant settlement service  fastaccess funding​ "
    },
    {
        "content": "* Visa Inc - on Sept 11  co called for redemption all of $1.75 billion principal amount outstanding of its 1.200 pct notes due 2017‍​ - SEC filing",
        "date": "09112017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa calls for redemption all of its 1.200 pct notes due 2017 "
    },
    {
        "content": "* Visa Inc says files for three-part senior notes offering of up to $2.5 billion - SEC filing‍​",
        "date": "09082017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa Inc files for three-part senior notes offering of up to $2.5 bln "
    },
    {
        "content": "* Visa Inc files prospectus supplement for potential three-part senior notes offering; size not disclosed - sec filing‍​ Source text (http://bit.ly/2vLDrIe) Further company coverage:",
        "date": "09062017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa Inc files prospectus supplement for potential three-part senior notes offering "
    },
    {
        "content": "Visa Inc  the world's largest payments processor  on Thursday named former Bank of England (BoE) deputy governor Charlotte Hogg as chief executive of its Europe division.",
        "date": "09072017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Former BoE deputy Hogg to join Visa as Europe unit CEO "
    },
    {
        "content": "Sept 7 Visa Inc  the world's largest payments processor  on Thursday named former Bank of England (BoE) deputy governor Charlotte Hogg as chief executive of its Europe division.",
        "date": "09072017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "CORRECTED-UPDATE 1-MOVES-Former BoE deputy Hogg to join Visa as Europe unit CEO "
    },
    {
        "content": "Sept 7 Visa Inc  the world's largest payments processor  on Thursday named Charlotte Hogg as chief executive of its Europe division.",
        "date": "09072017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "MOVES-Visa names ex-BoE deputy Charlotte Hogg as Europe unit CEO "
    },
    {
        "content": "* Visa Inc appoints Charlotte Hogg as chief executive officer of the compan's European operations",
        "date": "09072017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa appoints Charlotte Hogg as CEO of European operations "
    },
    {
        "content": "* Visa inc- ‍enabling visa payments on fitbit's smartwatch fitbit ionic​",
        "date": "08282017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa enables on the go payments with the new Fitbit Ionic "
    },
    {
        "content": "* Bridg raises $11 million in Series B funding from Morpheus Ventures  March Capital  Visa and NextEquity",
        "date": "08232017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Bridg raises $11 million in Series B funding "
    },
    {
        "content": "Aug 7 U.S. financial technology provider Fiserv made an improved offer for Monitise worth about 75 million pounds ($98 million) on Monday  hoping to secure backing from the British financial services technology group's investors.",
        "date": "08072017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Fintech firm Fiserv raises offer for Monitise to $98 mln "
    },
    {
        "content": "LONDON British consumer spending fell for the third month in a row in July in its longest losing streak in over four years  according to data released on Monday  in another sign that the impact of last year's Brexit vote is rippling through to households.",
        "date": "08062017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UK consumer spending sees longest decline since 2013: Visa "
    },
    {
        "content": "BRUSSELS  Aug 3 The European Commission said on Thursday it had sent a charge sheet to credit card group Visa over the fees merchants have to pay when customers from outside the bloc make purchases in the European Union.",
        "date": "08032017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "EU sends charge sheet to Visa over inter-regional fees "
    },
    {
        "content": "BRUSSELS  Aug 3 The European Commission said on Thursday it had sent a charge sheet to credit card group Visa over the fees merchants have to pay when customers from outside the bloc make purchases in the European Union.",
        "date": "08032017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-EU sends charge sheet to Visa over inter-regional fees "
    },
    {
        "content": "* Visa and marqeta form global partnership to drive new commercial and consumer payments experiences Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa and Marqeta form global partnership "
    },
    {
        "content": "** Shares of Visa  world's largest payments network operator  up as much as 0.6 pct at record high of $98.17",
        "date": "07192017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BUZZ-Payment processors rise after UK's halt on card fees "
    },
    {
        "content": "Visa Inc   the world's largest payments network operator  on Thursday reported a better-than-expected quarterly profit and raised its annual earnings forecast  as more people across the United States and Europe used its payments network.",
        "date": "07202017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa beats profit estimates  lifts earnings forecast "
    },
    {
        "content": "* Visa Inc - Board of directors declared a quarterly cash dividend of $0.165 per share of class a common stock payable on September 5  2017 Source text for Eikon: Further company coverage:",
        "date": "07182017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa declares quarterly dividend "
    },
    {
        "content": "July 20 Visa Inc  the world's largest payments network operator  on Thursday reported a better-than-expected quarterly profit and raised its annual earnings forecast  as more people across the United States and Europe used its payments network.",
        "date": "07202017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Visa beats profit estimates  lifts earnings forecast "
    },
    {
        "content": "July 20 Payments processor Visa Inc's quarterly revenue jumped nearly 26 percent as more people made payments using its network.",
        "date": "07202017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa's revenue surges 26 pct "
    },
    {
        "content": "* Q3 earnings per share view $0.81 -- Thomson Reuters I/B/E/S",
        "date": "07202017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa reports Q3 GAAP earnings per share $0.86 "
    },
    {
        "content": "Bank of New York Mellon Corp  said on Monday former Visa Chief Executive Charles Scharf will take the top job at the world's largest custody bank  where he will focus on boosting organic growth.",
        "date": "07182017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BNY Mellon names former Visa CEO to top job "
    },
    {
        "content": "* Visa and PayPal have agreed to extend participation in Visa digital enablement program (VDEP) in Europe",
        "date": "07182017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa and PayPal extend partnership to Europe "
    },
    {
        "content": "* Visa and YellowPepper Partner to accelerate new payment solutions in Latin America and the Caribbean Source text for Eikon: Further company coverage:",
        "date": "07142017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa  YellowPepper Partner to accelerate new payment solutions "
    },
    {
        "content": "July 17 Bank of New York Mellon Corp said on Monday former Visa Chief Executive Charles Scharf will take the top job at the world's largest custody bank  where he will focus on boosting organic growth.",
        "date": "07172017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UPDATE 4-BNY Mellon names former Visa CEO to top job "
    },
    {
        "content": "July 17 Bank of New York Mellon Corp named Visa Inc's former chief executive Charles Scharf as its CEO  effective immediately.",
        "date": "07172017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BNY Mellon names ex-head of Visa as CEO "
    },
    {
        "content": "Visa  and Mastercard  are both seen as suitors for Danish card payment services company Nets A/S   which confirmed over the weekend it had been approached by potential buyers.",
        "date": "07032017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa and Mastercard potential suitors for Denmark's Nets: analysts "
    },
    {
        "content": "July 3 Visa and Mastercard are both seen as suitors for Danish card payment services company Nets A/S  which confirmed over the weekend it had been approached by potential buyers.",
        "date": "07032017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa and Mastercard potential suitors for Denmark's Nets - analysts "
    },
    {
        "content": "* Visa Inc - announced availability of Visa checkout with Air Canada  Canada's largest airline Source text for Eikon: Further company coverage:",
        "date": "07062017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa reports availability of Visa checkout with Air Canada "
    },
    {
        "content": "* Visa commits to strategic investment in Klarna; companies plan partnership deal",
        "date": "06272017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa commits to strategic investment in Klarna "
    },
    {
        "content": "LONDON British consumers cut their spending for the first time in nearly four years last month  figures from credit card firm Visa showed  as households turned more cautious even before last week's shock election result.",
        "date": "06122017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UK consumer spending falls for first time in nearly 4 years: Visa "
    },
    {
        "content": "* Visa Inc - ‍Visa expands global network of providers to drive acceleration into iot payments​",
        "date": "06072017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa expands global network of providers to drive acceleration into IOT payments​ "
    },
    {
        "content": "* Soros Fund Management takes share stake of 29 600 shares in Twitter Inc - sec filing",
        "date": "05152017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Soros Fund Management takes share stake in Twitter  Visa Inc "
    },
    {
        "content": "April 27 Apple Inc has held talks with payments industry partners about launching a money-transfer service  technology news website Recode reported on Thursday.",
        "date": "04272017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UPDATE 1-Apple in talks to launch money-transfer service - Recode "
    },
    {
        "content": "April 21 Visa Inc said on Friday it was being investigated on rules related to acceptance of its debit cards  cardholder verification methods and routing of debit transactions.",
        "date": "04212017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Ohio investigates Visa's debit card transactions "
    },
    {
        "content": "Visa Inc  on Thursday reported better-than-expected quarterly earnings and said it expects full-year profit at the high end of its forecast  as it benefits from the purchase of Visa Europe and big credit-card portfolio wins back home.",
        "date": "04202017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa's profit boosted by Europe unit  big card portfolio wins "
    },
    {
        "content": "* Visa Inc- board declared a quarterly cash dividend of $0.165 per share of class a common stock Source text for Eikon: Further company coverage:",
        "date": "04182017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa board declars quarterly cash dividend of $0.165 per share "
    },
    {
        "content": "April 20Visa Inc on Thursday reported better-than-expected quarterly earnings and said it expects full-year profit at the high end of its forecast  as it benefits from the purchase of Visa Europe and big credit-card portfolio wins back home.",
        "date": "04202017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Visa's profit boosted by Europe unit  big card portfolio wins "
    },
    {
        "content": "* Visa Inc. Reports strong fiscal second quarter 2017 results and announces new $5.0 billion share repurchase program",
        "date": "04202017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa Q2 adjusted EPS $0.86 excluding items "
    },
    {
        "content": "* Visa Inc appoints John F. Lundgren to its board of directors",
        "date": "04182017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa appoints John Lundgren to its board "
    },
    {
        "content": "April 20Visa Inc  the world's largest payments network operator  reported a 27 percent increase in quarterly adjusted profit on Thursday  as more people used its payments network.",
        "date": "04202017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa's adjusted profit jumps 27 pct "
    },
    {
        "content": "* Visa launches enhanced transaction data for Amazon business customers in the U.S. Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa launches enhanced transaction data for Amazon business customers in the U.S. "
    },
    {
        "content": "LONDON British consumer spending increased at the slowest annual pace in more than three years in the first three months of 2017  in a further sign that one of the economy's main engines is losing steam as Brexit preparations begin  a survey showed on Monday.",
        "date": "04092017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UK consumer spending grows at slowest rate in three years: Visa "
    },
    {
        "content": "* PayPal and Visa extend partnership to accelerate adoption of digital and mobile payments across Asia Pacific",
        "date": "04042017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-PayPal and Visa extend partnership to accelerate adoption of digital and mobile payments across Asia Pacific "
    },
    {
        "content": "* Visa and Viewpost to accelerate electronic bill payments for U.S. Businesses",
        "date": "03282017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa and Viewpost to accelerate electronic bill payments for U.S. Businesses "
    },
    {
        "content": "WASHINGTON  March 27 The U.S. Supreme Court on Monday declined to hear a bid by retailers to revive a $7.25 billion antitrust settlement they reached with Visa Inc and Mastercard Inc over claims the card networks improperly fixed credit and debit card fees.",
        "date": "03272017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-U.S. top court rejects bid to revive $7.25 billion credit card settlement "
    },
    {
        "content": "NEW YORK  March 30U.S. blockchain startup Chain Inc has teamed with security firm Thales Group to make it easier for large companies that use blockchain technology to safely store their security credentials  the two companies said on Thursday.",
        "date": "03302017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Blockchain startup Chain teams with Thales to bolster security "
    },
    {
        "content": "March 2 Warehouse club retailer Costco Wholesale Corp reported lower-than-expected quarterly comparable-store sales and profit as big grocery chains competed fiercely to attract customers with lower prices.",
        "date": "03022017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Costco's same-store sales  profit miss estimates "
    },
    {
        "content": "* Temasek Holdings (Private) LTD takes share stake of 128 970shares in amazon com inc - sec filing",
        "date": "02142017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Temasek Holdings (Private) LTD takes share stake in Amazon  Mastercard and Visa "
    },
    {
        "content": "* Visa Inc - Board of directors  on January 31  2017  declared a quarterly cash dividend of $0.165 per share of class a common stock  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa declares quarterly dividend "
    },
    {
        "content": "Visa Inc   the world's largest payments network operator  reported better-than-expected quarterly profit and revenue as more people made payments using its network.",
        "date": "02022017",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa's profit  revenue tops estimates on payment volume growth "
    },
    {
        "content": "Feb 2 Visa Inc  the world's largest payments network operator  reported better-than-expected quarterly profit and revenue as more people made payments using its network.",
        "date": "02022017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Visa's profit  revenue tops estimates on payment volume growth "
    },
    {
        "content": "Feb 2 Visa Inc  the world's largest payments network operator  reported a 6.6 percent rise in first-quarter profit due to higher payment volumes growth.",
        "date": "02022017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa's quarterly profit rises 6.6 pct "
    },
    {
        "content": "* Sees full-year 2017 annual diluted class a common stock earnings per share growth: low 30s on a gaap nominal dollar basis",
        "date": "02022017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa reports Q1 EPS $0.86 "
    },
    {
        "content": "* Mead Johnson Nutrition jumps  in talks with Reckitt Benckiser",
        "date": "02022017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St stalls as market  Trump priorities diverge "
    },
    {
        "content": "* Indexes down: Dow 0.16 pct  S&P 0.09 pct  Nasdaq 0.18 pct   (Updates to early afternoon)",
        "date": "02022017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St slips as investors digest Trump's trade comments "
    },
    {
        "content": "* Indexes up: Dow 0.11 pct  S&P 0.13 pct  Nasdaq 0.17 pct   (Adds details  comments; updates prices)",
        "date": "02022017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St edges up on gains in consumer stocks "
    },
    {
        "content": "* Indexes down: Dow 0.18 pct  S&P 0.30 pct  Nasdaq 0.46 pct   (Updates to open)",
        "date": "02022017",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St lower as Fed uncertainty weighs on bank stocks "
    },
    {
        "content": "* Visa Inc - modifications and clarifications follow new guidance recently issued from federal reserve and address a federal trade commission inquiry",
        "date": "11222016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa modifies policies on debit routing "
    },
    {
        "content": "BRUSSELS The European Union's planned rules to reduce fraud by forcing the use of passwords or codes to authenticate electronic payments above 10 euros ($10.60) risk disrupting online shopping and may not increase security  Visa said on Tuesday.",
        "date": "11212016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "EU rules to stem payment fraud may disrupt six billion euros of e-commerce: Visa "
    },
    {
        "content": "I doubt that when history books survey the shocking events of November 2016  they will spare many words for the U.S. Supreme Court’s announcement late Thursday that it had dismissed a pair of cases involving credit card networks and ATM fees ranks. But for lawyers in the elite ranks of the Supreme Court bar  the justices’ order – which said that Visa  MasterCard and bank members of credit card networks had changed their argument after persuading the court to take their case -- create",
        "date": "11192016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "SCOTUS dismissal of ATM fees case: Visa  MasterCard swung for a home run  called out on strikes "
    },
    {
        "content": "BRUSSELS  Nov 22 The European Union's planned rules to reduce fraud by forcing the use of passwords or codes to authenticate electronic payments above 10 euros ($10.60) risk disrupting online shopping and may not increase security  Visa said on Tuesday.",
        "date": "11212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "EU rules to stem payment fraud may disrupt 6 bln euros of e-commerce - Visa "
    },
    {
        "content": "WASHINGTON  Nov 17 The U.S. Supreme Court on Thursday gave the green light to class action lawsuits by consumers accusing Visa Inc  Mastercard Inc and several U.S. banks of conspiring to inflate the prices of ATM access fees in violation of antitrust law.",
        "date": "11172016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "U.S. Supreme Court allows ATM fees lawsuits to proceed "
    },
    {
        "content": "WASHINGTON  Nov 17 The U.S. Supreme Court on Thursday gave the green light to class action lawsuits by consumers accusing Visa Inc  Mastercard Inc and several U.S. banks of conspiring to inflate the prices of ATM access fees in violation of antitrust law.",
        "date": "11172016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-U.S. Supreme Court allows ATM fees lawsuits to proceed "
    },
    {
        "content": "* Tiger Global Management LLC takes 599 800 class A share stake in Visa Inc - SEC filing",
        "date": "11142016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Tiger Global Management takes class A share stake in Visa - SEC filing "
    },
    {
        "content": "* Shares disposal is expected to have a positive material effect on the earnings for the financial year ending dec 31",
        "date": "11162016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Malayan Banking Bhd says Maybank disposed 1.12 mln class A common shares held in Visa Inc "
    },
    {
        "content": "NEW YORK Dan Loeb's Third Point hedge fund took a new share stake in Apple Inc  Visa Inc and Dell Technologies Inc during the third quarter  according to regulatory filings late on Thursday.",
        "date": "11102016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Loeb's Third Point takes share stake in Apple  Visa and Dell "
    },
    {
        "content": "NEW YORK  Nov 10 Dan Loeb's Third Point hedge fund took a new share stake in Apple Inc  Visa Inc  and Dell Technologies Inc during the third quarter  according to regulatory filings late on Thursday.",
        "date": "11102016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "CORRECTED-Loeb's Third Point takes share stake in Apple  Visa and Dell "
    },
    {
        "content": "NEW YORK  Nov 10 Dan Loeb's Third Point hedge fund took new share stakes in Apple Inc  Visa Inc  and Dell Technologies Inc during the third quarter  according to regulatory filings late on Thursday.",
        "date": "11102016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Loeb's Third Point takes share stakes in Apple  Visa and Dell "
    },
    {
        "content": "* Takes 2.3 mln shares stake in Dell Technologies - SEC filing",
        "date": "11102016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Third Point LLC takes stake in Visa  Dell Technologies - SEC filing "
    },
    {
        "content": "NEW YORK The U.S. government on Thursday asked a federal appeals court to reconsider a recent antitrust decision allowing American Express Co  to stop merchants from encouraging customers to use rival cards that charge lower fees.",
        "date": "11102016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "U.S. urges court to overturn AmEx antitrust decision "
    },
    {
        "content": "* \"New token service framework allows more companies to scale secure digital payments globally\"  Source text for Eikon:  Further company coverage:    (Bangalore.newsroom@thomsonreuters.com)",
        "date": "10252016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa opens tokenization services to third party partners "
    },
    {
        "content": "* Visa Inc - Pursuant to terms of offer letter  Alfred F. Kelly will receive an annual salary of $1.3 million - SEC filing  Source text: [http://bit.ly/2eC1CwG] Further company coverage:",
        "date": "10212016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa says terms of offer letter  Alfred Kelly will receive an annual salary of $1.3 mln "
    },
    {
        "content": "* Visa introduces international B2B payment solution built on Chain's blockchain technology",
        "date": "10212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa introduces international B2B payment solution "
    },
    {
        "content": "Visa Inc   the world's largest payments network operator  reported better-than-expected quarterly profit and revenue  boosted by the inclusion of Visa Europe's results and as customers spent more using its network.",
        "date": "10242016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa profit  revenue beat analysts' estimates "
    },
    {
        "content": "* Expects 2017 net revenue to grow 16-18 pct   (Adds CFO comments)",
        "date": "10242016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 3-Visa profit  revenue beat analysts' estimates "
    },
    {
        "content": "* Declares quarterly dividend  increases dividend rate by 18 percent and announces record date for the 2017 annual meeting of stockholders",
        "date": "10182016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa declares quarterly dividend and increases dividend rate by 18 pct "
    },
    {
        "content": "Oct 17 Visa Inc said Chief Executive Charles Scharf  who orchestrated the company's reunion with its European affiliate  is stepping down and will be succeeded by former American Express Co President Alfred Kelly.",
        "date": "10172016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UPDATE 2-Visa CEO Charles Scharf to resign  ex-AmEx president to take over "
    },
    {
        "content": "* Q4 earnings per share view $0.73 -- Thomson Reuters I/B/E/S",
        "date": "10242016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa Q4 adjusted earnings per share $0.78 excluding items "
    },
    {
        "content": "Visa Inc said Chief Executive Charles Scharf  who orchestrated the company's reunion with its European affiliate  is stepping down and will be succeeded by former American Express Co President Alfred Kelly.",
        "date": "10182016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa CEO Charles Scharf to resign  ex-AmEx president to take over "
    },
    {
        "content": "Oct 17 Visa Inc said Chief Executive Charlie Scharf has decided to resign  effective Dec. 1.",
        "date": "10172016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa CEO Charlie Scharf to resign "
    },
    {
        "content": "* Visa says  Charlie Scharf to resign as CEO effective December 1; Alfred F. Kelly  Jr. Named CEO",
        "date": "10172016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa appoints Alfred F. Kelly Jr as CEO "
    },
    {
        "content": "Oct 24 Visa Inc  the world's largest payments network operator  reported a 27.7 percent rise in quarterly profit as customers spent more using the network.",
        "date": "10242016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa's quarterly profit rises nearly 28 pct "
    },
    {
        "content": "* Visa Checkout opens platform for integration with digital wallets",
        "date": "10242016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa Checkout opens platform for integration with digital wallets "
    },
    {
        "content": "* Visa and Intel collaborate to drive better payment security for connected devices",
        "date": "10242016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa  Intel to work on payment security for connected devices "
    },
    {
        "content": "NEW YORK  Sept 26 A federal appeals court on Monday cleared the way for American Express Co to block merchants that accept its cards from steering customers toward lower-cost cards from other issuers.",
        "date": "09262016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 4-AmEx can bar merchants from steering card customers elsewhere "
    },
    {
        "content": "NEW YORK A federal appeals court on Monday cleared the way for American Express Co  to block merchants that accept its cards from steering customers toward lower-cost cards from other issuers.",
        "date": "09262016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "AmEx can bar merchants from steering card customers elsewhere "
    },
    {
        "content": "Wal-Mart Stores Inc's  Canadian unit will stop accepting Visa Inc  cards at 16 stores in the province of Manitoba starting Oct. 24  a company spokesman said on Wednesday  raising the stakes in a high-profile fee dispute in the country.",
        "date": "09152016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Wal-Mart Canada to extend Visa ban to more stores from October 24 "
    },
    {
        "content": "Sept 15 Wal-Mart Stores Inc's Canadian unit will stop accepting Visa Inc cards at 16 stores in the province of Manitoba starting Oct. 24  a company spokesman said on Wednesday  raising the stakes in a high-profile fee dispute in the country.",
        "date": "09152016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Wal-Mart Canada to extend Visa ban to more stores from Oct. 24 "
    },
    {
        "content": "Sept 15 Walmart Canada will stop accepting Visa Inc cards at its 16 stores in the province of Manitoba starting on Oct. 24  a spokesman said on Wednesday  raising the stakes in a high-profile fee dispute.",
        "date": "09152016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Walmart Canada to extend Visa ban to more stores from Oct. 24 "
    },
    {
        "content": "Sept 6 PayPal Holdings Inc has entered into a deal with MasterCard Inc that will allow payments in stores  the Wall Street Journal reported.",
        "date": "09062016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "REFILE-PayPal reaches deal with MasterCard for store payments - WSJ "
    },
    {
        "content": "* Visa Inc and Uber announce Uber local offers  a way for riders to get discounted rides by using Visa credit card on file with uber at local merchants  Source text for Eikon:  Further company coverage:",
        "date": "08302016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa and Uber to provide Uber local offers "
    },
    {
        "content": "JERUSALEM  Aug 15 Israel Discount Bank  reported a 46 percent rise in quarterly net profit that beat expectations due to a one-time gain from the sale of shares in Visa Europe.",
        "date": "08152016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Israel Discount Bank Q2 profit boosted by one-time Visa share sale "
    },
    {
        "content": "PARIS  Aug 3 Proceeds from the sale of its stake in card payment firm VISA Europe helped Societe Generale post a sharp rise in quarterly net income and offset pressure from low interest rates and weak trading income.",
        "date": "08032016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "REFILE-SocGen Q2 net income boosted by VISA windfall "
    },
    {
        "content": "* BZ WBK beats market forecasts with net profit of $182.4 mln",
        "date": "07272016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UPDATE 1-Visa deal gain lifts Polish lender BZ WBK's 2nd-quarter profit "
    },
    {
        "content": "* New facility  located in Palo Alto  will be a combination of office and collaboration spaces for about 300 Visa employees",
        "date": "07252016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa to open new Silicon Valley office "
    },
    {
        "content": "* Board of directors declared a quarterly cash dividend of $0.14 per share of class A common stock",
        "date": "07192016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa declares qtrly dividend of $0.14 per share "
    },
    {
        "content": "July 20 Visa Inc  operator of the world's largest payments network  said on Wednesday it had signed sponsorship deals with all ten members of the International Olympic Committee's (IOC) refugee team  essentially becoming their first corporate sponsor.",
        "date": "07202016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa to sponsor refugee athletes in Olympics "
    },
    {
        "content": "* Visa on operations in China - working through issues relating to national security reviews and encryption standards",
        "date": "07212016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa says longer term impact of brexit on Visa Europe's business is too early to determine "
    },
    {
        "content": "July 20 Visa Inc  operator of the world's largest payments network  said on Wednesday it had signed sponsorship deals with all 10 members of the International Olympic Committee's (IOC) refugee team  essentially becoming their first corporate sponsor.",
        "date": "07202016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Visa to sponsor refugee athletes in Olympics "
    },
    {
        "content": "Visa Inc  reported a higher-than-expected quarterly profit  as more customers use credit and debit cards for payments  and announced a $5 billion share buyback program.",
        "date": "07212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa profit tops estimates on higher payments volume "
    },
    {
        "content": "TORONTO  July 18 Some of Wal-Mart Stores Inc's  Canadian locations stopped accepting Visa Inc  credit cards on Monday  the retailer said  after it failed to reach a deal over what it called \"unacceptably high\" fees.",
        "date": "07182016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Walmart Canada stops taking Visa at some stores in fee dispute "
    },
    {
        "content": "PayPal Holdings Inc  moved to extend the reach of its online payments business through a deal with Visa Inc  that is expected to boost the revenue and number of users of the money-transfer service.",
        "date": "07222016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "PayPal seeks to extend reach with Visa tie-up "
    },
    {
        "content": "July 21 Visa Inc reported a higher-than-expected quarterly profit  as more customers use credit and debit cards for payments  and announced a $5 billion share buyback program.",
        "date": "07212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 3-Visa profit tops estimates on higher payments volume "
    },
    {
        "content": "* Did not include Visa Europe's financial results from June 21  2016 through june 30  2016",
        "date": "07212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa Q3 GAAP earnings per share $0.17 including items "
    },
    {
        "content": "July 21 PayPal Holdings Inc moved to extend the reach of its online payments business through a deal with Visa Inc that is expected to boost the revenue and number of users of the money-transfer service.",
        "date": "07222016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 3-PayPal seeks to extend reach with Visa tie-up "
    },
    {
        "content": "July 21 PayPal Holdings Inc on Thursday showed strong growth in its online payments business  meeting Wall Street expectations on earnings and announcing a new partnership with Visa Inc that is expected to bring a significant revenue increase.",
        "date": "07212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "PayPal announces Visa partnership  15 percent revenue growth "
    },
    {
        "content": "July 21 Visa Inc  the world's largest payments network operator  reported a steep drop in quarterly profit  hurt by costs related to the acquisition of Visa Europe  and said it would buy back Class A shares worth $5 billion.",
        "date": "07212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa profit drops  sets $5 bln buyback "
    },
    {
        "content": "NEW YORK  June 30 A federal appeals court on Thursday threw out a $7.25 billion antitrust settlement among Visa Inc  MasterCard Inc and millions of retailers over credit card fees.",
        "date": "06302016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa  MasterCard antitrust settlement with merchants is voided "
    },
    {
        "content": "NEW YORK A federal appeals court on Thursday threw out a $7.25 billion (5.48 billion pounds) antitrust settlement reached by Visa Inc  and MasterCard Inc  with millions of retailers that accused the card networks of improperly fixing credit and debit card fees.",
        "date": "06302016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa  MasterCard $7.25 billion settlement with retailers is thrown out "
    },
    {
        "content": "June 29 Visa Inc filed a lawsuit against Wal-Mart Stores Inc on Wednesday  claiming the retailer secretly began testing a protocol that eliminated the need for signature verifications for transactions paid for with a Visa debit card.",
        "date": "06292016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa countersues Wal-Mart in debit card PIN vs signature case "
    },
    {
        "content": "NEW YORK A federal appeals court on Thursday threw out a $7.25 billion antitrust settlement reached by Visa Inc and MasterCard Inc with millions of retailers that accused the card networks of improperly fixing credit and debit card fees.",
        "date": "06302016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa  MasterCard $7.25 bln settlement with retailers is thrown out "
    },
    {
        "content": "NEW YORK  June 30 A federal appeals court on Thursday threw out a $7.25 billion antitrust settlement reached by Visa Inc and MasterCard Inc with millions of retailers that accused the card networks of improperly fixing credit and debit card fees.",
        "date": "06302016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 5-Visa  MasterCard $7.25 bln settlement with retailers is thrown out "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Tuesday agreed to hear appeals by Visa Inc  Mastercard Inc and several U.S. banks seeking to throw out lawsuits claiming they conspired to inflate the prices of ATM access fees in violation of antitrust law.",
        "date": "06282016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Supreme Court agrees to review ATM fee antitrust lawsuit "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Tuesday agreed to hear appeals by Visa Inc  Mastercard Inc  and several U.S. banks seeking to throw out lawsuits claiming they conspired to inflate the prices of ATM access fees in violation of antitrust law.",
        "date": "06282016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "U.S. top court agrees to review ATM fee antitrust lawsuit "
    },
    {
        "content": "WASHINGTON  June 28 The U.S. Supreme Court on Tuesday agreed to hear appeals by Visa Inc  Mastercard Inc  and several U.S. banks seeking to throw out lawsuits claiming they conspired to inflate the prices of ATM access fees in violation of antitrust law.",
        "date": "06282016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-U.S. top court agrees to review ATM fee antitrust lawsuit "
    },
    {
        "content": "LONDON  June 22 (IFR) - Dozens of European banks will book hefty windfalls in the second quarter from the sale of their stakes in Visa Europe  after Visa Inc this week completed the purchase of its sister card payments firm.",
        "date": "06222016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa windfall gives European banks Q2 boost "
    },
    {
        "content": "* Confirmation of proceeds from sale of Visa Europe Limited to Visa Inc.",
        "date": "06222016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Co-Operative Bank says to recognise 62 mln stg from Visa Inc-Visa Europe deal "
    },
    {
        "content": "* Says Visa Inc buys Visa Europe  net capital gain for Caixabank of 115 million euros ($129.6 million) in Q2",
        "date": "06222016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Caixabank closes Visa Europe stake sale with net gain of 115 mln euros "
    },
    {
        "content": "* Appointed Gary  Hoffman  CEO of Hastings Group  as a board member of Visa Inc  Source text for Eikon:  Further company coverage:",
        "date": "06212016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF- Visa Inc completes acquisition of Visa Europe "
    },
    {
        "content": "June 19 Visa Inc  one of the Olympics' top global sponsors  kicks off its global advertising campaign for the Summer Games on Sunday with no plans to cut back on its Olympic presence despite difficulties in host country Brazil.",
        "date": "06202016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa launches Olympics campaign  undeterred by woes in Brazil "
    },
    {
        "content": "(Updates with new mBank figures)     WARSAW  June 16 Polish lenders stand to gain cash and Visa Inc shares after the world's largest payments network buys its subsidiary Visa Europe from its local member banks.     Visa said in November last year it would buy Visa Europe for up to $23.3 billion.      Below is a summary of Polish banks' estimates of how much they expect to receive from the deal  expected to be finalised in the second quarter of 2016:  Lender                  Owner ",
        "date": "06162016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "TABLE-Polish banks set for cash and shares from Visa deal - RTRS "
    },
    {
        "content": "* Says VISA to help accelerate EMV chip migration and support merchants",
        "date": "06162016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa says to accelerate EMV chip migration and support merchants "
    },
    {
        "content": "TORONTO Walmart Canada stores will stop accepting Visa Inc  cards because the credit card provider charges merchants \"unacceptably high\" fees  the retailer said on Saturday.",
        "date": "06122016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Walmart Canada to stop accepting Visa  says fees too high "
    },
    {
        "content": "TORONTO  June 11 Walmart Canada stores will stop accepting Visa Inc cards as the credit card provider charges merchants \"unacceptably high\" fees  the retailer said on Saturday.",
        "date": "06112016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Walmart Canada to stop accepting Visa  says fees too high "
    },
    {
        "content": "TORONTO  June 11 Walmart Canada stores will stop accepting Visa Inc cards because the credit card provider charges merchants \"unacceptably high\" fees  the retailer said on Saturday.",
        "date": "06122016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Walmart Canada to stop accepting Visa  says fees too high "
    },
    {
        "content": "* Introduced Visa digital commerce app  issuer-branded mobile commerce solution for financial institutions to offer their own mobile app to customers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06072016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa introduces Visa digital commerce app "
    },
    {
        "content": "* Has now received all regulatory approvals required for acquisition of Visa Europe Ltd",
        "date": "06032016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-European Commission approves Visa Inc's acquisition of Visa Europe "
    },
    {
        "content": "* Merchants including Alaska Airlines  Chick-Fil-A  Cole Haan  Emirates and Wyndam Hotel Group have signed on to offer visa checkout  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05172016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa expands Visa checkout across travel  tourism and fashion sites "
    },
    {
        "content": "May 10 Wal-Mart Stores Inc filed a lawsuit against Visa Inc  saying the payments network operator was resisting the use of personal identification numbers (PINs) by customers for purchases made on debit cards at its stores.",
        "date": "05102016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Wal-Mart sues Visa for resisting use of PIN-based transactions "
    },
    {
        "content": "* Wal- Mart filed a lawsuit against Visa saying payments network is preventing  it from requiring customers to verify their purchases -WSJ",
        "date": "05102016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Wal-Mart sues Visa over chip-enabled debit card transactions- WSJ "
    },
    {
        "content": "* Co  Visa Europe entered into an amended and restated transaction agreement",
        "date": "05102016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa Co  Visa Europe enter amended and restated transaction agreement "
    },
    {
        "content": "* Appointed James Hoffmeister  senior vice president  global corporate controller and chief accounting officer  as principal accounting officer",
        "date": "04252016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa appoints James Hoffmeister as principal accounting officer "
    },
    {
        "content": "April 26 Visa Inc is forecasting 400 000 to 500 000 international visitors to Rio de Janeiro in August  a projection one of its top marketing executives called \"reassuring\" given economic and health issues swirling around the August games in Brazil.",
        "date": "04272016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa calls travel projections for Olympics 'reassuring' "
    },
    {
        "content": "April 26 Visa Inc is forecasting 400 000 to 500 000 international visitors to Rio de Janeiro in August  a projection one of its top marketing executives called \"reassuring\" given economic and health issues swirling around the August games in Brazil.",
        "date": "04272016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Visa calls travel projections for Olympics 'reassuring' "
    },
    {
        "content": "Visa Inc  the world's largest payments network operator  lowered its full-year revenue forecast  blaming lack of improvement in cross-border spending.",
        "date": "04212016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa lowers revenue forecast  amends Visa Europe deal "
    },
    {
        "content": "April 21 Visa Inc  the world's largest payments network operator  lowered its full-year revenue forecast  blaming lack of improvement in cross-border spending.",
        "date": "04212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Visa lowers revenue forecast  amends Visa Europe deal "
    },
    {
        "content": "* Reaffirms outlook for annual operating margin  annual free cash flow for fiscal 2016",
        "date": "04212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Visa reports Q2 GAAP earnings per share of $0.71 "
    },
    {
        "content": "April 21 Visa Inc  the world's largest payments network operator  said it amended its deal to buy former subsidiary Visa Europe to eliminate the earn-out portion.",
        "date": "04212016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "REFILE-Visa's quarterly profit rises 10 pct  amends Visa Europe deal "
    },
    {
        "content": "* Declared a quarterly cash dividend of $0.14 per share of class a common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04202016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa declares quarterly cash dividend "
    },
    {
        "content": "* Announced launch of quick chip for EMV  technology that optimizes EMV chip card processing and speeds up checkout times",
        "date": "04192016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa announces launch of 'quick chip' technology for EMV "
    },
    {
        "content": "* Says its Singaporean subsidiary will become a principal member of Visa in Singapore",
        "date": "04052016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Wirecard unit to become member of Visa in Singapore "
    },
    {
        "content": "Feb 25 China UnionPay and Visa Inc signed a memorandum of understanding to collaborate on payments security  Visa said on Thursday.",
        "date": "02252016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa signs MoU with China UnionPay "
    },
    {
        "content": "* Expected capital gain for Nordea when Visa Inc acquires Visa Europe Ltd",
        "date": "02162016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Nordea sees EUR 90-130 mln pretax gain from Visa deal "
    },
    {
        "content": "Feb 11 Visa Inc  the world's largest payments network operator   disclosed a 9.99 percent holding of Class A shares in mobile payment firm Square Inc.",
        "date": "02122016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "CORRECTED-Visa discloses 9.99 pct stake in Class A shares of Square (Feb. 11) "
    },
    {
        "content": "Visa Inc   the world's largest payments network operator   disclosed a 9.99 percent holding of Class A shares in mobile payment firm Square Inc .",
        "date": "02122016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa discloses 9.99 percent stake in Dorsey-led Square "
    },
    {
        "content": "Feb 11 Visa Inc  the world's largest payments network operator   disclosed a 9.99 percent holding of Class A shares in mobile payment firm Square Inc.",
        "date": "02122016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "CORRECTED-Visa discloses 9.99 pct stake in Dorsey-led Square "
    },
    {
        "content": "SAN FRANCISCO Visa Inc   the world's largest credit and debit card company  said on Friday it currently has about a 1 percent stake in mobile payments company Square Inc  based on a 2011 investment.",
        "date": "02132016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa's investment in Square represents about 1 percent stake "
    },
    {
        "content": "SAN FRANCISCO  Feb 12 Visa Inc  the world's largest credit and debit card company  said on Friday it currently has about a 1 percent stake in mobile payments company Square Inc based on a 2011 investment.",
        "date": "02132016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa's investment in Square represents about 1 pct stake "
    },
    {
        "content": "* \u007fPlanned acquisition of Visa Europe Limited through Visa Inc. benefits company indirectly - positive non-recurring effect expected\u007f",
        "date": "02012016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Net mobile sees indirect benefits from \u007fplanned acquisition of Visa Europe Ltd "
    },
    {
        "content": "WARSAW  Jan 29 PKO BP  Poland's biggest bank by assets and a member of Visa Europe Ltd said on Friday it expected to get around 400 million zlotys ($98 million) this year from the sale of Visa Europe to Visa Inc.     ($1 = 4.0858 zlotys)   (Reporting by Agnieszka Barteczko; Editing by Greg Mahlich)",
        "date": "01292016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Poland's PKO says expects $98 mln in 2016 from Visa sale "
    },
    {
        "content": "Visa Inc   the world's largest payments network operator  reported a better-than-expected quarterly profit and did not lower its full-year forecasts as many Wall Street analysts were expecting.",
        "date": "01282016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa does not lower full-year forecast as Wall Street had expected "
    },
    {
        "content": "(Adds PKO BP estimate)     WARSAW  Jan 29 Polish lenders stand to gain cash and Visa Inc shares after the world's largest payments network buys its subsidiary Visa Europe from its local member banks.     Visa said last month it would buy Visa Europe for up to $23.3 billion.      Below is a summary of Polish banks' estimates of how much they expect to receive from the deal  expected to be finalised in the second quarter of 2016:  Lender                  Owner                Cash   ",
        "date": "01292016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "TABLE-Polish banks set for cash and shares from Visa deal - RTRS "
    },
    {
        "content": "Jan 28 Visa Inc  the world's largest payments network operator  reported a better-than-expected quarterly profit and did not lower its full-year forecasts as many Wall Street analysts were expecting.",
        "date": "01282016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Visa does not lower full-year forecast as Wall Street had expected "
    },
    {
        "content": "Jan 28 Visa Inc  the world's largest payments network operator  reported a 23.7 percent rise in first-quarter profit  as payment volumes increased.",
        "date": "01282016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa profit rises 24 pct on higher payment volumes "
    },
    {
        "content": "* Adds BZ WBK estimate      WARSAW  Jan 13 Polish lenders stand to gain an injection of cash and Visa Inc V.N shares after the world's largest payments network buys its subsidiary Visa Europe  of which local banks are among the members.     Visa said last month it would buy Visa Europe for up to $23.3 billion.      Below is a summary of Polish banks' estimates of how much they expect to receive from the deal  expected to be finalised in the second quarter of 2016:  Lender            ",
        "date": "01132016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "TABLE-Polish banks set for cash and shares from Visa deal - RTRS "
    },
    {
        "content": "Jan 12 Visa Inc said several big merchants including Starbucks Corp and Walgreens Boots Alliance Inc have started accepting its digital payments service  Visa Checkout.",
        "date": "01122016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Starbucks  Walgreens to add Visa Checkout as payment option "
    },
    {
        "content": "* comdirect bank to benefit from planned takeover of Visa Europe Limited by Visa Inc.",
        "date": "01072016",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-comdirect bank to benefit from planned takeover of Visa Europe Limited by Visa Inc. "
    },
    {
        "content": "BOSTON  Jan 4 Fidelity Investments said on Monday it is dropping long-time credit card partners American Express Co and Bank of America Corp  ending a 12-year partnership that has generated billions of dollars in fees.",
        "date": "01042016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Fidelity drops credit card partners American Express  Bank of America "
    },
    {
        "content": "BOSTON  Jan 4 Fidelity Investments said on Monday it is dropping long-time credit card partners American Express Co and Bank of America Corp  ending a 12-year partnership that has generated billions of dollars in fees.",
        "date": "01042016",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "REFILE-Fidelity drops credit card partners American Express  Bank of America "
    },
    {
        "content": "(Adds BNP BGZ estimates)     Dec 29 Polish lenders stand to gain an injection of cash and Visa Inc shares after the world's largest payments network buys its subsidiary Visa Europe  of which local banks are among the members.     Visa said last month it would buy Visa Europe for up to $23.3 billion.      Below is a summary of Polish banks' estimates of how much they expect to receive from the deal  expected to be finalised in the second quarter of 2016:       Lender               ",
        "date": "12292015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "TABLE-Polish banks set for cash and shares from Visa deal "
    },
    {
        "content": "(Adds Handlowy estimates)     Dec 28 Polish lenders stand to gain an injection of cash and Visa Inc shares after the world's largest payments network buys its subsidiary Visa Europe  of which local banks are among the members.     Visa said last month it would buy Visa Europe for up to $23.3 billion.      Below is a summary of Polish banks' estimates of how much they expect to receive from the deal  expected to be finalised in the second quarter of 2016:       Lender              ",
        "date": "12282015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "TABLE-Polish banks set for cash and shares from Visa deal "
    },
    {
        "content": "WARSAW  Dec 23 Polish lender ING Bank Slaski  may get 31 million euros  ($33.81 million) in cash and a further nearly 11 million euros in shares thanks to a settlement of the takeover transaction of Visa Europe by Visa Inc  the bank said.",
        "date": "12232015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Polish ING unit may get 42 mln euros thanks to Visa deal "
    },
    {
        "content": "Dec 9 Swedbank gives indicative financial effects from Visa Inc.'s intended acquisition of Visa Europe Limited:",
        "date": "12092015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Swedbank may get 1.5-2.5 bln SEK from Visa Inc deal for Visa Europe\u007f "
    },
    {
        "content": "ZURICH Swatch Group  Chief Executive Nick Hayek has signed a contract with credit card company Visa Inc.  in connection with the Swiss firm's new watch that enables wearers to make payments  a newspaper reported on Tuesday.",
        "date": "11242015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Swatch signs pact with Visa on payment watch: report "
    },
    {
        "content": "ZURICH  Nov 24 Swatch Group Chief Executive Nick Hayek has signed a contract with credit card company Visa Inc. in connection with the Swiss firm's new watch that enables wearers to make payments  a newspaper reported on Tuesday.",
        "date": "11242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Swatch signs pact with Visa on payment watch - report "
    },
    {
        "content": "Visa Inc  said on Monday it would buy former subsidiary Visa Europe Ltd for up to $23.3 billion in a deal that will give the world's largest payments network a chance to cut costs over the long term and raise fees in the second-biggest card market. | Video ",
        "date": "11022015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa to buy Visa Europe in deal worth as much as $23 billion "
    },
    {
        "content": "Nov 2 Visa Inc said on Monday it would buy former subsidiary Visa Europe Ltd for up to $23.3 billion in a deal that will give the world's largest payments network a chance to cut costs over the long term and raise fees in the second-biggest card market.",
        "date": "11022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 6-Visa to buy Visa Europe in deal worth as much as $23 bln "
    },
    {
        "content": "* Visa shares down 3.4 pct   (Adds Breakingviews; Updates shares)",
        "date": "11022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 5-Visa to buy Visa Europe in deal worth as much as $23 bln "
    },
    {
        "content": "* Indexes up: Dow 0.55 pct  S&P 0.70 pct  Nasdaq 0.96 pct   (Updates to early afternoon)",
        "date": "11022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St up on factory activity data  health care rally "
    },
    {
        "content": "WARSAW PKO BP   Poland's biggest bank by assets  said on Monday that it expected significant income as a result of Visa Inc  buying Visa Europe Ltd.",
        "date": "11022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Poland's PKO expects 'significant income' from Visa deal "
    },
    {
        "content": "WARSAW  Nov 2 PKO BP  Poland's biggest bank by assets  said on Monday that it expected significant income as a result of Visa Inc buying Visa Europe Ltd.",
        "date": "11022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Poland's PKO expects \"significant income\" from Visa deal "
    },
    {
        "content": "* Visa Inc announced proposed acquisition of Visa Europe Limited to create a single global payments business under Visa brand",
        "date": "11022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-Co-op Bank updates on sale proceeds from Visa Europe deal "
    },
    {
        "content": "* Indexes up: Dow 0.62 pct  S&P 0.72 pct  Nasdaq 0.90 pct   (Adds details  changes comment  updates prices)",
        "date": "11022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St higher after better-than-expected factory data "
    },
    {
        "content": "* Royal Bank of Scotland Group Plc - Visa Europe shareholding",
        "date": "11022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "BRIEF-RBS expects an initial 200 mln stg pretax gain on completion of Visa deal "
    },
    {
        "content": "* China Unionpay currently has monopoly on payment card market",
        "date": "10262015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Foreign bank card firms fear tough China regulatory regime "
    },
    {
        "content": "Oct 24 USAA  one of the largest U.S. issuers of debit and credit cards  is switching to Visa Inc from its longtime partner  MasterCard Inc  the company said on its website.",
        "date": "10242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "USAA says switches to Visa from MasterCard "
    },
    {
        "content": "LONDON Europe's banks are in line to share billions of euros from a buyout of Visa Europe by its U.S. sister company Visa Inc.   which is expected to be sealed in the next two weeks  sources said.",
        "date": "10162015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "European banks set for windfall from Visa Europe deal: sources "
    },
    {
        "content": "LONDON  Oct 16 Europe's banks are in line to share billions of euros from a buyout of Visa Europe by its U.S. sister company Visa Inc.  which is expected to be sealed in the next two weeks  sources said.",
        "date": "10162015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "European banks set for windfall from imminent Visa Europe deal -sources "
    },
    {
        "content": "Oct 6 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10062015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "MOVES-Citi  Deutsche Asset  Visa  EY "
    },
    {
        "content": "Oct 6 Debit and credit card company Visa Inc  named Demetrios Marantis as senior vice president  global government relations.",
        "date": "10062015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "MOVES-Visa names Demetrios Marantis as SVP  global government relations "
    },
    {
        "content": "* Says it will be in the best interests of FIFA and the sport for Sepp Blatter to step down immediately",
        "date": "10022015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Visa asks FIFA President to step down immediately "
    },
    {
        "content": "* New restrictions also apply to Visa  MasterCard   (Adds details  quotes)",
        "date": "09302015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UPDATE 1-China forex regulator says to cap overseas cash withdrawals "
    },
    {
        "content": "* FIFA image tarnished by Swiss criminal probe of Blatter   (Update with comments)",
        "date": "10022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 3-Soccer-Coke  McDonald's join sponsor call for FIFA's Blatter to resign "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Monday weighed whether to uphold the approval of an estimated $5.7 billion antitrust settlement by  MasterCard Inc  and Visa Inc  with merchants over credit card fees despite the objection of several major retailers.",
        "date": "09282015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "U.S. court hears challenge to $5.7 billion Visa  MasterCard settlement "
    },
    {
        "content": "NEW YORK  Sept 28 A U.S. appeals court on Monday weighed whether to uphold the approval of an estimated $5.7 billion antitrust settlement by  MasterCard Inc and Visa Inc with merchants over credit card fees despite the objection of several major retailers.",
        "date": "09282015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "U.S. court hears challenge to $5.7 bln Visa  MasterCard settlement "
    },
    {
        "content": "Hilton Worldwide Holdings said on Saturday it was investigating claims that hackers had compromised registers in gift shops and restaurants at a large number of Hilton Hotel and franchise properties across the United States.",
        "date": "09262015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Hilton says checking claims of hacking at hotels "
    },
    {
        "content": "A U.S. judge on Tuesday certified a class action against Target Corp brought by several banks over the retailer's massive data breach in 2013.",
        "date": "09152015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "U.S. judge certifies class action over Target Corp data breach "
    },
    {
        "content": " ",
        "date": "09152015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-U.S. judge certifies class action over Target Corp data breach "
    },
    {
        "content": "NEW YORK  Sept 10 Sam's Club  Wal-Mart Stores Inc's warehouse division  will accept American Express  credit cards starting Oct. 1  in addition to the other cards it already accepts in its stores  the companies said on Thursday.",
        "date": "09102015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "CORRECTED-Sam's Club to accept American Express credit cards "
    },
    {
        "content": "NEW YORK  Sept 8 JPMorgan Chase & Co. is cutting prices for a group of its credit card customers and getting Visa Inc to shoulder at least some of the burden of the lost revenue  underscoring how the largest U.S. bank's size can help it hang onto business in fiercely competitive markets.",
        "date": "09082015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "RPT - INSIGHT-JPMorgan uses its might to cut costs in credit card market "
    },
    {
        "content": "NEW YORK JPMorgan Chase & Co. is cutting prices for a group of its credit card customers and getting Visa Inc to shoulder at least some of the burden of the lost revenue  underscoring how the largest U.S. bank's size can help it hang onto business in fiercely competitive markets.",
        "date": "09082015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "JPMorgan uses its might to cut costs in credit card market "
    },
    {
        "content": "NEW YORK  Sept 8 JPMorgan Chase & Co. is cutting prices for a group of its credit card customers and getting Visa Inc to shoulder at least some of the burden of the lost revenue  underscoring how the largest U.S. bank's size can help it hang onto business in fiercely competitive markets.",
        "date": "09082015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "INSIGHT-JPMorgan uses its might to cut costs in credit card market "
    },
    {
        "content": "SYDNEY Australia's federal court has ordered a subsidiary of credit and debit card issuer Visa Inc to pay a fine of A$18 million ($12.55 million) for blocking a rival currency conversion service on its payment terminals.",
        "date": "09042015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Australia court fines Visa arm $12.6 million  cites anti-competitive conduct "
    },
    {
        "content": "Home Depot  REI and other retailers have asked a court to toss out their $5.7 billion settlement with MasterCard Inc and Visa Inc in a long-running fight over fees amid allegations that two opposing lawyers swapped information on negotiations and other confidential matters  according to a court filing on Tuesday.",
        "date": "09022015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Retailers seek to scrap $5.7 bln settlement with Visa  MasterCard "
    },
    {
        "content": "SYDNEY  Sept 4 Australia's federal court has ordered a subsidiary of credit and debit card issuer Visa Inc  to pay a fine of A$18 million ($12.55 million) for blocking a rival currency conversion service on its payment terminals.",
        "date": "09042015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Australia court fines Visa arm $12.6 mln  cites anti-competitive conduct "
    },
    {
        "content": "CHICAGO Visa Inc said on Monday online shoppers using its payment service are 17 percentage points more likely to complete their purchases than those using PayPal.",
        "date": "08252015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa says its users more likely to complete online purchases "
    },
    {
        "content": "CHICAGO Visa Inc said on Monday online shoppers using its payment service are 17 percentage points more likely to complete their purchases than those using PayPal.",
        "date": "08242015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa: Consumers using it online finish transactions more than those using PayPal "
    },
    {
        "content": "CHICAGO  Aug 24 Visa Inc said on Monday online shoppers using its payment service are 17 percentage points more likely to complete their purchases than those using PayPal.",
        "date": "08252015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Visa says its users more likely to complete online purchases "
    },
    {
        "content": "CHICAGO  Aug 24 Visa Inc said on Monday online shoppers using its payment service are 17 percentage points more likely to complete their purchases than those using PayPal.",
        "date": "08242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "CORRECTED-Visa: Consumers using it online finish transactions more than those using PayPal "
    },
    {
        "content": "Aug 18 Target Corp has reached an agreement with Visa Inc to reimburse up to $67 million to card issuers for the costs they took after a data breach at Target in 2013  the Wall Street Journal reported. (http://on.wsj.com/1K3REzC)",
        "date": "08182015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Target reaches agreement with Visa over data breach - WSJ "
    },
    {
        "content": "BERNE  Aug 18 FIFA will meet some of its leading commercial partners on Thursday to discuss reforms  a source close to soccer's world governing body said on Tuesday.",
        "date": "08182015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Soccer-FIFA to meet sponsors on Thursday "
    },
    {
        "content": "ZURICH  Aug 18 FIFA will meet some of its leading commercial partners on Thursday to discuss reforms  a source close to soccer's governing body said on Tuesday.",
        "date": "08182015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Soccer-FIFA to meet sponsors on Thursday - source "
    },
    {
        "content": "ZURICH World Cup sponsor McDonald’s has joined Coca-Cola and Visa in urging FIFA to adopt an independent reform commission in response to the scandals that have plagued world soccer’s governing body.",
        "date": "08062015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "FIFA sponsor McDonald's backs independent reform body: group "
    },
    {
        "content": "ZURICH  Aug 6 World Cup sponsor McDonald's  has joined Coca-Cola and Visa in urging FIFA to adopt an independent reform commission in response to the scandals that have plagued world football's governing body.",
        "date": "08062015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Soccer-FIFA sponsor McDonald's backs independent reform body-group "
    },
    {
        "content": "NEW YORK A federal appeals court has revived litigation against Visa Inc   Mastercard Inc  and several U.S. banks accusing them of conspiring to inflate the prices of ATM access fees in violation of antitrust law.",
        "date": "08042015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "ATM fee lawsuits against Visa  Mastercard  banks revived on appeal "
    },
    {
        "content": "NEW YORK  Aug 4 A federal appeals court has revived litigation against Visa Inc  Mastercard Inc  and several U.S. banks accusing them of conspiring to inflate the prices of ATM access fees in violation of antitrust law.",
        "date": "08042015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-ATM fee lawsuits against Visa  Mastercard  banks revived on appeal "
    },
    {
        "content": "NEW YORK Dozens of retailers are seeking to void nearly $6 billion of U.S. antitrust settlements with Visa Inc   MasterCard Inc  and American Express Co  after learning that opposing lawyers exchanged confidential information  potentially tainting the accords.",
        "date": "07292015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Merchants seek to void $6 billion Visa  MasterCard  AmEx settlements "
    },
    {
        "content": "NEW YORK A U.S. judge on Tuesday rejected a proposed class action settlement between American Express Co  and merchants who sued the company over swipe fees  ruling that a lawyer for the merchants compromised the fairness of the agreement.",
        "date": "08042015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "U.S. judge rejects American Express class action settlement "
    },
    {
        "content": "NEW YORK  July 29 Dozens of retailers are seeking to void nearly $6 billion of U.S. antitrust settlements with Visa Inc  MasterCard Inc and American Express Co after learning that opposing lawyers exchanged confidential information  potentially tainting the accords.",
        "date": "07292015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Merchants seek to void $6 bln Visa  MasterCard  AmEx settlements "
    },
    {
        "content": "The S&P 500 and Nasdaq posted their largest weekly drops since March on Friday as slowing global growth dragged commodity-related stocks lower while an earnings-fueled drop in Biogen took down the biotech sector.",
        "date": "07242015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Wall Street slides to end rough week on macro  earnings concerns "
    },
    {
        "content": "Credit and debit card issuer Visa Inc  said it was in talks to reunite with former subsidiary Visa Europe Ltd in a deal that would give the global company more scale to compete with arch-rival MasterCard Inc .",
        "date": "07232015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa in talks to reunite with Visa Europe "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  WEEK AHEAD",
        "date": "07242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "What to Watch in the Week Ahead and on Monday  July 27 "
    },
    {
        "content": "* Amazon jumps to record high after posting unexpected profit",
        "date": "07242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall Street slumps as materials  health stocks weigh "
    },
    {
        "content": "NEW YORK  July 23 Visa Inc joined fellow FIFA sponsor Coca-Cola Co on Thursday in calling for an independent commission to reform the way that soccer's governing body is run.",
        "date": "07232015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa joins Coke in call for independent body to reform FIFA "
    },
    {
        "content": "* Amazon jumps to record high after posting unexpected profit",
        "date": "07242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Dow  S&P lower on mixed earnings; Nasdaq rises "
    },
    {
        "content": "* Shares rise as much as 7.5 pct after market   (Adds analyst comment  details on Visa Europe; updates shares)",
        "date": "07232015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Visa in talks to reunite with Visa Europe "
    },
    {
        "content": "* Futures: Dow down 31 pts  S&P down 2 pts  Nasdaq up 3 pts   (Adds details  comment  updates prices)",
        "date": "07242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St set to extend selloff "
    },
    {
        "content": "ST PETERSBURG FIFA will meet its leading commercial partners next month after three of them increased pressure for major reforms to soccer's governing body following a series of corruption scandals.",
        "date": "07242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "FIFA to meet sponsors after reproaches from Coke  Visa  McDonald's "
    },
    {
        "content": "July 20 PayPal Holdings Inc shares jumped as much as 11 percent in their highly anticipated return to the Nasdaq after more than a decade in eBay Inc's  fold  valuing the digital payment processor at about $52 billion.",
        "date": "07202015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-PayPal returns to market with $52 bln valuation "
    },
    {
        "content": "ST PETERSBURG  July 24 FIFA will meet its leading commercial partners next month after three of them increased pressure for major reforms to soccer's governing body following a series of corruption scandals.",
        "date": "07242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-FIFA to meet sponsors after reproaches from Coke  Visa  McDonald's "
    },
    {
        "content": "July 24 U.S. stock index futures were higher on Friday after three straight days of losses as Amazon  Visa and Starbucks beat expectations.",
        "date": "07242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Futures higher after strong earnings reports "
    },
    {
        "content": "* Indexes down: Dow 0.7 pct  S&P 0.6 pct  Nasdaq 0.5 pct   (Updates close with volume  Visa up after the bell)",
        "date": "07232015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St falls for 3rd day as earnings fall short "
    },
    {
        "content": "July 20 PayPal Holdings Inc shares rose 5.9 percent in premarket trading  ahead of their highly anticipated return to the Nasdaq  valuing the company at about $50 billion.",
        "date": "07202015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "PayPal valued at about $50 bln ahead of market debut "
    },
    {
        "content": "July 23 Credit and debit card issuer Visa Inc  said it was in talks for a deal with former subsidiary Visa Europe  which it expected to conclude by the end of October.",
        "date": "07232015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa says in deal talks with Visa Europe "
    },
    {
        "content": "* Indexes down: Dow 0.52 pct  S&P 0.45 pct  Nasdaq 0.25 pct   (Updates to early afternoon)",
        "date": "07232015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall Street slumps for third day as earnings disappoint "
    },
    {
        "content": "July 22 Credit card issuer American Express Co  reported a better-than-expected second-quarter profit as it benefited from cost-savings after cutting jobs.",
        "date": "07232015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "CORRECTED-UPDATE 2-Cost cutting eases strong-dollar pain for American Express "
    },
    {
        "content": "* Dow falls 0.09 pct  S&P up 0.05 pct  Nasdaq up 0.42 pct   (Adds details  adds comment  updates prices)",
        "date": "07232015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-U.S. stocks higher; 3M  Caterpillar weigh on Dow "
    },
    {
        "content": "CHICAGO  July 1 Visa Inc said on Wednesday it is joining MasterCard Inc and American Express Co in barring its credit cards from being used to pay for ads on Backpage.com following a request from a Chicago sheriff who said the site is used by sex traffickers.",
        "date": "07012015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa joins MasterCard  AmEx in ending use for Backpage sex ads "
    },
    {
        "content": "CHICAGO  July 1 Visa Inc said on Wednesday it is joining MasterCard Inc and American Express Co in barring its credit cards from being used to pay for ads on Backpage.com following a request from a Chicago sheriff who said the site is used by sex traffickers.",
        "date": "07012015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Visa joins MasterCard  AmEx in ending use for Backpage sex ads "
    },
    {
        "content": "CHICAGO  June 30 MasterCard said on Tuesday that its credit cards can no longer be used to pay for ads on the Backpage.com website  following a request from a Chicago law enforcement official who said the site is used by sex traffickers.",
        "date": "06302015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "MasterCard stops allowing charges for Backpage.com sex ads "
    },
    {
        "content": "NEW YORK  June 16 A federal appeals court on Tuesday rejected American Express Co's emergency request to halt an injunction that requires the company to let merchants steer customers toward lower-cost cards offered by competitors.",
        "date": "06162015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "American Express loses emergency bid to block U.S. card injunction "
    },
    {
        "content": "June 12 Visa Inc said its board had elected Brocade Communications Systems Inc Chief Executive Lloyd Carney as an independent director  effective June 11.",
        "date": "06122015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "MOVES-Visa board elects Carney as independent director "
    },
    {
        "content": "NEW YORK/BERLIN Visa Inc has told FIFA it could end its sponsorship if soccer's governing body does not act fast to restore the reputation of the game after senior officials were arrested on  corruption charges. | Video ",
        "date": "05282015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa threatens to ditch FIFA as sponsor dismay mounts "
    },
    {
        "content": "* Adidas  Coca-Cola Hyundai  McDonald's  Anheuser-Busch concerned",
        "date": "05282015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 4-Visa threatens to ditch FIFA as sponsor dismay mounts "
    },
    {
        "content": "MOSCOW Visa Inc  the world's largest credit and debit card company  has moved processing of its card transactions to a local system  Olga Skorobogatova  Russia's central bank's  deputy chairwoman  said on Thursday.",
        "date": "05282015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa moved card processing in Russia to local system: central bank "
    },
    {
        "content": "MOSCOW  May 28 Visa Inc  the world's largest credit and debit card company  has moved processing of its card transactions to a local system  Olga Skorobogatova  Russia's central bank's  deputy chairwoman  said on Thursday.",
        "date": "05282015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa moved card processing in Russia to local system: cbank "
    },
    {
        "content": "BERNE FIFA sponsors Visa have expressed \"grave concern\" at the conditions of migrant workers in 2022 World Cup hosts Qatar.",
        "date": "05212015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "FIFA sponsors Visa express 'grave concern' over Qatar workers "
    },
    {
        "content": "BERNE  May 20 FIFA sponsors Visa have expressed \"grave concern\" at the conditions of migrant workers in 2022 World Cup hosts Qatar.",
        "date": "05202015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UPDATE 1-Soccer-FIFA sponsors Visa express \"grave concern\" over Qatar workers "
    },
    {
        "content": "BERNE  May 20 FIFA sponsors Visa have expressed \"grave concern\" at the conditions of migrant workers in 2022 World Cup hosts Qatar.",
        "date": "05202015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "RPT-Soccer-FIFA sponsors Visa express \"grave concern\" over Qatar workers "
    },
    {
        "content": "May 8 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "05082015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Visa Inc  is in preliminary talks to buy former subsidiary Visa Europe Ltd  in a deal that could be valued at up to $20 billion  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "05082015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa in talks to buy former subsidiary Visa Europe for up to $20 billion: Bloomberg "
    },
    {
        "content": "May 8 Visa Inc is in preliminary talks to buy former subsidiary Visa Europe Ltd  in a deal that could be valued at up to $20 billion  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "05082015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Visa in talks to buy former subsidiary Visa Europe for up to $20 bln-Bloomberg "
    },
    {
        "content": "Visa Inc   the world's largest credit and debit card company  forecast profit below Wall Street expectations for the current quarter  hurt by continued pressure from lower crude prices and a strong dollar.",
        "date": "04302015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa forecasts current-quarter profit below Street "
    },
    {
        "content": "* Indexes down: Dow 0.4 pct  S&P 0.5 pct  Nasdaq 0.5 pct   (Adds details  changes comment  updates prices)",
        "date": "04292015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "US STOCKS-Wall St falls as economic growth stalls; Fed meeting eyed "
    },
    {
        "content": "April 30 Visa Inc  the world's largest credit and debit card company  forecast profit below Wall Street expectations for the current quarter  hurt by continued pressure from lower crude prices and a strong dollar.",
        "date": "04302015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Visa forecasts current-quarter profit below Street "
    },
    {
        "content": "April 30 Visa Inc  the world's largest credit and debit card company  reported a 7.8 percent rise in second-quarter operating revenue as more customers used cards for payments.",
        "date": "04302015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa quarterly operating revenue rises 7.8 pct "
    },
    {
        "content": "April 28 MasterCard Inc's strong association with Chinese bank card behemoth UnionPay is expected to help it reap more benefits than larger rival Visa Inc  as the country opens up its $7 trillion bank card payments market to foreign players.",
        "date": "04282015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "MasterCard seen stealing a march on Visa as China opens doors "
    },
    {
        "content": "* Indexes close up: Dow 0.49 pct  S&P 0.51 pct  Nasdaq 0.42 pct",
        "date": "04222015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Stocks end stronger as investors look beyond mixed earnings "
    },
    {
        "content": "April 22 U.S. stocks ended stronger on Wednesday as Visa Inc's potential expansion into China and talk of a turnaround at McDonald's Corp helped investors see the bright side of mixed quarterly earnings.",
        "date": "04222015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS SNAPSHOT-Wall St finishes higher  helped by Visa and McDonald's "
    },
    {
        "content": "April 22 U.S. stocks rose in afternoon trading on Wednesday as Visa's potential expansion into China and talk of a turnaround at McDonald's helped investors see the bright side of mixed quarterly earnings.",
        "date": "04222015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "CORRECTED-US STOCKS-Stocks gain as investors eye bright side of mixed earnings "
    },
    {
        "content": "* Indexes up: Dow 0.3 pct  S&P 0.3 pct  Nasdaq 0.2 pct   (Updates to early afternoon)",
        "date": "04222015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St up in afternoon trading; Visa  MasterCard jump "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.3 pct  Nasdaq 0.1 pct   (Updates to midday  changes comment)",
        "date": "04222015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St ticks up in volatile trading; McDonald's  Visa rise "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.1 pct  Nasdaq 0.3 pct   (Updates to open)",
        "date": "04222015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St slips on mixed bag of earnings "
    },
    {
        "content": "BEIJING China has announced it will open up its market for clearing domestic bank card transactions  a move that should allow foreign players such as Visa Inc  and MasterCard Inc  direct access to a market valued at $6.84 trillion last year.",
        "date": "04222015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "China to open bank card clearing market to foreign firms from June "
    },
    {
        "content": "BEIJING  April 22 China has announced it will open up its market for clearing domestic bank card transactions  a move that should allow foreign players such as Visa Inc  and MasterCard Inc direct access to a market valued at $6.84 trillion last year.",
        "date": "04222015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-China to open bank card clearing market to foreign firms from June "
    },
    {
        "content": "April 15 Target Corp said it had agreed to reimburse about $19 million to financial institutions that had issued MasterCard-branded cards that were a part of the massive data breach at the retailer in 2013.",
        "date": "04152015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "UPDATE 1-Target announces $19 mln data breach settlement with MasterCard "
    },
    {
        "content": "April 14 Target Corp is nearing a settlement with MasterCard Inc to reimburse financial institutions about $20 million for costs incurred from the retailer's massive data breach in 2013  the Wall Street Journal reported.",
        "date": "04142015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Target nears $20 million MasterCard data breach settlement -WSJ "
    },
    {
        "content": "MOSCOW  March 27 Visa still needs one or two months to transfer processing of transactions made on its credit cards in Russia to a local payment system  but Mastercard will make an obligatory April 1 deadline  the head of the payment system said.",
        "date": "03272015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa to miss deadline for new Russia payment system  Mastercard on time: payment system head "
    },
    {
        "content": "* Following new agreements with Visa and Carta Worldwide  bank card payments via Vodafone wallet will be enabled in European markets from Q2 of 2015 onwards",
        "date": "03302015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BRIEF-Vodafone says Vodafone Wallet service to be enabled in European markets from Q2 "
    },
    {
        "content": "** Monitise Plc's shares down as much as 22.2 pct  after mobile-banking software maker says it is no longer looking to sell itself  and that co-CEO Alastair Lukies will step down",
        "date": "03252015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "BUZZ-Monitise: No longer up for sale  co-CEO Lukies to step down "
    },
    {
        "content": "Warehouse club Costco Wholesale Corp  has chosen Citigroup Inc  and Visa Inc  to run its co-branded credit card starting next year  replacing American Express Co   which lost the coveted tie-up last month.",
        "date": "03022015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Costco ties up with Citigroup  Visa for U.S. co-branded cards "
    },
    {
        "content": "* Visa shares hit all-time high   (Adds comment from Citigroup CFO  analyst)",
        "date": "03022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 3-Costco ties up with Citigroup  Visa for U.S. co-branded cards "
    },
    {
        "content": "FRANKFURT Visa Europe has announced a new  more secure way for consumers to pay retailers via smartphones  a move that could set the stage for Apple's  Apple Pay and rival mobile payment services to be introduced into Europe in the coming months.",
        "date": "02242015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Visa Europe plans new security that could pave way for Apple Pay "
    },
    {
        "content": "March 2 Warehouse club retailer Costco Wholesale Corp said on Monday it had entered into agreements with Citigroup Inc and Visa Inc for co-branded credit cards.",
        "date": "03022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Costco ties up with Citigroup  Visa for co-branded credit cards "
    },
    {
        "content": "Thomson Reuters March 02  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                ",
        "date": "03022015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "* Plans money transfer among Visa users via social networks   (adds details on social media money transfer service; Apple Pay)",
        "date": "02242015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 2-Visa Europe plans new security that could pave way for Apple Pay "
    },
    {
        "content": "MOSCOW  Feb 19 International credit and debit card company Visa Inc has agreed to transfer processing of transactions made on its cards in Russia to a local payment system  Russia's central bank and the company said on Thursday.",
        "date": "02192015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa agrees to process Russian card transactions on local system "
    },
    {
        "content": "NEW YORK American Express Co violated U.S. antitrust law by prohibiting merchants from steering consumers to use lower-cost credit cards  a federal judge ruled on Thursday  in the company's second major setback this month.",
        "date": "02192015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "American Express card rules violated U.S. antitrust law - judge "
    },
    {
        "content": "Feb 18 Samsung Electronics Co Ltd  has bought U.S. mobile wallet startup LoopPay  signalling its intention to launch a smartphone payments service to compete with a recent offering from rival Apple Inc.",
        "date": "02192015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Samsung buys startup LoopPay  moves toward mobile payments "
    },
    {
        "content": "* Shake Shack rises in market debut  Visa to split shares in four",
        "date": "01302015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "REFILE-US STOCKS-Wall St pares losses on energy rebound; Shake Shack  Amazon rally "
    },
    {
        "content": "* Shake Shack rises in market debut  Visa to split shares in four",
        "date": "01302015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St falls on U.S. growth concern; Shake Shack  Amazon rally "
    },
    {
        "content": "* Indexes down: Dow 0.9 pct  S&P 1 pct  Nasdaq 0.6 pct   (Updates to morning trading  adds data  comment)",
        "date": "01302015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St falls on earnings concern; Amazon rallies "
    },
    {
        "content": "Visa Inc   the world's largest credit and debit card company  reported a better-than-expected quarterly profit on Thursday due to a good holiday season and a strengthening U.S. job market that encouraged people to spend.",
        "date": "01302015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa reports better-than-expected profit "
    },
    {
        "content": "Visa Inc   the world's largest credit and debit card company  reported a better-than-expected quarterly profit on Thursday as a strengthening U.S. job market and cheaper gasoline prices encouraged people to spend.",
        "date": "01292015",
        "name": "Visa Inc",
        "news_type": "topStory",
        "symbol": "V",
        "title": "Cheaper gasoline helps Visa report better-than-expected profit "
    },
    {
        "content": "* Indexes up: Dow 1.31 pct  S&P 0.95 pct  Nasdaq 0.98 pct   (Adds Yellen report  Visa share move)",
        "date": "01292015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "US STOCKS-Wall St finishes higher in afternoon rally as oil gains "
    },
    {
        "content": "Jan 29 Visa Inc  the world's largest credit and debit card company  reported an 11.5 percent rise in quarterly profit on Thursday as a strengthening U.S. job market and cheaper gasoline prices encouraged people to spend.",
        "date": "01292015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "Visa's quarterly profit rises 11.5 pct "
    },
    {
        "content": "Jan 22 Monitise Plc  a British mobile banking technology company  said it was reviewing its strategic options and warned that full-year revenue would be below its expectations  blaming its transition to a subscription-based business model.",
        "date": "01222015",
        "name": "Visa Inc",
        "news_type": "normal",
        "symbol": "V",
        "title": "UPDATE 1-Monitise explores strategic review  warns on full-year results "
    }
]