[
    {
        "content": "NEW YORK Vale SA will halt new investments in low-return segments like its nickel business  the company's chief executive officer said on Wednesday.",
        "date": "11152017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale CEO Schvartsman cuts investments in low-return segments "
    },
    {
        "content": "SAO PAULO  Nov 17 Norway's Yara International ASA  a global producer and distributor of fertilizers  has reached an agreement to buy Vale SA's fertilizer complex in Cubatão  Brazil  for $255 million in cash  the company said on Friday.",
        "date": "11172017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Yara buys Vale fertilizer complex in Brazil for $255 million "
    },
    {
        "content": "NEW YORK/VANCOUVER Vale SA  has decided to postpone the sale of a stake in its New Caledonia nickel mine after the initial bids for the asset came in at the lower end of expectations  two people with knowledge of the matter said.",
        "date": "11172017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Exclusive: Vale delays sale of stake in New Caledonia nickel mine - sources "
    },
    {
        "content": "    Nov 14 Britain's FTSE 100 index is seen opening 7 points lower at 7 407.7 on Tuesday  according to financial bookmakers.           * RIO TINTO: Mick Davis  the former head of global miner Xstrata  has emerged as a frontrunner to become the next chairman of Anglo Australian miner Rio Tinto   the Financial Times newspaper reported.       * RIO TINTO: The Indonesian unit of Freeport-McMoRan Inc closed the main access road to its giant Grasberg copper mine in the eastern province of ",
        "date": "11142017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UK Stocks-Factors to watch on Nov 14 "
    },
    {
        "content": "RIO DE JANEIRO Brazil's miner Vale SA said on Wednesday it had received bids to invest in its New Caledonia nickel project as the company reevaluates its nickel business.",
        "date": "11082017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale says received bids for New Caledonia nickel project "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO Iron ore output at Brazil's Vale SA  should rise to 390 million tonnes next year  the world's largest iron ore producer said on Thursday  after a surge in third quarter profit on rising prices fell shy of analyst estimates.",
        "date": "10262017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale third-quarter profit surges  sees pickup in 2018 iron ore output "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO  Oct 26 Iron ore output at Brazil's Vale SA should rise to 390 million tonnes next year  the world's largest iron ore producer said on Thursday  after a surge in third quarter profit on rising prices fell shy of analyst estimates.",
        "date": "10262017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Vale Q3 profit surges  sees pickup in 2018 iron ore output "
    },
    {
        "content": "Surging prices for gasoline and diesel in the aftermath of Hurricane Harvey spiked margins to a more than two-year high  helping two big U.S. refiners record quarterly profits on Thursday that blew past Wall Street estimates.",
        "date": "10262017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Harvey drives U.S. refiner margins  helps beat profit estimates "
    },
    {
        "content": "RIO DE JANEIRO Brazilian miner Vale SA  should produce 10 million tonnes more pellets in 2019 compared to 2017  an executive of the world's top iron ore producer said in a conference call on Thursday.",
        "date": "10262017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale sees pellet output up by 10 million tonnes in 2019 "
    },
    {
        "content": "RIO DE JANEIRO  Oct 26 Brazilian miner Vale SA should produce 10 million tonnes more pellets in 2019 compared to 2017  an executive of the world's top iron ore producer said in a conference call on Thursday.",
        "date": "10262017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale sees pellet output up by 10 mln tonnes in 2019 "
    },
    {
        "content": "RIO DE JANEIRO  Oct 26 Brazilian miner Vale will ramp up iron ore production to 390 million tonnes next year and 400 million tonnes in 2019  executives at the world's top iron ore producer said in a call following results on Thursday.",
        "date": "10262017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale eyes big pickup in iron ore output next year "
    },
    {
        "content": "RIO DE JANEIRO  Oct 19 Brazil's Vale SA   the world's largest iron ore producer  said on Thursday its production in the third quarter hit a fresh quarterly record  boosted by a ramp-up at its S11D mine.",
        "date": "10192017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale reports record iron ore output in Q3 "
    },
    {
        "content": "RIO DE JANEIRO  Oct 19 Brazil's Vale SA   the world's largest iron ore producer  said on Thursday that its output in the third quarter rose 3.3 percent compared with the same period last year to hit a fresh quarterly record of 95.1 million tonnes.",
        "date": "10192017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale reports record iron ore output in Q3 "
    },
    {
        "content": "RIO DE JANEIRO  Oct 26 Brazil's Vale SA posted net income that fell short of estimates in the third quarter  the world's largest iron ore producer said on Thursday.",
        "date": "10262017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale profit surges in Q3  misses estimates "
    },
    {
        "content": "RIO DE JANEIRO The remaining preferred shareholders of Brazil's Vale SA  on Wednesday voted to accept a plan obliging them to convert their shares into a single stock class  finalizing a process that is part of the miner's bid to improve corporate governance.",
        "date": "10182017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil miner Vale seals share conversion  elects new board members "
    },
    {
        "content": "RIO DE JANEIRO  Oct 18 The remaining preferred shareholders of Brazil's Vale SA on Wednesday voted to accept a plan obliging them to convert their shares into a single stock class  finalizing a process that is part of the miner's bid to improve corporate governance.",
        "date": "10182017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil miner Vale seals share conversion  elects new board members "
    },
    {
        "content": "* Brazil's mining company Vale says  measures to improve iron ore price realization should add $400-600 million to adjusted Ebitda in 2nd half 2017 - presentation",
        "date": "09202017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BRIEF-Vale sees net debt falling to $14-16 bln by year end "
    },
    {
        "content": "BELO HORIZONTE  Sept 18 Mining reforms in Brazil are raising the cost of operating without generating increased interest in investing in the sector  an executive for world's largest iron ore producer Vale  said on Monday.",
        "date": "09182017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "REFILE-Brazil mining reform is raising costs for industry - Vale exec "
    },
    {
        "content": "BRASILIA A fire disrupted operations at a Vale Fertilizantes plant in Brazil's southeastern state of Minas Gerais on Thursday  the company said.",
        "date": "09212017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Fire disrupts Vale Fertilizantes plant in Brazil "
    },
    {
        "content": "SAO PAULO Shares in Cia Energética de Minas Gerais SA posted their biggest intraday jump in three weeks on Tuesday  on optimism the debt-laden Brazilian power utility could participate in an upcoming auction for the licensing rights of several hydropower dams it recently lost.",
        "date": "09122017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Cemig jumps as partner Vale signals bid for Brazil dams "
    },
    {
        "content": "BRASILIA  Sept 21 A fire disrupted operations at a Vale Fertilizantes plant in Brazil's southeastern state of Minas Gerais on Thursday  the company said.",
        "date": "09212017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "REFILE-Fire disrupts Vale Fertilizantes plant in Brazil "
    },
    {
        "content": "SAO PAULO Vale said on Thursday it will appeal a court decision forcing the Brazilian miner to halt operations at Amazonian nickel mine Onça Puma until it takes measures benefiting a local indigenous community.",
        "date": "09152017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale vows to appeal court decision halting nickel mine "
    },
    {
        "content": "SAO PAULO  Aug 28 Brazilian miner Vale SA redeemed $1 billion worth of 2019 bonds issued through a subsidiary abroad and announced a tender offer for up to $750 million worth of debt maturing in 2020  according to a securities filing on Monday.",
        "date": "08282017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale redeems $1 bln in debt  announces $750 mln tender offer "
    },
    {
        "content": "SAO PAULO Previ Caixa de Previdência [PREVI.UL] has yet to decide when it will reduce a majority stake in Vale SA and other companies in which it is a relevant shareholder  as Brazil's biggest pension fund aims to have less concentrated equity holdings  a senior executive said.",
        "date": "08242017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Previ has no timetable for Vale stake sale  eyes upcoming IPOs "
    },
    {
        "content": "TOKYO Japanese trading firm Mitsui & Co Ltd said on Tuesday it would book an after-tax profit of about 89 billion yen ($810 million) in the July-September second quarter on Brazil's Vale's stock conversion plan.",
        "date": "08152017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Mitsui to book $810 million after-tax profit in second-quarter on Vale's stock conversion plan "
    },
    {
        "content": "SAO PAULO/RIO DE JANEIRO Bigger-than-expected shareholder support in Vale SA's  stock conversion plan could lead the world's No. 1 iron ore producer to accelerate the listing of common shares in Brazil's strictest market segment and lure a boarder base of investors.",
        "date": "08142017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale gauges how to speed listing in strictest Brazil market "
    },
    {
        "content": "SAO PAULO/RIO DE JANEIRO  Aug 14 (Reuters) - B igger-than-expected shareholder backing for Vale SA's stock conversion plan could lead the world's No. 1 iron ore producer to speed up the listing of common shares in Brazil's strictest market to lure a broader investor base.",
        "date": "08142017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Vale works to speed up listing in strictest Brazil market "
    },
    {
        "content": "SAO PAULO/RIO DE JANEIRO  Aug 14 (Reuters) - B igger-than-expected shareholder support in Vale SA's stock conversion plan could lead the world's No. 1 iron ore producer to accelerate the listing of common shares in Brazil's strictest market segment and lure a boarder base of investors.",
        "date": "08142017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "REFILE-UPDATE 1-Vale gauges how to speed listing in strictest Brazil market "
    },
    {
        "content": "SAO PAULO/RIO DE JANEIRO  Aug 14 Vale SA could list common shares in Brazil's strictest listing market segment as early as this year  depending on how it can convince preferred holdouts to convert their shares  executives said on Monday. (Reporting by Guillermo Parra-Bernal and Marta Nogueira; Editing by Chizu Nomiyama)",
        "date": "08142017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale's Novo Mercado listing could come as early as this year "
    },
    {
        "content": "SAO PAULO  Aug 14 Bigger-than-expected shareholder support in Vale SA's stock conversion plan is leading the world's No. 1 iron ore producer to accelerate the listing of common shares in Brazil's strictest listing segment  executives said on Monday.",
        "date": "08142017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale gauges ways to accelerate listing in strictest chapter "
    },
    {
        "content": "SAO PAULO Investors in Brazil's Vale SA have overwhelmingly agreed to swap their preferred stock into common shares  handling the world's No. 1 iron ore producer a victory in a plan that will give equal votes to all shareholders and limit government meddling.",
        "date": "08112017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale investors overwhelmingly join share conversion plan "
    },
    {
        "content": "SAO PAULO  Aug 10 Investors in Brazil's Vale SA have overwhelmingly agreed to swap their preferred stock into common shares  handling the world's No. 1 iron ore producer a victory in a plan that will give equal votes to all shareholders and limit government meddling.",
        "date": "08112017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale investors overwhelmingly join share conversion plan "
    },
    {
        "content": "SAO PAULO  Aug 10 Brazilian miner Vale SA has reached a mininum threshold set for a proposed voluntary share conversion  after about 72 percent of current shareholders agreed to swap their preferred stock into common shares.",
        "date": "08112017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale reaches mininum threshold for voluntary share conversion "
    },
    {
        "content": "SAO PAULO Brazilian mining company Vale SA on Friday said 84.4 percent of current shareholders agreed to swap their preferred stock into common shares  guaranteeing the success of the country's largest ever corporate reorganization  at $21 billion.",
        "date": "08122017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale says 84.4 percent of shareholders join share swap "
    },
    {
        "content": "RIO DE JANEIRO A plan to merge Vale SA's different classes of stock into a single  common one should help the world's No. 1 iron ore producer lure more Asian investors and specialized mining and metals funds as shareholders  Chief Financial Officer Luciano Siani told the Reuters Latin American Investment Summit.",
        "date": "08082017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale CFO Siani sees share conversion plan luring more global investors "
    },
    {
        "content": "SAO PAULO Brazilian mining company Vale SA on Wednesday said it has sold two ships with a capacity to carry 400 000 tonnes of iron ore each for a total of $178 million.",
        "date": "08092017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale sells two large ore carriers for $178 million "
    },
    {
        "content": "SAO PAULO  Aug 9 Brazilian mining company Vale SA on Wednesday said it has sold two ships with a capacity to carry 400 000 tonnes of iron ore each for a total of $178 million.",
        "date": "08092017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale sells two large ore carriers for $178 mln "
    },
    {
        "content": "Aug 1 Mosaic Co CEO Joc O'Rourke said on Tuesday:",
        "date": "08012017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BRIEF-Mosaic CEO says unwilling to sell potash business at current valuation "
    },
    {
        "content": "SAO PAULO  Aug 1 Brazilian mining company Vale SA dismissed as speculative a news report saying it planned to buy a stake in Samarco Mineração SA from Australian partner BHP Biliton Ltd  according to a securities filing on Tuesday.",
        "date": "08012017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale calls 'speculative' news it plans to buy stake in Samarco "
    },
    {
        "content": "SYDNEY/RIO DE JANEIRO BHP Billiton on Tuesday denied commentary in a Brazilian newspaper that it has agreed to sell its stake in the Samarco iron ore mine to its partner Vale.",
        "date": "08012017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BHP denies it has agreed to sell Samarco stake to Vale "
    },
    {
        "content": "    By Bruno Federowski     SAO PAULO  July 25 Brazilian stocks hit a one-month high on Tuesday as a rally in the prices of commodity boosted shares of local blue-chips Vale SA and Petróleo Brasileiro SA.     China-listed iron ore futures also snapped a three-day losing streak on the back of China's strong steel sector  lifting shares in Vale  the world's largest iron ore miner. Bradespar SA  a key Vale shareholder  were the biggest gainers on Brazil's benchmark Bovespa stock index. ",
        "date": "07252017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil stocks hit one-month high on commodities boost "
    },
    {
        "content": "RIO DE JANEIRO Brazilian miner Vale SA  said on Thursday it would seek out fresh copper mining options and stop expanding nickel production capacity after second-quarter net income plunged on forex losses  rising costs and weaker iron ore prices.",
        "date": "07272017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Miner Vale to look toward copper after second-quarter miss "
    },
    {
        "content": "RIO DE JANEIRO  July 27 Brazilian miner Vale SA said on Thursday it would seek out fresh copper mining options and stop expanding nickel production capacity after second-quarter net income plunged on forex losses  rising costs and weaker iron ore prices.",
        "date": "07272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Miner Vale to look toward copper after 2nd-quarter miss "
    },
    {
        "content": "RIO DE JANEIRO The chief executive officer of Brazil's Vale said on Thursday that the world's top iron ore producer would seek to lower net debt to $15 billion next year.",
        "date": "07272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale CEO says hopes to reach $15 billion in net debt in 2018 "
    },
    {
        "content": "RIO DE JANEIRO  July 27 The chief executive officer of Brazil's Vale said on Thursday that the world's top iron ore producer would seek to lower net debt to $15 billion next year.",
        "date": "07272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale CEO says hopes to reach $15 bln in net debt in 2018 "
    },
    {
        "content": "RIO DE JANEIRO  July 27 Executives at Brazil's Vale said on Thursday the world's top producer of iron ore would continue cutting capital expenditure and was eyeing a net debt goal of less than $15 billion  without specifying a time frame.",
        "date": "07272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale to cut capex  eyes net debt goal of under $15 bln "
    },
    {
        "content": "SAO PAULO  July 27 Brazil's Vale SA posted net income that missed estimates in the second quarter  weighed down by a weaker currency and writedowns on the value of several assets  the world's largest iron ore producer said on Thursday.",
        "date": "07272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale net income drops on FX  asset writedowns "
    },
    {
        "content": "SAO PAULO  July 18 Vale SA on Tuesday said a Brazilian judge suspended a lawsuit over the miner Samarco Mineração SA's dam collapse in November 2015.",
        "date": "07182017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Miner Vale says Brazilian judge suspended lawsuit against companies for Samarco accident "
    },
    {
        "content": "RIO DE JANEIRO Brazil's Vale SA  the world's largest iron ore producer  said on Thursday that iron ore output would close the year near the bottom of its forecast of 360 million to 380 million tonnes  despite record second-quarter production.",
        "date": "07202017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale eyes 2017 iron ore output at low end of forecast "
    },
    {
        "content": "RIO DE JANEIRO  July 20 Brazil's Vale SA   the world's largest iron ore producer  said on Thursday that iron ore output would close the year near the bottom of its forecast of 360 million to 380 million tonnes  despite record second-quarter production.",
        "date": "07202017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Brazil's Vale eyes 2017 iron ore output at low end of forecast "
    },
    {
        "content": "RIO DE JANEIRO  July 20 Brazil's Vale SA   the world's largest iron ore producer  said on Thursday that second-quarter iron ore output rose 5.8 percent compared with the same period last year  hitting a fresh high for an April-to-June period.",
        "date": "07202017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale iron ore output hits 2nd-qtr record "
    },
    {
        "content": "MELBOURNE Brazil's Vale is reassessing its loss-making New Caledonian nickel operations as part of a wider review of low performing assets after new Chief Executive Fabio Schvartsman took charge last month  a spokesman said.",
        "date": "07042017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale says loss-making New Caledonia nickel operations under review "
    },
    {
        "content": "SAO PAULO  June 28 The high correlation between iron ore price trends and cash generation at Vale SA shows the dependence that the world's No. 1 producer of the mineral has on that segment  a presentation to investors showed on Tuesday.",
        "date": "06282017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale's cash generation dependent on ore price  CEO says "
    },
    {
        "content": "RIO DE JANEIRO  June 27 Shareholders of Vale SA on Tuesday approved a plan to make the world's No. 1 iron ore producer a company with dispersed share ownership  the press office said  in a landmark step aimed at enhancing transparency and equal rights.",
        "date": "06272017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale shareholders approve conversion of shares "
    },
    {
        "content": "SYDNEY BHP Billiton   and Vale  have won a four-month extension from a Brazilian court to negotiate a settlement to a $47 billion claim stemming from the Samarco mine disaster in 2015  BHP said on Friday.",
        "date": "06302017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Court gives BHP  Vale until October 30 to settle $47 billion Samarco claim "
    },
    {
        "content": "SAO PAULO Vale SA intends to extend $76 million in short-term credit facilities to iron ore miner Samarco Mineração SA  its joint venture with BHP Billiton Ltd  which halted operations a year and a half ago after a dam burst.",
        "date": "06292017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale to extend $76 million credit facility to Samarco "
    },
    {
        "content": "SAO PAULO  June 29 Vale SA intends to extend $76 million in short-term credit facilities to iron ore miner Samarco Mineração SA  its joint venture with BHP Billiton Ltd   which halted operations a year and a half ago after a dam burst.",
        "date": "06292017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale to extend $76 mln credit facility to Samarco "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO Consulting firms ISS and Glass Lewis have given a nod of approval to a restructuring plan for Brazilian miner Vale SA    boosting the chances of shareholder approval  a source said on Wednesday.",
        "date": "06142017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "ISS  Glass Lewis approve restructuring at Brazil's Vale: source "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO  June 14 Consulting firms ISS and Glass Lewis have given a nod of approval to a restructuring plan for Brazilian miner Vale SA   boosting the chances of shareholder approval  a source said on Wednesday.",
        "date": "06142017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "ISS  Glass Lewis approve restructuring at Brazil's Vale -source "
    },
    {
        "content": "SAO PAULO  June 9 Brazilian mining firm Vale SA said on Friday it had lined up a five-year $2 billion revolving credit facility  replacing a five-year $2 billion line agreed in 2013.",
        "date": "06092017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale signs $2 bln credit line  replacing 2013 agreement "
    },
    {
        "content": "SAO PAULO Vale SA  the world's largest iron ore miner  intends to resume growth with acquisitions and diversification  new Chief Executive Officer Fabio Schvartsman told analysts on Friday.",
        "date": "05262017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale new CEO eyes acquisition  diversification: analyst reports "
    },
    {
        "content": "NEW YORK Shares in Brazilian state-controlled oil company Petroleo Brasileiro SA and iron ore miner Vale SA both plunged in U.S. after-hours electronic trading following a report that the country's president was taped backing the payment of a bribe to thwart a corruption probe.",
        "date": "05182017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Petrobras  Vale ADRs plunge after new Brazil corruption allegations "
    },
    {
        "content": "SAO PAULO  May 11 The controlling shareholder of Vale SA proposed on Thursday a definitive swap ratio of 0.9342 common share per preferred stock as part of a plan to transform the world's No. 1 iron ore producer into a company with dispersed share ownership.",
        "date": "05112017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale's top shareholder unveils definitive terms for reorganization "
    },
    {
        "content": "SAO PAULO Vale SA's  board approved on Thursday a definitive swap ratio of 0.9342 common share per preferred stock as part of a plan to transform the world's No. 1 iron ore producer into a company with dispersed share ownership.",
        "date": "05122017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale's board approves top shareholder proposal for reorganization "
    },
    {
        "content": "SAO PAULO  May 11 Vale SA's board approved on Thursday a definitive swap ratio of 0.9342 common share per preferred stock as part of a plan to transform the world's No. 1 iron ore producer into a company with dispersed share ownership.",
        "date": "05122017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale's board approves top shareholder proposal for reorganization "
    },
    {
        "content": "SAO PAULO  May 5 Brazilian miner Vale SA aims to save $70 million by 2020 through a combined management system for iron ore and manganese production  replacing 17 prior systems  according to an emailed statement on Friday.",
        "date": "05052017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale sees $70 mln in savings from new systems by 2020 "
    },
    {
        "content": "SAO PAULO/RIO DE JANEIRO  April 27 Shares in Vale SA slumped the most in two weeks on Thursday  as executives signaled lackluster trends for iron ore prices this year and investors reacted to a first-quarter profit miss with disappointment.",
        "date": "04272017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale slumps as ore price outlook  profit disappoints "
    },
    {
        "content": "SAO PAULO  April 27 The market for iron ore remains well balanced at this point  as less supply is expected and as prices tend to find support above last year's levels  executives at Vale SA said on Thursday.",
        "date": "04272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale sees robust ore prices this year  market 'well balanced' "
    },
    {
        "content": "SAO PAULO  April 27 Vale SA  the world's largest iron ore producer  posted net income that missed estimates in the first quarter  reflecting the impact of heavy rains that hampered output in a key mine and increasing financial expenses.",
        "date": "04272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale misses profit estimates as revenue falls "
    },
    {
        "content": "    By Bruno Federowski     SAO PAULO  April 20 Brazilian stocks gained on Thursday  supported by a rally in shares of miner Vale SA  following solid first-quarter production figures.     Vale's iron ore output fell 6.7 percent on a quarterly basis due to seasonal effects  but jumped 11.2 percent from a year ago to a record high for the period.     The company's shares rose as much as 4.9 percent  adding the most points of any stock to Brazil's benchmark Bovespa index . Analysts at I",
        "date": "04202017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil stocks rise as Vale rallies on output data "
    },
    {
        "content": "SAO PAULO  April 20 Vale SA's first-quarter iron ore output fell 6.7 percent as seasonal rainfalls in a fast-growing mine in northern Brazil hampered extraction and the world's No. 1 producer of the raw material sought to rein in production at low-margin facilities.",
        "date": "04202017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale's first-quarter output falls on weather  keeps guidance "
    },
    {
        "content": "SAO PAULO  April 20 Vale SA's first-quarter iron ore output fell 6.7 percent as seasonal rainfalls in a fast-growing mine in northern Brazil hampered extraction and the world's No. 1 producer of the raw material sought to rein in production at low-margin facilities.",
        "date": "04202017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale's first-quarter output falls on weather; reiterates guidance "
    },
    {
        "content": "SAO PAULO  April 3 Brazilian miner Vale SA said on Monday that 260 000 tonnes of fine iron ore on a South Korean ship that sank in the South Atlantic had been insured.",
        "date": "04032017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale says 260 000 tns iron ore on sunken ship was insured "
    },
    {
        "content": "    SAO PAULO  March 28 Brazilian shares rose on Tuesday  supported by rising shares of Vale SA after the world's No. 1 ore producer tapped a commodities industry veteran as its next chief executive officer.     Preferred shares in Vale rose 1.7 percent  adding the most points to the benchmark Bovespa stock index  following the appointment of Fabio Schvartsman  who has been CEO of Klabin SA  Brazil's largest paper and cardboard producer  for the past six years.     Klabin units  a bl",
        "date": "03282017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil shares rise after Vale taps veteran executive as CEO "
    },
    {
        "content": "SAO PAULO  March 29 Brazil's mining company Vale SA on Wednesday said Aberdeen Asset Management PLC  on behalf of minority shareholders  nominated Isabella Saboya to join the company's board.",
        "date": "03292017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale minority shareholders nominate candidate to board "
    },
    {
        "content": "SAO PAULO Vale SA surprised investors with the appointment of Fabio Schvartsman as chief executive officer on Monday  choosing a commodities industry veteran to lead transformation of the world's No. 1 ore producer into a company with dispersed share ownership.",
        "date": "03282017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale taps veteran executive Schvartsman as new CEO "
    },
    {
        "content": "BRASILIA  March 27 Brazilian mining company Vale SA said on Monday it has concluded the sale of a stake in Mozambique's Moatize coal project to Japan's Mitsui & Co Ltd and received an initial payment of $733 million  the company said in a security filing.",
        "date": "03272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale sells stake in Moatize coal mine to Mitsui "
    },
    {
        "content": "SAO PAULO  March 24 Brazilian miner Vale SA  said on Friday the United States District Court for the Southern District of New York annulled the majority of a class action lawsuit against the company and executives over the collapse of a tailings dam in Brazil in 2015.",
        "date": "03242017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale says U.S. court annuls most of class action over dam disaster "
    },
    {
        "content": "SAO PAULO  March 27 Vale SA surprised investors with the appointment of Fabio Schvartsman as chief executive officer on Monday  choosing a commodities industry veteran to lead transformation of the world's No. 1 ore producer into a company with dispersed share ownership.",
        "date": "03282017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale taps veteran executive Schvartsman as new CEO "
    },
    {
        "content": "BRASILIA  March 27 Brazilian miner Vale SA  said on Monday it has wrapped up the sale of a stake in Mozambique's Moatize coal project to Japan's Mitsui & Co Ltd  and received an initial payment of $733 million  the company said in a security filing.",
        "date": "03272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale sells stake in Moatize coal mine to Mitsui "
    },
    {
        "content": "SAO PAULO  March 24 Brazilian miner Vale SA  said on Friday the United States District Court for the Southern District of New York annulled nearly all parts of a class action lawsuit against the company and executives over the collapse of a tailings dam in Brazil in 2015.",
        "date": "03242017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale says U.S. court annuls class action over dam disaster "
    },
    {
        "content": "BRASILIA  March 27 The board of Brazilian miner Vale elected as chief executive Fabio Schvartsman  who currently heads wood pulp and paper producer Klabin SA   the company said in a securities filing on Monday.",
        "date": "03272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazilian iron ore miner Vale picks Fabio Schvartsman as new CEO "
    },
    {
        "content": "SAO PAULO  March 27 Brazilian miner Vale  will name as chief executive Fabio Schvartsman  who currently heads wood pulp and paper producer Klabin SA   according to a report on the website of newspaper O Estado de S. Paulo on Monday.",
        "date": "03272017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil miner Vale to name Klabin's Schvartsman as CEO -newspaper "
    },
    {
        "content": "RIO DE JANEIRO Brazilian iron ore miner Vale SA said on Thursday that a federal court in Minas Gerais has suspended a case brought by prosecutors seeking 155 billion reais ($49.7 billion) in damages for the 2015 Samarco mine disaster.",
        "date": "03172017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil court suspends lawsuit over Samarco mine disaster: Vale "
    },
    {
        "content": "RIO DE JANEIRO  March 16 Brazilian iron ore miner Vale SA said on Thursday that a federal court in Minas Gerais has suspended a case brought by prosecutors seeking 155 billion reais ($49.7 billion) in damages for the 2015 Samarco mine disaster.",
        "date": "03162017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale says Brazil court suspends Samarco damages lawsuit to help deal "
    },
    {
        "content": "RIO DE JANEIRO  March 16 Brazilian iron ore miner Vale SA said on Thursday that a federal court in Minas Gerais has suspended a case brought by prosecutors seeking 155 billion reais ($49.7 billion) in damages for the 2015 Samarco mine disaster.",
        "date": "03172017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil court suspends lawsuit over Samarco mine disaster - Vale "
    },
    {
        "content": "SAO PAULO Brazilian mining company Vale SA said on Wednesday it is nearing conclusion of a deal to sell a stake in Mozambique's Moatize coal project to Japan's Mitsui & Co Ltd.",
        "date": "03152017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale to get $733 million by month-end from Moatize stake sale to Mitsui "
    },
    {
        "content": "SAO PAULO  March 15 Brazilian mining company Vale SA said on Wednesday it is nearing conclusion of a deal to sell a stake in Mozambique's Moatize coal project to Japan's Mitsui & Co Ltd.",
        "date": "03152017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale to get $733 mln by month-end from Moatize stake sale to Mitsui "
    },
    {
        "content": "SAO PAULO  March 15 Brazilian mining company Vale SA said on Wednesday it is nearing conclusion of a deal to sell a stake in Mozambique's Moatize coal project to Japan's Mitsui & Co Ltd.",
        "date": "03152017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale to get $733 mln by end of month from Moatize stake sale to Mitsui "
    },
    {
        "content": "SAO PAULO  March 10 Shares in Vale SA fell on Friday  bringing their losses over the past two weeks to nearly a fifth  as investors fretted over the impact of a potential drop in iron ore prices on the world's largest producer of the steel-making raw material.",
        "date": "03102017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Doubts over iron ore outlook cap rally in Brazil's Vale shares "
    },
    {
        "content": "SAO PAULO  March 10 Brazilian mining company Vale SA  the world's largest iron ore producer  has hired head hunter Spencer Stuart to find a successor to Chief Executive Officer Murilo Ferreira  the company said in a Friday statement.",
        "date": "03102017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil miner Vale hires head hunter to find CEO successor by May "
    },
    {
        "content": "* Iron ore price nearly doubles in a year  closing in on $100/T",
        "date": "03022017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Back from the dead? Chinese iron ore miners plot return as prices surge "
    },
    {
        "content": "SAO PAULO Vale SA has stepped up the search for a new chief executive officer as Murilo Ferreira announced his departure  signaling efforts by some top shareholders to shield the world's No. 1 iron producer from political interference  three people with direct knowledge of the situation said on Friday.",
        "date": "02242017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale intensifies CEO search as Ferreira to quit: sources "
    },
    {
        "content": "BRASILIA  Feb 23 Brazilian miner Vale SA  expects the global price of iron ore to average above $80 per tonne in 2017  on the back of increasing steel demand and a smaller rise in new production entering the market  the company's executive director of ferrous minerals said on Thursday.",
        "date": "02232017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale sees iron ore price above $80/tonne in 2017 "
    },
    {
        "content": "SAO PAULO  Feb 22 Vale SA  the world's largest iron ore producer  will redeem next month 750 million euros ($792 million) of bonds that mature in March 2018.",
        "date": "02222017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale to redeem next month $792 mln in bonds maturing in March 2018 "
    },
    {
        "content": "SAO PAULO  Feb 24 Vale SA has stepped up the search for a new chief executive officer as Murilo Ferreira announced his departure  signaling efforts by some top shareholders to shield the world's No. 1 iron producer from political interference  three people with direct knowledge of the situation said on Friday.",
        "date": "02242017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 5-Vale intensifies CEO search as Ferreira to quit -sources "
    },
    {
        "content": "BRASILIA  Feb 23 Brazilian miner Vale SA  expects the global price of iron ore to average above $80 per tonne in 2017  on the back of increasing steel demand and a smaller rise in new production entering the global market  the company's Executive Director of Ferrous Minerals Peter Poppinga said on Thursday.     (Reporting by Stephen Eisenhammer Editing by W Simon)",
        "date": "02232017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale sees iron ore price above $80/tonne in 2017 "
    },
    {
        "content": "BRASILIA  Feb 23 Brazilian miner Vale SA  reported on Thursday net profit of $525 million for the fourth quarter  falling short of analyst expectations but reversing a heavy loss in the period a year earlier thanks to record output and higher iron ore prices.",
        "date": "02232017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale swings to profit on higher iron ore prices "
    },
    {
        "content": "* Vale  former CSA partner  fails to receive earn-out   (Adds details on Vale earn-out clause in last two paragraphs  updates share price)",
        "date": "02222017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 4-Thyssenkrupp ends costly Americas venture with CSA sale to Ternium "
    },
    {
        "content": "BRASILIA  Feb 24 Murilo Ferreira  chief executive of Vale SA  said on Friday he did not know who will succeed him when he steps down from the helm of the Brazilian miner in May.",
        "date": "02242017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale CEO says he does not know who will succeed him "
    },
    {
        "content": "SAO PAULO  Feb 24 Murilo Ferreira will step down as chief executive officer of Vale SA when his term expires on May 26  the world's No. 1 iron ore producer said on Friday.",
        "date": "02242017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale CEO Ferreira to step down after term expires in May "
    },
    {
        "content": "BRASILIA  Feb 23 Brazilian miner Vale SA  said on Thursday its board had approved that a dividend of 4.7 billion reais ($1.53 billion)  or 0.91 reais per share  be paid to shareholders.",
        "date": "02232017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale approves dividend of 4.7 bln reais "
    },
    {
        "content": "BRASILIA  Feb 23 Brazilian miner Vale SA  on Thursday reported net profit of $525 million for the fourth quarter  falling short of analyst expectations after booking impairments.",
        "date": "02232017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale posts Q4 net profit of $525 mln "
    },
    {
        "content": "RIO DE JANEIRO  Feb 19 The largest shareholders of Vale SA have decided to dissolve an investment holding company through which they controlled the world's biggest iron ore producer for 20 years  newspaper O Globo reported on Sunday.",
        "date": "02192017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Top Vale shareholders plan to end holding company -report "
    },
    {
        "content": " (Updates prices)     By Bruno Federowski     SAO PAULO  Feb 20 Brazilian stocks rose to a nearly six-year high on Monday after miner Vale SA unveiled a proposal to become a company with no defined controlling shareholders.     Shares of Vale  the world's largest iron ore producer  gained nearly 7 percent  driving gains in Brazil's benchmark Bovespa stock index  which rose 1.16 percent.     Shares in Bradespar  a key shareholder in holding company Valepar SA  posted their biggest int",
        "date": "02202017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil stocks hit near 6-yr high on Vale shareholder proposal "
    },
    {
        "content": "    By Bruno Federowski     SAO PAULO  Feb 20 Brazilian stocks rose on Monday after miner Vale SA unveiled a proposal to become a company with no defined controlling shareholders.     Shares of Vale added the most points to Brazil's benchmark Bovespa stock index  which rose 0.9 percent.     Shares in Bradespar  a key shareholder in holding company Valepar SA  posted their biggest intraday jump ever  adding as much as 20 percent.     Analysts said the accord increases the value of Bra",
        "date": "02202017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil stocks rise on new Vale shareholder accord "
    },
    {
        "content": "BRASILIA  Feb 16 Brazilian miner Vale SA  said on Thursday it produced a record 349 million tonnes of iron ore in 2016  above its own guidance  helped by strong performance at mines in northern Brazil and the successful start of its new S11D mine.",
        "date": "02162017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale produced record 349 mln tonnes of iron ore in 2016 "
    },
    {
        "content": "SAO PAULO  Feb 20 At least 54 percent of holders of Vale SA's preferred shares must approve a proposal by the company's controlling bloc to transform their stock into common shares  executives at the world's largest iron ore producer said on Monday.",
        "date": "02202017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale needs 54 pct shareholder approval for share conversion "
    },
    {
        "content": "BRASILIA  Feb 16 Brazilian miner Vale SA  said on Thursday it produced a record 349 million tonnes of iron ore in 2016  above its own guidance  helped by the successful ramping up of its new S11D mine in the Amazon.",
        "date": "02162017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale produced record 349 mln tonnes of iron ore in 2016 "
    },
    {
        "content": "SAO PAULO  Feb 20 Brazilian miner Vale SA will become a company with dispersed share ownership  it said on Monday  in a move aimed at enhancing transparency and equal rights for all shareholders in the world's largest iron ore producer.",
        "date": "02202017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale readies for diluted ownership as partners renew accord "
    },
    {
        "content": "SAO PAULO  Feb 13 Vale SA's top non-government shareholders want Chief Executive Officer Murilo Ferreira in the job for another two years to stem pressure from Brazilian politicians to appoint an ally at the helm of the world's No. 1 iron ore producer  newspaper Valor Econômico said on Monday.",
        "date": "02132017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Key Vale partners want to keep CEO to stem political pressure -Valor "
    },
    {
        "content": "SAO PAULO After Norway's Yara pulled out as a potential bidder  Vale SA  has resumed searching for a buyer for four fertilizer plants that were not included in a $2.5 billion sale to Mosaic Co  according to three people with direct knowledge of the matter.",
        "date": "02152017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Exclusive: Vale resumes search for Cubatão fertilizer assets buyer - sources "
    },
    {
        "content": "SAO PAULO  Feb 6 Vale SA plans to reopen a 2026 bond issue and use the proceeds to redeem bonds maturing in March 2018  the Brazilian miner said in a Monday securities filing.",
        "date": "02062017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale plans to reopen 2026 issue  redeem 2018 bonds "
    },
    {
        "content": "RIO DE JANEIRO  Feb 2 Brazilian miner Vale SA  is more optimistic than the market consensus in terms of iron ore prices for 2017  Investor Relations Director Andre Figueiredo told reporters on Thursday.",
        "date": "02022017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale more optimistic than market on iron ore prices -exec "
    },
    {
        "content": "By Bruno Federowski     SAO PAULO  Jan 24 Brazilian stocks hit a nearly five-year high on Tuesday as rising prices of commodities boosted shares of miner Vale SA and state-controlled oil company Petrobras.     Shares of Vale  the world's largest iron ore producer  rose to their highest since January 2013 as China iron ore futures rebounded after a four-day retreat.     Some traders bet demand for basic metals will pick up following the Lunar New Year break as Beijing acts to boost ec",
        "date": "01242017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil stocks at highest in nearly 5 years on rising commodities "
    },
    {
        "content": "SAO PAULO Shares in Brazilian miner Vale SA will continue to rise after more than doubling last year  even as iron ore prices turn lower  analysts at Itaú BBA told Reuters.",
        "date": "01232017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazilian miner Vale's stock rally far from over: Itaú BBA "
    },
    {
        "content": "SAO PAULO Leading shareholders of Vale SA are close to endorsing a plan to turn the world's No. 1 iron ore producer into a company with  dispersed share ownership within six years  two people familiar with the talks said.",
        "date": "01192017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "New Vale pact seeks dispersed share ownership in six years: sources "
    },
    {
        "content": "BRASILIA  Jan 16 Brazilian miner Vale SA  said on Monday it has loaded the first commercial shipment of iron ore from its giant new mine in the Amazon known as S11D.",
        "date": "01162017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale loads first ore from new S11D mine "
    },
    {
        "content": "SAO PAULO  Jan 18 Brazilian stocks held near a 10-week high on Wednesday as shares of miner Vale SA jumped on hopes that the renewal of a shareholder agreement could improve corporate governance.     Local newspaper Valor Econômico reported that Vale's controlling shareholders have discussed grouping the miner's common and preferred shares as part of the renewal.      Analysts at Banco BTG Pactual SA said the changes to corporate governance included in the revised accord could unlock",
        "date": "01182017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil stocks near 10-week high as Vale rallies "
    },
    {
        "content": "SAO PAULO  Jan 19 Leading shareholders of Vale SA are close to endorsing a plan to turn the world's No. 1 iron ore producer into a company with  dispersed share ownership within six years  two people familiar with the talks said.",
        "date": "01192017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-New Vale pact seeks dispersed share ownership in six years -sources "
    },
    {
        "content": "By Bruno Federowski     SAO PAULO  Jan 16 The Mexican peso weakened on Monday after U.S. President-elect Donald Trump threatened to slap tariffs on German carmakers  which are stepping up production in low-cost Mexican plants.     In an interview with German newspaper Bild  Trump warned he would impose a border tax of 35 percent on vehicles imported to the U.S. market  following campaign promises to revive U.S. industrial jobs and curtail imports from Mexico.      Earlier this month ",
        "date": "01162017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Mexico peso weakens on Trump auto tariff threat "
    },
    {
        "content": "BRASILIA Top shareholders of Vale SA are discussing whether merging the Brazilian miner's two classes of stock as part of efforts to renew a shareholder accord that expires at the start of the next quarter  financial newspaper Valor Economico reported. ",
        "date": "01182017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale's top shareholders weigh unifying stock structure: Valor "
    },
    {
        "content": "BRASILIA  Jan 19 A new shareholder agreement for Vale SA is under discussion  the company said on Thursday in a securities filing.",
        "date": "01192017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale says new shareholder agreement under discussion -filing "
    },
    {
        "content": "SYDNEY/MELBOURNE Miner BHP Billiton Ltd    its partner Vale SA  and their jointly owned Samarco unit said on Thursday they have set a June 30 deadline to settle billions of dollars in compensation claims stemming from an iron ore mine disaster in Brazil in 2015.",
        "date": "01192017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BHP  Vale  Samarco set June 30 deadline to resolve multibillion dollar claims "
    },
    {
        "content": "SYDNEY  Jan 19 BHP Ltd   its partner Vale SA and Samarco have reached an agreement with Brazil authorities to settle a $47.5 billion civil claim over the Samarco iron ore mine disaster  the companies said on Thursday.",
        "date": "01192017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BHP says reached settlement agreement with Brazil over Samarco "
    },
    {
        "content": "SAO PAULO  Jan 19 Leading shareholders of Vale SA are close to endorsing a plan to turn the world's No. 1 iron ore producer into a company with  dispersed share ownership within six years  two people familiar with the talks said.",
        "date": "01192017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "New Vale pact seeks dispersed share ownership in six years -sources "
    },
    {
        "content": "BRASILIA  Jan 9 Brazilian miner Samarco and its shareholders Vale SA and BHP Billiton   have requested to extend until Jan. 19 a deadline to pay 1.2 billion reais ($375.39 million) in guarantees related to the collapse of a tailings dam in 2015  Vale said in a statement on Monday.",
        "date": "01092017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Samarco requests extension for dam disaster guarantee "
    },
    {
        "content": "RIO DE JANEIRO  Jan 11 An accident on Tuesday at a port in northeastern Brazil run by miner Vale SA  killed one worker and injured another  the company said in a note on Wednesday.",
        "date": "01112017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Accident at port of Brazil miner Vale kills one  injures another "
    },
    {
        "content": "BRASILIA  Jan 11 A Brazilian judge has extended the deadline for Samarco and its shareholders Vale SA  and BHP Billiton to make a 1.2 billion reais ($375.41 million) payment related to a dam spill to Jan 19  a statement from the court in the state of the Minas Gerais said on Wednesday.",
        "date": "01112017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil court extends deadline for Samarco to pay dam spill guarantee "
    },
    {
        "content": "SAO PAULO The board of Brazil's Vale SA tapped Fernando Jorge Buso Gomes as vice-chairman  to replace Sergio Figueiredo Clemente.",
        "date": "01042017",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Board of Brazil's Vale taps Jorge Buso Gomes as vice-chairman "
    },
    {
        "content": "SAO PAULO  Jan 11 Fundação Cesp  Brazil's largest private-sector pension fund  is currently not holding discussions over the partial or full sale of a 200 million-real ($62 million) stake it owns in Vale SA  the world's largest iron ore producer.",
        "date": "01112017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Funcesp says Vale stake sale not under discussion "
    },
    {
        "content": "SAO PAULO  Jan 11 Fundação Cesp  Brazil's largest private-sector pension fund  said on Wednesday it is not currently holding discussions over the partial or full sale of a 200 million real ($62 million) stake it owns in Vale SA  the world's largest iron ore producer.",
        "date": "01112017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Funcesp says Vale stake sale not under discussion "
    },
    {
        "content": "SAO PAULO  Jan 11 Fundação Cesp  Brazil's largest private-sector pension fund  is considering the partial or full sale of a 200 million-real ($62 million) stake it owns in Vale SA  the world's largest iron ore producer  Valor Econômico said on Wednesday.",
        "date": "01112017",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Funcesp considering selling Vale shares  Valor says "
    },
    {
        "content": "BRASILIA/SAO PAULO Vale SA's $2.5 billion sale of its fertilizer business to Mosaic Co  the latest step in the Brazilian iron ore miner's strategy to reduce debt  also makes it the U.S. company's biggest shareholder.",
        "date": "12202016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale sells fertilizer unit to Mosaic  to become top shareholder "
    },
    {
        "content": "CANAA DOS CARAJAS  Brazil Brazil's Vale SA on Saturday inaugurated its biggest mining project ever  lowering costs in a cut-throat market and reasserting its place as the world's biggest iron ore producer.",
        "date": "12172016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale opens huge new iron ore mine in Brazil's Amazon rainforest "
    },
    {
        "content": "NEW YORK  Nov 29 (IFR) - Brazilian miner Vale plans to refinance around US$2bn of debt next year  CFO Luciano Siani said on the sidelines of the company's investor day in New York on Tuesday.",
        "date": "11292016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale to refinance US$2bn of debt next year: CFO "
    },
    {
        "content": "SYDNEY BHP Billiton and Vale Sa have each approved $181 million to fund remediation and compensation programs at the Samarco iron ore joint venture in Brazil following a deadly mine disaster in November 2015.",
        "date": "11242016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BHP Vale to fund  extend credit over Samarco disaster "
    },
    {
        "content": "NEW YORK Vale SA  the world's No. 1 iron ore producer  is taking advantage of recent gains in mineral and metal prices and successful cost-cutting steps to rethink the pace of an asset sale plan to bring down debt  executives said on Tuesday.",
        "date": "11292016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Ore rally  cost cuts giving Vale breathe to rethink asset sales "
    },
    {
        "content": "NEW YORK  Nov 29 Vale SA  the world's No. 1 iron ore producer  is taking advantage of recent gains in mineral and metal prices and successful cost-cutting steps to rethink the pace of an asset sale plan to bring down debt  executives said on Tuesday.",
        "date": "11292016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Ore rally  cost cuts giving Vale breathe to rethink asset sales "
    },
    {
        "content": "SYDNEY  Nov 25 BHP Billiton and Vale Sa  have each approved $181 million to fund remediation and compensation programs at the Samarco iron ore joint venture in Brazil following a deadly mine disaster in November 2015.",
        "date": "11242016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-BHP Vale to fund  extend credit over Samarco disaster "
    },
    {
        "content": "* To extend $115 million in credit to joint venture Samarco in first-half 2017",
        "date": "11242016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "RPT-BRIEF-Brazil's Vale to extend Samarco $151 mln in credit in H1 2017 "
    },
    {
        "content": "* Brazil's Vale says near deal on fertilizers unit divestment",
        "date": "11292016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BRIEF-Brazil's Vale says near deal on fertilizers unit "
    },
    {
        "content": "NEW YORK  Nov 29 Vale SA  the world's largest iron ore producer  plans to focus strategic actions on improving global ore recovery and price realization as a way to bolster profitability in coming years  executives said on Tuesday.",
        "date": "11292016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale to focus on returns  sees asset sales closing soon "
    },
    {
        "content": "* To extend $115 million in credit to joint venture Samarco in first-half 2017",
        "date": "11242016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BRIEF-Brazil's Vale to extend Samarco $151 mln in credit in H1 2017 "
    },
    {
        "content": "SAO PAULO - Cia Energética de Minas Gerais SA (Cemig) has decided to sell its minority stake in Aliança Geração de Energia SA  a Brazilian power generation joint-venture with Vale SA   in a deal that could raise around 2 billion reais ($590 million)  three people familiar with the plan said.",
        "date": "11182016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Exclusive: Brazil's Cemig mulls sale of stake in venture with Vale: sources "
    },
    {
        "content": "BRASILIA A federal judge in Brazil has agreed to hear a criminal case  against four companies and 22 employees for a burst tailings dam at the Samarco mine that killed 19 people last November  according to a court document seen by Reuters on Friday.",
        "date": "11182016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil judge to hear criminal charges for Samarco dam disaster "
    },
    {
        "content": "BRASILIA  Nov 18 A federal judge in Brazil has accepted the criminal charges brought by prosecutors against four companies and 22 employees for a burst tailings dam at the Samarco mine last November  the G1 news site reported on Friday.",
        "date": "11182016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazilian judge accepts criminal charges for Samarco dam disaster -G1 "
    },
    {
        "content": "SAO PAULO Brazilian iron ore mining joint venture Samarco Mineração SA and its controllers Vale SA  and BHP Billiton Ltd  have 30 days to make a deposit of 1.2 billion reais ($354 million) to fund preparatory measures after last year's dam disaster  Vale said on Friday.",
        "date": "11112016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil court rules Vale  BHP  Samarco to deposit $354 million after dam burst "
    },
    {
        "content": "SAO PAULO  Nov 11 Brazilian iron ore mining joint venture Samarco Mineração SA and its controllers Vale SA  and BHP Billiton Ltd have 30 days to make a deposit of 1.2 billion reais ($354 million) to fund preparatory measures after last year's dam disaster  Vale said on Friday.",
        "date": "11112016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil court rules Vale  BHP  Samarco to deposit $354 mln after dam burst "
    },
    {
        "content": "RIO DE JANEIRO BHP Billiton's president of mining in the Americas on Thursday said \"complex\" negotiations continue with partner Vale SA and other stakeholders to restart operations next year at Samarco  the iron ore mine in Brazil where a 2015 dam burst killed 19 people and caused massive environmental damage.",
        "date": "11102016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BHP 'confident' of 2017 Samarco restart despite tough talks "
    },
    {
        "content": "BRASILIA  Nov 4 Brazilian railway operator MRS Logistica will sell miner Vale SA 23 locomotives and train parts for 115 million reais ($25.3 million)  MRS said in a statement on Friday.",
        "date": "11042016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale to buy MRS locomotives for $25.3 mln "
    },
    {
        "content": "SAO PAULO Brazilian President Michel Temer will not push to replace the head of the nation's largest mining company  Vale SA   until the current executive's mandate expires in May  a local newspaper reported.",
        "date": "11062016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's president delays pushing for new Vale CEO until next year: report "
    },
    {
        "content": "LONDON Vale Chief Executive Officer Murilo Ferreira said on Wednesday the firm was seeking to cut its debt to between $15 billion and $17 billion by the end of 2017  a slight revision of previous guidance.",
        "date": "11022016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale CEO aims to cut debt to $15-$17 billion by end 2017 "
    },
    {
        "content": "SAO PAULO  Nov 6 Brazilian President Michel Temer will not push to replace the head of the nation's largest mining company  Vale SA  until the current executive's mandate expires in May  a local newspaper reported.",
        "date": "11062016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's president delays pushing for new Vale CEO until next year -report "
    },
    {
        "content": "* Its board approved the sale of Australian coal asset of Carborough Downs",
        "date": "10282016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BRIEF-Brazil's Vale approves sale of Australian coal asset "
    },
    {
        "content": "RIO DE JANEIRO Brazilian miner Vale SA expects 50 million tonnes of new iron ore production to enter the global market in 2017  but it should be offset by falling production in China and increased steel demand  a company executive said at a conference in Rio de Janeiro.",
        "date": "10252016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale sees 50 million tonnes of iron ore entering 2017 market "
    },
    {
        "content": "TORONTO  Oct 25 Vale SA's Canadian unit will pay a C$1 million ($749 000) fine after pleading guilty to four violations of a workplace safety law in connection with the 2014 death of a worker at a Sudbury  Ontario smelter  the Brazilian miner said on Tuesday.",
        "date": "10252016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale Canada to pay C$1 million fine in worker's 2014 death "
    },
    {
        "content": "* Brazilian miner Vale has found negotiations with Australia's Fortescue Metals Group over shared blending more complex than anticipated  Vale's head of iron ore Peter Poppinga said on a conference call without going into details",
        "date": "10272016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BRIEF-Brazil's Vale expects Mitsui coal deal to close in weeks "
    },
    {
        "content": "BRASILIA Samarco  the troubled joint venture between Vale SA and BHP Billiton  will need to use infrastructure from Vale's neighboring mines if it wants to secure a long-term future  Vale's chief executive said on Thursday.",
        "date": "10272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale says Samarco future reliant on its infrastructure "
    },
    {
        "content": "BRASILIA  Oct 27 Samarco  the troubled joint venture between Vale SA and BHP Billiton  will need to use infrastructure from Vale's neighboring mines if it wants to secure a long-term future  Vale's chief executive said on Thursday.",
        "date": "10272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale says Samarco future reliant on its infrastructure "
    },
    {
        "content": "BRASILIA  Oct 27 Samarco  the troubled joint-venture between Vale SA and BHP Billiton   will need to use infrastructure from Vale's neighboring mines if it wants to secure a long-term future  Vale's chief executive said on Thursday.",
        "date": "10272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale says Samarco needs its infrastructure to secure future "
    },
    {
        "content": "BRASILIA Brazilian miner Vale SA  will go ahead with the sale of its fertilizer business after its board of directors gave its approval  the newspaper Valor Economico reported on Thursday.",
        "date": "10272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Miner Vale's board OKs sale of fertilizer business: report "
    },
    {
        "content": "BRASILIA  Oct 27 Brazilian miner Vale SA  will go ahead with the sale of its fertilizer business after its board of directors gave its approval  the newspaper Valor Economico reported on Thursday.",
        "date": "10272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Miner Vale's board OKs sale of fertilizer business -report "
    },
    {
        "content": "BRASILIA  Oct 27 Brazilian miner Vale SA  on Thursday reported third quarter net profit of $575 million  as the world's largest producer of iron ore returned to profit after a hefty loss during the same quarter last year.",
        "date": "10272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil miner Vale posts Q3 net profit of $575 mln "
    },
    {
        "content": "BRASILIA  Oct 27 Brazilian miner Vale SA  reported on Thursday third quarter net profit of $575 million  slightly below analyst expectations after a hefty loss during the same quarter last year.",
        "date": "10272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazilian miner Vale reports Q3 net profit of $575 mln "
    },
    {
        "content": "BRASILIA  Oct 20 Brazilian miner Vale SA  trimmed its forecast for iron ore output in 2017 on Thursday  as the world's largest producer of the steel-making raw material continued to phase out higher-cost production amid lower commodity prices.",
        "date": "10202016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale trims forecast for 2017 iron ore output "
    },
    {
        "content": "RIO DE JANEIRO  Oct 18 Brazilian mining company Vale SA said on Tuesday that a Sao Paulo court overturned an injunction preventing it from ending support for a pension plan at its fertilizer unit.",
        "date": "10192016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil court says Vale can seek end to support for pension plan "
    },
    {
        "content": "RIO DE JANEIRO  Oct 20 Brazilian prosecutors said on Thursday they charged 26 people  21 of them for qualified homicide  for their roles in the collapse of a tailings dam at the Samarco iron ore mine last November that killed 19 people.",
        "date": "10202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil prosecutors charge Samarco employees with homicide for dam spill "
    },
    {
        "content": "SAO PAULO  Oct 20 Brazilian miner Vale SA's iron ore output in the third quarter of the year amounted to 92.1 million tonnes  a 1.5 percent rise on output in the same period last year  it said on Thursday.",
        "date": "10202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale's Q3 iron ore output up 1.5 pct at 92.1 mln tonnes "
    },
    {
        "content": "SAO PAULO Iron ore prices should stay stable for the remaining of this year and also into 2017  Brazil's mining company Vale Chief Executive Officer Murilo Ferreira said on Friday.",
        "date": "10222016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale sees iron ore prices stable for rest of 2016 and in 2017 "
    },
    {
        "content": "Oct 21 Britain's FTSE 100 index is seen down 8 points  or 0.1 percent  on Friday  according to financial bookmakers.          * The UK blue chip index closed up 4.98 points  or 0.1 percent  on Thursday at 7 026.90. Banks helped to support British blue-chips  buoyed by good performance from U.S. lenders in key business areas on a volatile day as the European Central Bank held policy steady.         * BHP: BHP Billiton  Chairman Jac Nasser  one of the most powerful figures in the minin",
        "date": "10212016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UK Stocks-Factors to watch on Oct. 21 "
    },
    {
        "content": "RIO DE JANEIRO  Oct 5 Vale SA's plan to dispose of fertilizer assets remains on track despite a request last week by Brazil's state development bank  BNDES  to analyze the transaction more carefully  according to two people with direct knowledge of the situation.",
        "date": "10052016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale fertilizer deal on track despite BNDES delay -sources "
    },
    {
        "content": "SAO PAULO  Sept 29 Vale SA intends to form a strategic partnership in fertilizers  a segment in which the world's largest iron ore producer  has failed to find a partner or sell in recent years.",
        "date": "09302016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale intends to form partnership in fertilizers "
    },
    {
        "content": "SAO PAULO  Sept 29 Brazilian mining company Vale SA has nominated Eduardo de Salles Bartolomeo as board member  according to a securities filing Thursday.",
        "date": "09292016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale taps Bartolomeo to board  replacing Coutinho "
    },
    {
        "content": "RIO DE JANEIRO  Sept 28 Brazil's Vale SA   the world's largest iron ore exporter  said on Wednesday it expects balanced supply and demand in the iron ore market to continue with Brazil adding most of the world's new seaborne supply in 2017.",
        "date": "09282016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale says expects current iron ore price equilibrium to continue "
    },
    {
        "content": "RIO DE JANEIRO  Sept 29 Vale SA said on Thursday it has agreed to new terms for the sale of stakes in a coal mine and railway project in Mozambique to shareholder Mitsui & Co  in a deal that will raise $768 million and could help Vale free up to $2.7 billion in funding commitments for both projects.",
        "date": "09292016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale agrees to new terms with Mitsui for coal mine stake "
    },
    {
        "content": "RIO DE JANEIRO  Sept 29 Brazilian miner Vale SA  said on Thursday it has agreed to new terms with Japan's Mitsui & Co for the sale of a stake in its Moatize coal mine and connected railway in Mozambique.",
        "date": "09292016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale agrees to new terms with Mitsui for Mozambique coal asset "
    },
    {
        "content": "RIO DE JANEIRO The board of directors of Brazil's Vale SA  the world's largest iron ore exporter  plans to vote on the sale of two important assets at a meeting on Thursday  the Valor Economico daily newspaper said on Tuesday.",
        "date": "09272016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale board to debate asset sales on Thursday: Valor "
    },
    {
        "content": "SAO PAULO Shares in Brazil's Vale SA rose the most in almost 15 weeks on Wednesday on speculation the world's largest iron ore producer would announce the partial sale of a unit to U.S. fertilizer producer Mosaic Co later in the day.",
        "date": "09212016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale shares jump on talk of fertilizer unit sale "
    },
    {
        "content": "RIO DE JANEIRO  Sept 22 The board of directors of Brazilian mining company Vale SA has not yet made a decision on selling a stake in its fertilizer unit  the company said in a securities filing on Thursday.",
        "date": "09222016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale has not decided on sale of fertilizer unit - filing "
    },
    {
        "content": "SAO PAULO  Sept 21 Shares in Brazil's Vale SA rose the most in almost 15 weeks on Wednesday on speculation the world's largest iron ore producer would announce the partial sale of a unit to U.S. fertilizer producer Mosaic Co  later in the day.",
        "date": "09212016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale shares jump on talk of fertilizer unit sale "
    },
    {
        "content": "RIO DE JANEIRO Brazil's Vale SA said on Monday output from its new S11D iron ore mine in the Amazon region will be limited to 83 percent of full capacity as efforts to preserve cash and limit transport disruptions crimp a needed railway expansion.",
        "date": "09202016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale says rail delay limits new iron mine output to 75 million tons "
    },
    {
        "content": "RIO DE JANEIRO Brazil granted Vale SA a 10-year license to operate a 101-kilometer (63-mile) branch line connecting its $14.3 billion S11D iron ore mine project in the Amazon jungle to the Carajas Railway  the company said in a statement on Friday.",
        "date": "09162016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil grants Vale license for Amazon iron ore mine rail branch "
    },
    {
        "content": "* State of Rio De Janeiro 'CCC-' rating placed on creditwatch negative following missed debt service payment",
        "date": "09132016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BRIEF-S&P places state of Rio De Janeiro's rating on creditwatch negative following missed debt service payment "
    },
    {
        "content": "BELO HORIZONTE  Brazil Federal prosecutors investigating the deadly dam spill in November at the Samarco iron ore mine  owned by Vale SA and BHP Billiton  will decide in coming weeks whether to charge the company and executives  a prosecutor in the case said on Tuesday.",
        "date": "08302016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Prosecutors to decide in September on Samarco dam spill charges "
    },
    {
        "content": "Aug 30 Britain's FTSE 100 index is expected to open 13-18 points  or 0.2-0.3 percent  lower on Tuesday  according to financial bookmakers  with futures trading down 0.3 percent ahead of the cash market open.",
        "date": "08302016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Aug 30 "
    },
    {
        "content": "Aug 30 Britain's FTSE 100 index is expected to open lower  according to financial bookmakers.           * The UK blue chip index closed up 21.15 points  or 0.3 percent on Friday at 6 838.05  after Federal Reserve Chair Janet Yellen indicated that a U.S. interest rate rise could come later this year  a relief for investors after last week's hawkish comments from some Fed policymakers.      * BHP BILLITON: The deadly collapse of a tailings dam last November at the Samarco mine  owned b",
        "date": "08302016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UK Stocks-Factors to watch on Aug 30 "
    },
    {
        "content": "Aug 31 Britain's FTSE 100 index is seen opening down 13 points  or 0.19 percent  on Wednesday  according to financial bookmakers.        * The UK blue chip index closed 0.25 percent lower on Tuesday at 6 820.79 points  as a drop in major mining and housebuilding stocks weighed on the market.      * ARM: Shareholders in British technology company ARM approved its sale to Japan's SoftBank on Tuesday  marking the end of independence for the chip designer that powered the smartphone revo",
        "date": "08312016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UK Stocks-Factors to watch on Aug 31 "
    },
    {
        "content": "RIO DE JANEIRO Fijian rugby has so often flattered to deceive on the biggest stages but in Rio the Pacific islanders perfectly harnessed their blend of physicality  pace and flair to deliver their country its first Olympic medal.",
        "date": "08222016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Rugby: Fairytale of the flying Fijians caps solid return "
    },
    {
        "content": "RIO DE JANEIRO  Aug 23 Brazilian mining company Vale SA said on Tuesday that its most important railway  used to transport iron ore from its Carajas mine in the Amazon  stopped operating for over 12 hours on Monday due to a land protest on the line.",
        "date": "08232016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale says iron ore railway down for over 12 hours on Monday "
    },
    {
        "content": "RIO DE JANEIRO  Aug 22 Fijian rugby has so often flattered to deceive on the biggest stages but in Rio the Pacific islanders perfectly harnessed their blend of physicality  pace and flair to deliver their country its first Olympic medal.",
        "date": "08222016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Olympics-Rugby-Fairytale of the flying Fijians caps solid return "
    },
    {
        "content": "SAO PAULO  Aug 25 Vale SA  the world's largest producer of iron ore  will stay competitive and more profitable than rivals regardless of where prices for the mineral and basic metals will go in coming months.",
        "date": "08252016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale expects to stay competitive regardless of price levels "
    },
    {
        "content": "* Brazilian iron ore miner Vale SA said in a filing on Thursday that a federal court dismissed the company's appeal of an injunction filed by federal and Minas Gerais  Espirito Santo state courts against Samarco  BHP and Vale",
        "date": "08182016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BRIEF-Vale says appeal rejected  Samarco concession remains suspended "
    },
    {
        "content": "SAO PAULO  Aug 10 Vale SA  the world's largest producer of iron ore  denied it  plans to raise cash from the sale of future iron ore output through a so-called streaming financing transaction.",
        "date": "08102016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale denies iron ore streaming financing deal in the works "
    },
    {
        "content": "NEW YORK  Aug 3 (IFR) - Brazilian miner Vale returned to the debt markets for a second time in a matter of months on Wednesday  approaching investors with a US$1bn 10-year offering to fund bond redemptions.",
        "date": "08032016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale taps bond to retire debt "
    },
    {
        "content": "SAO PAULO Brazil's Vale SA  is considering raising as much as $10 billion from the sale of up to 3 percent of future iron ore output to undisclosed Chinese companies  two sources with direct knowledge of the matter said.",
        "date": "08032016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Exclusive: Vale seeks up to $10 billion with iron ore streaming deal  sources say "
    },
    {
        "content": "Aug 3 Chief Executive of Brazilian iron ore miner Vale SA Wednesday Murilo Ferreira said on Wednesday that the company would meet its 2016 divestment target with two deal still to be finalized",
        "date": "08032016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BRIEF-Brazil's Vale says to meet 2016 divestment target - CEO "
    },
    {
        "content": "SAO PAULO  Aug 3 Brazilian mining company Vale SA will issue new bonds due in 2026  the company said in a securities filing on Wednesday.",
        "date": "08032016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale to issue bonds due in 2026 "
    },
    {
        "content": "Aug 3 The following are the top stories from selected Canadian newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08032016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "PRESS DIGEST- Canada - Aug 3 "
    },
    {
        "content": "BRASILIA/RIO DE JANEIRO  Aug 2 Brazil's Vale  said on Tuesday it will receive $800 million in a gold streaming deal with Silver Wheaton Corp  as the world's largest producer of iron ore attempts to raise cash to pay down debt.",
        "date": "08022016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale signs $800 mln streaming deal with Silver Wheaton "
    },
    {
        "content": "BRASILIA  Aug 2 Brazilian miner Vale  said on Tuesday it will receive an initial cash payment of $800 million from a deal with Silver Wheaton to sell an additional percentage of gold contained in the copper concentrate produced at the Salobo mine.",
        "date": "08022016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale to receive $800 mln in deal with Silver Wheaton "
    },
    {
        "content": "By Bruno Federowski and Paula Arend Laier     SAO PAULO  July 26 Brazilian equities rose on Tuesday as higher prices of iron ore lifted shares of miner Vale SA following a heavy batch of corporate reports.     Iron ore futures listed in China rose more than 2 percent on Tuesday as steel prices recovered from a steep fall last week.      The move lifted stocks of miners and steel makers  with Vale   the biggest boost to Brazil's benchmark Bovespa index.      Shares in wireless carrier",
        "date": "07262016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil stocks up as higher iron ore prices lift Vale "
    },
    {
        "content": "July 28 Vale executives held a conference call with investors and analysts in English on Thursday to explain their second-quarter results.",
        "date": "07282016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BRIEF-Vale says no cash for expansion  only dividends  debt cuts "
    },
    {
        "content": "July 27 Brazilian iron ore miner Vale SA  says on Wednesday it will make a 3.7 bln real provision in the second quarter for the  Samarco tailings dam burst agreement",
        "date": "07272016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BRIEF-Brazil's Vale says to provision of 3.7 bln reais for Samarco - filing "
    },
    {
        "content": "SAO PAULO  July 28 Brazilian mining giant Vale SA plans to announce three more asset sales by the end of the year  Chief Executive Murilo Ferreira told analysts on a Thursday earnings call.   (Reporting by Marta Nogueira and Brad Haynes)",
        "date": "07282016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil miner Vale plans three more asset sales this year -CEO "
    },
    {
        "content": "RIO DE JANEIRO  July 28 Regional prosecutors in Brazil's Rio de Janeiro state filed a lawsuit on Thursday to block the granting of an operating license to ThyssenKrupp AG's CSA plant until a thorough environmental assessment is conducted.",
        "date": "07282016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil prosecutors sue to block license for ThyssenKrupp mill "
    },
    {
        "content": "RIO DE JANEIRO Brazilian mining company Vale SA said on Thursday that second-quarter net income fell 34 percent as provisions for potential losses from the burst dam at its Samarco subsidiary and higher taxes undermined productivity gains.",
        "date": "07282016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale second-quarter profit falls 34 percent; shares drop "
    },
    {
        "content": "RIO DE JANEIRO  July 28 Brazilian mining company Vale SA  said on Thursday that second-quarter net income fell 34 percent as provisions for potential losses from the burst dam at its Samarco subsidiary and higher taxes undermined productivity gains.",
        "date": "07282016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Brazil's Vale second-quarter profit falls 34 pct; shares drop "
    },
    {
        "content": "RIO DE JANEIRO  July 20 A Brazilian state law to ban upstream tailings dams  the design used for the dam that collapsed at the Samarco mine last November  could be passed this year  an environmental official for the state of Minas Gerais told Reuters on Wednesday.",
        "date": "07202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil state law to ban dam used at Samarco mine could pass this year "
    },
    {
        "content": "SYDNEY/LONDON BHP Billiton and Anglo American have  reported setbacks in their iron ore production  but analysts said the contraction was nowhere near enough to dent the massive global supply glut that has driven prices to record lows.",
        "date": "07202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BHP  Anglo see only slight setbacks for iron ore production "
    },
    {
        "content": "* Less petroleum output this year   (Updates with Anglo outlook)",
        "date": "07202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-BHP  Anglo see only slight setbacks for iron ore production "
    },
    {
        "content": "Spanish tennis player Rafael Nadal is recovering well from a left wrist injury and is on track to compete at the Olympics in Rio  his doctor said on Tuesday.",
        "date": "07052016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Nadal on track to compete at Rio  says doctor "
    },
    {
        "content": "RIO DE JANEIRO  July 1 Brazil's Vale SA said it has sold three of its giant \"Valemax\" iron ore ships to a group led by Industrial and Commercial Bank of China  continuing efforts to unload assets to cut debt and focus investment on its main mining activities.",
        "date": "07012016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale says sold three Valemax iron ore ships to ICBC for $296 mln "
    },
    {
        "content": "BRASILIA Brazil's government authorized an emergency transfer of 2.9 billion reais ($850 million) on Tuesday for the cash-strapped state of Rio de Janeiro to help pay for infrastructure projects and security for the Olympic Games in August.",
        "date": "06212016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil extends $850 million emergency loan to Rio for Olympics "
    },
    {
        "content": "BRASILIA  June 21 Brazil's government authorized an emergency transfer of 2.9 billion reais ($850 million) on Tuesday for the cash-strapped state of Rio de Janeiro to help pay for infrastructure projects and security for the Olympic Games in August.",
        "date": "06212016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil extends $850 mln emergency loan to Rio for Olympics "
    },
    {
        "content": "SAO PAULO  June 20 Brazilian mining company Samarco Mineração SA and owners Vale SA and BHP Billiton Plc have hired banks to sound out creditors on a potential renegotiation of $3.8 billion in debt  after a deadly dam spill led to the shutdown of a key mine  a source with direct knowledge of the plan said on Monday.",
        "date": "06202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Samarco  owners hire banks for debt talks -source "
    },
    {
        "content": "SAO PAULO  June 20 Brazilian mining company Samarco Mineração SA and owners Vale SA and BHP Billiton Plc have hired banks to sound out creditors on a potential renegotiation of $3.8 billion in debt  after a deadly dam spill led to the shutdown of a key mine  a source with direct knowledge of the plan said on Monday.",
        "date": "06202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Samarco  owners hire banks for debt talks -source "
    },
    {
        "content": "BRASILIA The Brazilian government plans to transfer 2.9 billion reais ($849 million) in emergency funds to the state of Rio de Janeiro to pay for infrastructure and security during the Olympic Games  a government official told Reuters on Saturday.",
        "date": "06182016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil plans emergency funds for Rio ahead of Olympics: source "
    },
    {
        "content": "BRASILIA  June 18 The Brazilian government plans to transfer 2.9 billion reais  ($849 million) in emergency funds to the state of Rio de Janeiro to pay for infrastructure and security during the Olympic Games  a government official told Reuters on Saturday.",
        "date": "06182016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil plans emergency funds for Rio ahead of Olympics - source "
    },
    {
        "content": "SAO PAULO Mosaic Co  the world's top producer of concentrated phosphate  has entered talks to buy Vale SA's fertilizer unit  in a renewed push to grow in South America and Africa  three sources with direct knowledge of the matter said.",
        "date": "06182016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Exclusive: Mosaic eyes Vale's fertilizer business  sources say "
    },
    {
        "content": "SAO PAULO  June 16 Brazilian mining company Vale SA will not financially support Samarco  a joint venture with BHP Billiton  if the company is not able to resume operations  Vale's head of investor relations said on Thursday.",
        "date": "06162016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "CORRECTED-Vale will not support Samarco if unable to resume operations "
    },
    {
        "content": "SAO PAULO  June 16 Brazilian miner Vale  is ready to support Samarco  a joint venture with BHP Billiton  if the company is unable to resume operations this year after a deadly dam spill last November forced its mine to close  a Vale executive said on Thursday.",
        "date": "06162016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale to support JV Samarco if unable to resume operations "
    },
    {
        "content": "Golden State Warriors center Andrew Bogut will miss the remainder of the NBA Finals after injuring his knee  the team said on Wednesday  with the Australian still hopeful of recovering in time for the Olympics.",
        "date": "06162016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Bogut out of Finals with injury  hopeful on Rio "
    },
    {
        "content": "* Remains \"committed\" to Australia's cause at Rio Olympics   (updates with Basketball Australia comment)",
        "date": "06162016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-NBA-Bogut out of Finals with injury  hopeful on Rio "
    },
    {
        "content": "BRASILIA  June 13 Brazilian iron ore miner Vale SA said on Monday that a 20 billion reais ($5.7 billion) civil lawsuit seeking environmental and property damages for last year's deadly Samarco mine disaster has been dismissed.",
        "date": "06132016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil judge dismisses $5.7 bln civil suit against Samarco -Vale "
    },
    {
        "content": "BRASILIA  June 13 Brazilian iron ore miner Vale SA said on Monday that a 20 billion reais ($5.7 billion) civil suit over last year's Samarco mine disaster has been dismissed  the company said in a securities filing.",
        "date": "06132016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil judge dismisses $5.7 bln civil suit against Samarco -Vale "
    },
    {
        "content": "RIO DE JANEIRO  June 15 Brazilian miner Samarco  a joint venture between Vale SA and BHP Billiton   no longer expects to resume mining operations this year  Benedito Waldson  the company's head of human resources told Reuters on Wednesday.",
        "date": "06152016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale-BHP's Samarco no longer sees operations resuming this year "
    },
    {
        "content": "JOHANNESBURG  June 10 The Mozambique unit of Brazilian mining company Vale said on Friday that its trains had targeted by gunfire twice in recent days on the Sena rail line which carries coal from the interior to the Indian Ocean port of Beira.",
        "date": "06102016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale's Mozambique unit says trains attacked by gunmen "
    },
    {
        "content": "LONDON  June 9 Katherine Grainger  Britain's most successful female Olympic rower  still has a chance of making her fifth Games despite being left out of an initial squad of 43 named for Rio on Thursday.",
        "date": "06092016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Olympics-Grainger could go to Rio despite failing to make initial squad "
    },
    {
        "content": "RIO DE JANEIRO  June 8 Brazilian mining company Vale SA said on Wednesday there have been no attempts within the company to remove Chief Executive Murilo Ferreira  responding to local media reports that his job was under threat.",
        "date": "06082016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale says no plans within company to change CEO "
    },
    {
        "content": "NEW YORK  June 7 (IFR) - Below is a recap of primary issuance activity in the LatAm market on Tuesday:",
        "date": "06072016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "LATAM CLOSE-Vale Overseas raises US$1.25bn in LatAm primary "
    },
    {
        "content": "NEW YORK  June 8 (IFR) - Latin America's primary bond markets are on course for their busiest week of the year  with borrowers bringing a slew of new deals amid an upbeat tone for emerging markets assets.",
        "date": "06082016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "LatAm primary bond markets in busiest week of 2016 "
    },
    {
        "content": "By Bruno Federowski     SAO PAULO  June 8 Latin American stocks and currencies soared on Wednesday as stronger-than-expected Chinese trade data added fuel to a rally driven by shrinking expectations of near-term U.S. rate increases.     Imports by the world's biggest consumer of commodities fell only 0.4 percent from a year earlier in May  the smallest decline since November 2014. Economists polled by Reuters had estimated a 6 percent drop.      The data lifted prices of basic produc",
        "date": "06082016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Latam stocks  currencies soar on strong China imports data "
    },
    {
        "content": "NEW YORK  June 7 (IFR) - Brazilian miner Vale announced initial price thoughts of very low 6% on a new five-year bond ahead of pricing on Tuesday.",
        "date": "06072016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale set IPTs of very low 6% on new bond "
    },
    {
        "content": "SAO PAULO  June 7 Brazil's Vale  the world's largest iron ore miner  said on Tuesday it plans to issue bonds maturing in June 2021 to pay down debt.",
        "date": "06072016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale to issue bonds maturing in 2021 to pay debt "
    },
    {
        "content": "SAO PAULO  June 8 Vale SA  the world's largest iron ore producer  is not aware of any discussions or attempts to replace Chief Executive Officer Murilo Ferreira  as recently reported by local newspapers.",
        "date": "06082016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale is unaware of plans to replace CEO Ferreira "
    },
    {
        "content": "RIO DE JANEIRO  June 2 Brazil's interim President Michel Temer plans to replace the head of the nation's largest miner  Vale SA  because he is too closely allied with suspended President Dilma Rousseff  newspaper Valor reported on Thursday.",
        "date": "06022016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Temer looking to replace Vale CEO -Valor "
    },
    {
        "content": "RIO DE JANEIRO  June 3 Brazilian miner Samarco  co-owned by BHP Billiton and Vale SA  said on Friday it will launch a voluntary layoff program with the aim of cutting 40 percent of its 3 000 employees.",
        "date": "06032016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale-BHP's Samarco says looking to cut 40 percent of workforce "
    },
    {
        "content": "SAO PAULO  May 24 Brazilian iron ore miner Vale SA said it would delist shares in Hong Kong on July 28 as part of its strategy of simplification  according to a securities filing on Tuesday.   (Reporting by Caroline Stauffer; Editing by Jonathan Oatis)",
        "date": "05242016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale says delisting shares in Hong Kong "
    },
    {
        "content": "NEW YORK Norway's Yara International  sees Vale SA's  fertilizer business as one of several investment opportunities  as the company eyes potential further acquisitions in Brazil  its chief financial officer said on Wednesday.",
        "date": "05182016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Yara eyeing Vale's fertilizer business  other buying opportunities "
    },
    {
        "content": "SINGAPORE The displacement of smaller iron ore miners by global mining companies will start to slow if the price stays around $50 per ton  a senior official at top iron ore miner Vale said on Thursday.",
        "date": "05192016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale sees slower displacement of small iron miners  but warns bumpy road ahead "
    },
    {
        "content": "SYDNEY  May 19 Brazilian miner Vale  has had a minor acid leak at its Goro nickel operations in New Caledonia  the government of the French Pacific territory said  two years after a large chemical discharge at the same site sparked violent protests.",
        "date": "05192016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "New Caledonia reports minor acid leak at Vale nickel operations "
    },
    {
        "content": "OLCHING  Germany German paralympic cyclist Denise Schindler hopes to race with a 3D-printed leg prosthesis in Rio de Janeiro in September. | Video ",
        "date": "05042016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "German cyclist looks to race with 3D-printed prosthesis in Rio "
    },
    {
        "content": "SYDNEY  May 4 Australian shares sank more than 1.5 percent on Wednesday with resources among the hardest hit  as fears of further declines in metals prices and a court case dragged on mining giant BHP Billiton Ltd  and in turn on the index.",
        "date": "05042016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Miners lead Australia shares lower in profit-taking spree "
    },
    {
        "content": "LONDON  May 4 European equity futures were flat on Wednesday  with concerns over weak global economic growth weighing on markets.",
        "date": "05042016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "European Factors to Watch-Sluggish start seen for European shares "
    },
    {
        "content": "RIO DE JANEIRO Rio de Janeiro's mayor said Thursday preparations for the Olympics will not be impacted by Brazil's political turbulence  and he guaranteed there was zero corruption in the city's projects for the games.",
        "date": "05052016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Rio mayor assures Olympics not impacted by graft  political turmoil "
    },
    {
        "content": "LONDON British slalom canoeist Fiona Pennie is leaving nothing to chance at this year's Rio Olympics where she will fit a mosquito net to her boat between races to minimize the threat of the Zika virus.",
        "date": "05052016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "British canoeist Pennie has novel answer to Zika threat "
    },
    {
        "content": "May 5 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "05052016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "PRESS DIGEST- British Business - May 5 "
    },
    {
        "content": "BUENOS AIRES  April 27 Brazilian miner Vale SA  is considering a restart of its Rio Colorado potash project in Argentina after a long delay  the company said on Wednesday  the latest sign that international investors are eyeing a return to the country.",
        "date": "04272016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale eyes restart of Argentina potash project "
    },
    {
        "content": "BRASILIA  April 28 The global iron ore market is in better condition than expected  with Chinese demand improving  the chief executive of Brazil's Vale SA  said on Thursday.",
        "date": "04282016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale seeing improved iron ore demand in China "
    },
    {
        "content": "BUENOS AIRES  April 27 Brazilian miner Vale SA  is planning to restart its Rio Colorado potash project in Argentina after a long delay   but at a lower predicted capacity than initially targeted  a local government spokesman said on Wednesday.",
        "date": "04272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale to restart Argentine potash project - gov't spokesman "
    },
    {
        "content": "BRASILIA  April 28 Brazilian miner Vale SA  on Thursday reported a first-quarter net profit of $1.78 billion  beating analyst forecasts and returning to profit for the first time in three quarters  helped by higher iron ore prices and a stronger Brazilian real.",
        "date": "04282016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale returns to profit on iron ore  currency "
    },
    {
        "content": "BRASILIA  April 20 Brazilian miner Vale said on Wednesday it expects full-year iron ore production to come in at the lower end of guidance  as the world's largest iron ore producer joined Australian rivals in signaling a halt to years of ramping up output.",
        "date": "04202016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale signals slight drop in iron ore production "
    },
    {
        "content": "RIO DE JANEIRO  April 28 Brazilian miner Vale SA  said on Thursday it is not currently considering a restart of its Rio Colorado potash project in Argentina without a partner to share the investment.",
        "date": "04282016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale will not restart Rio Colorado without partner "
    },
    {
        "content": "BRASILIA  April 28 Brazilian miner Vale SA  reported on Thursday a first-quarter net profit of $1.78 billion  beating analyst forecasts of $1.06 billion helped by higher iron ore prices and a stronger Brazilian real.",
        "date": "04282016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale reports Q1 net profit of $1.78 bln "
    },
    {
        "content": "BRASILIA  April 20 Brazilian miner Vale SA  said on Wednesday it produced 77.5 million tonnes of iron ore in the first quarter  a company record for the period that keeps it on track to achieve the lower end of its full-year guidance.",
        "date": "04202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale produces 77.5 mln tonnes of iron ore in Q1 "
    },
    {
        "content": "SAO PAULO/LONDON Vale SA  is considering spinning off its fertilizer assets into a joint venture controlled by Apollo Global Management LLC  if they succeed in a joint bid for Anglo American Plc's fertilizer operations in Brazil  three sources with direct knowledge of the plan told Reuters on Wednesday.",
        "date": "04282016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Exclusive: Apollo  Vale in talks for broad Brazil fertilizer venture - sources "
    },
    {
        "content": "* Move could support tighter iron ore market - analyst   (Recasts lead paragraph)",
        "date": "04202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-BHP joins Rio in iron ore output cut  eases oversupplied market "
    },
    {
        "content": "RIO DE JANEIRO  April 15 Brazil's Vale SA  reiterated on Friday it is looking for a partner in the fertilizer sector  responding to a Reuters report that the miner is preparing a joint bid with U.S. private equity firm Apollo for Anglo American's niobium and phosphates business in Brazil.",
        "date": "04162016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale reiterates looking for partner in fertilizers "
    },
    {
        "content": "LONDON Brazilian miner Vale  is teaming up with U.S. private equity firm Apollo  to bid for Anglo American's  niobium and phosphates business in Brazil  three sources familiar with the matter said on Tuesday.",
        "date": "04132016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale prepares joint bid with Apollo for Anglo's Brazil fertilizer business: sources "
    },
    {
        "content": "LONDON  April 12 Brazilian miner Vale  is teaming up with U.S. private equity firm Apollo to bid for Anglo American's niobium and phosphates business in Brazil  three sources familiar with the matter said on Tuesday.",
        "date": "04132016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Vale prepares joint bid with Apollo for Anglo's Brazil fertiliser business -sources "
    },
    {
        "content": "LONDON  April 12 Brazilian miner Vale  is teaming up with U.S. private equity firm Apollo to bid for Anglo American's niobium and phosphates business in Brazil  three sources familiar with the matter said on Tuesday.",
        "date": "04122016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale prepares joint bid with Apollo for Anglo's Brazil fertiliser business - sources "
    },
    {
        "content": "Japanese trailblazer Kento Momota will miss this year's Rio de Janeiro Olympics after being given an indefinite suspension by national badminton bosses for visiting an illegal casino  Kyodo News reported on Monday.",
        "date": "04112016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Japan's Momota to miss Rio after casino visit: report "
    },
    {
        "content": "BRASILIA  April 6 Brazilian miner Vale SA  said on Wednesday it was close to balancing its free cash flow for 2016  helped by a reduction in capital spending for the year to $5.5 billion  as the world's largest iron ore producer battles a fall in commodity prices.",
        "date": "04062016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale says close to balancing free cash flow for 2016 "
    },
    {
        "content": "BRASILIA Vale SA denied a report on Wednesday that it was negotiating a sale of fertilizer assets to Norway's Yara International as the Brazilian miner seeks to raise cash following its biggest quarterly loss in decades.",
        "date": "04062016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale  Yara deny in talks over fertilizer unit stake "
    },
    {
        "content": "BRASILIA  April 6 Vale SA denied a report on Wednesday that it was negotiating a sale of fertilizer assets to Norway's Yara International as the Brazilian miner seeks to raise cash following its biggest quarterly loss in decades.",
        "date": "04062016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale  Yara deny in talks over fertilizer unit stake "
    },
    {
        "content": "SAO PAULO Brazilian miner Vale SA said on Monday it will sell its entire 26.87 percent stake in the struggling CSA steel plant to Germany's ThyssenKrupp for a token value  in a bid to focus on core mining businesses with commodity prices at historic lows.",
        "date": "04052016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale says it will sell CSA steel plant stake to ThyssenKrupp "
    },
    {
        "content": "SAO PAULO  April 4 Brazilian miner Vale SA  said on Monday it will sell its entire 26.87 percent stake in the CSA steel plant to Germany's Thyssenkrupp  for a token value  in a bid to focus on its core mining businesses with commodity prices at historic lows.",
        "date": "04042016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale says it will sell CSA steel plant stake to Thyssenkrupp "
    },
    {
        "content": "* Brazilian miner Vale SA said in a statement on Wednesday that it is not in negotiations with Norway's Yara International  to sell fertilizer assets",
        "date": "04062016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BRIEF-Brazil's Vale says not negotiating with Yara over fertilizer sale "
    },
    {
        "content": "* Thyssenkrupp shares fall 5.2 pct after 48 pct gain   (Adds details on possible Thyssenkrupp steel exit  analyst comments  shares)",
        "date": "04052016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Brazil's Vale sells CSA steel plant stake to Thyssen "
    },
    {
        "content": "FRANKFURT  April 4 The DAX top-30 index  looked set to open 0.3 percent higher on Monday  according to premarket data from brokerage Lang & Schwarz at 0603 GMT.",
        "date": "04042016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "German stocks - Factors to watch on April 4 "
    },
    {
        "content": "BRASILIA  April 6 Brazilian miner Vale SA  cut its forecast for capital spending in 2016 to $5.5 billion from $6.2 billion previously  and reiterated in a presentation on Wednesday it plans to sell core assets in a bid to cut debt by $10 billion.",
        "date": "04062016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale cuts 2016 investment to $5.5 bln "
    },
    {
        "content": "NEW YORK/SAO PAULO Brazilian iron ore miner Vale SA is finalizing a proposal to sell its 26.87 percent stake in a steel slab plant that cost nearly $10 billion to build to Germany’s Thyssenkrupp for $1 plus the assumption of some debt  a source close to the deal said.",
        "date": "04012016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Exclusive: Brazil's Vale mulls sale of Thyssenkrupp steel venture stake "
    },
    {
        "content": "BRASILIA  April 6 Brazilian miner Vale SA  could sell a minority stake in its fertilizer unit by the end of the year  newspaper Valor said on Wednesday  citing unnamed market sources.",
        "date": "04062016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale could sell stake in fertilizer unit in 2016 -paper "
    },
    {
        "content": "BRASILIA  March 31 Brazil's Vale SA  the world's No. 2 mining company  said on Thursday that partner Mitsui & Co Ltd has no plans to revise the terms of a coal venture project in Mozambique  as reported by a newspaper.",
        "date": "03312016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale says Mitsui not reconsidering Mozambique coal venture "
    },
    {
        "content": "SAO PAULO  March 31 Vale SA  the world's No. 2 mining company  said on Thurday that partner Mitsui & Co Ltd has no plans to revise terms of a coal venture project in Mozambique  as reported by a local newspaper.",
        "date": "03312016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale says Mitsui has no plans to revise Mozambique coal venture "
    },
    {
        "content": "BRASILIA  March 31 Japanese trader Mitsui & Co Ltd is considering changing the terms of a 2014 stake purchase agreement with Vale SA in Mozambique after the Brazilian miner wrote off $2.4 billion in assets in the African country  newspaper Valor said on Thursday.",
        "date": "03312016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Mitsui mulls reviewing 2014 Vale deal in Mozambique - paper "
    },
    {
        "content": "SAO PAULORoger Agnelli  the Brazilian banker who turned Vale SA  into the world's No. 1 iron ore producer  died on Saturday in a plane crash. He was 56.",
        "date": "03202016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Agnelli  who turned Vale into top miner  dies in crash "
    },
    {
        "content": "SAO PAULO/RIO DE JANEIRO  March 23 Vale SA said on Wednesday that changes to its current dividend policies will be proposed at a shareholders' meeting on April 25  an indication the world's largest iron ore producer is looking to preserve cash amid a slump in prices.",
        "date": "03242016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale to propose change to dividend policy at shareholders meeting "
    },
    {
        "content": "SAO PAULO  March 20Roger Agnelli  the Brazilian banker who turned Vale SA into the world's No. 1 iron ore producer  died on Saturday in a plane crash. He was 56.",
        "date": "03202016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 5-Brazil's Agnelli  who turned Vale into top miner  dies in crash "
    },
    {
        "content": "RIO DE JANEIRO  March 18 Brazilian miner Vale SA  should be granted a temporary provision next week allowing it to operate a dam at the Brucutu mine  a state environmental official said in an interview.",
        "date": "03182016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil Vale should get permission to operate Brucutu dam next week -official "
    },
    {
        "content": "SAO PAULO Brazilian miner Vale SA  still plans to sell about $10 billion of assets in order to reduce debt  even after announcing it was in talks about potentially buying a minority stake in Australian rival Fortescue Metals Group   a press representative told Reuters on Wednesday.",
        "date": "03092016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil Vale still plans asset sales despite Fortescue talks "
    },
    {
        "content": "SAO PAULO  March 8 Brazilian miner Vale SA  still plans to sell about $10 billion of assets in order to reduce debt  even after announcing it was in talks about potentially buying a minority stake in Australian rival Fortescue Metals Group  a press representative told Reuters on Wednesday.   (Reporting by Gustavo Bonato  writing by Stephen Eisenhammer; Editing by David Gregorio)",
        "date": "03082016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil Vale still plans asset sales despite Fortescue talks "
    },
    {
        "content": "RIO DE JANEIRO/MELBOURNE The world's no.1 and no.4 iron ore miners are in talks that could see Brazil's Vale SA taking a minority stake in Australia-based Fortescue Metals Group and blending their iron ore to win market share in China.",
        "date": "03082016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale  Fortescue plan tie-up to boost iron ore market share in China "
    },
    {
        "content": "MANILA A planned tie-up between Brazil's Vale and Fortescue Metals Group  both leading iron ore miners  could make their supply more attractive for China's mills  improving and adapting quality at lower costs  Chinese steel players and traders said.",
        "date": "03082016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale's iron ore tie-up with Fortescue could entice Chinese mills "
    },
    {
        "content": "SAO PAULO  March 7 Brazilian miner Vale SA  said on Monday it signed a memorandum of understanding with Australian rival Fortescue Metals Group Ltd  to explore creating joint ventures to blend iron ore for the Chinese market.",
        "date": "03072016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale explores joint venture with Australia's Fortescue "
    },
    {
        "content": "BEIJING China's Commerce Ministry said on Thursday it had not received an application for regulatory approval from iron ore miners Vale and Fortescue Metals Group in relation to their planned joint venture.",
        "date": "03102016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "China says not received application from Vale  Fortescue for planned JV "
    },
    {
        "content": "SAO PAULO  March 8 Preferred shares Vale SA  fell in early trading on Tuesday after the Brazilian miner announced plans to form a joint venture with Australian rival Fortescue Metals Group Ltd with the aim of better serving Chinese steelmakers.       (Reporting by Reese Ewing; Editing by Chizu Nomiyama)",
        "date": "03082016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Shares of Brazil miner Vale fall after Fortescue JV plans "
    },
    {
        "content": "By Bruno Federowski and Paula Arend Laier     SAO PAULO  March 7 Brazilian shares on Monday advanced for the sixth straight day as heavyweights Vale  and Petrobras gained on stronger raw materials prices  though the market's upward momentum slowed after the previous week's big rallies.      Shares of Vale SA  the world's largest iron ore miner  rose to their highest in about four months  supported by a nearly 20 percent jump in spot iron ore prices for delivery to a Chinese port <",
        "date": "03072016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil stocks post 6th day of gains  helped by raw materials "
    },
    {
        "content": "BRASILIA  March 7 Shares of Brazilian miner Vale SA gained more than 8 percent in early trading on the Sao Paulo stock exchange after spot iron ore prices rocketed nearly 20 percent to the highest in more than eight months on Monday.    (Reporting by Silvio Cascione)",
        "date": "03072016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Shares in Brazil's Vale gain 8 pct on iron ore price rise "
    },
    {
        "content": "BEIJING  March 10 China's Commerce Ministry said on Thursday it had not received an application for regulatory approval from iron ore miners Vale and Fortescue Metals Group in relation to their planned joint venture.",
        "date": "03102016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "REFILE-China says not received application from Vale  Fortescue for planned JV "
    },
    {
        "content": "* Fortescue shares touch 16-month high   (Adds Fortescue CEO  China steel association comments)",
        "date": "03082016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Vale  Fortescue plan tie-up to boost iron ore market share in China "
    },
    {
        "content": "BRASILIA  March 3 Brazilian prosecutors on Thursday criticized a deal that mining company Samarco reached earlier this week with the federal government to pay an estimated 20 billion reais ($5.27 billion)in damages for a deadly dam spill in November.",
        "date": "03042016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazilian prosecutors question Samarco dam burst settlement "
    },
    {
        "content": "BRASILIA/RIO DE JANEIRO March 2 Mining company Samarco and its owners  BHP Billiton and Vale SA   reached a deal with the Brazilian government on Wednesday to pay an estimated 20 billion reais ($5.1 billion) in damages over 15 years for a deadly dam spill in November.",
        "date": "03022016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "CORRECTED(OFFICIAL)-UPDATE 2-Samarco to pay $5 bln in damages for dam disaster "
    },
    {
        "content": "BRASILIA Samarco Mineracao SA [SAMNE.UL] will pay at least 20 billion reais ($5 billion) over 15 years as part of a deal reached with the Brazilian government to settle a lawsuit for damages caused by a deadly dam spill at a mine in November  a government source told Reuters on Tuesday.",
        "date": "03022016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Samarco to pay at least $5 billion in Brazil dam spill deal: source "
    },
    {
        "content": "BRASILIA/RIO DE JANEIRO Mining company Samarco and its owners  BHP Billiton and Vale SA  reached a deal with the Brazilian government on Wednesday to pay an estimated 20 billion reais ($5.1 billion) in damages over 15 years for a deadly dam spill in November.",
        "date": "03032016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale/BHP's Samarco to pay $5.1 billion in damages for dam disaster "
    },
    {
        "content": "SYDNEY/WELLINGTON  March 3 Australian shares climbed 0.8 percent on Thursday as gains in commodity prices lifted the mining sector  while upbeat U.S. jobs data gave a fillip to risk sentiment generally.",
        "date": "03032016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Australia shares rise for third day  NZ hits record "
    },
    {
        "content": "BRASILIA/RIO DE JANEIRO March 2 Mining company Samarco and its owners  BHP Billiton and Vale SA   reached a deal with the Brazilian government on Wednesday to pay an estimated 20 billion reais ($5.1 billion) in damages over 15 years for a deadly dam spill in November.",
        "date": "03032016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 4-Vale/BHP's Samarco to pay $5 bln in damages for dam disaster "
    },
    {
        "content": "RIO DE JANEIRO Brazilian miner Vale SA  put its prime assets on the block on Thursday after taking the biggest loss in decades  but analysts said the target to make $10 billion in 18 months was unrealistic and expressed concern a fire sale could destroy equity value.",
        "date": "02252016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale looks to sell $10 billion of assets after massive loss "
    },
    {
        "content": "RIO DE JANEIRO  Feb 23 Workers who disrupted production at mine and transportation units of Brazilian mining company Vale SA in Brazil's Minas Gerais state suspended their strike late on Tuesday to engage in talks with the company  a union official said.",
        "date": "02232016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Vale union suspends strike over bonus payments for talks "
    },
    {
        "content": "SAO PAULO  Feb 24 Brazilian miner Vale SA  said on Wednesday its current chairman of the board Dan Antonio Marinho was being replaced by Gueitiro Matsuo Genso  currently president of pension fund Previ.",
        "date": "02242016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazilian iron ore miner Vale changes chairman of board "
    },
    {
        "content": "RIO DE JANEIRO  Feb 25 Brazilian miner Vale SA  put its prime assets on the block on Thursday after taking the biggest loss in decades  but analysts said the target to make $10 billion in 18 months was unrealistic and expressed concern a fire sale could destroy equity value.",
        "date": "02252016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale looks to sell $10 bln of assets after massive loss "
    },
    {
        "content": "SAO PAULO  Feb 25 Shares of Brazilian iron ore producer Vale SA fell more than 5 percent in early trading on the Sao Paulo stock exchange after the miner reported its biggest quarterly loss in 30 years on Thursday.    (Reporting by Marcelo Teixeira; Editing by Chizu Nomiyama)",
        "date": "02252016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Shares of Brazil's Vale fall more than 5 pct after large loss "
    },
    {
        "content": "RIO DE JANEIRO  Feb 23 Workers who disrupted production at mine and transportation units of Brazilian mining company Vale SA in Brazil's Minas Gerais state suspended their strike late Tuesday to engage in talks with the company  a union official said.",
        "date": "02232016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale union suspends strike over bonus payments for talks -official "
    },
    {
        "content": "RIO DE JANEIRO The metro line extension that will connect Rio de Janeiro's Olympic Park in Barra de Tijuca with the rest of the city is at risk of not being finished before the Games start in August  if a delayed development bank loan is not disbursed  two senior government sources told Reuters on Monday.",
        "date": "02222016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Rio subway line may not be finished before Games "
    },
    {
        "content": "SAO PAULO  Feb 24 Brazilian miner Vale SA  said on Wednesday that the Timbopeba iron ore mine in Minas Gerais was operating normally despite a union blockage at the workers' entrance during a two-and-a-half-hour period this morning.    (Reporting by Roberto Samora  writing by Stephen Eisenhammer)",
        "date": "02242016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil Vale says Timbopeba mine operating normally despite union action "
    },
    {
        "content": "RIO DE JANEIRO  Feb 24 Workers in Brazil at Vale's Timbopeba iron ore mine in Minas Gerais state went on strike early on Wednesday in protest over the payment of a profit sharing bonus  the local union said.",
        "date": "02242016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil workers at Vale's Timbopeba iron mine on strike over bonus "
    },
    {
        "content": "RIO DE JANEIRO  Feb 25 Brazilian miner Vale SA  reported a fourth-quarter net loss of $8.57 billion  its worst ever as a private company  as weak commodity prices and hefty writedowns heaped further pressure on the world's largest producer of iron ore.",
        "date": "02252016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale reports worst loss in 20 years on commodity slump "
    },
    {
        "content": "RIO DE JANEIRO  Feb 25 Brazilian miner Vale SA  reported a fourth-quarter net loss of $8.57 billion on Thursday  missing analyst forecasts and heaping further pressure on the world's largest producer of iron ore.    (Reporting by Stephen Eisenhammer)",
        "date": "02252016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazilian miner vale reports Q4 net loss of $ 8.57 bln "
    },
    {
        "content": "RIO DE JANEIRO  Feb 17 Brazil's Vale SA   the world's largest iron ore producer  said Wednesday that it began testing equipment at its $14.4 billion S11D mine at its massive Carajas complex in the Brazilian Amazon.",
        "date": "02172016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale says starts tests at its biggest ever iron ore mine "
    },
    {
        "content": "RIO DE JANEIRO  Feb 18 Brazilian miner Vale SA  produced record amounts of iron ore  nickel  copper  cobalt and gold as it battled a slump in global metals prices by boosting output in search of greater market share.",
        "date": "02182016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 3-Brazil's Vale posts record iron ore  nickel output even as prices slump "
    },
    {
        "content": "RIO DE JANEIRO  Feb 17 Brazil's Vale SA  the world's largest iron ore producer  said on Wednesday that it has begun testing equipment at its S11D mine  the company's largest ever  at its massive Carajas complex in the Brazilian Amazon.",
        "date": "02172016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale says starts tests at its biggest ever iron ore mine "
    },
    {
        "content": "RIO DE JANEIRO  Feb 18 Nine workers at a fertilizer plant owned by Brazilian mining company Vale SA  were sickened by an ammonia leak on Wednesday  company and union officials and local authorities in Araxa  Brazil said on Thursday.",
        "date": "02182016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale Brazil fertilizer plant suffers ammonia leak  sickening nine "
    },
    {
        "content": "RIO DE JANEIRO  Feb 18 Brazilian miner Vale SA  said on Thursday it produced 88.4 million tonnes of iron ore in the fourth quarter  a new record for the company.",
        "date": "02182016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale says 4th-Qtr iron ore output 88.4 mln tonnes "
    },
    {
        "content": "RIO DE JANEIRO  Feb 11 A judge in Brazil's state of Minas Gerais has frozen 470 million reais ($118 million) of assets owned by Vale SA and 1.8 million reais linked to BHP Billiton Ltd to ensure payment of damages related to a deadly dam rupture  Rio de Janeiro's O Globo newspaper said on Thursday.",
        "date": "02122016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil court freezes Vale  BHP  Samarco assets -report "
    },
    {
        "content": "LONDON  Feb 12 European stocks were seen rising on Friday  rebounding from the previous session's steep losses  with encouraging results from Commerzbank and a rally in oil prices expected to support banks and commodity-related stocks  and ease concerns over a slowdown in global growth.",
        "date": "02122016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "European Factors to Watch-Shares set for rebound  helped by banks and oil "
    },
    {
        "content": "Feb 12 Britain's FTSE 100 index is seen opening up 111 points  or 2 percent  on Friday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue-chip index closed 2.4 percent weaker at 5 536.97 points on Thursday  with a sharp sell-off in major banking and mining stocks pushing the market down to its lowest level in more than three years.      * BARCLAYS: Singapore's DBS Group Holdings and Oversea-Chinese Banking Co",
        "date": "02122016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UK Stocks-Factors to watch on Feb 12 "
    },
    {
        "content": "TOKYO Japan is on track to match its highest ever haul of gold medals at this year's Olympics in Rio de Janeiro  according to data and statistics company Infostrada Sports.",
        "date": "02052016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Japan set for rich medal haul in Rio: analysts "
    },
    {
        "content": "RIO DE JANEIRO  Jan 29 The price tag for the 2016 Olympics in Rio de Janeiro has risen by 400 million reais ($99.3 million) since August mainly due to rising costs of supplying temporary power and seating at venues  the head of the group monitoring spending said on Friday.",
        "date": "01292016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "OLYMPICS-Cost of Rio's 2016 Olympics rises by almost $100 million "
    },
    {
        "content": "RIO DE JANEIRO  Jan 28 Brazilian miner Vale SA  will recommend to its board that no dividend is paid to shareholders this year because of the slump in commodity prices  the company said on Thursday.",
        "date": "01282016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale scraps dividend as iron ore price slumps "
    },
    {
        "content": "RIO DE JANEIRO  Jan 25 Brazilian mining company Vale SA on Monday confirmed that an appeals court overturned an order closing its Port of Tubarao iron ore and coal terminals  allowing it to restart a facility responsible for about a third of its iron ore exports.",
        "date": "01252016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale confirms court order allowing it to reopen Port of Tubarao "
    },
    {
        "content": "RIO DE JANEIRO  Jan 28 Brazilian miner Vale SA  will recommend to its board that no dividend is paid to shareholders this year because of the slump in commodity prices  the company said on Thursday.",
        "date": "01282016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale scraps dividend for 2016 as iron ore price slumps "
    },
    {
        "content": "RIO DE JANEIRO  Jan 25 Brazilian mining company Vale SA won an injunction on Monday reopening the Port of Tubarao  near Vitoria  Brazil to iron ore exports and coal imports  overturning a court order last week that closed the terminal on environmental grounds  the company's lawyer told Reuters.",
        "date": "01252016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale wins order reopening iron port; has 60 days to fix problems "
    },
    {
        "content": "RIO DE JANEIRO  Jan 25 A Brazilian judge decided on Monday that miner Vale SA may reopen its iron ore and coal port near Vitoria  the company's lawyer said  staving off the possibility it will have to start closing mines.",
        "date": "01262016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Vale wins order reopening iron port for at least 60 days "
    },
    {
        "content": "LONDON World Sailing's chief says his efforts to get the Olympic sailing venue shifted from Rio's polluted Guanabara Bay to the cleaner and safer Buzios  a coastal resort some 160 km (100 miles) away  resulted in his being voted off the body.",
        "date": "01272016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Ex-sailing CEO says pushed out for Rio water concerns: AP "
    },
    {
        "content": "LONDON  Jan 27 World Sailing's chief says his efforts to get the Olympic sailing venue shifted from Rio's polluted Guanabara Bay to the cleaner and safer Buzios  a coastal resort some 160 km (100 miles) away  resulted in his being voted off the body.",
        "date": "01272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Olympics-Ex-sailing CEO says pushed out for Rio water concerns - AP "
    },
    {
        "content": "LONDON  Jan 27 World Sailing's chief says his efforts to get the Olympic sailing venue shifted from Rio's polluted Guanabara Bay to the cleaner and safer Buzios  a coastal resort some 160 km (100 miles) away  resulted in his being voted off the body.",
        "date": "01272016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Olympics-Former CEO says was pushed out for concerns over water - AP "
    },
    {
        "content": "RIO DE JANEIRO  Jan 22 The court-ordered closure of miner Vale SA's Port of Tubarão in Brazil has blocked the loading of some 200 000 tonnes of iron ore per day  the company said in a statement on Friday.",
        "date": "01222016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale says 200 000 tns/day of iron ore halted at Tubarão port "
    },
    {
        "content": "RIO DE JANEIRO  Jan 22 Moody's placed the credit ratings of Brazilian iron ore miner Vale SA under review for possible downgrade to \"junk\" status on Friday  one day after it put nine mining companies in Latin America on review for downgrade due to low metals prices.",
        "date": "01222016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Moody's puts miner Vale on review for possible downgrade to junk "
    },
    {
        "content": "RIO DE JANEIRO  Jan 22 The court-ordered closure of miner Vale SA's Port of Tubarão in Brazil has blocked the loading of some 200 000 tonnes of iron ore per day  the company said in a Friday statement.",
        "date": "01222016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale says 200 000 tns/day of iron ore halted at Tubarão port "
    },
    {
        "content": "* Brazil court orders closure of Port of Tubarão     * After sharp gains  futures come off highs     * Caution remains as weak demand  oversupply weigh   (Adds latest physical iron ore assessment from TSI)     By Ruby Lian and Manolo Serapio Jr     SHANGHAI/MANILA  Jan 22 Iron ore futures in China and Singapore rose on Friday after the closure of a major Brazilian port halted shipments by top iron ore miner Vale SA  offering some relief to an over-supplied market.     Unless the clos",
        "date": "01222016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Iron ore futures rise on supply risks after Vale port closure "
    },
    {
        "content": "SAO PAULO  Jan 22 Moody's placed the credit ratings of Brazilian iron ore miner Vale SA under review for downgrade on Friday  one day after it put nine mining companies in Latin America on review for downgrade due to low metals prices.",
        "date": "01222016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Moody's puts Brazil miner Vale under review for downgrade "
    },
    {
        "content": "RIO DE JANEIRO A Brazilian federal court on Thursday ordered the suspension of activities at Vale SA's Port of Tubarão until pollution concerns are fixed  halting the world's largest iron ore exporter's ability to ship more than a third of its output.",
        "date": "01222016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil court orders closure of Vale's Tubarão iron ore port "
    },
    {
        "content": "RIO DE JANEIRO  Jan 21 A Brazilian federal court on Thursday ordered the suspension of activities at Vale SA's  Port of Tubarão until pollution concerns are fixed  halting the world's largest iron ore exporter's ability to ship more than a third of its output.",
        "date": "01222016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Brazil court orders closure of Vale's Tubarão iron ore port "
    },
    {
        "content": "RIO DE JANEIRO  Jan 14 Brazilian mining company Vale SA said on Thursday it signed a deal with state-run lender Banco do Brasil for $50 million in export finance.",
        "date": "01142016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale signs $50 mln export finance deal with Banco do Brasil "
    },
    {
        "content": "RIO DE JANEIRO  Jan 12 Vale SA    the world's largest iron ore producer  said on Tuesday it drew down $3 billion from a revolving credit line to pay debt due this quarter  a move that shines a light on its fragile finances amid low commodity prices and faltering asset sales.",
        "date": "01122016",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale draws $3 billion of credit as asset sales falter "
    },
    {
        "content": "RIO DE JANEIRO  Jan 12 Brazilian miner Vale SA  said on Tuesday it has drawn down $3 billion of its $5 billion revolving credit line to improve liquidity and cover potential costs until it manages to close asset sales.",
        "date": "01122016",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale draws down $3 bln to cover costs until asset sales "
    },
    {
        "content": "By Stephen Eisenhammer     RIO DE JANEIRO  Dec 31 Within hours of a deadly mining spill in November that would become Brazil's worst environmental disaster  BHP Chief Executive Andrew Mackenzie was in front of a camera offering his sympathies to those affected.     Meanwhile  his counterpart at joint venture partner Vale SA   Murilo Ferreira  took nearly a week after the mine wastewater flood to talk to the press  setting the tone for a media strategy experts say has been slow and cl",
        "date": "12312015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Anger at Vale over Brazil mine accident fed by cautious  slow public response "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO Dec 19 A judge in Brazil's state of Minas Gerais has frozen the Brazilian assets of mining giants BHP Billiton and Vale SA after determining their joint venture Samarco was unable to pay for damage caused by the bursting of a dam at its mine last month.",
        "date": "12202015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "RPT-UPDATE 1-Judge blocks Brazilian assets of Vale  BHP after dam burst "
    },
    {
        "content": "RIO DE JANEIRO  Dec 21 Brazilian mining company Vale SA said on Monday its mining operations were continuing as normal and it still had not been notified of a court ruling on Friday to block the transfer or sale of mining rights after a deadly dam burst last month.",
        "date": "12212015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "CORRECTED(OFFICIAL)-UPDATE 1-Brazil Vale says operations normal despite asset freeze "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO Dec 19 A judge in Brazil's state of Minas Gerais has frozen the Brazilian assets of mining giants BHP Billiton and Vale SA after determining their joint venture Samarco was unable to pay for damages caused by a burst dam at its mine last month.",
        "date": "12192015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Judge blocks Brazilian assets of Vale  BHP after dam burst "
    },
    {
        "content": "RIO DE JANEIRO Brazil's Vale SA said on Sunday it will appeal a court decision to freeze some of it and BHP Billiton's Brazilian assets  saying the ruling  which declared the two mining companies responsible for a dam burst last month  was \"inappropriate.\"",
        "date": "12212015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil Vale says will appeal ruling to block assets for dam burst "
    },
    {
        "content": "RIO DE JANEIRO  Dec 21 Brazilian mining company Vale SA said on Monday that its mining operations were continuing as normal despite a court ruling on Friday that blocks the firm from extracting iron ore after a deadly dam burst last month.",
        "date": "12212015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil Vale says operations normal despite court asset freeze "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO Dec 19 A judge in Brazil's state of Minas Gerais has frozen the Brazilian assets of mining giants BHP Billiton and Vale SA after determining their joint venture Samarco was unable to pay for damage caused by the bursting of a dam at its mine last month.",
        "date": "12192015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Judge blocks Brazilian assets of Vale  BHP after dam burst "
    },
    {
        "content": "RIO DE JANEIRO  Dec 17 The African Development Bank approved a plan to provide as much as $300 million to help Brazilian mining company Vale SA finance the expansion of the Nacala logistics corridor in East Africa  Vale said in a statement on Thursday.",
        "date": "12172015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "African Development Bank approves loan for Vale Nacala rail plan "
    },
    {
        "content": "SAO PAULO  Dec 9 Brazilian iron ore miner Vale SA said late on Tuesday in a filing it had completed the sale of four very large ore carriers (VLOC)  also known as Valemax class ships  to a consortium lead by ICBC Financial Leasing.",
        "date": "12092015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale completes sale of 4 ore carriers to Chinese-led consortium "
    },
    {
        "content": "NEW YORK Brazil's Vale SA   said November's deadly mining disaster could cost it at least $443 million  but it was too early to put a price tag on what it expects to be a long clean-up from the pollution caused by the dam burst.",
        "date": "12022015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale sees at least $443 million mine disaster costs  long clean-up "
    },
    {
        "content": "NEW YORK  Dec 1 Brazil's Vale SA   said November's deadly mining disaster could cost it at least $443 million  but it was too early to put a price tag on what it expects to be a long clean-up from the pollution caused by the dam burst.",
        "date": "12022015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 5-Vale sees at least $443 mln mine disaster costs  long clean-up "
    },
    {
        "content": "RIO DE JANEIRO  Dec 2 Brazil's attorney general has asked the supreme court to uphold the closure of Brazilian mining company Vale SA's Onça Puma nickel mine for allegedly failing to meet the terms of its environmental license  the prosecutor said on Wednesday.",
        "date": "12032015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil asks court to uphold closure of Vale Amazon nickel mine "
    },
    {
        "content": "NEW YORK Brazil's Vale SA   said November's deadly mining disaster could cost it at least $443 million  but it was too early to put a price tag on what it expects to be a long clean-up from the pollution spilled in the dam burst.",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale sees at least $443 million mine disaster costs  long clean-up "
    },
    {
        "content": "SAO PAULO  Nov 30 Murilo Ferreira has quit as chairman of Brazilian state-controlled Petroleo Brasileiro SA  the company said on Monday  without disclosing the reason for his decision.",
        "date": "11302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale CEO Ferreira quits as chairman of Brazil's Petrobras "
    },
    {
        "content": "NEW YORK  Dec 1 Brazilian miner Vale  is operating a nickel processing plant at the Onca Puma project  an Amazon mine where a court has ordered mining activities halted  the company's nonferrous metals chief told Reuters on Tuesday.",
        "date": "12022015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale's Onca Puma ferro-nickel plant operates through court-ordered mine closure "
    },
    {
        "content": "NEW YORK  Dec 1 Brazil's Vale SA   said November's deadly mining disaster could cost it at least $443 million  but it was too early to put a price tag on what it expects to be a long clean-up from the pollution spilled in the dam burst.",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "CORRECTED-UPDATE 4-Vale sees at least $443 mln mine disaster costs  long clean-up "
    },
    {
        "content": "NEW YORK  Dec 1 (IFR) - Bonds issued by Brazilian miner Vale widened on Tuesday as officials in New York fended off questions about the financial impact of the recent dam burst at joint venture Samarco.",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "LATAM WRAP-Vale  Samarco weaken over disaster costs "
    },
    {
        "content": "* Aberdeen AM down on emerging market outflows   (Recasts  adds quote  detail)",
        "date": "11302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Britain's FTSE lags euro zone  pulled down by BHP and Aberdeen "
    },
    {
        "content": "NEW YORK  Dec 1 Brazil's Vale SA   prepared investors on Tuesday for a difficult 2016  unveiling a plan that includes cutting capital investment to about $6 billion and $443 million in expected costs to clean up a November mine disaster.",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "CORRECTED-UPDATE 2-Vale cuts 2016 budget  sees $443 mln mine disaster costs "
    },
    {
        "content": "SAO PAULO  Dec 1 Brazilian miner Vale SA  said in a Tuesday presentation that the impact of the Samarco dam burst could be $443 million in 2016 and that it planned to reduce investments to around $6 billion next year.",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "CORRECTED-Brazil's Vale estimates $443 mln Samarco impact in 2016 "
    },
    {
        "content": "LONDON  Dec 4 Brazil's Vale SA said on Friday that it plans to sell its 11 remaining Valemax iron ore carriers and lease them back in transactions that could raise $1.1 billion.",
        "date": "12042015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale says Valemax ship sale  leaseback could fetch $1.1 bln "
    },
    {
        "content": "Dec 1 Vale SA executives spoke on Tuesday at the New York Stock Exchanges for the Rio de Janeiro-based mining company's annual Vale Day investor conference",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BRIEF-Vale says it has no clear estimate of Samarco disaster cost "
    },
    {
        "content": "NEW YORK  Dec 1 Brazilian miner Vale SA  expects a 50 percent increase in output from its Goro New Caledonia Nickel project in 2016  non-ferrous metals chief Jennifer Maki said at an investor conference at the New York Stock Exchange on Tuesday.",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale expects Goro nickel mine output to rise 50 pct in 2016 "
    },
    {
        "content": "LONDON  Dec 4 Brazil's Vale SA  the world's leading iron ore producer  said on Friday it plans to drastically reduce ore stockpiles in its southern mine system in Minas Gerais state and expects to raise $1.1 billion from the sale of its remaining 11 Valemax very large ore carriers soon.   (Reporting by Maytaal Angel and Eric Onstad in London; Writing by Jeb Blount in Rio de Janeiro)",
        "date": "12042015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale says to reduce ore stocks and sell 11 Valemax carriers "
    },
    {
        "content": "SAO PAULO  Nov 30 Murilo Ferreira quit as chairman of Brazil's Petroleo Brasileiro SA  the state-controlled oil company said on Monday  without disclosing the reason for his decision.",
        "date": "11302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale CEO Ferreira quits as chairman of Brazil's Petrobras "
    },
    {
        "content": "SYDNEY/LONDON BHP Billiton shares dropped more than 5 percent to a seven-year low on Monday after Brazil announced plans to sue the mining company and its partners for 20 billion reais ($5.2 billion) over the bursting of a dam.",
        "date": "11302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BHP shares sink on Brazil's plan to sue over mine disaster "
    },
    {
        "content": "NEW YORK  Dec 1 Environmental recovery from a burst dam disaster at a Brazilian mine half-owned by Vale SA  will take time and a lot of help  miner Chief Executive Murilo Ferreira said at an event in New York on Tuesday.",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale says Samarco recovery will take time  assistance "
    },
    {
        "content": "RIO DE JANEIRO  Nov 27 Toxic materials such as arsenic were found in the water of the Rio Doce river days after a dam burst at a mine in Brazil earlier this month  an executive for Vale  the co-owner of the mine operator  confirmed on Friday.",
        "date": "11292015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "RPT-UPDATE 2-Vale confirms arsenic found in water days after Brazil dam burst "
    },
    {
        "content": "LONDON  Dec 4 Brazilian mining company Vale SA hopes to have all the displaced victims of a deadly dam-burst disaster at the Samarco Mineração SA mine in Brazil's Minas Gerais state in permanent homes by Christmas  chief financial officer Luciano Siani said on Friday.",
        "date": "12042015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale hopes to have Samarco victims in homes by Christmas "
    },
    {
        "content": "SYDNEY/LONDON  Nov 30 BHP Billiton  shares dropped more than 5 percent to a seven-year low on Monday after Brazil announced plans to sue the mining company and its partners for 20 billion reais ($5.2 billion) over the bursting of a dam.",
        "date": "11302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-BHP shares sink on Brazil's plan to sue over mine disaster "
    },
    {
        "content": "LONDON  Nov 30 Britain's top share index edged lower on Monday  with mining company BHP Billiton falling on the prospect of a hefty fine in Brazil and Aberdeen Asset Management slipping after it reported outflows from its emerging market funds.",
        "date": "11302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Britain's FTSE edges lower  pulled down by BHP and Aberdeen "
    },
    {
        "content": "SAO PAULO  Dec 1 Brazilian miner Vale SA  said in a Tuesday presentation that the impact of the Samarco dam burst could be $443 million in 2016 and that it planned to reduce investments by around $6 billion next year.",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale estimates $443 mln Samarco impact in 2016 "
    },
    {
        "content": "BRASILIA Brazil filed a lawsuit on Monday against two of the world's largest mining companies for 20 billion Brazilian reais ($5.2 billion) to clean up what it says was its worst environmental disaster  caused by the collapse of a tailings dam.",
        "date": "12012015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil sues BHP  Vale for $5 billion in damages for mine disaster "
    },
    {
        "content": "BRASILIA  Nov 27 Brazil's federal and state governments plan to sue the owners of the Samarco iron ore miner for 20 billion reais ($5.24 billion)in damages caused by the burst of a tailings dam  Environment Minister Izabella Teixeira told reporters on Friday.",
        "date": "11292015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "RPT-UPDATE 2-Brazil to sue BHP  Vale for $5 bln in damages for dam burst "
    },
    {
        "content": "SYDNEY  Nov 30 BHP Billiton   said on Monday its chairman and three other board members would oversee its response to the Samarco mine disaster in Brazil as clean-up efforts continue amid confirmation arsenic had been found in river water.",
        "date": "11302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BHP names chairman  board members to oversee Samarco disaster "
    },
    {
        "content": "BRASILIA Brazil's federal and state governments plan to sue the owners of the Samarco iron ore miner for 20 billion reais ($5.24 billion)in damages caused by the burst of a tailings dam  Environment Minister Izabella Teixeira told reporters on Friday.",
        "date": "11272015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil to sue BHP  Vale for $5 billion in damages for dam burst "
    },
    {
        "content": "RIO DE JANEIRO Toxic materials such as arsenic were found in the water of the Rio Doce river days after a dam burst at a mine in Brazil earlier this month  an executive for Vale  the co-owner of the mine operator  confirmed on Friday.",
        "date": "11272015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale confirms arsenic found in water days after Brazil dam burst "
    },
    {
        "content": "RIO DE JANEIRO  Nov 27 Toxic materials such as arsenic were found in the water of the Rio Doce river days after a dam burst at a mine in Brazil earlier this month  an executive for Vale  the co-owner of the mine operator  confirmed on Friday.",
        "date": "11272015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Vale confirms arsenic found in water days after Brazil dam burst "
    },
    {
        "content": "BRASILIA/NEW YORK A U.S. judge on Friday dismissed Rio Tinto's lawsuit accusing rival Vale and others of conspiring to misappropriate its mining rights in the Simandou region in Guinea.",
        "date": "11202015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "U.S. judge dismisses Rio Tinto lawsuit against Vale "
    },
    {
        "content": "MARIANA  Brazil  Nov 19 Workers at Brazilian iron ore miner Vale SA fear for their safety after the Samarco dam burst in the town of Mariana  where the company was reducing the number of employees because of weak ore prices  despite its push for output and complaints about safety.",
        "date": "11192015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale workers fear for safety after Brazil's Samarco disaster "
    },
    {
        "content": "BRASILIA  Nov 27 Brazil's federal and state governments plan to sue the owners of the Samarco iron ore miner for 20 billion reais ($5.24 billion)in damages caused by the burst of a tailings dam  Environment Minister Izabella Teixeira told reporters on Friday.",
        "date": "11272015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil to sue BHP  Vale for $5 bln in damages for dam burst "
    },
    {
        "content": "BRASILIA  Nov 27 Brazil's federal and state governments plan to sue the owners of the Samarco iron ore miner for 20 billion reais ($5.24 billion)in damages caused by the burst of a tailings pond dam  Environment Minister Izabella Teixeira told reporters on Friday.",
        "date": "11272015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil to sue BHP  Vale for $5 bln in damages for dam burst "
    },
    {
        "content": "BRASILIA/NEW YORK  Nov 20 A U.S. judge on Friday dismissed Rio Tinto's lawsuit accusing rival Vale  and others of conspiring to misappropriate its mining rights in the Simandou region in Guinea.",
        "date": "11222015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "RPT-UPDATE 3-U.S. judge dismisses Rio Tinto lawsuit against Vale "
    },
    {
        "content": "BRASILIA/NEW YORK  Nov 20 A U.S. judge on Friday dismissed Rio Tinto's lawsuit accusing rival Vale  and others of conspiring to misappropriate its mining rights in the Simandou region in Guinea.",
        "date": "11202015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-U.S. judge dismisses Rio Tinto lawsuit against Vale "
    },
    {
        "content": "WINNIPEG  Manitoba Potash-rich Saskatchewan hopes to revise its taxes on production of the crop fertilizer to avoid big revenue drops in years when prices sag  the Canadian province's economy minister said on Friday.",
        "date": "11202015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Saskatchewan seeks price protection in altering potash taxes "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 19 Brazilian miner Vale SA will close its nickel smelting and refining operations in the western Canadian province of Manitoba in 2018  but will continue mining and milling despite the plunge in the price of nickel  a company official said on Thursday.",
        "date": "11192015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale to shut Manitoba nickel smelting  refining in 2018 "
    },
    {
        "content": "SAO PAULO  Nov 19 Brazil's Vale SA    the world's largest iron ore producer  plans to raise 1.5 billion reais ($400 million) through the sale of seven-year notes to state-controlled Banco do Brasil SA .",
        "date": "11192015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "CORRECTED-Vale to sell $400 mln in export trade notes to Banco do Brasil "
    },
    {
        "content": "RIO DE JANEIRO The cost of a deadly dam burst at an iron ore mine in Brazil run by Samarco has already exceeded the insurance cap for civil damages  co-owner Vale SA said on Monday.",
        "date": "11162015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale says Samarco costs already exceed insurance "
    },
    {
        "content": "RIO DE JANEIRO  Nov 16 The cost of a deadly dam burst at an iron ore mine in Brazil run by Samarco has already exceeded the insurance cap for civil damages  co-owner Vale SA  said on Monday.",
        "date": "11162015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale says Samarco costs already exceed insurance "
    },
    {
        "content": "MARIANA  Brazil As despair turns to anger over a deadly dam burst at a Brazilian mine  lawmakers pushed on Tuesday for tougher regulations in a new mining code and iron ore giant Vale SA came under pressure to help mourning families and contain the environmental impact.",
        "date": "11112015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Anger at burst dams in Brazil focuses on Vale  mining code "
    },
    {
        "content": "BENTO RODRIGUES  Brazil  Nov 9 A river of mud from burst dams at a Brazilian iron ore mine forced populous cities more than 300 km (200 miles) downstream to cut off drinking water on Monday  raising health and environmental concerns as slow-moving search efforts continued.",
        "date": "11092015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil mine dam burst endangers water supply far downstream "
    },
    {
        "content": "MARIANA  Brazil  Nov 10 As despair turns to anger over a deadly dam burst at a Brazilian mine  lawmakers pushed on Tuesday for tougher regulations in a new mining code and iron ore giant Vale SA came under pressure to help mourning families and contain the environmental impact.",
        "date": "11112015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Anger at burst dams in Brazil focuses on Vale  mining code "
    },
    {
        "content": "MARIANA  Brazil  Nov 9 Mudslides from burst dams at the Germano mine complex in Brazil have taken out a conveyor belt at a nearby mine and will affect the output of iron ore giant Vale SA   the company told Reuters on Monday.",
        "date": "11092015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale says burst dams in Brazil to hit Mariana output "
    },
    {
        "content": "MARIANA  Brazil  Nov 10 As despair turns to anger over a deadly dam burst at a Brazilian mine  lawmakers pushed on Tuesday for tougher regulations in a new mining code and iron ore giant Vale SA came under pressure to help mourning families and contain the environmental impact.",
        "date": "11102015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Anger at burst dams in Brazil focuses on Vale  mining code "
    },
    {
        "content": "NEW YORK  Nov 9 (IFR) - LatAm debt markets started the week on a softer note Monday as investors digested the increasing possibility of a US rate hike in December following last week's strong payroll numbers.",
        "date": "11092015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "LATAM WRAP-LatAm bond markets weaken on rate concerns "
    },
    {
        "content": "MARIANA  Brazil  Nov 10 Brazilian public prosecutors secured a court injunction on Tuesday that requires the Vale-BHP joint iron ore venture Samarco to undertake emergency measures to mitigate environmental damage after the project's dam unleashed a flood of mud.",
        "date": "11102015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil court orders Samarco take emergency actions after dam break "
    },
    {
        "content": "RIO DE JANEIRO  Nov 10 Brazilian mining company Vale SA said on Monday that a deadly collapse of a tailings dam at Brazil's Samarco  an iron ore company it owns 50-50 with Australia's BHP Billiton Plc  will cut output from two nearby mines.",
        "date": "11102015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale says Samarco disaster to cut output at nearby mines "
    },
    {
        "content": "RIO DE JANEIRO  Nov 10 Brazilian mining company Vale SA said on Monday that a deadly collapse of a tailings dam at Brazil's Samarco  an iron ore company it owns 50-50 with Australia's BHP Billiton Plc  will cut output from two nearby mines.",
        "date": "11102015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale says Samarco disaster to cut output at nearby mines "
    },
    {
        "content": "* Vale's CEO estimates China is currently producing between 180 and 190 million tonnes of grade-adjusted iron ore per year  down from 240 million tonnes in 2014",
        "date": "10222015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "BRIEF-Vale CEO estimates China producing 180 mln tonnes of iron ore "
    },
    {
        "content": "RIO DE JANEIRO  Oct 22 Brazilian miner Vale SA  on Thursday posted a net loss of $2.1 billion in the third quarter due to low iron ore and nickel prices and a weakening real against the dollar.",
        "date": "10222015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2-Vale posts $2 bln loss on weak Brazil currency  low iron ore prices "
    },
    {
        "content": "RIO DE JANEIRO  Oct 22 Brazilian miner Vale SA  expects to renegotiate ocean freight transportation rates in 2016  cutting costs and increasing trade competitiveness  company executives said on a conference call with investors on Thursday.",
        "date": "10222015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale expects to negotiate ocean freight rates  cut costs in 2016 "
    },
    {
        "content": "RIO DE JANEIRO  Oct 22 Brazilian miner Vale SA  reported on Thursday a net loss of $2.12 billion in the third quarter due to low iron ore prices and a weakening real against the dollar.",
        "date": "10222015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale posts $2 bln loss in 3rd-qtr "
    },
    {
        "content": "BRASILIA  Oct 19 Brazilian miner Vale SA  said on Monday it produced 88.2 million tonnes of iron ore in the third quarter  an all-time high for the company  as it continues to raise output into an already oversupplied market.",
        "date": "10192015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale hits iron ore production record in 3rd-qtr "
    },
    {
        "content": "BRASILIA  Oct 19 Brazilian miner Vale SA  said on Monday it produced 88.2 million tonnes of iron ore in the third quarter  a new record for the company.",
        "date": "10192015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale hits iron ore record in 3rd-qtr "
    },
    {
        "content": "RIO DE JANEIRO  Oct 15 Brazilian miner Vale SA  said on Thursday its board approved the payment of a second dividend installment this year of $500 million.",
        "date": "10152015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "RPT-Board of Brazil's Vale approves second dividend payment "
    },
    {
        "content": "Oct 9 Environment Canada raided one of mining giant Vale SA's Sudbury  Ontario offices on Thursday  investigating allegations that the company violated the Fisheries Act in 2012  the company said on Friday.",
        "date": "10092015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Canada environmental officers raid Vale offices in Ontario "
    },
    {
        "content": "Oct 9 Environment Canada raided one of mining giant Vale SA's Sudbury  Ontario offices on Thursday  investigating allegations that the company violated the Fisheries Act in 2012  the company said on Friday.",
        "date": "10092015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Canadian environment authorities raid Vale offices in Ontario "
    },
    {
        "content": "RIO DE JANEIRO  Sept 28 Brazil's Vale SA  said on Monday it plans to cut its dividend for the year by $500 million in order to help shore up the miner's balance sheet in the face of weaker commodity prices  especially iron ore.",
        "date": "09282015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale cuts dividend in face of iron ore rout "
    },
    {
        "content": "* China steel exports seen at 100 mln T/year as local demand peaks   (Adds details throughout)",
        "date": "09232015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Vale vows deeper iron ore cost cut as China's steel demand peaks "
    },
    {
        "content": "SAO LUIS  Brazil Two kilometers out to sea  workers battle treacherous currents to build a huge dock capable of loading the largest iron ore ships on earth  a vital step as Brazil's Vale fights for dominance in a tumbling market.",
        "date": "09202015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Trains  tides and tons: Vale leads Brazil's iron ore expansion "
    },
    {
        "content": "RIO DE JANEIRO  Sept 24 Brazilian miner Vale SA  said on Thursday it approved the election of Jennifer Maki as executive director of the company's base metals division.",
        "date": "09242015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale approves Jennifer Maki as base metals head "
    },
    {
        "content": "RIO DE JANEIRO  Sept 14 Murilo Ferreira will take a leave of absence as chairman of state-run oil firm Petrobras  turning his full attention to his job as chief executive of Vale SA  as the mining giant grapples with a downturn in the sector.",
        "date": "09142015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Petrobras chairman to take leave  to focus on job as Vale CEO "
    },
    {
        "content": "RIO DE JANEIRO  Sept 14 The chairman of Brazil's Petrobras  Murilo Ferreira requested leave from the state-run oil company to focus on running mining giant Vale SA  a senior Petrobras source said on Monday.",
        "date": "09142015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Petrobras chairman asked for leave to focus on running Vale -source "
    },
    {
        "content": "SAO LUIS  Brazil  Sept 19 Two kilometers out to sea  workers battle treacherous currents to build a huge dock capable of loading the largest iron ore ships on earth  a vital step as Brazil's Vale fights for dominance in a tumbling market.",
        "date": "09192015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Trains  tides and tonnes: Vale leads Brazil's iron ore expansion "
    },
    {
        "content": "RIO DE JANEIRO  Sept 14 Murilo Ferreira will take a leave of absence as chairman of state-run oil firm Petrobras  turning his full attention to his job as chief executive officer of Vale SA as the mining company grapples with a downturn in the sector.",
        "date": "09152015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Petrobras chairman to take leave  to focus on job as Vale CEO "
    },
    {
        "content": "RIO DE JANEIRO  Sept 11 Brazilian miner Vale SA  said on Friday it launched a public offering for 1.35 billion reais ($352 million) of debentures.",
        "date": "09112015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale offers 1.35 bln reais in debentures "
    },
    {
        "content": "SAO PAULO  Sept 4 China's stock market crash and currency devaluation have not dampened the optimism of mining giant Vale's chief executive  who said he is most upbeat on the iron ore market in two years  according to a newspaper interview published Friday.",
        "date": "09042015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale CEO still upbeat on China  iron ore market -paper "
    },
    {
        "content": "RIO DE JANEIRO  Sept 2 Brazil's Vale SA  said on Wednesday it had received a ruling allowing it to restart operations at the Onca Puma nickel mine in Para state.",
        "date": "09022015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "CORRECTED-Brazil's Vale says permitted to restart Onca Puma nickel mine "
    },
    {
        "content": "RIO DE JANEIRO  Aug 26 Global mining and trading firm Glencore Plc and Australia's Bloomfield Group agreed to acquire Vale's Integra coal mine in Australia for undisclosed terms  the buyers said in an emailed statement on Wednesday.",
        "date": "08262015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Glencore  Bloomfield buy Vale coal mine in Australia "
    },
    {
        "content": "RIO DE JANEIRO/SYDNEY Brazilian mining giant Vale has continued its disposal of non-core holdings  agreeing to sell a mothballed coal mine in Australia jointly to Glencore Plc and Bloomfield Group for an undisclosed sum.",
        "date": "08272015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale sells another coal mine in Australia "
    },
    {
        "content": "* Buyers are Glencore  Bloomfield   (Adds comment  details  SYDNEY dateline)",
        "date": "08272015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale sells another coal mine in Australia "
    },
    {
        "content": "TORONTO A nitrogen oxide leak sent a yellow plume up from Vale SA's Copper Cliff nickel and copper smelter in Sudbury  Ontario early on Thursday morning  forcing the company to declare an emergency at the plant.",
        "date": "08132015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Safety incidents at Vale's operations in Canada "
    },
    {
        "content": "RIO DE JANEIRO  Aug 14 Vale SA stopped operations at its Onça Puma nickel mine in Brazil's Amazon after a Brazilian federal court on Friday ordered the halt because of disputed payments to indigenous communities.",
        "date": "08142015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Vale halts Amazon nickel mine output after court order "
    },
    {
        "content": "SAO PAULO  Aug 5 The board of Vale SA   the world's largest iron ore producer  on Wednesday approved plans to raise 1 billion reais ($287 million) from the sale of debt notes to expand the railway system at its Carajas ore mine.",
        "date": "08052015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale plans debt sale to expand Carajas railway "
    },
    {
        "content": "SAO PAULO  Aug 5 The board of Vale SA   the world's largest iron ore producer  on Wednesday approved plans to raise 1 billion reais ($287 million) from the sale of debt notes to expand the railway system at the Carajas ore mine.",
        "date": "08052015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale plans debt sale to expand Carajas railway "
    },
    {
        "content": "SAO PAULO  Aug 5 Latin American currencies dropped on Wednesday on expectations for a September increase in U.S. interest rates after strong service sector data offset weaker jobs numbers in the world's largest economy.     Equities were mostly higher as mining company Vale SA  helped the Bovespa stock index nearly erase losses from the previous two sessions.     U.S. private job growth slowed sharply in July  according to the ADP National Employment Report released early on Wednesda",
        "date": "08052015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Latam currencies sink on strong U.S. service sector data "
    },
    {
        "content": "SAO PAULO  Aug 5 Brazilian miner Vale  expects to invest $4 billion in the second half of 2015 and sees total investments of between $8 billion and $8.5 billion in the full year  according to a presentation on Wednesday.",
        "date": "08052015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale estimates 2015 investment of $8-8.5 bln "
    },
    {
        "content": "NEW YORK  July 30 (IFR) - Brazilian credits enjoyed a rare day of stable price action on Thursday led by miner Vale  whose bonds were some 20bp narrower following the release of better-than-expected results.",
        "date": "07302015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "LATAM WRAP-Vale outperforms as Brazil credits stable "
    },
    {
        "content": "* Vale iron ore chief says iron ore production for 2016 will be below previous guidance of 376 million tonnes",
        "date": "07302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BRIEF-Vale signals cut to iron ore production outlook for 2016 "
    },
    {
        "content": "RIO DE JANEIRO  July 30 Vale SA  the world's biggest iron ore producer  returned to profit in the second quarter  bolstered by higher output and cost cuts as it kept up pressure on Australian rivals in its fight for market share.",
        "date": "07302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Vale returns to profit  signals cut to 2016 iron ore outlook "
    },
    {
        "content": "RIO DE JANEIRO  July 30 Brazilian miner Vale SA  said on Thursday that the collapse of a coal stacker at its port in Mozambique will not affect forecast coal production for next year.",
        "date": "07302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale says Mozambique coal stacker collapse won't affect 2016 production "
    },
    {
        "content": "RIO DE JANEIRO  July 30 Brazilian miner Vale SA  said on Thursday it is selling a 36.4 percent stake in Minerações Brasileiras Reunidas SA for 4 billion reais ($1.2 billion) to an investment vehicle managed by Bradesco BBI SA .",
        "date": "07302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale sells stake in MBR subsidiary for 4 bln reais "
    },
    {
        "content": "RIO DE JANEIRO  July 30 Brazilian mining company Vale SA said on Thursday the start up of Cia Siderurgica do Pecem (CSP)  a Brazilian steel mill being built with Korea's Posco and Dongkuk Steel Mill Co   will be delayed until the first half of 2016 from the second half of 2015 because of a strike.",
        "date": "07302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale says start of Posco  Dongkuk Brazil steel mill delayed to 2016 "
    },
    {
        "content": "RIO DE JANEIRO  July 30 Brazilian mining company Vale SA said on Thursday that it expects to receive $448 million from the sale of four dry-bulk iron ore ships to China's state-owned China Merchants Energy Shipping Co  in September.",
        "date": "07302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale to receive $448 mln from ore ship sale in September "
    },
    {
        "content": "RIO DE JANEIRO  July 30 Brazilian miner Vale SA  posted second-quarter net profit of $1.68 billion on Thursday bolstered by a recovery in iron ore prices during the period and the weakening real.",
        "date": "07302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale beats forecasts with Q2 profit of $1.7 bln "
    },
    {
        "content": "MAPUTO  July 27 A coal stacker has collapsed at the Mozambique port of Nacala  dealing a blow to Brazilian miner Vale's effort to start coal shipments from the African nation in the third quarter  sources told Reuters on Monday.",
        "date": "07272015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Mozambique port accident deals blow to Vale coal project -sources "
    },
    {
        "content": "RIO DE JANEIRO  July 23 Brazilian mining company Vale SA said on Thursday it produced 85.3 million tonnes of iron ore in the second quarter  a record for the quarter and second-highest ever for the firm.",
        "date": "07232015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Brazil's Vale pressures rivals with 2nd-qtr iron ore record "
    },
    {
        "content": "RIO DE JANEIRO  July 23 Brazilian mining company Vale SA said on Thursday it produced 85.3 million tonnes of its own iron ore in the second quarter  the second highest quarterly production ever for the firm.",
        "date": "07232015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale produced 85.3 mln tonnes of iron ore in 2nd-qtr "
    },
    {
        "content": "SYDNEY  July 16 As Rio Tinto and BHP Billiton ship more iron ore than ever to China  the Australia mining giants face a fightback from Brazil's Vale  for market share that threatens to drive already weak prices even lower.",
        "date": "07152015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale's designs on China add to Rio  BHP drive for more iron ore "
    },
    {
        "content": "LONDON Its nuclear deal with world powers bodes well for Iran's crude oil sales but offers less for Tehran's second biggest export  iron ore  as low prices squeeze private miners out of business.",
        "date": "07152015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Little joy for Iran's private iron ore exporters from nuclear deal "
    },
    {
        "content": "SYDNEY As Rio Tinto and BHP Billiton ship more iron ore than ever to China  the Australia mining giants face a fightback from Brazil's Vale for market share that threatens to drive already weak prices even lower.",
        "date": "07162015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale's designs on China add to Rio  BHP drive for more iron ore "
    },
    {
        "content": "RIO DE JANEIRO  June 30 Latin American stocks rose modestly on Tuesday as some investors bet Greece could still strike a deal to remain in the euro zone  but a sharp fall in shares of miner Vale weighed on the Brazilian bourse.     Shares of Latin American companies tracked by a benchmark MSCI index rose 0.5 percent  partly recovering from a nearly 4 percent drop in the past eight sessions. Gains followed reports that Greece would be willing to suspend a Sunday referendum on the term",
        "date": "06302015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Latam stocks rise cautiously as investors eye Greece "
    },
    {
        "content": "SHANGHAI China said on Friday it will allow 400 000-deadweight tonne ships to dock at its ports  officially ending a more than three-year ban that had effectively shut out Brazilian miner Vale SA's giant vessels.",
        "date": "07032015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "China to lift ban on entry of miner Vale's mega-ships "
    },
    {
        "content": "SHANGHAI  July 3 China said on Friday it will allow 400 000-deadweight tonne ships to dock at its ports  officially ending a more than three-year ban that had effectively shut out Brazilian miner Vale SA's giant vessels.",
        "date": "07032015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-China to lift ban on entry of miner Vale's mega-ships "
    },
    {
        "content": "June 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "06242015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "SAO PAULO Brazilian miner Vale SA could raise about $1.5 billion through the sale of a stake in one of its Brazil-based assets  a senior executive said on Wednesday.",
        "date": "06242015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale expects to raise $1.5 billion from asset sale in Brazil "
    },
    {
        "content": "SAO PAULO  June 24 Brazilian miner Vale SA  could raise about $1.5 billion through the sale of a stake in one of its Brazil-based assets  a senior executive said on Wednesday.",
        "date": "06242015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Vale expects to raise $1.5 bln from asset sale in Brazil "
    },
    {
        "content": "RIO DE JANEIRO  June 10 Brazilian miner Vale  revised on Wednesday its break even price for producing a tonne of iron ore and shipping it to China to between $37 and $41 in 2015  down from $43 previously  as it cuts costs because of slumping iron prices.",
        "date": "06102015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale says iron ore break even price $37-$41 in 2015 "
    },
    {
        "content": "SAO PAULO  June 2 Shares of Brazilian miner Vale SA jumped more than 6 percent on Tuesday  driving the benchmark Bovespa index up nearly 2 percent  while hopes that Greece is near an agreement with its creditors supported Latin American currencies in general.     Vale's shares rallied as iron ore futures rose to a three-week high in China. Shares of steelmaker Companhia Siderurgica Nacional  which have a smaller weight on the Bovespa index  rose for the same reason.      The Bovespa ",
        "date": "06022015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Vale drives up Brazil Bovespa  currencies gain on Greece deal hopes "
    },
    {
        "content": "RIO DE JANEIRO  May 19 Brazilian miner Vale  said on Tuesday it agreed to sell four large iron ore carriers to China Merchants Energy Shipping Co (CMES)   as it looks to raise cash in the midst of an iron ore price slump.",
        "date": "05192015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale to sell 4 large iron ore carriers to China's CMES "
    },
    {
        "content": "RIO DE JANEIRO  May 19 Brazilian miner Vale  said on Tuesday it agreed to sell four large iron ore carriers to China Merchants Energy Shipping Co (CMES)   as it looks to raise cash in the midst of an iron ore price slump.",
        "date": "05192015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale to sell 4 large iron ore carriers to China's CMES "
    },
    {
        "content": "RIO DE JANEIRO  May 18 Brazil's benchmark Bovespa index dropped more than 1 percent on Monday as shares of banks and miners weighed  while Latin American currencies weakened as higher U.S. Treasuries yields lured investors out of riskier assets.     Shares of Brazilian banks Bradesco slid 3.2 percent while Itau Unibanco dropped 2.1 percent on concerns the government may increase taxes on the banking sector to help it plug a growing fiscal deficit.     Shares of miner Vale  the world'",
        "date": "05182015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil's Bovespa drops with banking shares  Vale "
    },
    {
        "content": "RIO DE JANEIRO  May 15 Brazilian miner Vale  said on Friday it secured a $3 billion revolving credit facility for a term of five years.",
        "date": "05152015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale secures $3 bln credit line "
    },
    {
        "content": "BRASILIA  May 13 Caixa Econômica Federal  Brazil's top mortgage lender  and the Industrial and Commercial Bank of China Ltd (ICBC)  will create a $50 billion fund for Brazilian  infrastructure investments  two government sources with knowledge of the plans said on Wednesday.",
        "date": "05132015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "China's ICBC  Brazil's Caixa to start $50 billion fund -sources "
    },
    {
        "content": "SAO PAULO  May 11 Shares of Brazilian iron-ore producer Vale SA led the Bovespa stock index higher on Monday after top customer China announced it would lower interest rates to boost economic growth.     Brazil's real   however  weakened alongside other Latin American currencies on concern over Greek debt talks.     China cut interest rates for the third time in six months on Sunday to help stoke a domestic economy that is headed for its worst year in a quarter of a century.      Chi",
        "date": "05112015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Brazil's Vale advances on China rates; currencies slide "
    },
    {
        "content": "PERTH/LONDON Rio Tinto is to stick with plans to produce iron ore at full tilt despite a plunge in prices  turning up the heat on rivals large and small  which are struggling to cope with the consequences of a supply glut.",
        "date": "05072015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Rio Tinto unshakeable on iron ore expansion plans "
    },
    {
        "content": "(Adds Vale driving Brazil stocks up; updates prices)     By Walter Brandimarte     RIO DE JANEIRO  May 4 Shares of miner Vale SA drove Brazil's benchmark Bovespa index higher on Monday  while the real dropped 2 percent after the central bank signaled it will reduce the rollover pace of currency swaps.     Common shares of Vale jumped more than 9 percent  adding to gains of 7.3 percent in the previous session  after the world's largest producer of iron ore said it could reduce its ",
        "date": "05042015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Vale drives Bovespa higher; Brazil real drops 2 pct "
    },
    {
        "content": "By Walter Brandimarte     RIO DE JANEIRO  May 5 Latin American financial markets benefited from hopes that the U.S. Federal Reserve may take just a little longer to raise interest rates  while shares of state-run oil company Petrobras and iron ore miner Vale drove Brazil's benchmark stock index to its highest level in nearly seven months.     Shares of Petroleo Brasileiro SA  as the oil company is formally known  gained 4.6 percent on bets that Brazil may ease stringent national cont",
        "date": "05052015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Petrobras  Vale drive Brazil Bovespa to 7-month high "
    },
    {
        "content": "SINGAPORE/MELBOURNE  May 6 Rio Tinto  the most profitable iron ore producer  is in a strong position to keep its mines running at full tilt  even as rivals BHP Billiton and Brazil's Vale  apply the brakes in a market suffering a supply glut.",
        "date": "05062015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Rio Tinto tipped to stick to no-output cut mantra on iron ore "
    },
    {
        "content": "RIO DE JANEIRO Brazil's Vale SA said on Thursday it could reduce forecasted iron ore production by up to 30 million tonnes over the next two years  as the miner tries to resuscitate margins in the midst of a severe price slump.",
        "date": "05012015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale signals cut in production growth as iron price slumps "
    },
    {
        "content": "NEW YORK  April 28 (IFR) - Brazilian corporates including Petrobras and Vale extended losses on Tuesday  as investors sought to lock in profits after the recent rally in Latin American credits.",
        "date": "04282015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Petrobras  Vale underperform in quiet market "
    },
    {
        "content": "RIO DE JANEIRO  April 30 Brazil's Vale SA  said on Thursday it could reduce forecasted iron ore production by up to 30 million tonnes over the next two years  as the miner tries to resuscitate margins in the midst of a severe price slump.",
        "date": "04302015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Vale signals cut in production growth as iron price slumps "
    },
    {
        "content": "MELBOURNE/LONDON  April 27 Brazil's Vale SA  has chosen Barclays to advise it on the sale of some or all of its Australian coal assets  two people close to the situation said on Monday  as the company looks to raise money to ride out the commodities rout.",
        "date": "04272015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "RPT-Vale taps Barclays to advise on Australian asset sale - sources "
    },
    {
        "content": "RIO DE JANEIRO  April 30 Brazil's miner Vale SA  may cut its iron ore production forecast by up to 30 million tonnes over the next two years as it struggles with falling prices  the company's Head of Ferrous Peter Poppinga told investors during a conference call on Thursday.   (Reporting by Stephen Eisenhammer; Editing by Alden Bentley)",
        "date": "04302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale says may cut output goal by up to 30 mln tonnes by 2016 "
    },
    {
        "content": "RIO DE JANEIRO  April 30 Brazil's Vale SA  said on Thursday it expects to replace some old higher-cost iron ore production as new capacity comes on stream  the clearest sign yet the miner could cut future output forecasts due to weak prices.",
        "date": "04302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale says plans to substitute out some old production "
    },
    {
        "content": "MELBOURNE/LONDON  April 27 Brazil's Vale SA  has chosen Barclays to advise it on the sale of some or all of its Australian coal assets  two people close to the situation said on Monday  as the company looks to raise money to ride out the commodities rout.",
        "date": "04272015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale taps Barclays to advise on Australian asset sale - sources "
    },
    {
        "content": "RIO DE JANEIRO Brazilian mining company Vale SA will likely report a third straight net quarterly loss on Thursday in the face of the lowest iron ore prices in a decade.",
        "date": "04292015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale on track for third straight loss in first quarter "
    },
    {
        "content": "RIO DE JANEIRO  April 30 Brazil's Vale SA   the world's No. 1 producer of iron ore  on Thursday posted its third straight quarterly loss under pressure from falling prices of the commodity as demand growth from China slows.",
        "date": "04302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 2- Vale posts $3.2 bln loss on iron ore's relentless fall "
    },
    {
        "content": "RIO DE JANEIRO  April 30 Brazil's Vale SA  posted on Thursday a first-quarter net loss of $3.17 billion  its third quarterly loss in a row  as the miner continues to see its margins eroded by the falling price for iron ore.    (Reporting by Stephen Eisenhammer)",
        "date": "04302015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale posts third straight loss in Q1 "
    },
    {
        "content": "April 29 Cliffs Natural Resources Inc  which is struggling to cope with an over-supplied iron ore market  blamed industry leaders BHP Billiton Ltd  Rio Tinto PLC and Vale SA for weak prices for the commodity.",
        "date": "04292015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Cliffs Natural blames Rio  BHP  Vale for weak iron-ore prices "
    },
    {
        "content": "April 29 Cliffs Natural Resources Inc  which is struggling to cope with oversupply in the iron ore market  blamed industry leaders BHP Billiton Ltd  Rio Tinto Plc and Vale SA for weak prices of the commodity.",
        "date": "04292015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Cliffs Natural blames Rio  BHP  Vale for weak iron-ore prices "
    },
    {
        "content": "By Walter Brandimarte     RIO DE JANEIRO  April 24 Brazil's benchmark stock index jumped to a five-month high on Friday  leading gains in key Latin American equity markets  as shares of state-run oil company Petrobras and miner Vale extended a recent rally.     Petrobras' voting shares gained more than 4 percent for a second consecutive day after it released financial statements that had been delayed by a massive corruption scandal. The move avoided a major debt crisis for the world'",
        "date": "04242015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Petrobras  Vale drive Brazil Bovespa to 5-month high "
    },
    {
        "content": "RIO DE JANEIRO  April 22 Iron ore miner Vale SA drove Brazil's stock market higher on Wednesday  offsetting a decline in shares of state-run oil company Petrobras  which is expected to release its long-delayed financial statements.     Brazil's benchmark Bovespa index rose 1.1 percent as traders returned from a national holiday that shut Brazilian markets on Tuesday.     Shares of Vale jumped 8.2 percent after the world's largest iron ore producer posted a 4.9 percent year-on-year in",
        "date": "04222015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Vale drives Bovespa higher  Petrobras drops ahead of earnings "
    },
    {
        "content": "RIO DE JANEIRO  April 22 Brazilian miner Vale SA  said on Wednesday it produced 74.5 million tonnes of iron ore in the first quarter  a company record for the period  as it increased output despite weak prices.",
        "date": "04222015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 1-Vale defies price rout to hit new iron production record "
    },
    {
        "content": "RIO DE JANEIRO  April 22 Brazilian miner Vale SA  said on Wednesday it produced 74.5 million tonnes of iron ore in the first quarter  an increase of 4.9 percent on the previous year  as it continued to ramp up production despite weakening prices.    (Reporting by Stephen Eisenhammer and Jeb Blount)",
        "date": "04222015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale iron ore production rises 5 pct in first quarter "
    },
    {
        "content": "RIO DE JANEIRO  April 7 Shares of Vale  the world's largest iron ore producer  supported Brazil's benchmark Bovespa index on Tuesday as prices for the metal rebounded after a prolonged slide.     Most Latin American stocks and currencies were higher as investors continued to bet that the U.S. Federal Reserve may delay an expected interest rate hike following worse-than-forecast jobs data on Friday.     Vale's shares jumped about 5 percent on the Sao Paulo stock exchange as prices for",
        "date": "04072015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Vale supports Bovespa as iron ore prices rebound "
    },
    {
        "content": "SAO PAULO  April 1 Brazilian miner Vale SA  on Wednesday said it had concluded a deal with power utility Cemig Geração e Transmissão SA to sell 49 percent of its stake in the massive Belo Monte hydroelectric dam  following through on a December 2013 accord.",
        "date": "04012015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale concludes sale of 49 pct stake in Belo Monte dam "
    },
    {
        "content": "RIO DE JANEIRO/NEW YORK  March 25 Brazil's Vale SA may find it easier to dispose of giant ships and part of its stake in a rail logistics business before selling mining assets  as the world's top iron ore producer looks to raise cash amid a price rout  according to four sources with knowledge of the situation.",
        "date": "03252015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "DEALTALK-Brazil's Vale likely to sell rail  ships before mining assets "
    },
    {
        "content": "SAO PAULO Brazil's government has selected Murilo Ferreira  the chief executive officer of miner Vale SA  to head the board of embattled state-run Petroleo Brasileiro SA  according to a filing from the oil company on Friday.",
        "date": "03272015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil government names Vale CEO Ferreira to head Petrobras board "
    },
    {
        "content": "RIO DE JANEIRO  March 23 Brazilian miner Vale's  senior executives got a nearly 20 percent pay rise in 2014  including bonuses for targets achieved the year before  a securities filing said.",
        "date": "03232015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale executives get nearly 20 pct pay rise in 2014 "
    },
    {
        "content": "RIO DE JANEIRO  March 13 Brazilian iron ore miner Vale SA transferred its stake in a joint venture in Guinea to BSG Resources on Friday  the company said in a statement.",
        "date": "03132015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale transfers stake in Guinea to BSG Resources "
    },
    {
        "content": "RIO DE JANEIRO  March 13 Brazilian iron ore miner Vale SA transferred its stake in a joint venture in Guinea to BSG Resources on Friday  the company said in a statement.",
        "date": "03132015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Brazil's Vale transfers stake in Guinea venture to BSG Resources "
    },
    {
        "content": "VANCOUVER  March 2 Silver Wheaton Corp  said on Monday that it would pay $900 million for the right to buy an additional 25 percent of future gold production from Vale SA's Salobo mine in Brazil  boosting its 2015 gold output to 230 000 ounces.",
        "date": "03022015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Silver Wheaton takes new gold stream stake in Vale mine "
    },
    {
        "content": "RIO DE JANEIRO Shares in Brazil's Vale SA plunged 5 percent on Thursday as the miner posted full-year net income well below analyst forecasts due to a weaker iron ore price and Brazilian currency.",
        "date": "02262015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale misses profit forecast  shares slide "
    },
    {
        "content": "MEXICO CITY  Feb 26 Mexico's IPC index  rose on Thursday as Mexican bottling and retail firm Femsa  reported soaring profit  while a weak showing from Brazil's miner Vale sent the Bovespa down amid mixed data from the United States.",
        "date": "02262015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Femsa profit boosts Mexico shares  Bovespa down on Vale "
    },
    {
        "content": "Feb 26 * Brazil's Vale does not expect to take iron ore write downs any time soon  the company's chief financial officer Luciano Siani said on a conference call to discuss fourth quarter results.",
        "date": "02262015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "BRIEF-Brazil's Vale says giant iron ore project to go ahead no matter what "
    },
    {
        "content": "RIO DE JANEIRO  Feb 26 Shares in Brazil's Vale SA plunged 5 percent on Thursday as the miner posted full-year net income well below analyst forecasts due to a weaker iron ore price and Brazilian currency.",
        "date": "02262015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "UPDATE 3-Brazil's Vale misses profit forecast  shares slide "
    },
    {
        "content": "RIO DE JANEIRO  Feb 26 Brazilian mining company Vale SA on Thursday took a $1.152 billion net impairment on assets for 2014 driven by writedowns on its Brazilian fertilizer assets and for the Simandou iron ore mining project in Guinea.",
        "date": "02262015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Vale takes 2014 net impairment of $1.152 bln "
    },
    {
        "content": "RIO DE JANEIRO  Feb 19 Brazilian miner Vale SA   said on Thursday it produced 319.2 million tonnes of iron ore in 2014  beating its forecast for the year  as it begins to boost production after years of stagnation.",
        "date": "02192015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-Brazil's Vale beats iron ore forecast  takes nickel crown "
    },
    {
        "content": "SHANGHAI  Feb 11 China has amended rules around ships it will allow to berth at mainland ports  paving the way for Brazilian miner Vale to ship iron ore in its giant 400 000 deadweight tons (DWT) carriers.",
        "date": "02112015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 1-China rule change paves way for Vale's mega-ships official entry "
    },
    {
        "content": "SHANGHAI  Feb 11 China has amended rules around ships it will allow to berth at mainland ports  paving the way for Brazilian miner Vale to ship iron ore in its giant 400 000 deadweight tons (DWT) carriers.",
        "date": "02112015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "China rule change paves way for Vale's mega-ships official entry "
    },
    {
        "content": "* Australia  Brazil's share of China market seen exceeding 80 pct",
        "date": "02042015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "UPDATE 2-Chinese iron ore imports seen rising to 1 bln tonnes as top miners rule "
    },
    {
        "content": "RIO DE JANEIRO  Jan 30 Brazilian miner Vale SA  proposed on Friday to pay dividends of $2 billion this year  less than half the $4.2 billion it distributed in 2014  amid falling prices of iron ore and other base metals.",
        "date": "01302015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Brazil's Vale halves 2015 dividends as iron ore prices fall "
    },
    {
        "content": "SAO PAULO Brazil's Vale SA  the world's largest iron ore producer  was downgraded by Standard and Poor's Rating Services on Friday  on expectations that its financial risk profile will deteriorate in the next two years.",
        "date": "01262015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "S&P downgrades Vale to BBB+; outlook raised to 'stable' "
    },
    {
        "content": "RIO DE JANEIRO  Jan 29 Brazilian miner Vale's  mega-ships have been able to dock at five ports in China  the firm's head of investor relations said on Thursday  as a ban that had been in place since 2012 is relaxed.",
        "date": "01292015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale's mega-ships dock at five Chinese ports - executive "
    },
    {
        "content": "Jan 13 Former Xstrata Plc Chief Executive Mick Davis is considering a bid for Vale SA's nickel business  the Bloomberg reported.",
        "date": "01132015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Former Xstrata CEO considering bid for Vale's nickel assets - Bloomberg "
    },
    {
        "content": "Jan 13 Former Xstrata Plc Chief Executive Mick Davis is considering a bid for Vale SA's   nickel business  Bloomberg reported.",
        "date": "01132015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "REFILE-UPDATE 1-Former Xstrata CEO considering bid for Vale's nickel assets - Bloomberg "
    },
    {
        "content": "Jan 13 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "01132015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "RIO DE JANEIRO/LONDON  Jan 14 Vale's  nickel business is a good target for former Xstrata CEO Mick Davis  but his reported offer price is probably too low  considering the Brazilian miner's stated interest in only selling a minority stake  analysts and banking sources said on Wednesday.",
        "date": "01142015",
        "name": "VALE SA",
        "news_type": "topStory",
        "symbol": "VALE",
        "title": "Vale's nickel unit a good target for X2 but higher price needed "
    },
    {
        "content": "RIO DE JANEIRO  Jan 14 Plunging oil and metal prices on Wednesday hurt the currencies of commodity-exporting countries in Latin America  as well as shares of Brazilian miner Vale and state-run oil company Petrobras.     Chile's peso slumped 1.1 percent as prices of copper   the country's main export product  slumped more than 8 percent at one point to their lowest level since July 2009.       The Colombian peso was also pressured by another drop in the price of oil  Colombia's bigges",
        "date": "01142015",
        "name": "VALE SA",
        "news_type": "normal",
        "symbol": "VALE",
        "title": "EMERGING MARKETS-Falling commodity prices hurt Chilean peso  Vale shares "
    }
]