[
    {
        "content": "Nov 15 Indian shares ended lower on Wednesday as falling global commodity prices pushed metal shares such as Vedanta Ltd down  while consumer stocks such as ITC Ltd also weighed on the indexes.",
        "date": "11152017",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Indian shares end lower; metal  consumer stocks drag "
    },
    {
        "content": "Nov 15 Indian shares fell on Wednesday tracking weaker Asian markets  with consumer stocks such as ITC Ltd and metals shares such as Vedanta Ltd weighing on the broader NSE index.",
        "date": "11152017",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Indian shares fall; ITC  Vedanta drag "
    },
    {
        "content": "* Sept quarter profit 77.4 million rupees versus profit of 51.4 million rupees year ago",
        "date": "10302017",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "BRIEF-India's Automobile Corp of Goa Sept-qtr profit rises "
    },
    {
        "content": "    Oct 10 Britain's FTSE 100 index is seen opening 5 points lower at 7 502.8 on Tuesday  according to financial bookmakers.               * BHP BILLITON: Activist investor Elliott has embarked on an international tour of BHP Billiton's biggest shareholders as it presses ahead with its campaign to force a radical shake-up of the FTSE 100 mining giant  sources familiar with the matter told Reuters.     * MICRO FOCUS: British tech firm Micro Focus International  the new owner of ArcSig",
        "date": "10102017",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "UK Stocks-Factors to watch on Oct 10 "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_10102017.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     9:00 am: India's President Ram Nath Kovind  Transport Minister Nitin Gadkari and Junior Water Resources Minister Arjun Ram Meghwal at inauguration of India Water Week 2017 in New Delhi.     10:00 am:",
        "date": "10102017",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Morning News Call - India  October 10 "
    },
    {
        "content": "LONDON  Sept 20 Volcan Investments  the family trust of diversified miner Vedanta on Thursday said it was increasing its stake in Anglo American.",
        "date": "09202017",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Indian billionaire Agarwal to buy bigger stake in Anglo American "
    },
    {
        "content": "* June quarter net profit after tax 58.5 million rupees versus profit 63.3 million rupees year ago",
        "date": "07272017",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "BRIEF-India's Automobile Corp of Goa June-qtr profit falls "
    },
    {
        "content": "July 26 - India's NSE index edged up on Wednesday  hovering near the 10 000-point mark it breached for the first time in the previous session  with stocks such as Vedanta Ltd gaining on solid quarterly results.",
        "date": "07262017",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Indian shares rise; Vedanta hits near 3-year high "
    },
    {
        "content": "MUMBAI  April 11 Indian metals and mining group Vedanta Limited said on Tuesday it had completed its buyout of oil and gas explorer Cairn India Ltd  consummating a deal that was delayed for months by investor opposition.",
        "date": "04112017",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Mining group Vedanta completes buyout of Cairn India "
    },
    {
        "content": "* Agarwal acting through family trust  not Vedanta- statement",
        "date": "03162017",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "UPDATE 3-Indian billionaire targets $2.4 bln Anglo stake as mining sector revives "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Anil Agarwal is betting the house on Africa. The Indian tycoon is making a personal bet on Anglo American worth up to 2 billion pounds through a fiddly  bond-financed deal. The raid signals a desire to build a global mining giant. There is little overlap with Agarwal's flagship London-listed Vedanta Resources  but a 12 percent stake would give him a prime position in the event of an Anglo breakup.",
        "date": "03162017",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Indian tycoon bets house on Africa in Anglo raid "
    },
    {
        "content": "MUMBAI  Aug 9 Hindustan Zinc Ltd  a subsidiary of billionaire Anil Agarwal's mining conglomerate Vedanta Ltd  aims to double silver output in five years due to rising prices and increased demand from solar panel makers.",
        "date": "08092016",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "UPDATE 1-Hindustan Zinc to double silver output to catch solar wave "
    },
    {
        "content": "Anglo American Plc  has rebuffed informal approaches by Indian mining and metals tycoon Anil Agarwal  Bloomberg reported  citing people familiar with the matter.",
        "date": "07292016",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Anglo American rebuffs merger interest from India's Agarwal: Bloomberg "
    },
    {
        "content": "July 28 Anglo American Plc has rebuffed informal approaches by Indian mining and metals tycoon Anil Agarwal  Bloomberg reported  citing people familiar with the matter.",
        "date": "07292016",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "UPDATE 1-Anglo American rebuffs merger interest from India's Agarwal -Bloomberg "
    },
    {
        "content": "* Offers 1 share and 4 redeemable shares for each Cairn share",
        "date": "07222016",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Vedanta sweetens Cairn India deal terms after takeover delayed "
    },
    {
        "content": "* \u007fBaghmara Gold Block in state of Chhattisgarh (6.08 sq.km) was put on auction as composite license (prospecting license cum mining lease)\u007f",
        "date": "03012016",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "BRIEF-Vedanta wins auction of Baghmara gold mine in the state of Chhattisgarh "
    },
    {
        "content": "NEW DELHI India said on Monday it would raise the import duty on aluminium but cut the export tax on low grade iron ore  a move that would benefit Vedanta Ltd  the most as it is a big producer of both commodities.",
        "date": "02292016",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Duty revision on iron ore  aluminium to boost Vedanta "
    },
    {
        "content": "NEW DELHI Vedanta Ltd has won India's first-ever auction of a gold mine  a provincial government official said  as the nation opens up the sector to private companies to curb overseas purchases of the metal that cost it $36 billion last year.",
        "date": "02272016",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Vedanta wins gold-hungry India's first mine auction "
    },
    {
        "content": "MUMBAI Indian resources group Vedanta Ltd  posted a 99 percent plunge in third-quarter profit on Thursday due to lower global commodity prices  although it beat analysts' forecasts for a net loss.",
        "date": "01282016",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Vedanta posts 99 pct slump in quarterly profit on weak commodity prices "
    },
    {
        "content": "MUMBAI  Jan 28 Indian resources group Vedanta Ltd posted a 99 percent plunge in third-quarter profit on Thursday due to lower global commodity prices  although it beat analysts' forecasts for a net loss.",
        "date": "01282016",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "India's Vedanta posts 99 pct slump in quarterly profit on weak commodity prices "
    },
    {
        "content": "NEW DELHI  Oct 20 Indian miner Vedanta Ltd  expects its iron ore exports from the state of Goa to be much higher than its permitted mining capacity of 5.5 million tonnes in the fiscal year to March  as it bids for ore in government-run auctions.",
        "date": "10202015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "India's Vedanta to export over 5.5 mln T iron ore from Goa this yr "
    },
    {
        "content": "** Mining stocks  battered by a rout in commodity prices  get hefty boost from activist investor Carl Icahn disclosing a stake in diversified miner & energy producer Freeport-McMoRan",
        "date": "08282015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "BUZZ-Mining stocks: Icahn stake in Freeport-McMoRan lifts sector "
    },
    {
        "content": "** London-listed miner Vedanta Resources & unit Vedanta Ltd up sharply & both on track for sharpest intraday gain in around 3.5 mnths",
        "date": "08252015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "BUZZ-Vedanta: co & unit up on issue of NCDs "
    },
    {
        "content": "NEW DELHI India's top iron ore exporting state of Goa resumed production on Monday after nearly three years and could hit its court-set annual limit of 20 million tonnes this fiscal year itself  its mines director told Reuters.",
        "date": "08102015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Top iron ore exporter Goa resumes output after three years "
    },
    {
        "content": "NEW DELHI  Aug 10 Vedanta Ltd  India's biggest private miner  expects to produce 5.5 million tonnes of iron ore this fiscal year to March after restarting operations on Monday after a gap of almost three years  a senior company executive told Reuters.",
        "date": "08102015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "India's Vedanta set to produce 5.5 mln T iron ore after restarting operations "
    },
    {
        "content": "* Says timing of deal \"opportunistic\"  undervalues Cairn India",
        "date": "08062015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "UPDATE 1-Aviva Investors opposes Vedanta takeover bid for Cairn India "
    },
    {
        "content": "LONDON  Aug 5 Fund firm Aviva Investors said on Wednesday it opposed a $2.3 billion plan by Vedanta Ltd  to buy out minority shareholders in Cairn India  as the deal failed to deliver sufficient value.",
        "date": "08052015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Aviva Investors opposes Vedanta Ltd takeover bid for Cairn India "
    },
    {
        "content": "* In talks with regulators and exchanges for Cairn merger   (Adds CEO comments  details)",
        "date": "07292015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "UPDATE 2-India's Vedanta looks to restart Goa mines by October "
    },
    {
        "content": "MUMBAI  July 23 Indian mining and energy group Vedanta Limited said on Thursday its offer to buy out minority investors in Cairn India was fair  dismissing reports that opposition from some small shareholders  including former owner Cairn Energy  could scupper the deal.",
        "date": "07232015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Vedanta says its Cairn India buyout offer is fair "
    },
    {
        "content": "MUMBAI Britain's Cairn Energy Plc  is set to vote against Vedanta Ltd's  $2.3 billion buyout offer for Cairn India's  minority shareholders  the Financial Times said on Wednesday  citing people familiar with the situation.",
        "date": "07222015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Cairn Energy set to vote against Vedanta-Cairn India merger: FT "
    },
    {
        "content": "MUMBAI Cairn India  Chief Executive Mayank Ashar said on Tuesday the firm's proposed buyout by parent Vedanta Ltd  was \"on track\"  brushing off demands from some minority shareholders for a higher price tag.",
        "date": "07212015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Cairn India says tie-up with parent Vedanta is on track "
    },
    {
        "content": "MUMBAI  July 21 Cairn India Chief Executive Mayank Ashar said on Tuesday the firm's proposed buyout by parent Vedanta Ltd was \"on track\"  brushing off demands from some minority shareholders for a higher price tag.",
        "date": "07212015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "UPDATE 1-Cairn India says tie-up with parent Vedanta is on track "
    },
    {
        "content": "July 1 Vedanta Group chairman says Sterlite Technologies",
        "date": "07012015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "BRIEF-Sterlite Tech to invest 400 bln rupees for mnfg LCD panels in India-Vedanta chairman "
    },
    {
        "content": "** Vedanta Resources bouncing clear of near 2-mth lows in robust volume amid media reports of a potential merger between units Vedanta Ltd and Cairn India (CIL)",
        "date": "06092015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "CORRECTED-BUZZ-Vedanta: boosted by media spec of merger with Cairn India unit "
    },
    {
        "content": "NEW DELHI The oil minister met executives from oil company Cairn India this week to discuss its potential merger with parent Vedanta Ltd  the operating unit of London-listed mining and energy group Vedanta Resources Plc.",
        "date": "06122015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Oil minister says met Cairn India over Vedanta merger "
    },
    {
        "content": "MUMBAI The boards of oil company Cairn India and its parent  Vedanta Ltd  will meet on Sunday to discuss a potential merger  both companies said.",
        "date": "06132015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Cairn India  Vedanta boards to meet on Sunday to discuss merger "
    },
    {
        "content": "* Merger gives Vedanta access to Cairn India's $2.6 bln cash pile",
        "date": "06152015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Vedanta says buyout of Cairn India minorities moves it closer to becoming major player "
    },
    {
        "content": "MUMBAI Indian mining and energy group Vedanta Ltd made a $2.3 billion offer on Sunday to buy out minority shareholders in cash-rich oil unit Cairn India  a deal that helps parent Vedanta Resources Plc repay hefty debts.",
        "date": "06142015",
        "name": "Vedanta  Limited",
        "news_type": "topStory",
        "symbol": "VEDL",
        "title": "Vedanta makes $2.3 bln bid to buy out minorities in Cairn India "
    },
    {
        "content": "NEW DELHI  June 12 India's oil minister met executives from oil company Cairn India this week to discuss its potential merger with parent Vedanta Ltd  the operating unit of London-listed mining and energy group Vedanta Resources Plc.",
        "date": "06122015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "UPDATE 1-Indian oil min says met Cairn India over Vedanta merger "
    },
    {
        "content": "MUMBAI Shares of Vedanta Ltd  and Cairn India Ltd  rose on Monday after Vedanta offered to buy out minorities in cash-rich oil unit Cairn India in a $2.3 billion deal.",
        "date": "06152015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Cairn India  Vedanta shares rise after $2.3 billion deal "
    },
    {
        "content": "MUMBAI Indian mining and energy group Vedanta Ltd  made a $2.3 billion offer on Sunday to buy out minority shareholders in cash-rich oil unit Cairn India   a deal that helps parent Vedanta Resources Plc  repay hefty debts.",
        "date": "06142015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "Vedanta makes $2.3 billion bid to buy out minorities in Cairn India "
    },
    {
        "content": "* Merger gives Vedanta access to Cairn India's $2.6 bln cash pile",
        "date": "06142015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "UPDATE 2-Vedanta makes $2.3 bln bid to buy out minorities in Cairn India "
    },
    {
        "content": "MUMBAI  June 14 India's largest private miner Vedanta Ltd has offered to buy out minority shareholders in cash-rich oil and gas unit Cairn India   a move that will streamline debt-burdened parent Vedanta Resources Plc's operating structure.",
        "date": "06142015",
        "name": "Vedanta  Limited",
        "news_type": "normal",
        "symbol": "VEDL",
        "title": "India's Vedanta to buy out minority shareholders in unit Cairn India "
    }
]