[
    {
        "content": "(The following statement was released by the rating agency) MOSCOW/LONDON  November 13 (Fitch) Fitch Ratings says the proposed buy-out of Global Telecom Holding S.A.E (GTH) shares not owned by VEON Ltd. may significantly increase the latter's leverage above the downgrade threshold level. Deleveraging may be slow due to limited free cash flow growth resulting from progressive future dividend payments and likely spectrum investments in the near term  including in Bangladesh and Ukraine. The positi",
        "date": "11132017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "Fitch: GTH Buy-Out May Increase Leverage for VEON "
    },
    {
        "content": "AMSTERDAM  Nov 9 Telecommunications company Veon's new mobile internet platform  which competes with messaging services like Whatsapp  was downloaded more than 5 million times since it was started last year  its CEO said on Thursday.",
        "date": "11092017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "UPDATE 1-Veon posts loss at flagship Wind joint venture; new app downloaded 5 million times "
    },
    {
        "content": "* BOARD APPROVES APPOINTMENT OF PHAROS HOLDING AS FINANCIAL ADVISOR TO EVALUATE MANDATORY TENDER OFFER BY VEON HOLDINGS TO ACQUIRE REMAINING SHARES OF COMPANY ‍​ Source text: (http://bit.ly/2hmhGsk) Further company coverage:",
        "date": "11092017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "BRIEF-Global Telecom says Pharos Holding to advise on share purchase offer by VEON "
    },
    {
        "content": "* VEON REPORTS SOLID THIRD QUARTER RESULTS WITH ROBUST FREE CASH FLOW GENERATION AND ANNOUNCES MANDATORY TENDER OFFER FOR GTH",
        "date": "11092017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "BRIEF-Veon Q3 EBITDA increased 16.4 pct to 1 042 US dollars "
    },
    {
        "content": "AMSTERDAM  Nov 9 Mobile telecommunications company Veon said on Thursday its sales rose 4 percent in the third quarter to $2.46 billion  largely due to strong growth in Russia and Pakistan.",
        "date": "11092017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "Veon posts higher Q3 sales; Wind joint venture records net loss "
    },
    {
        "content": "OSLO  Nov 1 Norwegian police have ended a corruption investigation into the former chief executive of Vimpelcom  the company now known as Veon  saying on Wednesday he was no longer a suspect.",
        "date": "11012017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "UPDATE 2-Norwegian police drop inquiry into ex-Vimpelcom chief "
    },
    {
        "content": "OSLO  Nov 1 Jo Lunder  the former chief executive officer of Vimpelcom  is no longer considered a suspect in a corruption probe  Norwegian police said on Wednesday.",
        "date": "11012017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "Norway police says ex-Vimpelcom chief Lunder no longer a suspect "
    },
    {
        "content": "* Jacky Simmonds appointed Group Chief People Officer Source text for Eikon: Further company coverage:",
        "date": "10102017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "BRIEF-Jacky Simmonds appointed Group Chief People Officer "
    },
    {
        "content": "* ‍ANNOUNCES BUSINESS COLLABORATION  WITH HGC TO GROW BUSINESSES IN ENTERPRISE MARKET​",
        "date": "09272017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "BRIEF-Veon ‍announces business collaboration with HGC "
    },
    {
        "content": "* Telenor to complete the divestment of its interests in Veon",
        "date": "09202017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "BRIEF-Telenor to complete the divestment of its interests in Veon "
    },
    {
        "content": "NEW YORK A U.S. judge said Veon Ltd   shareholders may pursue much of a lawsuit accusing the multinational phone company once known as VimpelCom of inflating its share price by concealing a bribery scheme in Uzbekistan and overstating its financial controls.",
        "date": "09192017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "Veon must face lawsuit over bribery disclosures: U.S. judge "
    },
    {
        "content": "(The following statement was released by the rating agency) MOSCOW/LONDON  September 18 (Fitch) Fitch Ratings says the recent changes to the Uzbek currency control regulation and the concurrent som devaluation are unlikely to have a significant impact on VEON Ltd's leverage metrics  and are neutral for its 'BB+' rating. The negative impact of an expected decline in USD-translated EBITDA and cash flow generation due to currency devaluation in Uzbekistan could be mitigated by VEON's access to cash",
        "date": "09182017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "Fitch: No Impact On VEON's Leverage From Uzbek Currency Devaluation "
    },
    {
        "content": "* ANNOUNCED ON WEDNESDAY THAT TELENOR EAST HOLDING II AS OFFERS FOR SALE 90 000 000 COMMON SHARES",
        "date": "09212017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "BRIEF-Telenor East Holding II offers for sale 90 000 000 common shares "
    },
    {
        "content": "NEW YORK  Sept 19 A U.S. judge said Veon Ltd shareholders may pursue much of a lawsuit accusing the multinational phone company once known as VimpelCom of inflating its share price by concealing a bribery scheme in Uzbekistan and overstating its financial controls.",
        "date": "09192017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "Veon must face lawsuit over bribery disclosures -U.S. judge "
    },
    {
        "content": "* Underwriters priced offering of 90 million common shares of Veon Ltd at a public offering price of USD 4.15 per ADS/share",
        "date": "09212017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "BRIEF-Telenor prices 90 mln common shares of Veon at $4.15 per ADS/share "
    },
    {
        "content": "AMSTERDAM  Sept 15 Emerging markets-focused telecoms company Veon Ltd warned on Friday that Uzbekistan's sharp currency devaluation last week would hurt its 2017 revenues and profits.",
        "date": "09152017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "CORRECTED-UPDATE 2-Veon expects profit hit from Uzbek currency devaluation "
    },
    {
        "content": "Sept 15 Dutch telecommunications company Veon Ltd said on Friday it was lowering its guidance for 2017 as a result of the liberalisation of currency exchange rules in Uzbekistan.",
        "date": "09152017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "Veon cuts 2017 guidance on Uzbek currency devaluation "
    },
    {
        "content": "* VEON AND GTH SELL THEIR PAKISTAN TOWER BUSINESS FOR USD 940 MILLION Source text for Eikon: Further company coverage: (Gdynia Newsroom:)",
        "date": "08302017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "BRIEF-Veon and GTH sell their Pakistan tower business for $940 million "
    },
    {
        "content": "* Veon Ltd - has noted recent media comments concerning a potential tower transaction in Pakistan - Sec filing",
        "date": "08292017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "BRIEF-Veon ltd confirms that it is in advanced discussions with Edotco for sale of its indirect unit  Deodar Limited "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE/HONG KONG  August 08 (Fitch) Fitch Ratings says CK Hutchison Holdings Limited's (CKHH; A-/Stable) financial and operating results for 1H17 were broadly in line with expectations  despite being affected by foreign-exchange movements against its reporting Hong Kong dollar currency. Reported EBITDA  stripping out currency effects  increased by 7%  with solid contribution from all businesses. The ports sector is a stable EBITDA ma",
        "date": "08082017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "Fitch: CKHH's 1H Earnings Solid; in Line with Expectations "
    },
    {
        "content": "AMSTERDAM  Aug 3 VEON Ltd  formerly known as Vimpelcom  on Thursday reported a second-quarter net loss on continuing operations of $258 million  due to impairments  bond redemptions and losses at its Italian joint venture.",
        "date": "08032017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "UPDATE 1-VEON reports Q2 loss of $258 million "
    },
    {
        "content": "* Q2 LOSS FROM CONTINUED OPERATIONS $258 MILLION VERSUS LOSS OF $40 MILLION YEAR AGO",
        "date": "08032017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "BRIEF-Veon Q2 reports net loss from continued operations at $258 million "
    },
    {
        "content": "AMSTERDAM  Aug 3 VEON Ltd  formerly known as Vimpelcom  on Thursday reported a second-quarter net loss on continuing operations of $258 million  due to impairments  bond redemptions and losses at its Italian joint venture.",
        "date": "08032017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "VEON reports $258 million Q2 loss "
    },
    {
        "content": "FRANKFURT VEON named former Xerox chief Ursula Burns as its chairwoman on Monday  as the telecoms operator undertakes corporate governance reforms and a makeover as a global online services company.",
        "date": "07242017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "VEON names former Xerox CEO Ursula Burns as chairwoman "
    },
    {
        "content": "FRANKFURT  July 19 Global telecom operator VEON said on Wednesday it was making progress in its strategy to reinvent itself as an online player by introducing its messaging and mobile services app in four new markets  including its largest in Russia and Pakistan.",
        "date": "07192017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "VEON offers mobile messaging app in five markets  including Russia "
    },
    {
        "content": "FRANKFURT  July 24 VEON named former Xerox chief Ursula Burns as its chairwoman on Monday  as the telecoms operator undertakes corporate governance reforms and a makeover as a global online services company.",
        "date": "07242017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "UPDATE 1-VEON names former Xerox CEO Ursula Burns as chairwoman "
    },
    {
        "content": "FRANKFURT  July 24 Global telecoms operator VEON has elected former Xerox Corp chief Ursula Burns as its chairman  the company said on Monday  part of corporate governance reforms that are designed to showcase its makeover as an online services player.",
        "date": "07242017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "VEON board elects former Xerox CEO Ursula Burns as chairman "
    },
    {
        "content": "* To upgrade version of existing app in Italy this week (Adds background on messaging app strategy  company details)",
        "date": "07192017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "UPDATE 1-VEON offers mobile messaging app in five markets  including Russia "
    },
    {
        "content": "* URSULA BURNS TO BECOME CHAIRMAN OF VEON'S SUPERVISORY BOARD EFFECTIVE TODAY",
        "date": "07242017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "BRIEF-Veon appoints Ursula Burns as a chairman "
    },
    {
        "content": "MOSCOW Russia's second and third-largest mobile telecoms operators Megafon and Vimpelcom will end their Euroset retail joint venture to focus on their own distribution channels in an increasingly competitive market  they said on Wednesday.",
        "date": "07122017",
        "name": "VEON Ltd",
        "news_type": "topStory",
        "symbol": "VEON",
        "title": "Russian mobile operators Megafon and Vimpelcom end retail partnership "
    },
    {
        "content": "* Vimpelcom to receive half of Euroset's stores (Adds context  Megafon and analyst comment)",
        "date": "07122017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "UPDATE 1-Russian mobile operators Megafon and Vimpelcom end retail partnership "
    },
    {
        "content": "MOSCOW  July 12 Russian mobile operator Megafon will buy a 50 percent stake in Euroset  Russia's largest mobile and electronics retail network  from Vimpelcom  a subsidiary of Amsterdam-based mobile network operator Veon Ltd.",
        "date": "07122017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "Russia's Megafon to buy 50 pct stake in Euroset from Vimpelcom "
    },
    {
        "content": "* MEGAFON WILL ACQUIRE PJSC VIMPELCOM’S 50% INTEREST IN EUROSET  RESULTING IN MEGAFON OWNING 100% OF EUROSET",
        "date": "07122017",
        "name": "VEON Ltd",
        "news_type": "normal",
        "symbol": "VEON",
        "title": "BRIEF-Veon and Megafon to end their Euroset JV "
    }
]