[
    {
        "content": "* Vereit Inc - ‍in connection with transaction  Vereit may receive up to $200 million​",
        "date": "11132017",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit to sell Cole Capital to an affiliate of CIM Group "
    },
    {
        "content": "NEW YORK  Nov 8 The former chief financial officer of American Realty Capital Properties Inc was sentenced to 18 months in prison on Wednesday after he was found guilty of deceiving investors by inflating the real estate investment trust’s financial statements.",
        "date": "11082017",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "Former American Realty CFO gets 18 months for falsifying accounts "
    },
    {
        "content": "* Based on year to date performance  increasing AFFO per share guidance to $0.73 - $0.74 from $0.71 - $0.73 ​",
        "date": "11082017",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "BRIEF-VEREIT Inc Q3 FFO per share $0.18 "
    },
    {
        "content": "* ‍Priced an offering of $600 million aggregate principal amount of 3.950 pct senior notes due 2027 at an issue price of 99.330 pct of par value​ Source text for Eikon: Further company coverage:",
        "date": "08082017",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit announces pricing of $600 mln of senior notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 08 (Fitch) Fitch Ratings has assigned a 'BBB-' rating to the senior unsecured notes issued by VEREIT (NYSE: VER). Net proceeds are expected to be used to repay its outstanding $500 million term loan. A full list of Fitch's current ratings for VER follows at the end of this release. KEY RATING DRIVERS VER's ratings are based on the company's improving credit metrics  strong management team  well-diversified portfolio of ",
        "date": "08082017",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "Fitch Rates VEREIT's Senior Unsecured Bonds 'BBB-' "
    },
    {
        "content": "* Says consolidated revenue for quarter ended June 30  2017 decreased $34.1 million to $336.9 million",
        "date": "08032017",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit reports Q2 FFO per share $0.17 "
    },
    {
        "content": "NEW YORK  June 30 The former chief financial officer of American Realty Capital Properties Inc was convicted on Friday of deceiving investors by inflating the real estate investment trust's financial statements.",
        "date": "06302017",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "Ex-American Realty CFO convicted of falsifying company's accounts "
    },
    {
        "content": "June 29 A U.S. prosecutors on Thursday urged jurors to convict the former chief financial officer of American Realty Capital Properties Inc over allegations he inflated the real estate investment trust's financial statements  winding down a three-week trial.",
        "date": "06292017",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "Prosecutors urge jurors to convict ex-American Realty CFO in fraud trial "
    },
    {
        "content": "NEW YORK A federal judge on Friday refused to dismiss an indictment accusing a former chief financial officer of American Realty Capital Properties Inc of fraudulently inflating financial data for the big real estate investment trust.",
        "date": "05012017",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "American Realty ex-CFO loses bid to dismiss fraud indictment "
    },
    {
        "content": "NEW YORK  April 28 A federal judge on Friday refused to dismiss an indictment accusing a former chief financial officer of American Realty Capital Properties Inc of fraudulently inflating financial data for the big real estate investment trust.",
        "date": "04282017",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "American Realty ex-CFO loses bid to dismiss fraud indictment "
    },
    {
        "content": "* Vereit® announces fourth quarter and full year 2016 operating results",
        "date": "02232017",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit Q4 FFO per share $0.05 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 15 (Fitch) Fitch Ratings has assigned first-time ratings to  VEREIT  Inc. (NYSE: VER) including an Issuer Default Rating (IDR) of 'BBB-'. The  Rating Outlook is Stable. A full list of ratings follows at the end of the  release.  KEY RATING DRIVERS VER's ratings are based on the company's improving credit metrics  strong  management team  well diversified portfolio of predominantly single-tenant  net  leased assets tha",
        "date": "11152016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "Fitch Assigns First-Time Ratings to VEREIT  Inc. "
    },
    {
        "content": "* Vereit - consolidated revenue for quarter ended Sept 30  2016 decreased $22.1 million to $362.9 million as versus revenue of $385.0 million for same quarter in 2015",
        "date": "11022016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit Q3 adjusted FFO per share $0.20 "
    },
    {
        "content": "NEW YORK U.S. prosecutors on Thursday announced criminal fraud charges against two former American Realty Capital Properties Inc executives stemming from a 2014 accounting scandal that wiped out roughly $4 billion of the real estate investment trust's market value.",
        "date": "09082016",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "U.S. charges ex-American Realty executives with inflating results "
    },
    {
        "content": "NEW YORK  Sept 8 U.S. prosecutors on Thursday announced criminal fraud charges against two former American Realty Capital Properties Inc executives stemming from a 2014 accounting scandal that wiped out roughly $4 billion of the real estate investment trust's market value.",
        "date": "09082016",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "UPDATE 5-U.S. charges ex-American Realty executives with inflating results "
    },
    {
        "content": "* American Finance Trust  Inc. to acquire American Realty Capital - Retail Centers Of America  Inc. for $1.4 Billion",
        "date": "09072016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-American Finance Trust  Inc. to acquire American Realty Capital "
    },
    {
        "content": "NEW YORK  Sept 8 The U.S. Securities and Exchange Commission on Thursday filed a lawsuit accusing two former American Realty Capital Properties Inc officers of helping orchestrate a fraudulent scheme that caused the real estate investment trust to inflate results in 2014.",
        "date": "09082016",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "SEC sues two former American Realty Capital officers "
    },
    {
        "content": "* Rmr's majority owned subsidiary  Rmr Group Llc  acquired assets of Tremont for an upfront purchase price of $2.2 million",
        "date": "08082016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-The RMR Group acquires Tremont Realty Capital "
    },
    {
        "content": "* Says offering 50.0 million common shares  Source text for Eikon:  Further company coverage:",
        "date": "08042016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit announces public offering of common stock "
    },
    {
        "content": "* Q2 net income of $3.2 million and net loss per diluted share of $0.02",
        "date": "08032016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-VEREIT Q2 adjusted FFO per share $0.19 "
    },
    {
        "content": "* Vereit Inc announces upsizing and pricing of public offering of common stock",
        "date": "08052016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit Inc announces upsizing and pricing of public offering "
    },
    {
        "content": "* Vereit Inc says  moves up Q2 2016 quarterly report and earnings conference call to August 3  Source text for Eikon:  Further company coverage:    )",
        "date": "07132016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit moves up Q2 2016 quarterly report and earnings conference call to Aug 3 "
    },
    {
        "content": "* Says offering to sell $500 million aggregate principal amount of senior notes due 2026",
        "date": "05162016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit announces public offering of $5 mln senior notes "
    },
    {
        "content": "* Offering size was increased to $1.0 billion from previously announced $500 million aggregate principal amount",
        "date": "05182016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit upsizes offering of senior notes "
    },
    {
        "content": "* Q1 earnings per share view $-0.01  revenue view $329.0 million -- Thomson Reuters I/B/E/S",
        "date": "05052016",
        "name": "VEREIT Inc",
        "news_type": "topStory",
        "symbol": "VER",
        "title": "BRIEF-Vereit posts Q1 adjusted FFO per share $0.21 "
    },
    {
        "content": "Brokerage firm RCS Capital Corp filed for Chapter 11 bankruptcy protection as part of a prearranged plan to restructure debt and give lenders control of its profitable Cetera investment advisory arm and take it private.",
        "date": "02012016",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "Brokerage RCS Capital bankruptcy to take Cetera private "
    },
    {
        "content": "Feb 1 Brokerage firm RCS Capital Corp  filed for Chapter 11 bankruptcy protection as part of a prearranged plan to restructure debt and give lenders control of its profitable Cetera investment advisory arm and take it private.",
        "date": "02012016",
        "name": "VEREIT Inc",
        "news_type": "normal",
        "symbol": "VER",
        "title": "UPDATE 2-Brokerage RCS Capital bankruptcy to take Cetera private "
    }
]