[
    {
        "content": "* VF Corp announces definitive agreement to acquire Icebreaker®  a New Zealand-based outdoor and sport apparel brand",
        "date": "11022017",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF Corp announces definitive agreement to acquire Icebreaker "
    },
    {
        "content": "* VF reports third quarter 2017 results; raises outlook and dividend for 2017",
        "date": "10232017",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF reports Q3 earnings per share $0.97 "
    },
    {
        "content": "Aug 14 Apparel and footwear maker VF Corp said it would buy  Williamson-Dickie Mfg. Co  the owner of Dickies and Workrite workwear  for about $820 million in cash.",
        "date": "08142017",
        "name": "VF Corporation",
        "news_type": "normal",
        "symbol": "VFC",
        "title": "VF Corp to buy Dickies workwear maker for $820 million "
    },
    {
        "content": "Aug 14 Apparel and footwear maker VF Corp said on Monday it would buy  privately held Williamson-Dickie Mfg. Co  the owner of Dickies and Workrite workwear  for about $820 million in cash.",
        "date": "08142017",
        "name": "VF Corporation",
        "news_type": "normal",
        "symbol": "VFC",
        "title": "UPDATE 2-VF Corp to buy Dickies workwear maker for $820 million "
    },
    {
        "content": "* VF reports second quarter 2017 results; raises outlook for 2017",
        "date": "07242017",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF Corp reports Q2 EPS $0.29 from continuing operations "
    },
    {
        "content": "* VF Corp - ‍VF's board of directors has elected president  chief executive officer and director Steven E. Rendle  to role of chairman​ Source text for Eikon: Further company coverage:",
        "date": "07242017",
        "name": "VF Corporation",
        "news_type": "normal",
        "symbol": "VFC",
        "title": "BRIEF-VF Corporation chairman Eric C. Wiseman announces retirement "
    },
    {
        "content": "* VF Corporation enters into definitive agreement to sell its licensed sports group business to Fanatics  Inc.",
        "date": "04042017",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF Corp enters agreement to sell licensed sports group business to Fanatics Inc "
    },
    {
        "content": "* VF Corp introduces 2021 strategic growth plan; updates strategy and long-term financial outlook",
        "date": "03302017",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF Corp expects gross margin to reach 51.5 pct in 2021 "
    },
    {
        "content": "* CEO Eric Wiseman's total compensation for 2016 was $16.3 million versus $13.2 million in 2015 - SEC filing  Source text for Eikon: Further company coverage:",
        "date": "03162017",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF Corp CEO Eric Wiseman's total compensation for 2016 was $16.3 mln vs $13.2 mln in 2015 "
    },
    {
        "content": "NEW YORK  Feb 27 (Thomson Reuters Foundation) - Apparel giant VF Corp  the company behind such popular brands as Wrangler jeans and Timberland boots  is adopting sourcing policies to eliminate products that contribute to deforestation and human rights violations  it said on Monday.",
        "date": "02272017",
        "name": "VF Corporation",
        "news_type": "normal",
        "symbol": "VFC",
        "title": "Apparel titan VF Corp tackles deforestation  human rights issues in supply chain "
    },
    {
        "content": "* VF Corporation announces fourth quarter 2016 earnings and conference call date  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF Corporat announces fourth quarter 2016 earnings date "
    },
    {
        "content": "* Steve Rendle to become CEO of VF Corporation on January 1  2017",
        "date": "10052016",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-Steve Rendle to become CEO of VF corporation "
    },
    {
        "content": "* VF Corp appoints Jim Pisani as Timberland global brand president  Source text for Eikon:  Further company coverage:",
        "date": "08082016",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF Corp appoints Jim Pisani as Timberland global brand president "
    },
    {
        "content": "* VF Corporation recommends shareholders reject \"mini-tender\" offer by trc capital corporation",
        "date": "08052016",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF Corp recommends shareholders reject \"mini-tender\" offer by TRC Capital "
    },
    {
        "content": "* Delta Galil to acquire contemporary premium brands from VF Corp",
        "date": "06302016",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-Delta Galil to acquire contemporary premium brands from VF Corp "
    },
    {
        "content": "* VF Corp says co  certain of its units entered into Accession No. 1 to credit agreement relating to 5 year revolving credit agreement  dated as of April 14  2015",
        "date": "06072016",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF Corp  some units entered into Accession No. 1 to credit agreement "
    },
    {
        "content": "* CEO Eric C. Wiseman total 2015 compensation $13.2 million versus $17.8 million in 2014",
        "date": "03242016",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "BRIEF-VF CEO Eric C. Wiseman total 2015 compensation $13.2 mln "
    },
    {
        "content": "* Shares rise as much as 10 pct   (Adds details  analyst and conference call comments; Updates shares)",
        "date": "11202015",
        "name": "VF Corporation",
        "news_type": "normal",
        "symbol": "VFC",
        "title": "UPDATE 2-Foot Locker profit and sales race past estimates "
    },
    {
        "content": "LOS ANGELES Former Olympic athlete and reality TV star Bruce Jenner  who is transitioning to life as a woman  revealed her new name as Caitlyn Jenner on Monday and posed in a white strapless leotard on the cover of Vanity Fair magazine. | Video ",
        "date": "06022015",
        "name": "VF Corporation",
        "news_type": "normal",
        "symbol": "VFC",
        "title": "Jenner reveals new name Caitlyn  breaks Twitter record "
    },
    {
        "content": "LOS ANGELES Former Olympic athlete and reality TV star Bruce Jenner  who is transitioning to life as a woman  revealed her new name as Caitlyn Jenner on Monday and posed in a white strapless leotard on the cover of Vanity Fair magazine. | Video ",
        "date": "06012015",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "Jenner reveals new name Caitlyn  breaks Twitter record "
    },
    {
        "content": "LOS ANGELES  June 1 Former Olympic athlete and reality TV star Bruce Jenner  who is transitioning to life as a woman  revealed her new name as Caitlyn Jenner on Monday and posed in a white strapless leotard on the cover of Vanity Fair magazine.",
        "date": "06012015",
        "name": "VF Corporation",
        "news_type": "normal",
        "symbol": "VFC",
        "title": "UPDATE 2-Jenner reveals new name Caitlyn  breaks Twitter record "
    },
    {
        "content": "LOS ANGELES  June 1 Former Olympic athlete and reality TV star Bruce Jenner  who is transitioning to life as a woman  revealed her new name as Caitlyn Jenner on Monday and posed in a white strapless leotard on the cover of Vanity Fair magazine.",
        "date": "06012015",
        "name": "VF Corporation",
        "news_type": "normal",
        "symbol": "VFC",
        "title": "Bruce Jenner says 'Call me Caitlyn' on Vanity Fair cover "
    },
    {
        "content": "LOS ANGELES Privately held Conde Nast may best be known as the publisher of fashion  culture and lifestyle magazines such as Vogue  Vanity Fair and GQ  but it is hoping to draw new consumers and advertisers through the realm of virtual reality.",
        "date": "04272015",
        "name": "VF Corporation",
        "news_type": "topStory",
        "symbol": "VFC",
        "title": "Conde Nast eyes digital viewers with virtual reality  scripted shows "
    },
    {
        "content": "LOS ANGELES  April 26 Privately held Conde Nast may best be known as the publisher of fashion  culture and lifestyle magazines such as Vogue  Vanity Fair and GQ  but it is hoping to draw new consumers and advertisers through the realm of virtual reality.",
        "date": "04272015",
        "name": "VF Corporation",
        "news_type": "normal",
        "symbol": "VFC",
        "title": "CORRECTED-Conde Nast eyes digital viewers with virtual reality  scripted shows "
    }
]