[
    {
        "content": "NEW YORK Viacom Inc  should package 10 percent of its international operations and take it public  Mario Gabelli  chief executive office of GAMCO Investors Inc  said Tuesday at the Reuters Global Investment 2018 Outlook. | Video ",
        "date": "11142017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Gabelli suggests Viacom float part of its international business "
    },
    {
        "content": "Viacom Inc  and Charter Communications Inc  said on Wednesday that they had agreed to a multi-year renewal of their distribution agreement.",
        "date": "11152017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom  Charter to renew distribution agreement "
    },
    {
        "content": "NEW YORK  Nov 14 Viacom Inc should package 10 percent of its international operations and take it public  Mario Gabelli  chief executive office of GAMCO Investors Inc  said Tuesday at the Reuters Global Investment 2018 Outlook.",
        "date": "11142017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "REUTERS SUMMIT-Gabelli suggests Viacom float part of its international business "
    },
    {
        "content": "Nov 15 Viacom Inc and Charter Communications Inc said on Wednesday that they had agreed to a multi-year renewal of their distribution agreement.",
        "date": "11152017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-Viacom  Charter to renew distribution agreement "
    },
    {
        "content": "* Viacom and Charter Communications announce renewal of distribution agreement",
        "date": "11152017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom and charter communications announce renewal of distribution agreement "
    },
    {
        "content": "Viacom Inc   owner of MTV and Comedy Central  said Thursday it expects lower revenue from cable and satellite companies in 2018  a forecast that sent its shares down almost 10 percent in morning trading.",
        "date": "11162017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom expects distributor revenue to drop in 2018; shares sink "
    },
    {
        "content": "Nov 16 Viacom Inc  owner of MTV and Comedy Central  said Thursday it expects lower revenue from cable and satellite companies in 2018  a forecast that sent its shares down almost 10 percent in morning trading.",
        "date": "11162017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 5-Viacom expects distributor revenue to drop in 2018; shares sink "
    },
    {
        "content": "Nov 16 Viacom Inc  the owner of MTV  Comedy Central and Paramount  reported a 2.9 percent rise in quarterly revenue on Thursday  as a rise in film unit revenue offset declines in U.S. affiliate revenue.",
        "date": "11162017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "CORRECTED-Viacom reports 2.9 percent rise in revenue "
    },
    {
        "content": "* VIACOM INC - ‍BOARD OF DIRECTORS HAS DECLARED A QUARTERLY CASH DIVIDEND OF $0.20 PER SHARE ON BOTH CO'S CLASS A AND CLASS B COMMON STOCK​ Source text for Eikon: Further company coverage:",
        "date": "11102017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-VIACOM SETS QUARTERLY CASH DIVIDEND OF $0.20/SHR ON CLASS A & CLASS B COMMON STOCK "
    },
    {
        "content": "* Avid technology - ‍announced multiyear enterprise agreement with viacom  to enhance worldwide production infrastructure on avid's mediacentral platform​ Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Avid enters into multiyear enterprise agreement with Viacom "
    },
    {
        "content": "* Viacom Inc - ‍quarterly GAAP revenues increased 3% to $3.32 billion​",
        "date": "11162017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom reports Q4 profit $1.67‍​/shr "
    },
    {
        "content": "Nov 7 Viacom Inc's Paramount Pictures said on Tuesday it has ended a financing agreement with China-based Huahua Media due to recent changes in Chinese foreign investment policies.",
        "date": "11072017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Paramount Pictures scraps agreement with Huahua Media "
    },
    {
        "content": "* ‍Paramount Pictures - ‍paramount Pictures and Huahua Media have mutually agreed to end their slate financing agreement​",
        "date": "11072017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Paramount Pictures provides slate financing update "
    },
    {
        "content": "* Viacom Inc announces ‍appointment of Kelly Day as president of Viacom Digital Studios  a new unit focused on digital content​ Source text for Eikon: Further company coverage:",
        "date": "11012017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom appoints Kelly Day as president of Viacom Digital Studios "
    },
    {
        "content": " (This Oct 26 story in the 11th paragraph  corrects to say Viacom announced plans to launch its streaming Nickelodeon channel in Japan earlier this month  from launched it)",
        "date": "10312017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom looks to U.S. mobile deals as young viewers flee TV "
    },
    {
        "content": "NEW YORK  Oct 26 Viacom Inc is trying a new tactic in its multi-front effort to win back younger U.S. viewers ditching expensive cable TV packages: seeking deals directly with mobile phone networks.",
        "date": "10312017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "CORRECTED-Viacom looks to U.S. mobile deals as young viewers flee TV "
    },
    {
        "content": "Viacom Inc  and Charter Communications Inc   agreed on a short-term extension of their renewal deadline  a source familiar with the matter said  as the companies aim to avoid the immediate blackout of Viacom networks. | Video ",
        "date": "10162017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom  Charter agree to extend renewal deadline: source "
    },
    {
        "content": "Viacom Inc  and cable operator Spectrum continued talks  Sunday night as the 7 pm ET (2300 GMT) deadline on their programming agreement passed  a source familiar with the situation told Reuters.",
        "date": "10152017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom  Spectrum continue talks past 7 pm deadline: source "
    },
    {
        "content": "Viacom Inc  and Charter Communications Inc  have agreed to a distribution deal that puts eight of Viacom's most popular networks in Charter's cheapest U.S. cable bundle  a source told Reuters on Wednesday.",
        "date": "10182017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom  Charter deal to include eight networks in basic package: source "
    },
    {
        "content": "Oct 16 Viacom Inc and Charter Communications Inc  agreed on a short-term extension of their renewal deadline  a source familiar with the matter said  as the companies aim to avoid the immediate blackout of Viacom networks.",
        "date": "10162017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom  Charter agree to extend renewal deadline - source "
    },
    {
        "content": "Oct 15 Viacom Inc and cable operator Spectrum continued talks  Sunday night as the 7 pm ET (2300 GMT) deadline on their programming agreement passed  a source familiar with the situation told Reuters.",
        "date": "10152017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom  Spectrum continue talks past 7 pm deadline-source "
    },
    {
        "content": "Oct 18 Viacom Inc and Charter Communications Inc have agreed to a distribution deal that puts eight of Viacom's most popular networks in Charter's cheapest U.S. cable bundle  a source told Reuters on Wednesday.",
        "date": "10182017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 2-Viacom  Charter deal to include eight networks in basic package -source "
    },
    {
        "content": "* Viacom has agreed to short term extension of renewal deadline with Charter- source Source",
        "date": "10162017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom has agreed to short term extension of Spectrum renewal deadline with Charter- source "
    },
    {
        "content": "Oct 18 Viacom Inc and Charter Communications have agreed to a deal whereby eight of Viacom's networks  including five of its flagship networks  will be in the least expensive  package of Charter's Spectrum cable service  a source told Reuters on Wednesday.",
        "date": "10182017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom  Charter agree to deal to include 8 networks in basic package- source "
    },
    {
        "content": "Oct 17 Viacom Inc and cable operator Spectrum have agreed on a multi-year programming deal that keeps Nickelodeon  Comedy Central and Viacom's 21 other networks in 16.6 million households  the companies said on Tuesday.",
        "date": "10182017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom and Charter's Spectrum reach programming deal "
    },
    {
        "content": "Oct 12 Viacom Inc  parent of networks including MTV and Nickelodeon  launched TV ads this week urging its viewers to call customer service at cable company Spectrum ahead of a deadline that may result in a costly blackout for 16.6 million customers.",
        "date": "10122017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom launches TV ads in dispute with Charter "
    },
    {
        "content": "Viacom Inc  said on Wednesday that Charter Communications  subscribers may lose access to its channels such as MTV  Comedy Central and Nickelodeonon as the expiration looms for a distribution deal between the companies.",
        "date": "10122017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom warns of disruption as negotiations with Charter stall "
    },
    {
        "content": "Oct 11 Viacom Inc said on Wednesday that Charter Communications subscribers may lose access to its channels such as MTV  Comedy Central and Nickelodeonon as the expiration looms for a distribution deal between the companies.",
        "date": "10122017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-Viacom warns of disruption as negotiations with Charter stall "
    },
    {
        "content": "* Current Viacom  Charter deal set to expire October 15- source‍​",
        "date": "10122017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Current Viacom  Charter deal set to expire Oct 15- source‍​ "
    },
    {
        "content": "Oct 3 Media content companies must get bigger to compete in the quickly changing media landscape  Shari Redstone  whose family controls Viacom Inc and CBS  told attendees of a luncheon on Tuesday at the Paley Center for Media in New York City.",
        "date": "10032017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom  CBS owner Shari Redstone says media companies need scale "
    },
    {
        "content": "* Viacom Inc says on leak of digital properties \"see no indication that the information was viewed by anybody else\"‍​ Further company coverage:",
        "date": "09192017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom says on leak of digital properties \"see no indication that the information was viewed by anybody else\"‍​ "
    },
    {
        "content": "* Viacom optimizes its video distribution network in North America with Cisco Further company coverage: ",
        "date": "09152017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom optimizes video distribution network in North America with Cisco "
    },
    {
        "content": "* hoopla digital says ‍announced an agreement with Viacom to add hundreds of television shows ​ Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-hoopla digital ‍announces an agreement with Viacom ​ "
    },
    {
        "content": "Sept 13 Viacom Inc's MTV network had its first summer of ratings growth in six years  the network told Reuters this week  a sign that the company is seeing progress wooing back coveted younger viewers who watch shows online.",
        "date": "09132017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom's MTV sees first summer ratings growth in six years "
    },
    {
        "content": "Sept 8 Viacom Inc's  Paramount Pictures movie studio still has not received payments from the Chinese studios it entered into a financing deal with in January  Paramount Chief Executive Jim Gianopulos told investors on Friday.",
        "date": "09082017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "UPDATE 1-Paramount has not received payment from Chinese studios -studio CEO "
    },
    {
        "content": "Sept 8 Viacom Inc's  Paramount Pictures movie studio still has not received payments from at least one of the Chinese studios it entered into a financing deal with in January  Paramount Chief Executive Jim Gianopulos told investors on Friday.",
        "date": "09082017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Paramount still has not received payment from Chinese studio -studio CEO "
    },
    {
        "content": "LOS ANGELES The MTV Video Music awards were held in Los Angeles on Sunday.",
        "date": "08282017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Factbox: Key winners at the 2017 MTV Video Music Awards "
    },
    {
        "content": "BRUSSELS  Aug 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08232017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "EU mergers and takeovers (Aug 23) "
    },
    {
        "content": "LOS ANGELES Tom Cruise broke his ankle while performing a stunt on the set of the upcoming \"Mission: Impossible 6 \" causing production on the film to go on hiatus while the actor recovers  Paramount Pictures said in a statement on Wednesday. | Video ",
        "date": "08162017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Tom Cruise breaks ankle in stunt  halts production on 'Mission' film "
    },
    {
        "content": "LOS ANGELES  Aug 15 Pop star Pink has been chosen to receive the 2017 Vanguard Award  MTV's equivalent of a lifetime achievement honor for video music  the U.S. cable and satellite television channel said on Tuesday.",
        "date": "08152017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Pink to get Vanguard award at MTV Video Music Awards "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.20 per share Source text for Eikon: Further company coverage:",
        "date": "08022017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom sets quarterly cash dividend of $0.20/share "
    },
    {
        "content": "BRUSSELS  July 31 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07312017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "EU mergers and takeovers (July 31) "
    },
    {
        "content": "NEW YORK Viacom Inc could gain a leg up in negotiations with distributors and ward off declines in U.S. ad revenue and sales by finding a merger partner  analysts said on Friday.",
        "date": "08042017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom's weak forecast shows need for merger: analysts "
    },
    {
        "content": "Viacom Inc  the owner of MTV  Comedy Central and Paramount Pictures  forecast a low single-digit dip in sales to  U.S. pay-TV companies and streaming video services this quarter  sending its stock down almost 8 percent after hours.",
        "date": "08032017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom sees weak affiliate sales  shares plummet "
    },
    {
        "content": "NEW YORK  Aug 4 Viacom Inc could gain a leg up in negotiations with distributors and ward off declines in U.S. ad revenue and sales by finding a merger partner  analysts said on Friday.",
        "date": "08042017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 2-Viacom's weak forecast shows need for merger -analysts "
    },
    {
        "content": "Aug 3 Viacom Inc  the owner of MTV  Comedy Central and Paramount Pictures  forecast a low single-digit dip in sales to  U.S. pay-TV companies and streaming video services this quarter  sending its stock down almost 8 percent after hours.",
        "date": "08032017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 4-Viacom sees weak affiliate sales  shares plummet "
    },
    {
        "content": "* GAMEMINE INC SAYS HAS ENTERED INTO A GLOBAL DISTRIBUTION PARTNERSHIP WITH VIACOM INC",
        "date": "07272017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom and Gamemine enter into a global distribution partnership "
    },
    {
        "content": "* Viacom  Discovery vying for Scripps & deal could come soon; Scripps family said to want 50 pct of deal in cash - CNBC  citing sources",
        "date": "07252017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom  Discovery vying for Scripps and deal could come soon - CNBC "
    },
    {
        "content": "* Viacom names Justin Dini senior vice president  corporate communications Source text for Eikon: Further company coverage:",
        "date": "07242017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom names Justin Dini senior vice president  corporate communications "
    },
    {
        "content": "* Viacom Inc - ‍revenues in third fiscal quarter increased 8%  or $257 million  to $3.36 billion​",
        "date": "08032017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom Q3 earnings per share $1.69 "
    },
    {
        "content": "Aug 3 Viacom Inc  the owner of MTV  Comedy Central and Paramount  reported an 8.3 percent rise in quarterly revenue as higher domestic affiliate revenue offset continued declines in U.S. advertising sales.",
        "date": "08032017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom reports 8.3 percent rise in quarterly revenue "
    },
    {
        "content": "Viacom Inc has informed Scripps Networks Interactive it is willing to pay all cash to acquire the U.S. TV network operator  sources familiar with the matter said on Tuesday. | Video ",
        "date": "07262017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Exclusive: Viacom willing to make an all-cash deal to buy Scripps Networks - sources "
    },
    {
        "content": "Viacom Inc has informed Scripps Networks Interactive it is willing to pay all cash to acquire the U.S. TV network operator  sources familiar with the matter said on Tuesday.",
        "date": "07262017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom willing to make an all-cash deal to buy Scripps Networks - sources "
    },
    {
        "content": "* Viacom announces multi-year content partnership with Tyler Perry",
        "date": "07142017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom announces multi-year content partnership with Tyler Perry "
    },
    {
        "content": "LONDON  July 12 (Thomson Reuters Foundation) - American cable television channel MTV is launching drama series in Egypt and in India with storylines on female genital mutilation  child marriage and sex work with the aim of  generating debate around issues often seen as taboo.",
        "date": "07132017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "REFILE-New MTV dramas in Egypt and India tackle female genital mutilation  sex work "
    },
    {
        "content": "July 13 Internet television company Roku has hired investment banks to lead an initial public offering that could come later this year as it aims for a valuation of more than $1 billion  sources familiar with the matter said.",
        "date": "07132017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Internet TV company Roku hires banks for 2017 IPO -sources "
    },
    {
        "content": "* Announced four internal appointments and two new additions to its Distribution and Business Development Group",
        "date": "06152017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "CORRECTED-BRIEF-Viacom ‍announces 2 new additions to its Distribution and Business Development group​ "
    },
    {
        "content": "* Viacom announces the pricing terms of its cash tender offers for certain outstanding debt securities",
        "date": "06022017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom reports pricing terms of its cash tender offers for certain outstanding debt securities "
    },
    {
        "content": "NEW YORK  May 25 A number of Viacom Inc's networks  which include Nickelodeon  Comedy Central and MTV  will be available to Altice NV's Suddenlink subscribers more than two years after the cable provider dropped them in a carriage dispute  the companies said on Thursday.",
        "date": "05252017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom networks to return to Suddenlink customers "
    },
    {
        "content": "* Viacom CEO Bakish at JPM conference - set up well going into the upfront season  should be transacting in next 30-60 days",
        "date": "05222017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom CEO Bakish says set up well going into upfront season - JPM conference "
    },
    {
        "content": "NEW YORK CBS Corp  Chief Executive Leslie Moonves said in response to a shareholder question on Friday that he believed shares of Viacom Inc   which the network considered merging with last year  were undervalued.",
        "date": "05192017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "CBS' CEO Moonves says Viacom undervalued "
    },
    {
        "content": "NEW YORK  May 19 CBS Corp Chief Executive Leslie Moonves said in response to a shareholder question on Friday that he believed shares of Viacom Inc   which the network considered merging with last year  were undervalued.",
        "date": "05192017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-CBS' CEO Moonves says Viacom undervalued "
    },
    {
        "content": "May 19 CBS Chief Executive Officer Leslie Moonves told shareholders on Friday he believes shares of Viacom   which the network considered merging with last year  are undervalued.",
        "date": "05192017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "CBS CEO Moonves says Viacom is undervalued "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.20per share Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom sets quarterly cash dividend of $0.20 per share "
    },
    {
        "content": "* Viacom announces cash tender offers for up to $750 million aggregate purchase price of certain outstanding debt securities",
        "date": "05182017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom announces cash tender offers for up to $750 mln aggregate purchase price of certain outstanding debt securities "
    },
    {
        "content": "May 17 Ceo says does not believe Charter Communications' move to re-tier its networks is 'something that is contractually allowed'",
        "date": "05172017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom CEO says Charter move is not contractually allowed "
    },
    {
        "content": "Viacom Inc  shares fell as much as 4.8 percent on Wednesday after Deutsche Bank downgraded the New York-based media company to \"sell \" citing the expected loss of revenue from a large cable distributor.",
        "date": "05102017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom's shares drop on Deutsche Bank downgrade to 'sell' "
    },
    {
        "content": "Viacom Inc   the owner of MTV  Comedy Central and Nickelodeon  reported second-quarter profit that beat estimates on Thursday  but worry that it will lose revenue from a big cable distributor weighed on its stock. | Video ",
        "date": "05042017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom beats estimates but faces distribution headwinds "
    },
    {
        "content": "May 4 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported second-quarter profit that beat estimates on Thursday  but worry that it will lose revenue from a big cable distributor weighed on its stock.",
        "date": "05042017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 4-Viacom beats estimates but faces distribution headwinds "
    },
    {
        "content": "May 4 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported second-quarter profits that beat Wall Street's estimates on Thursday  but advertising and distribution headwinds weighed on its stock in early trading.",
        "date": "05042017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "CORRECTED-UPDATE 3-Viacom beats estimates but faces distribution  ad headwinds "
    },
    {
        "content": "* Viacom Inc qtrly filmed entertainment revenues grew 37pct to $895 million",
        "date": "05042017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom Q2 earnings per share $0.30 "
    },
    {
        "content": "May 4 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported a 60 percent decline in quarterly profit on Thursday  hurt by higher programming costs and as domestic advertising sales continue to fall.",
        "date": "05042017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom's profit plunges 60 percent "
    },
    {
        "content": "Time Warner Inc  reported a better-than-expected quarterly profit  as revenue from box office hits including  \"The LEGO Batman Movie \" and \"Kong: Skull Island\" helped offset declining ad sales. | Video ",
        "date": "05032017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Time Warner beats estimates; sees lower advertising "
    },
    {
        "content": "* Co says on track to close merger with AT&T before 2017 end (Adds analyst comment  details from call)",
        "date": "05032017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 3-Time Warner beats estimates; sees lower advertising "
    },
    {
        "content": "* Announced launch of Global Product Development Group Source text for Eikon: Further company coverage:",
        "date": "04252017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom Inc announces launch of Global Product Development Group "
    },
    {
        "content": "* Viacom names Julia Phelps senior vice president  communications & culture",
        "date": "04212017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom names Julia Phelps Senior Vice President  Communications & Culture "
    },
    {
        "content": "* Colleen Fahey Rush named executive vice president  Insights & Audience Science  and chief research officer of Viacom Media Networks",
        "date": "04072017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Colleen Fahey Rush named EVP  Insights & Audience Science  and Chief Research Officer of Viacom Media Networks "
    },
    {
        "content": "* Lions Gate Entertainment Corp - Agreement for MGM to acquire 80.91% aggregate membership interests in EPIX held by Viacom  Paramount and Lionsgate",
        "date": "04052017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-MGM to acquire full ownership of EPIX "
    },
    {
        "content": "April 5 MGM Holdings Inc said it would acquire the 81 percent of Epix it does not already own from two of its partners in the premium U.S. channel  Viacom Inc and Lionsgate Entertainment Corp  for about $1.03 billion.",
        "date": "04052017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "MGM to buy 81 pct of Epix for $1.03 bln "
    },
    {
        "content": "April 6 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Thursday:",
        "date": "04062017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "April 6 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04062017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "PRESS DIGEST - Wall Street Journal - April 6 "
    },
    {
        "content": "March 30 When Viacom Inc’s Spike TV rebrands as the Paramount Network in early 2018  the struggling media company hopes to position itself as a challenger to top-rated U.S. cable networks like Comcast Corp’s USA and Time Warner Inc’s TNT with shows that have the caliber of HBO.",
        "date": "03302017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom looks to rival major U.S. cable channels with Paramount Network "
    },
    {
        "content": "* Press release - viacom names jim gianopulos chairman and chief executive officer of paramount pictures",
        "date": "03272017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom appoints Jim Gianopulos as Chairman and CEO of Paramount Pictures "
    },
    {
        "content": "Shares of Viacom Inc  could rise 40 percent in the next year as the New York-based media company's new CEO Bob Bakish focuses on its Paramount Pictures studio and a handful of its networks to turn the business around  according to Barron's.",
        "date": "03262017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom's shares could jump 40 percent: Barron's "
    },
    {
        "content": "March 26 Shares of Viacom Inc could rise 40 percent in the next year as the New York-based media company's new CEO Bob Bakish focuses on its Paramount Pictures studio and a handful of its networks to turn the business around  according to Barron's.",
        "date": "03262017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom's shares could jump 40 percent -Barron's "
    },
    {
        "content": "NEW YORK Major U.S. media companies Time Warner Inc’s  Turner  Viacom Inc  and 21st Century Fox Inc’s  Fox Networks Group will launch OpenAP  a program for advertisers to laser focus their commercials at specific audiences on television.",
        "date": "03152017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Turner  Fox  Viacom to offer advertisers way to laser focus on audience "
    },
    {
        "content": "* Kern Schireson has been appointed Executive Vice President and Chief Data Officer  effective immediately  Source text for Eikon: Further company coverage:",
        "date": "03132017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom names Kern Schireson Chief Data Officer "
    },
    {
        "content": "* Viacom promotes Christa D'Alimonte to executive vice president  general counsel and secretary",
        "date": "03102017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom promotes Christa D'Alimonte to executive vice president  general counsel and secretary "
    },
    {
        "content": "NEW YORK  March 7 Most people would be thrilled to succeed in one field. Sheila Johnson has triumphed in some remarkably different ones.",
        "date": "03072017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BET co-founder Sheila Johnson succeeds all over the map "
    },
    {
        "content": "Viacom Inc is in talks with former Twentieth Century Fox Chairman Jim Gianopulos to lead its Paramount Pictures film studio  the Wall Street Journal reported.",
        "date": "03082017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom in talks with ex-Fox Chairman Gianopulos to lead Paramount: WSJ "
    },
    {
        "content": "March 8 Viacom Inc is in talks with former Twentieth Century Fox Chairman Jim Gianopulos to lead its Paramount Pictures film studio  the Wall Street Journal reported.",
        "date": "03082017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-Viacom in talks with ex-Fox Chairman Gianopulos to lead Paramount-WSJ "
    },
    {
        "content": "March 8 Viacom Inc is in talks with former Twentieth Century Fox Chairman Jim Gianopulos to lead its Paramount Pictures film studio  the Wall Street Journal reported.",
        "date": "03082017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom in talks with ex-Fox Chairman Gianopulos to lead Paramount-WSJ "
    },
    {
        "content": "* Says intends to use net proceeds from offering primarily for repayment of outstanding indebtedness",
        "date": "02232017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom announces $1.3 billion subordinated debt offering "
    },
    {
        "content": "NEW YORK (IFR) - Investors piled into a hybrid bond offering from US media giant Viacom on Thursday  but the issuer had to sweeten some of the terms to reflect the risk of sweeping US tax reforms.",
        "date": "02232017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom sweetens tax-related terms on new bond sale "
    },
    {
        "content": "* Viacom announces leadership transition at Paramount Pictures",
        "date": "02222017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Brad Grey to step down as Chairman  CEO of Paramount Pictures "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 21 (Fitch) Fitch Ratings has assigned a 'BB+' rating to  Viacom Inc.'s (Viacom) issuance of 40-year junior subordinated debentures.  The  rating reflects standard notching for a hybrid instrument with its risk  characteristics.  In addition  Fitch affirmed Viacom's 'BBB' Issuer Default  Rating (IDR).  The Rating Outlook is Negative. Proceeds from the offering are expected to be used to repay  the  October 2017  and Se",
        "date": "02212017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Fitch Rates Viacom's Junior Subordinated Debt 'BB+'; Affirms 'BBB' IDR and Negative Outlook "
    },
    {
        "content": "Brad Grey  the chairman and chief executive officer of Viacom Inc's  Paramount Pictures film studio is expected to leave with an announcement coming as early as next week  according to two sources familiar with the situation.",
        "date": "02172017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Exclusive: Paramount CEO Grey to depart as soon as next week - sources "
    },
    {
        "content": "* Jana Partners LLC dissolves sole share stake in Twitter - sec filing",
        "date": "02142017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Jana Partners dissolves stake in Twitter  Viacom and Priceline "
    },
    {
        "content": "* Viacom to narrow focus to six key cable TV channels- WSJ  citing sources",
        "date": "02082017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom to narrow focus to six key cable TV channels- WSJ "
    },
    {
        "content": "Viacom Inc  will focus on five of its cable television brands and the Paramount movie studio  license less content to video streaming companies and consider selling assets as part of a turnaround plan  it said on Thursday.",
        "date": "02092017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom puts its might behind six brands in turnaround push "
    },
    {
        "content": "Feb 9 Viacom Inc will focus on five of its cable television brands and the Paramount movie studio  license less content to video streaming companies and consider selling assets as part of a turnaround plan  it said on Thursday.",
        "date": "02092017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 5-Viacom puts its might behind six brands in turnaround push "
    },
    {
        "content": "* Viacom Inc - company presents new strategic plan  including focus on six priority flagship brands",
        "date": "02092017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom Inc posts Q1 adjusted earnings $1.04/shr "
    },
    {
        "content": "Feb 9 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported a 5.39 percent rise in quarterly revenue  helped by improved theatrical revenue and growth in domestic affiliate revenues.",
        "date": "02092017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom revenue rises 5.39 pct "
    },
    {
        "content": "* Board of directors has declared a quarterly cash dividend of $0.20 per share on both its Class A and Class B common stock  Source text for Eikon:  Further company coverage:",
        "date": "02062017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom declares quarterly cash dividend "
    },
    {
        "content": "Feb 6 Newly named Viacom Inc Chief Executive Officer Bob Bakish will outline his plans to revive the company's struggling business on Thursday during an earnings call  he told shareholders on Monday.",
        "date": "02062017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom CEO to present turnaround strategy on Thursday "
    },
    {
        "content": "* S&P says Viacom Inc financial risk profile assessment revised to significant; 'BBB-' rating and negative outlook unchanged  Source text for Eikon: (http://bit.ly/2kkMF84)",
        "date": "01232017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-S&P says Viacom financial risk profile assessment revised to significant 'BBB-' rating "
    },
    {
        "content": "Jan 26 Lionsgate has initiated talks to sell its stake in Epix to the premium U.S. cable channel's other two shareholders  MGM Holdings Inc and Paramount  a unit of Viacom Inc  according to people familiar with the matter.",
        "date": "01262017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Lionsgate in talks to sell Epix stake to MGM  Viacom -sources "
    },
    {
        "content": "Lionsgate has initiated talks to sell its stake in Epix to the premium U.S. cable channel's other two shareholders  MGM Holdings Inc and Paramount  a unit of Viacom Inc  according to people familiar with the matter.",
        "date": "01262017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Lionsgate in talks to sell Epix stake to MGM  Viacom: sources "
    },
    {
        "content": "Jan 26 Lionsgate has initiated talks to sell its stake in Epix to the premium U.S. cable channel's other two shareholders  MGM Holdings Inc and Paramount  a unit of Viacom Inc  according to people familiar with the matter.",
        "date": "01262017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-Lionsgate in talks to sell Epix stake to MGM  Viacom -sources "
    },
    {
        "content": "Jan 19 Viacom's Paramount Pictures has signed a three-year deal with two Chinese film companies  Shanghai Film Group and Huahua Media  the companies said on Thursday.",
        "date": "01192017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom's Paramount Pictures inks deal with Chinese film companies "
    },
    {
        "content": "* CEO Robert Bakish reports grant of employee stock options of 337 500 of co's class b common stock",
        "date": "01112017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom CEO Robert Bakish reports grant of employee stock options "
    },
    {
        "content": "* Viacom Inc - as per employment agreement  Robert Bakish annual base salary will be $3 million per year - SEC filing  Source text: (http://bit.ly/2jwyf00) Further company coverage:",
        "date": "01112017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom Inc says as per employment agreement  Robert Bakish's annual base salary will be $3 mln per year - SEC filing "
    },
    {
        "content": "Jan 11 Media company Viacom Inc said on Wednesday that David Lynn would lead its international media business  Viacom International Media Networks (VIMN)  replacing Chief Executive Bob Bakish.",
        "date": "01112017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom's David Lynn to head international media networks unit "
    },
    {
        "content": "* Viacom appoints David Lynn as CEO of Viacom International Media Networks",
        "date": "01112017",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom appoints David Lynn as CEO of Viacom International Media Networks "
    },
    {
        "content": "Viacom Inc  on Thursday named Sarah Levy  the chief operating officer of its Nickelodeon network  COO of its global entertainment group  as new Chief Executive Bob Bakish seeks to turn around the ailing media company.",
        "date": "01052017",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom names global entertainment group COO "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK Longtime Viacom Inc  executive Doug Herzog  who oversees the networks Comedy Central and MTV  is leaving the company next month  according to a memo to employees sent Wednesday from chief executive Bob Bakish.",
        "date": "12212016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom unit head overseeing MTV  Comedy Central to leave "
    },
    {
        "content": "Controlling shareholder Sumner Redstone will step down from the Viacom  board of directors after the company's annual meeting in February  according to a company filing on Friday.",
        "date": "12162016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Sumner Redstone to step down from Viacom board "
    },
    {
        "content": "Sumner Redstone's holding company National Amusements Inc's decision to abandon a merger of its prized media assets  CBS Corp and Viacom Inc  leaves them under pressure to buy or partner with peers in an industry where scale matters.",
        "date": "12132016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Abandoned CBS  Viacom merger leaves scale issue lingering "
    },
    {
        "content": "NEW YORK Media mogul Sumner Redstone and his daughter Shari called off their failed effort to merge CBS Corp  and Viacom Inc  on Monday  sending shares of Viacom - widely viewed as the weaker company - down almost 8 percent. | Video ",
        "date": "12122016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Sumner Redstone and daughter pull CBS  Viacom merger plan "
    },
    {
        "content": "Shari Redstone  vice chair of Viacom Inc and the daughter of controlling shareholder Sumner Redstone  has withdrawn her support for a merger between CBS Corp and Viacom  CNBC reported on Monday.",
        "date": "12122016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Shari Redstone withdraws support for CBS-Viacom merger: CNBC "
    },
    {
        "content": "* Viacom waiting for CBS to make offer; Viacom delivered presentation to CBS last Wednesday - CNBC  citing sources",
        "date": "11292016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom waiting for CBS to make offer - CNBC  citing sources "
    },
    {
        "content": "Nov 28 The top priorities of Viacom Inc's  acting president and chief executive are improving key relations with affiliates as well as the struggling media company's internal culture  Bob Bakish told Reuters at the end of his first week on the job.",
        "date": "11282016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom CEO looks to improve culture  affiliate relations  amid CBS talk "
    },
    {
        "content": "Viacom Inc   the owner of Comedy Central  Nickelodeon and MTV  said on Tuesday it had bought Argentine broadcaster Television Federal SA (Telefe) from telecom carrier Telefonica SA  for $345 million in cash.",
        "date": "11152016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom buys Argentine broadcaster from Telefonica for $345 million "
    },
    {
        "content": "Nov 15 Viacom Inc  the owner of Comedy Central  Nickelodeon and MTV  said on Tuesday it had bought Argentine broadcaster Television Federal SA (Telefe) from telecom carrier Telefonica SA for $345 million in cash.",
        "date": "11152016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 2-Viacom buys Argentine broadcaster from Telefonica for $345 mln "
    },
    {
        "content": "Viacom Inc   the owner of Comedy Central  Nickelodeon and MTV  said on Tuesday it would buy Argentine broadcaster Television Federal SA (Telefe) from telecom carrier Telefonica SA  for $345 million in cash.",
        "date": "11152016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom buys Telefonica's Telefe for $345 million "
    },
    {
        "content": "Nov 15 Viacom Inc  the owner of Comedy Central  Nickelodeon and MTV  said on Tuesday it would buy Argentine broadcaster Television Federal SA (Telefe) from telecom carrier Telefonica SA for $345 million in cash.",
        "date": "11152016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "CORRECTED-UPDATE 1-Viacom buys Telefonica's Telefe for $345 mln "
    },
    {
        "content": "Nov 15 Viacom Inc  the owner of Comedy Central  Nickelodeon and MTV  said on Tuesday it bought Argentine broadcaster Television Federal SA (Telefe) for $345 million in cash.",
        "date": "11152016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "CORRECTED-Viacom buys Telefonica's Telefe for $345 mln "
    },
    {
        "content": "Possible sticking points have emerged ahead of negotiations between media companies CBS Corp  and Viacom Inc  about a potential merger  including who will be on the board of the combined company and what it would be called  people familiar with the situation told Reuters.",
        "date": "11152016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Exclusive: Ahead of CBS/Viacom deal talks  sticking points emerge - sources "
    },
    {
        "content": "* under terms of agreement  Viacom will acquire all of Telefe's brands and assets",
        "date": "11152016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom acquires Televisión Federal S.A. in Argentina from Telefónica S.A. for $345 mln "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in General Motors - SEC filing",
        "date": "11142016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Soros Fund Management takes share stake in Alphabet  dissolves stake in GM - SEC filing "
    },
    {
        "content": "Viacom Inc   the owner of MTV  Comedy Central and Nickelodeon  reported lower-than-expected quarterly revenue on Wednesday  weighed down by a decline in domestic advertising sales and the absence of hits from its Paramount film studio.",
        "date": "11092016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom revenue misses expectations as ad sales fall "
    },
    {
        "content": "NEW YORK  Nov 10 Shari Redstone  a controlling shareholder of Viacom Inc and CBS Corp  never wanted to separate the two media companies 10 years ago  she told attendees of The New York Times DealBook conference on Thursday.",
        "date": "11102016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Shari Redstone says she did not support a Viacom/CBS split "
    },
    {
        "content": "* Jana Partners LLC takes sole share stake in Yahoo Inc - sec filing",
        "date": "11142016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Jana Partners takes sole share stake in Yahoo  Twitter "
    },
    {
        "content": "Nov 9 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported lower-than-expected quarterly revenue on Wednesday  weighed down by a decline in domestic advertising sales and the absence of hits from its Paramount film studio.",
        "date": "11092016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 3-Viacom revenue misses expectations as ad sales fall "
    },
    {
        "content": "* CBS Corp has retained banks Moelis & Co and Goldman Sachs to advise company on possible merger with Viacom Inc- WSJ  citing source  Source text : http://on.wsj.com/2ewYYqk",
        "date": "11072016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-CBS retained banks Moelis & Co  Goldman Sachs to advise on merger with Viacom- WSJ  citing source "
    },
    {
        "content": "Nov 9 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported a 14.8 percent fall in quarterly revenue  weighed down by lower domestic advertising revenue and the absence of hit movie releases at its Paramount film studio.",
        "date": "11092016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom revenue falls 14.8 pct "
    },
    {
        "content": "Nov 10 Shari Redstone Says She Was Never A Proponent Of Splitting Up CBS from Viacom",
        "date": "11102016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Shari Redstone says she was never a proponent of splitting CBS/Viacom "
    },
    {
        "content": "* Viacom international chief Bob Bakish may serve as interim CEO - Bloomberg",
        "date": "10272016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom international chief Bob Bakish may serve as interim CEO - Bloomberg "
    },
    {
        "content": "* Is in advanced talks with google to join its web tv service-source  Further company coverage:    (Reporting by Jessica Toonkel)",
        "date": "10192016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom is in advanced talks to join Google web TV-source "
    },
    {
        "content": "* CBS and Viacom have not yet engaged  but are preparing for merger talks; CBS CEO Leslie Moonves seeks governance rights -CNBC  citing sources  Source text: http://bit.ly/2d4RmzQ",
        "date": "10112016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-CBS and Viacom have not yet engaged  but are preparing for merger talks; CBS CEO Leslie Moonves seeks governance rights-CNBC "
    },
    {
        "content": "* Viacom has retained financial advisors in connection with special committee's evaluation of request by national",
        "date": "10142016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom special committee retains financial advisors "
    },
    {
        "content": "* Crowd Mobile & Viacom International Media Networks announce strategic partnership",
        "date": "10092016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Crowd Mobile and Viacom announce strategic partnership "
    },
    {
        "content": "* Possible re-Combination of Viacom (BAA3-stable) and CBS (BAA2-stable) could result in return to BAA2 rating for Viacom  Source text for Eikon:  Further company coverage:",
        "date": "09292016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Moody's says that possible re-combination of viacom (baa3-stable) and cbs (baa2-stable) could result in return to baa2 rating for viacom "
    },
    {
        "content": "NEW YORK (IFR) - Media conglomerate Viacom (Baa3/BBB-/BBB) is preparing to price a US dollar bond as soon as this week  market sources told IFR on Monday.",
        "date": "09262016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Exclusive: Viacom readies U.S. dollar bond - sources "
    },
    {
        "content": "NEW YORK  Sept 29 (IFR) - Investors piled billions of orders into a US$1.3bn bond from media giant Viacom on Thursday  betting that a possible merger with CBS would help turn around the struggling business.",
        "date": "09292016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Investors binge on Viacom bonds after merger talk "
    },
    {
        "content": "* National Amusements  Inc. proposes combination of CBS and Viacom",
        "date": "09292016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-National Amusements Inc proposes combination of CBS and Viacom "
    },
    {
        "content": "NEW YORK  Sept 26 (IFR) - Media conglomerate Viacom is preparing to price a US dollar bond as soon as this week  market sources told IFR on Monday.",
        "date": "09262016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom readies US dollar bond sale as soon as this week: sources "
    },
    {
        "content": "* Viacom board said to plan all-day strategy review  hire advisers - Bloomberg  citing sources",
        "date": "09072016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom board said to plan all-day strategy review  hire advisers - Bloomberg "
    },
    {
        "content": "* Fitch on Viacom - We expect a permanent President and CEO will be in place by September 30  2016",
        "date": "08222016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Fitch says Viacom leadership transition is neutral to ratings "
    },
    {
        "content": "* Viacom and Sumner Redstone's National Amusements in deep settlement talks that would end litigation  lead to CEO Dauman's exit - CNBC  citing DJ  Further company coverage:",
        "date": "08172016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom and Sumner Redstone's National Amusements in deep settlement talks that would end litigation  lead to CEO Dauman's exit - CNBC  citing DJ "
    },
    {
        "content": "Aug 19 Memo to Viacom employees obtained by Reuters :",
        "date": "08192016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom  National Amusements boards agree to settle dispute - internal memo "
    },
    {
        "content": "* Thomas May will become Viacom chairman- CNBC  citing sources",
        "date": "08192016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Thomas May will become Viacom chairman- CNBC  citing sources "
    },
    {
        "content": "* Moody's - Rating outlook revised to negative from stable following weaker than expected earnings announcement and ongoing operational challenges",
        "date": "08092016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Moody's revises Viacom's Baa2 rating outlook to negative "
    },
    {
        "content": "Top Viacom Inc  executives recently held discussions with National Amusements Inc to settle litigation surrounding the media empire of Sumner Redstone  the Wall Street Journal reported on Tuesday.",
        "date": "08022016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom and Redstone's National Amusements held settlement talks: WSJ "
    },
    {
        "content": "Aug 2 Top Viacom Inc executives recently held discussions with National Amusements Inc to settle litigation related to control of Sumner Redstone's media empire  the Wall Street Journal reported on Tuesday.",
        "date": "08022016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-Viacom and Redstone's National Amusements held settlement talks -WSJ "
    },
    {
        "content": "Aug 2 Top Viacom Inc executives recently held discussions with National Amusements Inc to settle litigation surrounding the media empire of Sumner Redstone  the Wall Street Journal reported on Tuesday.",
        "date": "08022016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom and Redstone's National Amusements held settlement talks-WSJ "
    },
    {
        "content": "* Viacom held settlement talks with Sumner Redstone's National Amusements  but talks fell apart- CNBC  citing DJ   Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "08022016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom held settlement talks with Sumner Redstone's National Amusements  but talks fell apart- CNBC  citing DJ "
    },
    {
        "content": "* Fitch downgrades Viacom's IDR to 'BBB'; outlook remains negative",
        "date": "08052016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Fitch downgrades Viacom's IDR to 'BBB'; outlook remains negative "
    },
    {
        "content": "Aug 4 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported a 1.6 percent rise in quarterly revenue  helped by higher license fees and theatrical revenue at its movie business.",
        "date": "08042016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom revenue rises as movie business drives gains "
    },
    {
        "content": "* Sumner Redstone spokesman says Viacom board would not allow face-to-face meeting between Redstone and independent director Charles Phillips  Source text for Eikon:  Further company coverage:    (Reporting by Dan Levine)",
        "date": "06272016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom board would not allow meeting between Sumner Redstone director "
    },
    {
        "content": "* Former Viacom CEO Tom Freston to CNBC: Would not take CEO job again if asked; nobody has floated idea",
        "date": "06152016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Would not take CEO role again if asked - Former Viacom CEO Tom Freston to CNBC "
    },
    {
        "content": "* S&P - Viacom outlook revised to negative from stable on weaker operating performance; 'BBB-' rating affirmed",
        "date": "06212016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-S&P - Viacom outlook revised to negative from stable on weaker operating performance; 'BBB-' rating affirmed "
    },
    {
        "content": "Sumner Redstone's National Amusements Inc  which holds 80 percent of Viacom voting shares  has started looking for potential board members for Viacom  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06102016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Redstone's National Amusements seeks new Viacom board members: reports "
    },
    {
        "content": "June 9 Sumner Redstone's National Amusements Inc  which holds 80 percent of Viacom voting shares  has started looking for potential board members for Viacom  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06102016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Redstone's National Amusements seeks new Viacom board members - reports "
    },
    {
        "content": "NEW YORK  June 6 Viacom's Chief Executive Philippe Dauman  who is suing over his removal from Sumner Redstone's trust  on Monday said in a court filing that a judge should expedite the matter because the 93-year-old media mogul is in ill health and may soon not be able to provide needed evidence.",
        "date": "06062016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom CEO lawyers urge speedy trial  citing Redstone's health "
    },
    {
        "content": "* Shari Redstone opposing Viacom CEO's request for a quick trial over his removal from her father's family trust - Bloomberg  citing court papers",
        "date": "06032016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Shari Redstone opposing Viacom CEO's request for a quick trial over his removal from her father's family trust - Bloomberg  citing court papers "
    },
    {
        "content": "A Massachusetts court has scheduled a June 7 hearing on Viacom  Chief Executive Philippe Dauman's removal from the trust that will control the media company when Sumner Redstone dies or is deemed incapacitated.",
        "date": "05282016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Court sets June 7 hearing on Viacom CEO's removal from Redstone trust "
    },
    {
        "content": "May 27 Sumner Redstone made clear on Friday that he is considering ousting Viacom's chief executive and the company's board of directors in the fierce power struggle between Redstone's family and company executives over control of the media empire.",
        "date": "05272016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "UPDATE 2-Sumner Redstone suggests he could oust Viacom board  CEO "
    },
    {
        "content": "Sumner Redstone made clear on Friday that he is considering ousting Viacom's  chief executive and the company's board of directors in the fierce power struggle between Redstone's family and company executives over control of the media empire.",
        "date": "05282016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Sumner Redstone suggests he could oust Viacom board  CEO "
    },
    {
        "content": "May 27 A Massachusetts court has scheduled a June 7 hearing on Viacom Chief Executive Philippe Dauman's removal from the trust that will control the media company when Sumner Redstone dies or is deemed incapacitated.",
        "date": "05272016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Court sets June 7 hearing on Viacom CEO's removal from Redstone trust "
    },
    {
        "content": "* Viacom CEO Dauman & Director Abrams file lawsuit to block recent actions around the Sumner Redstone Trust & National Amusements - CNBC  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05232016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom CEO Dauman & Director Abrams file lawsuit to block recent actions around the Sumner Redstone Trust & National Amusements - CNBC "
    },
    {
        "content": "* Viacom Board Poised For Sumner Redstone To Make Changes; Board Still Focused On Delivering Paramount Deal - CNBC  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05242016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom board poised for Sumner Redstone to make changes - CNBC "
    },
    {
        "content": "Media mogul Sumner Redstone is planning to name National Amusements Inc general counsel Tad Jankowski to the seven-person trust that will determine the fate of both Viacom and CBS in the event of Redstone's incapacitation or death  sources familiar with the situation told Reuters on Sunday.",
        "date": "05232016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Sumner Redstone plans to add National Amusements executive to trust: sources "
    },
    {
        "content": "May 20 Media mogul Sumner Redstone has removed Viacom CEO Philippe Dauman and Viacom board member George Abrams from the seven-person trust that will determine the fate of both Viacom and CBS in the event of his incapacitation or death  two people familiar with the situation told Reuters Friday.",
        "date": "05212016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Sumner Redstone removes Viacom CEO and board member from trust "
    },
    {
        "content": "May 22 Media mogul Sumner Redstone is planning to name National Amusements Inc general counsel Tad Jankowski to the seven-person trust that will determine the fate of both Viacom and CBS in the event of Redstone's incapacitation or death  sources familiar with the situation told Reuters on Sunday.",
        "date": "05232016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Sumner Redstone plans to add National Amusements executive to trust -sources "
    },
    {
        "content": "* Viacom board votes to stop paying Chairman Emeritus Sumner Redstone - CNBC  citing DJ    )",
        "date": "05182016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom board votes to stop paying Chairman Emeritus Sumner Redstone - CNBC  citing DJ "
    },
    {
        "content": "* Moody's Says Viacom's Stable Cable Fees Will Protect It From Streaming Threat In The Near Term",
        "date": "05102016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Moody's comments on Viacom's rating "
    },
    {
        "content": "* Board members from CBS  Viacom planning to visit Redstone to investigate his competency for themselves  now that trial is over - WSJ  citing sources  Source text - (http://on.wsj.com/1VR4A2v) Further company coverage:    (Bengaluru Newsroom)",
        "date": "05102016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "BRIEF-Board members from CBS Viacom planning to visit Redstone to investigate his competency for themselves - WSJ  citing sources "
    },
    {
        "content": "* Viacom's carriage dispute with dish will not impact either companies' credit ratings or outlooks imminently",
        "date": "04202016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Moody's - Viacom's dispute with Dish will not impact either companies' credit ratings or outlooks imminently "
    },
    {
        "content": "* Select Viacom live and video-on-demand content to join Sling TV single- and multi-stream services",
        "date": "04212016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Viacom and Dish agree to multi-year renewal "
    },
    {
        "content": "Ailing Viacom Inc  controlling shareholder Sumner Redstone opposes Chief Executive Officer Philippe Dauman's plan to sell a minority stake sale in Viacom's Paramount Pictures movie studio  the Wall Street Journal reported on Monday.",
        "date": "04122016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom's Redstone opposes selling minority stake in Paramount: WSJ "
    },
    {
        "content": "April 11 Ailing Viacom Inc controlling shareholder Sumner Redstone opposes Chief Executive Officer Philippe Dauman's plan to sell a minority stake sale in Viacom's Paramount Pictures movie studio  the Wall Street Journal reported on Monday.",
        "date": "04122016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom's Redstone opposes selling minority stake in Paramount - WSJ "
    },
    {
        "content": "March 7 Viacom CEO Philippe Dauman said on Monday that he expects to renew its contract with Dish Network Corp next quarter.",
        "date": "03072016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom CEO says he expects to renew deal with Dish next quarter "
    },
    {
        "content": "NEW YORK  Feb 4 Sumner Redstone was the mogul who never wanted to retire. For years he held on to his media empire with the same tenacity he used in clinging to the windowsill of a burning hotel in 1979.",
        "date": "02042016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "NEWSMAKER-Sumner Redstone: taking risks and banning Tom Cruise "
    },
    {
        "content": "NEW YORK  Feb 4 Viacom Inc's board of directors named Chief Executive Officer Philippe Dauman as executive chairman  replacing majority owner Sumner Redstone  overriding calls for an independent board chief from Redstone's daughter  who voted against Dauman.",
        "date": "02052016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "RPT-UPDATE 8-Viacom names CEO Dauman as chair as Redstone exits; daughter protests "
    },
    {
        "content": "Viacom Inc's 92-year-old Executive Chairman Sumner Redstone should be examined by a psychiatrist hired by the ex-girlfriend who has questioned his mental competency  a California judge ruled on Friday.",
        "date": "01232016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom's Redstone may undergo medical exam in competency suit "
    },
    {
        "content": "Jan 22 Viacom Inc's 92-year-old Executive Chairman Sumner Redstone should be examined by a psychiatrist hired by the ex-girlfriend who has questioned his mental competency  a California judge ruled on Friday.",
        "date": "01232016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 3-Viacom's Redstone may undergo medical exam in competency suit "
    },
    {
        "content": "Jan 19 A shareholder filed a lawsuit against Viacom's board on Tuesday  alleging the company and CBS  improperly paid millions to executive chairman Sumner Redstone \"while he was physically and mentally incapacitated.\"",
        "date": "01192016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Shareholder sues Viacom board over Sumner Redstone health "
    },
    {
        "content": "BOSTON Viacom Inc  will allow investors to vote in March on a proposal to extend voting rights to all shareholders  though the measure is certain to fail as it is opposed by executive chairman Sumner Redstone's holding company.",
        "date": "01092016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Exclusive: Viacom to allow vote on expanding shareholder rights "
    },
    {
        "content": "BOSTON Viacom Inc  will allow investors to vote in March on a proposal to extend voting rights to all shareholders  though the measure is certain to fail as it is opposed by executive chairman Sumner Redstone's holding company.",
        "date": "01082016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Exclusive: Viacom to allow vote on expanding shareholder rights "
    },
    {
        "content": "Jan 4 Lawyers for media mogul Sumner Redstone on Monday asked a court to dismiss ex-girlfriend Manuela Herzer's petition for a new evaluation of the 92-year-old's mental competence  while Herzer's attorneys said they will seek a subpoena of Viacom CEO Philippe Dauman to compel his testimony in the case.",
        "date": "01052016",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "RPT-UPDATE 2-Media mogul Redstone seeks dismissal of ex-girlfriend's suit "
    },
    {
        "content": "Jan 4 Media mogul Sumner Redstone has filed a motion seeking the dismissal of a petition filed by his former girlfriend Manuela Herzer to have him examined to see if he was able to make healthcare decisions for himself.",
        "date": "01052016",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "REFILE-Sumner Redstone seeks dismissal of former girlfriend's petition "
    },
    {
        "content": "Media mogul Sumner Redstone's compensation as executive chairman of CBS Corp and Viacom Inc was reduced for 2015  CNBC reported  citing sources.",
        "date": "12222015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "CBS  Viacom executive chair Redstone's compensation cut in 2015: CNBC "
    },
    {
        "content": "Dec 22 Media mogul Sumner Redstone's compensation as executive chairman of CBS Corp and Viacom Inc was reduced for 2015  CNBC reported  citing sources.",
        "date": "12222015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "CBS  Viacom exec chair Redstone's compensation cut in 2015-CNBC "
    },
    {
        "content": "Shari Redstone refused an offer from her media mogul father Sumner to sell her 20 percent stake in the holding company that controls Viacom Inc and CBS Corp for $1 billion  the Wall Street Journal reported.",
        "date": "12222015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Shari Redstone refused to sell stake in media empire: WSJ "
    },
    {
        "content": "A California judge on Monday granted the former girlfriend of Viacom chairman Sumner Redstone a request to conduct depositions of the company's chief executive Philippe Dauman  and two of Redstone's doctors  but not the media mogul himself  for now.",
        "date": "12222015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Judge grants partial victory to Sumner Redstone's former girlfriend "
    },
    {
        "content": "Dec 21 A California judge on Monday granted the former girlfriend of Viacom chairman Sumner Redstone a request to conduct depositions of the company's chief executive Philippe Dauman  and two of Redstone's doctors  but not the media mogul himself  for now.",
        "date": "12222015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-Judge grants partial victory to Sumner Redstone's former girlfriend "
    },
    {
        "content": "Dec 21 Shari Redstone refused an offer from her media mogul father Sumner to sell her 20 percent stake in the holding company that controls Viacom Inc and CBS Corp  for $1 billion  the Wall Street Journal reported.",
        "date": "12212015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Shari Redstone refused to sell stake in media empire - WSJ "
    },
    {
        "content": "Dec 21 Shari Redstone refused an offer from her media mogul father Sumner to sell her 20 percent stake in the holding company that controls Viacom Inc and CBS Corp  for $1 billion  the Wall Street Journal reported.",
        "date": "12212015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 2-Shari Redstone refused to sell stake in media empire - WSJ "
    },
    {
        "content": "Viacom Inc  Chief Executive Philippe Dauman said he speaks with Executive Chairman Sumner Redstone several times a week and that the 92-year-old media mogul is in charge of his own healthcare.",
        "date": "12072015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom CEO Dauman addresses concerns about Redstone "
    },
    {
        "content": "* Speaks to Redstone several times a week   (Adds comments from Dauman)",
        "date": "12072015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-Viacom CEO Dauman addresses concerns about Redstone "
    },
    {
        "content": "NEW YORK Viacom Inc's Chief Operating Officer  Thomas Dooley  has not renewed an employment agreement set to expire in 12 months  a situation that compensation consultants say is unusual and raises the question of whether he will stay with the multi-billion dollar media company as it tries to turn its fortunes around.",
        "date": "12112015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Questions arise as Viacom COO's contract nears end "
    },
    {
        "content": "Dec 7 Viacom Inc Chief Executive Philippe Dauman said he speaks with Executive Chairman Sumner Redstone several times a week and that the 92-year-old media mogul is in charge of his own healthcare.",
        "date": "12072015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom CEO Dauman says Redstone making own healthcare decisions "
    },
    {
        "content": "BOSTON/NEW YORK An official for the second-largest U.S. public pension system on Thursday urged Viacom Inc  to do away with its dual-class share structure  the latest call from an investor for change at the media empire controlled by the aging mogul Sumner Redstone as doubts grow over his ability to lead.",
        "date": "12042015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Exclusive: Viacom should end non-voting stock  give vote to all investors - California fund "
    },
    {
        "content": "BOSTON/NEW YORK An official for the second-largest U.S. public pension system on Thursday urged Viacom Inc to do away with its dual-class share structure  the latest call from an investor for change at the media empire controlled by the aging mogul Sumner Redstone as doubts grow over his ability to lead.",
        "date": "12032015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom should end non-voting stock  give vote to all investors-California fund "
    },
    {
        "content": "BOSTON/NEW YORK An official for the second-largest U.S. public pension system on Thursday urged Viacom Inc to do away with its dual-class share structure  the latest call from an investor for change at the media empire controlled by the aging mogul Sumner Redstone as doubts grow over his ability to lead.",
        "date": "12032015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Exclusive: Viacom should end non-voting stock  give vote to all investors - California fund "
    },
    {
        "content": "NEW YORK Two of the largest shareholders in Viacom Inc  have made the highly unusual move of publicly questioning Sumner Redstone's mental fitness to remain executive chairman of the multi-billion dollar media company.",
        "date": "12022015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Exclusive: Top investors question whether Viacom's Redstone should step down "
    },
    {
        "content": "Viacom Inc's  second-largest shareholder has urged the media company to sell a stake in its Paramount movie studio to Alibaba Group Holding Ltd   according to the Financial Times.",
        "date": "12032015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Investor urges Viacom to sell Paramount studio stake to Alibaba: FT "
    },
    {
        "content": "Sumner Redstone's physicians have publicly attested that he is mentally capable  William Schwartz  chairman of Viacom 's governance and nominating committee  wrote in an e-mailed to Reuters Wednesday afternoon.",
        "date": "12022015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Sumner Redstone is mentally capable  says Viacom board member "
    },
    {
        "content": "Dec 2 Sumner Redstone's physicians have publicly attested that he is mentally capable  William Schwartz  chairman of Viacom 's governance and nominating committee  wrote in an e-mailed to Reuters Wednesday afternoon.",
        "date": "12022015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "REFILE-Sumner Redstone is mentally capable  says Viacom board member "
    },
    {
        "content": "Dec 3 Viacom Inc's second-largest shareholder has urged the media company to sell a stake in its Paramount movie studio to Alibaba Group Holding Ltd  according to the Financial Times.",
        "date": "12032015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Investor urges Viacom to sell Paramount studio stake to Alibaba - FT "
    },
    {
        "content": "NEW YORK Two of the largest shareholders in Viacom Inc  have made the highly unusual move of publicly questioning Sumner Redstone's mental fitness to remain executive chairman of the multi-billion dollar media company.",
        "date": "12032015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Exclusive: Top investors question whether Viacom's Redstone should step down "
    },
    {
        "content": "By Jennifer Saba Sumner Redstone's state of health is ailing the corporate governance at CBS and Viacom. The media mogul's mental capacity is being called into question again  this time by an ex-girlfriend in a lawsuit filed last week. Shareholders of both companies  which Redstone controls and chairs  deserve a clearer idea of whether the 92-year-old is fit to lead the boards.",
        "date": "12012015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Breakingviews: Sumner Redstone's health ails corporate governance "
    },
    {
        "content": "LOS ANGELES  Nov 30 A California court on Monday rejected a request from the former girlfriend of Sumner Redstone for the 92-year-old media mogul  who controls CBS Corp  and Viacom Inc  to undergo an immediate medical evaluation.",
        "date": "11302015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "U.S. media mogul Redstone's ex-girlfriend loses motion in mental competence suit "
    },
    {
        "content": "Mario Gabelli  the second-largest voting shareholder in Viacom Inc  is calling for the media company to disclose the mental competence of its executive chairman  Sumner Redstone  the billionaire value investor said on Wednesday.",
        "date": "12022015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Shareholder Gabelli calls for disclosure around Redstone's mental capacity "
    },
    {
        "content": "A U.S. lawsuit raises new questions about the competence of Sumner Redstone and his ability as executive chairman of Viacom Inc and CBS Corp to run the two media companies.",
        "date": "11262015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "U.S. lawsuit raises new questions about Redstone's ability to run media companies "
    },
    {
        "content": "LOS ANGELES A California court on Monday rejected a request from the former girlfriend of Sumner Redstone for the 92-year-old chairman of  Viacom Inc to undergo an immediate medical evaluation.",
        "date": "12012015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Judge rules out immediate medical check in suit on Redstone's mental competence "
    },
    {
        "content": "Nov 25 A U.S. lawsuit raises new questions about the competence of Sumner Redstone and his ability as executive chairman of Viacom Inc and CBS Corp to run the two media companies.",
        "date": "11262015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-U.S. lawsuit raises new questions about Redstone's ability to run media companies "
    },
    {
        "content": "Viacom Inc   the owner of MTV  Comedy Central and Nickelodeon  reported weaker-than-expected quarterly revenue on Thursday  although declines in ad sales for its U.S. cable TV business were not as steep as analysts had anticipated.",
        "date": "11122015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom revenue down  but U.S. ad sales declines ease "
    },
    {
        "content": "Nov 12 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported a 5 percent fall in quarterly revenue on Thursday as a lack of hit movie releases in the period hurt revenue from the company's films business.",
        "date": "11122015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom's quarterly revenue falls 5 percent "
    },
    {
        "content": "Oct 16 Cablevision Systems Inc and Viacom Inc have settled an antitrust lawsuit in which Cablevision had accused Viacom of forcing distributors and subscribers to buy channels they did not want.",
        "date": "10162015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Cablevision  Viacom settle bundling lawsuit "
    },
    {
        "content": "Sept 30 MTV  a unit of Viacom Inc  named on Wednesday Sean Atkins as its president.",
        "date": "09302015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "MTV names Sean Atkins as president "
    },
    {
        "content": "Sept 30 MTV  the music and reality-TV focused television network owned by Viacom Inc  on Wednesday named veteran media executive Sean Atkins as its president.",
        "date": "09302015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-MTV names Sean Atkins as president "
    },
    {
        "content": "LOS ANGELES  Sept 29 Cablevision Systems Inc  and Viacom Inc are discussing a possible settlement of an antitrust lawsuit in which the cable operator accuses Viacom of forcing distributors and subscribers to buy channels they do not want  a person familiar with the matter said on Tuesday.",
        "date": "09292015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Cablevision  Viacom in settlement talks over bundling lawsuit -source "
    },
    {
        "content": "LOS ANGELES  Sept 29 Cablevision Systems Inc  and Viacom Inc are discussing a possible settlement of an antitrust lawsuit in which the cable operator accuses Viacom of forcing distributors and subscribers to buy channels they do not want  a person familiar with the matter said on Tuesday.",
        "date": "09292015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 1-Cablevision  Viacom in settlement talks over bundling lawsuit -source "
    },
    {
        "content": "* Said on Wednesday announces partnership with Viacom  in Latin America",
        "date": "08272015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "BRIEF-Myriad Group announces partnership with Viacom in Latin America "
    },
    {
        "content": "* Indexes finish down: Dow 0.69 pct  S&P 0.78 pct  Nasdaq 1.62 pct   (Updates to close  adds detail on Zynga)",
        "date": "08062015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "US STOCKS-Media stock selloff leaves Wall Street bruised "
    },
    {
        "content": "Aug 6 U.S. media stocks have taken an indiscriminate beating this week  but many big fund managers still like entertainment conglomerate Walt Disney Co  while turning negative for the long term on Discovery Communications  owner of several niche television franchises.",
        "date": "08062015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Despite media stock beat down  Disney stands tall with U.S. funds "
    },
    {
        "content": "* Indexes down: Dow 0.7 pct  S&P 0.75 pct  Nasdaq 1.53 pct   (Updates to mid-afternoon)",
        "date": "08062015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "US STOCKS-Wall St slumps as media stocks hemorrhage "
    },
    {
        "content": "* Indexes down: Dow 0.72 pct  S&P 0.82 pct  Nasdaq 1.61 pct   (Updates to early afternoon)",
        "date": "08062015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "US STOCKS-Wall St slumps as media stocks bleed "
    },
    {
        "content": "* Shares fall as much as 18 pct   (Adds details  background; updates shares)",
        "date": "08062015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "UPDATE 2-Viacom revenue miss adds to concerns over U.S. cable companies "
    },
    {
        "content": "MILAN  July 31 European pay TV company Sky  has agreed to buy Italy's MTV free-to-air channel from U.S. media group Viacom  a move that could pressure local market leader Mediaset.",
        "date": "07312015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Sky Italia agrees to buy Viacom's MTV Italia "
    },
    {
        "content": "Aug 6 Viacom Inc's revenue fell 10.6 percent in the third quarter  hurt by lower revenue from the company's films business as there were no major movie releases in the quarter.",
        "date": "08062015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom's quarterly revenue falls 10.6 pct "
    },
    {
        "content": "July 21 Pop singer Taylor Swift  British singer-songwriter Ed Sheeran  R&B singer Beyonce  and DJ-producer Mark Ronson lead the nominations for the MTV Video Music Awards  the cable network said on Tuesday.",
        "date": "07212015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Taylor Swift  Ed Sheeran lead MTV Video Music Award nominations "
    },
    {
        "content": "April 7 Shares of MTV owner Viacom Inc  slipped on Tuesday  a day after the company hit the pause button on a $20 billion share buyback program and announced slew of restructuring steps that will result in a charge of $785 million.",
        "date": "04072015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom shares slip on bigger-than-expected charge  buyback halt "
    },
    {
        "content": "U.S. media company Viacom Inc  said it will undertake a restructuring  including cutting jobs  abandoning some acquired titles and reorganizing three of its domestic network groups into two new organizations  to drive growth.",
        "date": "04062015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Viacom to cut jobs  abandon titles  reorganize network groups "
    },
    {
        "content": "April 6 Media company Viacom Inc said it will reorganize three of its domestic network groups into two new organizations as part of a restructuring to drive growth.",
        "date": "04062015",
        "name": "Viacom Inc",
        "news_type": "normal",
        "symbol": "VIAB",
        "title": "Viacom to reorganize three domestic network groups to drive growth "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 27 (Fitch) Fitch Ratings has published its new Rating  Navigators for the following North American diversified Media companies: --CBS Corporation --Cox Enterprises  Inc. --Discovery Communications LLC --NBCUniversal Media LLC --Time Warner Inc. --Twenty-First Century Fox  Inc. --Viacom  Inc. --The Walt Disney Company  Inc.  These Rating Navigators should be read in tandem with its companion report  entitled 'Media:  R",
        "date": "02272015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "Fitch Publishes Rating Navigators for U.S. Diversified Media Companies "
    },
    {
        "content": "Jan 29 Viacom Inc is jumping on the direct-to-consumer bandwagon with plans to introduce an online video streaming product for its children's cable network Nickelodeon  the company's chief executive said on Thursday.",
        "date": "01292015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "UPDATE 2-Viacom to launch video streaming service for Nickelodeon "
    },
    {
        "content": "Jan 26 The Raine Group  a boutique merchant bank focused on the technology  media and telecoms sector  plans to hire Viacom's former CEO Tom Freston as a senior adviser  the New York Times reported.",
        "date": "01262015",
        "name": "Viacom Inc",
        "news_type": "topStory",
        "symbol": "VIAB",
        "title": "MOVES-Raine Group to hire former Viacom CEO Tom Freston as adviser - NYT "
    }
]