[
    {
        "content": "SAO PAULO  Nov 8 Tim Participações SA   Brazil's second-largest wireless phone company  expressed concerns on Wednesday about the potential acquisition of debt-laden carrier Oi SA by state-run China Telecom Corp Ltd  adding to criticism already put forth by rival Telefonica Brasil SA.",
        "date": "11082017",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Brazil's TIM criticizes China Telecom tactics in Oi bid "
    },
    {
        "content": "SAO PAULO  Oct 25 Telefonica Brasil SA   the country's biggest telecommunications firm  posted a 28 percent rise in quarterly profit on Wednesday  helped by tight cost controls and increased revenue per customer.",
        "date": "10252017",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 3-Telefonica Brasil's 3rd-quarter hits profit targets; cost discipline helps "
    },
    {
        "content": "Oct 25 Telefonica Brasil SA  the biggest telecommunications firm in the country  on Wednesday reported third-quarter net income of 1.223 billion reais ($377 million)  up 28 percent from a year earlier.",
        "date": "10252017",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil tops Q3 profit estimates "
    },
    {
        "content": "SAO PAULO  July 26 Telefonica Brasil SA is using digital customer services to further reduce spending on call centers and paper billing  executives told analysts on Wednesday  suggesting there is room to continue improving operational profitability.",
        "date": "07262017",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil using digital services to further cut costs "
    },
    {
        "content": "SAO PAULO  July 26 Telefonica Brasil SA   the biggest telecommunications firm in the country  on Wednesday reported a 25 percent rise in second-quarter net income to 873 million reais ($275 million)  a securities filing showed.",
        "date": "07262017",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil posts 25 pct rise in second-quarter profit "
    },
    {
        "content": "SAO PAULO  June 8 Brazil's São Paulo state aims to sell control of Cia Energética de São Paulo SA by around September  two people with knowledge of the plan said on Thursday  marking the latest move by regional governments in Latin America's No. 1 economy to raise cash and exit the utility industry.",
        "date": "06082017",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Brazil state wants Cesp sale by September  sources say "
    },
    {
        "content": "SAO PAULO  June 8 The Brazilian state of São Paulo plans to sell control of Cia Energética de São Paulo SA at an auction scheduled by around September  two people with direct knowledge of the matter told Reuters on Thursday.",
        "date": "06082017",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Brazil state aims to sell Cesp stake by September  sources say "
    },
    {
        "content": "SAO PAULO  May 9 Telefonica Brasil SA reported a 13 percent rise in recurring net income on Tuesday  citing rigorous cost controls and accelerating demand for mobile and data services despite a sluggish economic recovery.",
        "date": "05092017",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil books 13 pct rise in recurring profit "
    },
    {
        "content": "SAO PAULO  May 9 Telefonica Brasil SA reported a 13 percent rise in recurring net income on Tuesday  citing rigorous cost controls and accelerating demand for mobile and data services despite a sluggish economic recovery.",
        "date": "05092017",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil books 13 pct rise in recurring profit "
    },
    {
        "content": "SAO PAULO  Feb 22 Telefonica Brasil SA   the country's largest telecommunications company  believes the introduction of digital communications channels with clients will reduce costs and improve margins  Chief Executive Eduardo Navarro told analysts on an earnings call Wednesday.",
        "date": "02222017",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil to save money by reducing customer center calls -CEO "
    },
    {
        "content": "SAO PAULO  Feb 21 Telefonica Brasil SA   the country's biggest telephone carrier  said on Tuesday that fourth-quarter net income was in line with estimates as cost and expense controls helped offset tepid revenue growth.",
        "date": "02212017",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil meets profit estimates on strict cost controls "
    },
    {
        "content": "SAO PAULO  Feb 21 Telefonica Brasil SA   the country's biggest telephone carrier  said on Tuesday that fourth-quarter net income came in line with estimates because of cost and expense controls that helped offset tepid revenue growth.",
        "date": "02212017",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil meets profit estimates on strict cost controls "
    },
    {
        "content": "SAO PAULO Amos Genish resigned from the board of Telefónica Brasil SA and will be replaced by José María Del Rey Osorio  according to a securities filing on Wednesday.",
        "date": "01042017",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Amos Genish resigns from Telefónica Brasil's board "
    },
    {
        "content": "SAO PAULO  Nov 21 Telefonica Brasil SA  expects to invest 24 billion reais ($7.11 billion) from 2017 through 2019 to expand 4G coverage and fiber networks  the company said on Monday in a securities filing.",
        "date": "11212016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Corrected- Telefonica Brasil to invest 24 bln reais to expand 4g and fiber networks "
    },
    {
        "content": "SAO PAULO  Nov 17 Telefônica Brasil SA's  board has elected Eduardo Navarro as chief executive officer  effective immediately  according to a securities filing late on Wednesday.",
        "date": "11172016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefônica Brasil approves election of CEO Navarro -filing "
    },
    {
        "content": "SAO PAULO  Oct 26 Eduardo Navarro  the new chief executive officer of Telefonica Brasil  has vowed to carry on the legacy of predecessor Amos Genish  who announced his departure this month.",
        "date": "10262016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil's new CEO ready to lead  build on Genish's legacy "
    },
    {
        "content": "SAO PAULO  Oct 25 Telefonica Brasil SA   the country's biggest telecommunications company  said third-quarter net income rose 9.6 percent and sales of pre-paid mobile services rose for the first time in two years amid signs of an economic recovery.",
        "date": "10262016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "UPDATE 2-Telefonica Brasil profits up 9.6 pct as economy improves "
    },
    {
        "content": "SAO PAULO  Oct 25 Telefonica Brasil SA   the biggest telecommunications company in the country  reported on Tuesday that third-quarter net income rose by 9.6 percent from a year earlier to 952.7 million reais  according to a securities filing.",
        "date": "10252016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil profits 953 mln reais in 3rd quarter "
    },
    {
        "content": "SAO PAULO  Oct 18 Telefónica Brasil SA   the nation's biggest phone carrier  will keep investing about 8 billion reais ($2.5 billion) annually  outgoing Chief Executive Officer Amos Genish said on Tuesday  bucking a trend of smaller capital spending among rivals in Latin America's largest economy.",
        "date": "10182016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil vows to keep pace of annual investments "
    },
    {
        "content": "SAO PAULO  Oct 18 Telefonica Brasil SA   the biggest Brazilian telecoms operator  will keep investing about 8 billion reais ($2.5 billion) per year  Chief Executive Amos Genish said on Tuesday  focusing on digital services over traditional capital spending.",
        "date": "10182016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil to maintain pace of investments -CEO "
    },
    {
        "content": "SAO PAULO It took only minutes for Amos Genish to choose his successor at the helm of Telefónica Brasil SA. However  a stock market tumble on the announcement suggests investors may take longer to digest his departure as chief executive of the country's No. 1 wireless carrier.",
        "date": "10112016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "New Telefónica Brasil CEO faces investor test after harsh welcome "
    },
    {
        "content": "SAO PAULO Telefónica Brasil SA will begin its transition this week to new Chief Executive Officer Eduardo Navarro de Carvalho  who vowed in an interview on Monday to continue cutting costs and expanding digital services growth at Brazil's No. 1 phone carrier.",
        "date": "10102016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefónica Brasil to start CEO transition this week; shares drop "
    },
    {
        "content": "SAO PAULO  Oct 10 Amos Genish  chief executive of Telefonica Brasil SA  on Monday said the firm will undertake a smooth leadership transition  seeking to allay investor concerns after the rushed news of his departure sent shares sliding.",
        "date": "10102016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil CEO promises smooth transition as shares drop "
    },
    {
        "content": "SAO PAULO  Oct 10 Amos Genish  chief executive of Telefonica Brasil SA  on Monday said the announcement that he was leaving the company's top post was planned for Oct. 25  but had to be accelerated due to leaked news of his departure.",
        "date": "10102016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil CEO says leaked news of departure speeded up announcement "
    },
    {
        "content": "SAO PAULO Telefónica Brasil SA said on Sunday that Chief Executive Officer Amos Genish has stepped down citing unspecified personal reasons  leading the country's biggest wireless carrier to move faster with a planned transition.",
        "date": "10102016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil CEO Genish quits  Navarro to replace him "
    },
    {
        "content": "SAO PAULO  Oct 9 Telefónica Brasil SA  said on Sunday that Chief Executive Officer Amos Genish has stepped down citing unspecified personal reasons  leading the country's biggest wireless carrier to move faster with a planned transition.",
        "date": "10102016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "UPDATE 2-Telefonica Brasil CEO Genish quits  Navarro to replace him "
    },
    {
        "content": "SAO PAULO  Oct 9 Telefónica Brasil SA   the owner of Brazil's largest wireless carrier  said on Sunday that Chief Executive Officer Amos Genish tendered his resignation.",
        "date": "10102016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefónica Brasil says CEO Genish tenders resignation "
    },
    {
        "content": "SAO PAULO  Sept 28 A Brazilian court plans to hold a hearing on Thursday on the case of a former Telefonica Brasil SA senior executive who says the country's No. 1 wireless carrier planted news that she acted to permit excessive price differences in advertising contracts.",
        "date": "09282016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Brazil court to hold hearing on Telefónica Brasil case "
    },
    {
        "content": "* Said on Monday its board approved to pay out own capital interest in a gross total amount of 650.0 million Brazilian reais ($199.7 million)  corresponding to 552.5 million reais net",
        "date": "09202016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "BRIEF-Telefonica Brasil announces own capital interest payment "
    },
    {
        "content": "SAO PAULO  July 27 Brazil's biggest phone carrier  Telefónica Brasil SA  expects operational profitability to grow over the next three years thanks to cost savings following the purchase of GVT SA and a recovering economy  Chief Executive Officer Amos Genish said on Wednesday.",
        "date": "07272016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefónica Brasil expects profit growth in recovering economy "
    },
    {
        "content": "SAO PAULO  July 25 Telefonica Brasil SA   the country's largest wireless carrier  is investigating whether contracting practices at its marketing division failed to meet internal guidelines and allowed excessive price discrepancies  Valor Econômico newspaper reported on Monday.",
        "date": "07252016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefónica probes Brazil marketing deals for discrepancies -report "
    },
    {
        "content": "SAO PAULO  July 26 Telefonica Brasil SA   the biggest telecommunications company in the country  raised its forecast for savings from a major merger  although one-time personnel costs from the restructuring triggered a 23 percent drop in quarterly profit.",
        "date": "07262016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil boosts merger outlook  but profit down "
    },
    {
        "content": "SAO PAULO  July 26 Telefonica Brasil SA   the biggest telecommunications company in the country  reported on Tuesday that second-quarter net income fell 23 percent from a year earlier  according to a securities filing.",
        "date": "07262016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil profit slide 23 pct in 2nd quarter "
    },
    {
        "content": "SAO PAULO  July 6 Telefonica Brasil SA   the country's largest telecom operator  sees revenue from digital services growing faster than overall sales as the company moves away from a model based on offering voice and internet connection.",
        "date": "07062016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil sees digital revenue outpacing overall sales growth "
    },
    {
        "content": "* Announced on Friday that its board approved to appoint Eduardo Navarro de Carvalho as the chairman of the board",
        "date": "06132016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "BRIEF-Telefonica Brasil announces appointment of chairman "
    },
    {
        "content": "SAO PAULO  April 28 Any result of negotiations with Brazilian regulators to renew fixed-line telephone concessions is likely to be better than the current arrangement  Telefonica Brasil Chief Executive Amos Genish told analysts on a Thursday earnings call.",
        "date": "04282016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil sees upside from concession talks  understands delay "
    },
    {
        "content": "SAO PAULO  April 27 Telefonica Brasil SA  said on Wednesday it nearly tripled first-quarter net income from a year ago as the country's biggest telecommunications company sold cell towers and cut costs after acquiring broadband provider GVT.",
        "date": "04272016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil profit nearly triples on tower sales  cost cuts "
    },
    {
        "content": "SAO PAULO  April 27 Telefonica Brasil SA   the biggest telecommunications firm in the country  reported on Wednesday that first-quarter net income nearly tripled from a year earlier due to tower sales and cost-cutting after acquiring broadband provider GVT.",
        "date": "04272016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil profit nearly triples on tower sales  cost cuts "
    },
    {
        "content": "SAO PAULO  April 1 Telefônica Brasil SA  the owner of the country's No. 1 wireless carrier  has sold 1 655 cellphone towers to Towerco Latam Brasil Ltda for 760 million reais ($214 million).",
        "date": "04012016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefônica Brasil sells towers to Towerco for 760 mln reais "
    },
    {
        "content": "SAO PAULO  Feb 25 Telefonica Brasil SA's  cost savings from the acquisition of broadband provider GVT are on track despite an ongoing economic recession  Chief Executive Amos Genish told analysts on an earnings call on Thursday.    (Reporting by Brad Haynes; Editing by Chizu Nomiyama)",
        "date": "02252016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil sees cost savings on track despite downturn "
    },
    {
        "content": "SAO PAULO  Feb 24 Telefonica Brasil SA  plans to increase investments this year in line with inflation  keeping a lid on spending as a severe recession in Latin America's largest economy hurts sales.",
        "date": "02242016",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil to invest a bit more  tracking inflation "
    },
    {
        "content": "SAO PAULO  Feb 24 Telefonica Brasil SA  posted a fourth-quarter net profit of 1.115 billion reais ($282 million)  down 11 percent from a year earlier  according to a filing on Wednesday.",
        "date": "02242016",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil posts 11 percent drop in quarterly profit "
    },
    {
        "content": "SAO PAULO  Nov 4 Telefonica Brasil SA   Brazil's biggest telecommunications company by revenue  reported a larger-than-expected 16 percent drop in third-quarter net income due to weak sales growth and rising debt-servicing expenses.",
        "date": "11042015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil misses profit estimates on debt expenses "
    },
    {
        "content": "SAO PAULO  Nov 5 Telefonica Brasil SA   Brazil's biggest telecommunications company  is on track for cost savings outlined in its best-case scenario as it consolidates the takeover of broadband provider GVT SA  Chief Executive Officer Amos Genish said on Thursday.",
        "date": "11052015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil cost-cutting on track for best-case savings -CEO "
    },
    {
        "content": "SAO PAULO  Nov 4 Telefonica Brasil SA   Brazil's largest telecommunications company by revenue  reported a 16 percent drop in net income on Wednesday due to weak sales growth and rising debt-related costs.",
        "date": "11042015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil misses profit estimates on weak sales  debt "
    },
    {
        "content": "The following Spanish stocks may be affected by newspaper reports and other factors on Thursday. Reuters has not verified the newspaper reports  and cannot vouch for their accuracy:",
        "date": "11052015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Spanish stocks - Factors to watch on Thursday "
    },
    {
        "content": "SAO PAULO  Sept 17 Spain's Telefonica  and European media group Vivendi concluded a swap of shares in Telefonica's Brazilian unit for those of the parent company  Telefonica Brasil said on Thursday.",
        "date": "09172015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica  Vivendi conclude share swap "
    },
    {
        "content": "SAO PAULO  Aug 18 Telefonica Brasil SA   the local unit of Spain's Telefónica SA  plans to invest at least 25 billion reais ($7.2 billion) between this year and 2017  according to a securities filing published on Tuesday.",
        "date": "08182015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil sees investment of at least $7.2 bln thru 2017 "
    },
    {
        "content": "PARIS  July 30 European media group Vivendi  has sold its remaining 4 percent stake in Telefonica Brasil for $877 million  resolving an antitrust problem it had as the owner of indirect stakes in two Brazilian mobile operators.",
        "date": "07302015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Vivendi sells remaining shares in Telefonica Brasil "
    },
    {
        "content": "SAO PAULO  July 29 Brazil's currency  the real  rose on Wednesday after five sessions of losses as a recovery in Chinese stocks supported appetite for emerging markets in general  while shares of phone company Telefonica Brasil boosted the Brazilian bourse.     The real strengthened 1.1 percent  leading gains among Latin American currencies  as China managed to stabilize its stock market  providing some relief to emerging markets in general.      Analysts warned that Latin American c",
        "date": "07292015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "EMERGING MARKETS-Brazil's real rises; Telefonica lifts Bovespa "
    },
    {
        "content": "SAO PAULO  July 29 Telefonica Brasil SA  raised its outlook for potential gains from acquisition of broadband provider GVT to as much as 16.2 billion reais ($4.8 billion)  according to a presentation released on Wednesday.",
        "date": "07292015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil raises outlook for savings from GVT deal "
    },
    {
        "content": "PARIS/MADRID  July 29 European media group Vivendi has become a major shareholder in Spain's Telefonica after agreeing to swap shares in the telecom operator's Brazilian unit for those of the parent company.",
        "date": "07292015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Vivendi swaps shares to become big holder of Telefonica "
    },
    {
        "content": "SAO PAULO  July 29 Brazilian phone company Telefonica Brasil SA posted a sharper than expected drop in quarterly net income on Wednesday  but its acquisition of broadband provider GVT gave operating profit a boost.",
        "date": "07292015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil posts lower profit  GVT bolsters EBITDA "
    },
    {
        "content": "* Announces to have entered into agreement with Telefonica  to exchange 58.4 million of its Telefonica Brasil  preferred shares (representing 3.5 percent of share capital) for 46.0 million ordinary shares of Telefonica  representing 0.95 percent of the Spanish telecoms operator's share capital  Further company coverage:    (Gdynia Newsroom)",
        "date": "07292015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "BRIEF-Vivendi exchanges Telefonica Brasil shares for Telefonica shares "
    },
    {
        "content": "SAO PAULO  July 29 Brazilian phone company Telefonica Brasil SA said on Wednesday that second-quarter net profit fell 56.4 percent from a year earlier to 932.9 million reais ($259.14 million)  missing an average forecast of 1.018 billion in a Reuters poll.",
        "date": "07292015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil posts 56 pct drop in Q2 net profit "
    },
    {
        "content": " ",
        "date": "06262015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Telecom Italia chairman expects to meet Bollore soon "
    },
    {
        "content": "PARIS Vivendi  said on Wednesday it raised its stake in Telecom Italia  to 14.9 percent  replacing Telefonica  as its biggest shareholder and gaining a foothold in a country it said had significant growth prospects.",
        "date": "06242015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Vivendi becomes top shareholder in Telecom Italia "
    },
    {
        "content": "* Telefonica says makes capital gain of 380 mln euros   (Adds Vivendi and Telefonica comment  detail  background)",
        "date": "06242015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "UPDATE 1-Vivendi becomes top shareholder in Telecom Italia "
    },
    {
        "content": "RIO DE JANEIRO  May 28 Brazilian phone company Telefonica Brasil SA said on Thursday its shareholders approved the purchase of broadband provider GVT in a general assembly.",
        "date": "05282015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil says shareholders approve GVT acquisition "
    },
    {
        "content": "SAO PAULO  May 13 Telefonica Brasil SA  may be the mobile operator with the least interest in a consolidation of the Brazilian market  a senior executive said on Wednesday  signaling little enthusiasm for a potential mega-deal that seems to have lost momentum.",
        "date": "05132015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil says rivals more interested in consolidation "
    },
    {
        "content": "SAO PAULO  May 6 Telefonica Brasil SA  raised 16.1 billion reais ($5.3 billion) in a share offering aimed at funding its acquisition of broadband provider GVT from France's Vivendi SA  according to a securities filing on Wednesday.",
        "date": "05062015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil raises $5.3 bln with share offering "
    },
    {
        "content": "SAO PAULO  May 13 Brazilian phone company Telefonica Brasil SA reported a 12 percent drop in first-quarter profit from a year earlier due to stagnant revenue and rising financial expenses.",
        "date": "05132015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil profit slips on weak demand  financial expenses "
    },
    {
        "content": "SAO PAULO  May 13 Brazilian phone company Telefonica Brasil SA said on Wednesday that its first-quarter profit fell 12.3 percent from a year earlier to 579.7 million reais ($191 million).",
        "date": "05132015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil posts 12.3 percent drop in quarterly profit "
    },
    {
        "content": "RIO DE JANEIRO  April 27 Telefonica Brasil SA  said on Monday its board had approved a share offering priced at 47 reais ($16.12) for preferred shares and 38.47 reais for commons shares  as the company raises funds to buy broadband provider GVT.",
        "date": "04272015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil prices share offering for GVT purchase "
    },
    {
        "content": "SAO PAULO  April 8 Telefonica Brasil SA  plans to distribute a new share offering on April 28  according to a new prospectus published on Wednesday  pushing back the timeline by nearly two weeks after a review by securities regulator CVM.",
        "date": "04082015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil sets new timeline for share offering "
    },
    {
        "content": "SAO PAULO/NEW YORK Telefonica Brasil SA  on Thursday announced plans for a share offering in three weeks to help close the acquisition of broadband provider GVT from Vivendi SA  by June  confirming information provided to Reuters on Wednesday.",
        "date": "03262015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil says plans new share offering on April 16 "
    },
    {
        "content": "NEW YORK/BRASILIA Telefonica Brasil SA  plans to raise up to $4 billion in fresh capital through a rights issue that will be announced as early as Thursday to buy local broadband provider GVT  two sources with direct knowledge of the deal told Reuters.",
        "date": "03252015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil preps $4 billion rights issue for Thursday: sources "
    },
    {
        "content": "LONDON Spanish telecoms firm Telefonica has lined up nine banks to run its 3 billion euro ($3.2 billion) capital increase in connection with its purchase of Vivendi's Brazilian unit GVT  a source familiar with the matter said on Thursday.",
        "date": "03192015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica lines up nine banks for 3 billion euro capital hike: source "
    },
    {
        "content": "RIO DE JANEIRO  March 20 Telefonica Brasil  said on Friday it would hold a public share offering after it receives regulatory approval to buy the local broadband unit of Vivendi SA known as GVT.",
        "date": "03212015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "Telefonica Brasil says to offer shares after GVT approval "
    },
    {
        "content": "SAO PAULO/NEW YORK  March 26 Telefonica Brasil SA on Thursday announced plans for a share offering in three weeks to help close the acquisition of broadband provider GVT from Vivendi SA by June  confirming information provided to Reuters on Wednesday.",
        "date": "03262015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil says plans new share offering on April 16 "
    },
    {
        "content": "SAO PAULO  March 26 Telefonica Brasil SA  said on Thursday it planned to price a new share offering on April 16 to help fund the acquisition of broadband provider GVT  confirming details of a Reuters report citing two sources with knowledge of the deal.    (Reporting by Alberto Alerigi Jr.; Editing by Chizu Nomiyama)",
        "date": "03262015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil says to price new share offering April 16 "
    },
    {
        "content": "NEW YORK/BRASILIA  March 25 Telefonica Brasil SA  plans to raise up to $4 billion in fresh capital through a rights issue that will be announced as early as Thursday to buy local broadband provider GVT  two sources with direct knowledge of the deal told Reuters.",
        "date": "03252015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil preps $4 bln rights issue for Thursday -sources "
    },
    {
        "content": "* Says to name Amos Genish  current CEO of GVT  Chairman of Telefonica Brasil  Source text for Eikon:  Further company coverage:    (Reporting By Elisabeth O'Leary)",
        "date": "03252015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "BRIEF-Telefonica to name Amos Genish Chairman of Telefonica Brasil "
    },
    {
        "content": "NEW YORK  March 25 Telefonica Brasil SA  plans to raise up to $4 billion in fresh capital through a rights issue that will be announced as early as Thursday  two sources with direct knowledge of the deal told Reuters.",
        "date": "03252015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil preps $4 bln rights issue for Thursday -sources "
    },
    {
        "content": "LONDON  March 19 Spanish telecoms firm Telefonica has lined up nine banks to run its 3 billion euro ($3.2 billion) capital increase in connection with its purchase of Vivendi's Brazilian unit GVT  a source familiar with the matter said on Thursday.",
        "date": "03192015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica lines up nine banks for 3 bln euro capital hike- source "
    },
    {
        "content": "SAO PAULO  Feb 24 Telefonica Brasil SA  is focused on controlling costs as revenue stagnates  executives told analysts on Tuesday  after posting better-than-expected profit despite slipping sales.",
        "date": "02242015",
        "name": "Telefonica Brasil SA",
        "news_type": "topStory",
        "symbol": "VIV",
        "title": "UPDATE 1-Telefonica Brasil eyes cost cutting as earnings stagnate "
    },
    {
        "content": "SAO PAULO  Feb 24 Telefonica Brasil SA  posted a 2 percent rise in fourth-quarter profit from a year earlier  according to a securities filing on Tuesday.",
        "date": "02242015",
        "name": "Telefonica Brasil SA",
        "news_type": "normal",
        "symbol": "VIV",
        "title": "Telefonica Brasil 4th qtr profit beats estimates "
    }
]