[
    {
        "content": "NEW YORK Valero Energy was buying gasoline cargoes for spot delivery in the U.S. East Coast after an outage at its 270 000 barrels per day (bpd) Pembroke refinery in Wales earlier this week  two trade sources said on Thursday.",
        "date": "11022017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero a gasoline buyer on U.S. East Coast after Pembroke outage: sources "
    },
    {
        "content": "* Valero Energy Partners - ‍Effective Nov 1  co entered into a purchase and sale agreement and a contribution agreement​ - SEC Filing",
        "date": "11022017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy Partners entered into a purchase and sale agreement and a contribution agreement​ "
    },
    {
        "content": "HOUSTON Leading U.S. refiner Valero Energy Corp said the supply of crude oil from Venezuela has been \"very consistent\" despite political strife this year in that country.",
        "date": "10262017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero says Venezuelan crude supply 'very consistent' "
    },
    {
        "content": "Oct 26 Valero Energy Corp reported better-than-expected quarterly profit on Thursday  supported by strong margins and a rise in refining activity after a crippling hurricane season hurt refiners on the U.S. Gulf coast.",
        "date": "10262017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Valero Energy profit beats estimates on strong refining margins "
    },
    {
        "content": "* Q3 earnings per share view $1.83 -- Thomson Reuters I/B/E/S",
        "date": "10262017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy Q3 earnings per share $1.91 "
    },
    {
        "content": "Oct 26 Valero Energy Corp reported a 37.2 percent jump in quarterly profit on Thursday  supported by strong margins and a rise in refining activity after a crippling hurricane season that hurt refiners on the U.S. Gulf coast.",
        "date": "10262017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Refiner Valero Energy Q3 profit rises "
    },
    {
        "content": "HOUSTON  Oct 6 A contractor died at Valero Energy Corp's Corpus Christi  Texas  refinery on Wednesday  the company said on Friday.",
        "date": "10062017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Contractor died at Valero Corpus Christi refinery-company "
    },
    {
        "content": "A federal judge in California has granted class status to a lawsuit accusing a Valero Energy subsidiary of deceiving consumers by offering a discount to those paying with cash and failing to give the cash price to those using debit cards.",
        "date": "10052017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Lawsuit over Valero's gas price ads can proceed as class - ruling "
    },
    {
        "content": "HOUSTON Valero Energy Corp has restarted the coker at its 335 000-barrel-per-day (bpd) Port Arthur  Texas  refinery  about four days after a fire on a feed tank shut the unit  said sources familiar with plant operations.",
        "date": "09242017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero restarts Port Arthur Texas refinery coker: sources "
    },
    {
        "content": "HOUSTON Valero Energy Corp was repairing a coker feed tank at its Port Arthur  Texas  refinery shortly before the residual crude oil inside burst into flames on Tuesday  sources familiar with plant operations said on Friday.",
        "date": "09232017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero Port Arthur tank being repaired shortly before fire: sources "
    },
    {
        "content": "NEW YORK/BOSTON  Sept 15 More than 22 000 barrels of oil  refined fuels and chemicals spilled at sites across Texas in the wake of Hurricane Harvey  along with millions of cubic feet of natural gas and hundreds of tons of other toxic substances  a Reuters review of company reports to the U.S. Coast Guard shows.",
        "date": "09152017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "UPDATE 2-Oil and chemical spills from Hurricane Harvey big  but dwarfed by Katrina "
    },
    {
        "content": "* Valero Energy Corporation and Plains All American Pipeline  L.P. elect to terminate proposed acquisition by Valero of certain plains assets",
        "date": "09182017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy Corp and Plains All American Pipeline LP elect to terminate proposed acquisition by Valero of certain plains assets "
    },
    {
        "content": "NEW YORK Valero Energy Corp probably underestimated the leakage of dangerous chemicals when Hurricane Harvey hit its Houston refinery last month  a U.S. Environmental Protection Agency spokesman said.",
        "date": "09152017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero underestimated Houston refinery leak during Harvey "
    },
    {
        "content": "NEW YORK  Sept 15 Valero Energy Corp probably underestimated the leakage of dangerous chemicals when Hurricane Harvey hit its Houston refinery last month  a U.S. Environmental Protection Agency spokesman said.",
        "date": "09152017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Valero underestimated Houston refinery leak during Harvey "
    },
    {
        "content": "* Valero announces its central Texas pipeline and terminal projects",
        "date": "09062017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero announces its Central Texas pipeline  terminal projects "
    },
    {
        "content": "* Valero Energy Corp sees 2017 capital expenditures of $2.70 billion Source text for Eikon: [ID: nEOL6MfPc4] Further company coverage:",
        "date": "09062017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy Corp sees 2017 capital expenditures of $2.70 billion "
    },
    {
        "content": "Valero's five refineries located on Texas's Gulf Coast are in the process of ramping back up following Tropical Storm Harvey  Chief Executive officer Joe Gorder said on Thursday.",
        "date": "09072017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero CEO says five Texas refineries in process of restarting after Harvey "
    },
    {
        "content": "NEW YORK  Sept 5 Valero Energy Corp  the largest U.S. independent refiner  asked federal regulators to allow or direct Colonial Pipeline Co to lift gasoline grade requirements in the wake of Hurricane Harvey  a filing showed on Tuesday.",
        "date": "09052017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero seeks FERC waiver to Colonial Pipeline fuel specifications after Harvey "
    },
    {
        "content": "HOUSTON Valero Energy Corp was restarting multiple units at its 335 000 barrel per day (bpd) Port Arthur  Texas  refinery on Monday  according to a notice filed with the Texas Commission on Environmental Quality.",
        "date": "09042017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero Port Arthur refinery restarting multiple units: filing "
    },
    {
        "content": "NEW YORK  Sept 5 Valero Energy Corp  the largest U.S. independent refiner  asked federal regulators to allow or direct Colonial Pipeline Co to lift gasoline grade requirements in the wake of Hurricane Harvey  a filing showed on Tuesday.",
        "date": "09052017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Valero seeks FERC waiver to Colonial Pipeline fuel specifications after Harvey "
    },
    {
        "content": "NEW YORK Valero Energy Corp  said on Monday its Corpus Christi and Texas City oil refineries had recovered to pre-hurricane levels of operation.",
        "date": "09042017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero says Corpus Christi  Texas City refineries at pre-Harvey levels "
    },
    {
        "content": "HOUSTON Valero Energy Corp was ramping up production at its Corpus Christi  Texas-area refineries in the wake of Hurricane Harvey  the company said.",
        "date": "09032017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero ramping up production at Texas refineries hit by Harvey "
    },
    {
        "content": "HOUSTON Valero Energy Corp is pushing back the planned overhaul  perhaps to next year  of the gasoline unit at its Sunray  Texas  refinery because of logistical bottlenecks from by Tropical Storm Harvey in Houston 572 miles (920 kilometers) away  said sources familiar with plant operations.",
        "date": "09012017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero Sunray refinery pushing back gasoline unit overhaul due to Harvey "
    },
    {
        "content": "U.S. biofuels regulations  which mandate mixing corn-based ethanol into gasoline  have lately drawn together a diverse cast of political opponents.",
        "date": "08232017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Special Report: Refiner Valero's secret campaign against U.S. biofuels mandates "
    },
    {
        "content": "MEXICO CITY Mexico's mining and infrastructure firm Grupo Mexico expects to expand its oil-by-rail business by building at least three terminals in Mexico  including one exclusively for U.S. refiner Valero Energy  its chief financial officer told Reuters on Tuesday.",
        "date": "08092017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Grupo Mexico sees growth in oil-by-rail  terminals: CFO "
    },
    {
        "content": "HOUSTON  Aug 7 U.S. refiners could face a continued squeeze on profit margins in the months ahead as dwindling supplies of heavy crude from Venezuela and elsewhere are leading several to switch to higher-priced but easier-to-refine light  sweet crude.",
        "date": "08072017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Higher-cost crude could squeeze margins at U.S. refiners "
    },
    {
        "content": "* Sempra Energy's ienova unit  Valero sign contracts for liquid fuels projects in Mexico",
        "date": "08032017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Sempra Energy unit and Valero sign contracts for liquid fuels projects in Mexico "
    },
    {
        "content": "WASHINGTON/NEW YORK The Environmental Protection Agency will reject a proposed overhaul of the U.S. biofuels program that would have shifted blending responsibility away from refining companies further down the fuel supply chain  three sources familiar with the matter told Reuters on Thursday.",
        "date": "08032017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "U.S. to reject biofuel program tweaks in blow to refiners  Icahn: sources "
    },
    {
        "content": "* Valero signs long-term agreements to import refined products into central mexico",
        "date": "08032017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero signs long-term agreements to import refined products into Central Mexico "
    },
    {
        "content": "    July 27 The following is a list of refinery incidents reported in the United States on July 27:           * Shell to shutter Convent gasoline unit in early '18 -sources                                  * Valero says refineries to run up to 93 pct of capacity in 3rd qtr of 2017                     * Valero says switched refineries to light crude slate in June                                  * Petrobras Pasadena  Tx  refinery reports various unit startups                          ",
        "date": "07282017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "DIARY-U.S. refinery operations-Shell to shutter Convent gasoline unit in early '18 "
    },
    {
        "content": "Refiner Valero Energy Corp's quarterly profit topped estimates as it operated at a higher capacity  offsetting a rise in costs and lower margins in its ethanol unit.",
        "date": "07272017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Refiner Valero posts higher-than-expected quarterly profit "
    },
    {
        "content": "July 27 Refiner Valero Energy Corp's quarterly profit topped estimates as it operated at a higher capacity  offsetting a rise in costs and lower margins in its ethanol unit.",
        "date": "07272017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Refiner Valero posts higher-than-expected quarterly profit "
    },
    {
        "content": "* Q2 earnings per share view $1.10 -- Thomson Reuters I/B/E/S",
        "date": "07272017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy reports Q2 earnings per share $1.23 "
    },
    {
        "content": "July 27 Valero Energy Corp  the largest independent U.S. refiner  reported a 32.7 percent fall in quarterly profit on Thursday as costs increased.",
        "date": "07272017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Refiner Valero's quarterly profit slumps 32.7 pct "
    },
    {
        "content": "    July 18 The following is a list of refinery incidents reported in the United States on July 16-17:           * Shell says maintenance complete at Martinez  Calif. refinery                                   * Phillips 66 reports power restored after brief outage at Sweeny refinery                      * Citgo's Corpus Christi  Texas gasoline unit operating normally: sources                       * PES shuts boiler  limits production at Phila. refinery - source                     ",
        "date": "07182017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "DIARY-U.S. refinery operations-Total Port Arthur refinery reformer restart on hold "
    },
    {
        "content": "    July 10 The following is a list of refinery incidents reported in the United States on July 10:           * Shell Convent refinery restarts gasoline  alkylation units -sources                            * Total Port Arthur refinery shuts reformer for repairs -sources                                 * Marathon Texas City gasoline unit shut for repair -sources                                     * Exxon Beaumont  Texas plant reports control valve malfunction on July 9              ",
        "date": "07112017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "DIARY-U.S. refinery operations-Exxon Beaumont refinery shuts HCU due to leak -sources "
    },
    {
        "content": "* Valero Energy Corporation and plains All American Pipeline  L.P. plan to challenge attempt to block proposed acquisition by Valero of certain plains assets",
        "date": "07122017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy  Plains All American Pipeline plan to challenge attempt to block proposed acquisition by Valero of certain plains assets "
    },
    {
        "content": "    July 9 The following is a list of refinery incidents reported in the United States on July 7-9:           * Exxon reports flaring at Beaumont  Texas refinery- community line                              * Exxon Baytown refinery HCU overhaul to finish in Aug -sources                                    * Valero begins gasoline unit repairs at Memphis refinery -sources                               * Exxon's Beaumont  Texas refinery plans weekend HCU restart: sources                ",
        "date": "07102017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "DIARY-U.S. refinery operations-Exxon Baytown refinery HCU overhaul to finish in Aug -sources "
    },
    {
        "content": "    July 13 The following is a list of refinery incidents reported in the United States on July 12:            * CVR Wynnewood  Okla. refinery reports emissions on July 7                                    * HollyFrontier reports emissions at Tulsa West refinery                                       * Phillips 66 says planned work underway at Rodeo  Calif. refinery                             * Total Port Arthur refinery hydrotreater shut -sources                                     ",
        "date": "07132017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "DIARY-U.S. refinery operations-Valero Memphis gasoline unit boosting output after restart-sources "
    },
    {
        "content": "    July 11 The following is a list of refinery incidents reported in the United States on July 11:           * Exxon reports flaring at Beaumont  Texas refinery                                              * Shell Convent gasoline  alky units running at minimum -sources                                 * PBF reports planned flaring at Torrance  California refinery                                   * Valero Memphis refinery restarting gasoline unit -sources                            ",
        "date": "07122017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "DIARY-U.S. refinery operations-Shell Convent gasoline  alky units running at minimum -sources "
    },
    {
        "content": "Valero Energy Corp  filed a lawsuit against Pacific Gas & Electric Company (PG&E)  after PG&E shut off all electricity to Valero's Benicia  California refinery in early May  the company said on Friday.",
        "date": "06302017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero files lawsuit against PG&E over Benicia refinery power outage "
    },
    {
        "content": "A power outage at a Valero Energy Corp refinery and resulting smoke on Friday forced residents to remain indoors for several hours in the San Francisco Bay city of Benicia  California.",
        "date": "05052017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero refinery power outage in California forces residents indoors "
    },
    {
        "content": "* Valero Energy Corporation declares regular cash dividend on common stock",
        "date": "05032017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy sets regular quarterly cash dividend of $0.70 per share "
    },
    {
        "content": "U.S. refiner Valero Energy Corp  said it would process more crude oil in the current quarter to take advantage of robust demand for gasoline as the stockpile of refined products in the United States declines.",
        "date": "04252017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero Energy to process more crude amid strong gasoline demand "
    },
    {
        "content": "* Shares rise before reversing course to drop 2 pct (Adds Q2 throughput volume outlook  CEO comments)",
        "date": "04252017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 3-Valero Energy to process more crude amid strong gasoline demand "
    },
    {
        "content": "HOUSTON  April 25 Valero Energy Corp Chairman and Chief Executive Joe Gorder said he expects costs for renewable fuel credits to drag on the company's returns in the second quarter of 2017.",
        "date": "04252017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "CORRECTED-UPDATE 1-Valero CEO expects Q2 biofuel costs to be 'a significant headwind' "
    },
    {
        "content": "April 25 Valero Energy Corp  the largest U.S. oil refiner  reported a 38.4 percent fall in quarterly profit  hurt by weak margins in its core refining business.",
        "date": "04252017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero Energy's quarterly profit slumps 38.4 pct "
    },
    {
        "content": "* CEO Joseph Gorder's FY 2016 total compensation $18.5 million versus $17.5 million in FY 2015 - sec filing",
        "date": "03232017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy CEO Joseph Gorder's FY 2016 total compensation was $18.5 mln "
    },
    {
        "content": "March 10 Oil refiners shelled out a record over $2 billion to meet U.S. biofuels requirements in 2016  a 70 percent surge that helps fuel a growing debate over who should shoulder the costs for meeting environmental regulations.",
        "date": "03102017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "U.S. refiners' biofuel bill soars to record high as debate heats up "
    },
    {
        "content": "* Valero Energy Partners LP reports 2016 fourth quarter and full year results",
        "date": "02022017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy reports Q4 rev $104 mln "
    },
    {
        "content": "NEW YORK  Jan 31 Valero Energy Corp on Tuesday signaled that record high costs to comply with the U.S. renewable fuels program will continue this year  after the oil refiner was hit with a ballooning tab for the program in 2016.",
        "date": "01312017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero says record biofuels compliance costs to continue in 2017 "
    },
    {
        "content": "Valero Energy Corp   the largest independent U.S. refiner  reported a better-than-expected quarterly profit as higher margins in its ethanol unit more than offset weakness in its refining business.",
        "date": "01312017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero Energy profit beats estimates on higher ethanol margins "
    },
    {
        "content": "Jan 31 Valero Energy Corp  the largest independent U.S. refiner  reported a better-than-expected quarterly profit as higher margins in its ethanol unit more than offset weakness in its refining business.",
        "date": "01312017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Valero Energy profit beats estimates on higher ethanol margins "
    },
    {
        "content": "* Valero Energy reports 2016 fourth quarter and full year results",
        "date": "01312017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy reports Q4 earnings per share $0.81 "
    },
    {
        "content": "Jan 31 Valero Energy Corp  the largest independent U.S. refiner  reported a higher quarterly profit as lower corn and stronger ethanol prices boosted the company's ethanol unit results.",
        "date": "01312017",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero Energy reports higher profit boosted by ethanol business "
    },
    {
        "content": "HOUSTON Valero Energy Corp on Friday was increasing production on the large crude distillation unit (CDU) at the company's 335 000 barrel per day (bpd) Port Arthur  Texas  refinery  said sources familiar with plant operations.",
        "date": "01272017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero Port Arthur refinery boosts large CDU production: sources "
    },
    {
        "content": "* Increase in company's regular quarterly cash dividend on common stock from $0.60 per share to $0.70 per share  Source text for Eikon:  Further company coverage:",
        "date": "01262017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy increases regular cash dividend by 17 pct "
    },
    {
        "content": "* Valero Energy Partners LP announces acquisition of undivided interest in the Red River Pipeline",
        "date": "01182017",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy Partners acquires undivided interest in Red River pipeline "
    },
    {
        "content": "* Sets regular quarterly cash dividend of $0.60 per share  Source text for Eikon:  Further company coverage:",
        "date": "11022016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy sets quarterly cash dividend of $0.60 per share "
    },
    {
        "content": "Valero Energy Corp's  quarterly profit beat analysts' estimate by a wide margin  as the largest independent U.S. refiner kept a tight leash on costs.",
        "date": "10252016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Cost cuts help refiner Valero beat profit estimate "
    },
    {
        "content": "Oct 25 Valero Energy Corp's quarterly profit beat analysts' estimate by a wide margin  as the largest independent U.S. refiner kept a tight leash on costs.",
        "date": "10252016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Cost cuts help refiner Valero beat profit estimate "
    },
    {
        "content": "* Q3 earnings per share view $0.93 -- Thomson Reuters I/B/E/S",
        "date": "10252016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy Q3 earnings per share $1.33 "
    },
    {
        "content": "Oct 25 Valero Energy Corp  the largest independent U.S. refiner  reported a 55.5 percent plunge in quarterly profit as margins were squeezed by high gasoline inventories and costs jumped for meeting renewable fuel standards.",
        "date": "10252016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Refiner Valero's profit halves as margins fall "
    },
    {
        "content": "HOUSTON  Oct 8 North Dakota oil producers were dealt another blow this week when Royal Dutch Shell  said it would scrap plans to build an oil train terminal in Washington state that would have taken over 400 000 barrels per week of Bakken and other inland crudes.",
        "date": "10082016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Crude realities for Bakken oil as Shell ditches W. Coast rail plan "
    },
    {
        "content": "HOUSTON Valero Energy Corp shut the large crude distillation unit and a coking unit on Monday night at the 335 000-barrel-per-day Port Arthur  Texas  refinery as part of an ongoing plant-wide overhaul  said sources familiar with plant operations.",
        "date": "09212016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero Port Arthur refinery shuts large CDU  coker: sources "
    },
    {
        "content": "* Priced a public offering of $1 250 000 000 aggregate principal amount of 3.400 percent senior notes due 2026  Source text for Eikon:  Further company coverage:",
        "date": "09072016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy announces pricing of notes offering "
    },
    {
        "content": "NEW YORK/HOUSTON  Aug 25 LyondellBasell Industries NV has retained Bank of America Merrill Lynch  to help with the potential sale of its 263 776 barrel-per-day refinery in Houston  according to two people familiar with the talks.",
        "date": "08252016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-LyondellBasell retains bank for potential Houston refinery sale -sources "
    },
    {
        "content": "* H. Paulett Eberhart and Kimberly S. Greene have been elected to company's board of directors.  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07282016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy board of directors elects new members "
    },
    {
        "content": "LONDON  July 28 The accumulation of gasoline stocks in the United States has been driven by excess gasoline production rather than lack of demand  according to Valero  the largest independent refiner in the United States.",
        "date": "07282016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "COLUMN-Valero blames excess winter production for U.S. gasoline glut: Kemp "
    },
    {
        "content": "NEW YORK  July 26 Valero Energy Corp  the largest U.S. refiner  expects to get hit with a half-billion-dollar bill in the second half of the year thanks to the rising cost of meeting government mandates to blend biofuels.",
        "date": "07262016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero says biofuels blending costs could double in 2016 "
    },
    {
        "content": "Valero Energy Corp  expects lower refinery utilization over the rest of the year as companies step up efforts to counter slumping refining margins caused by record supplies of gasoline and diesel products.",
        "date": "07262016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero expects lower refinery utilization as margins tank "
    },
    {
        "content": "* Sees 2016 biofuel blending costs at $750 mln-$850 mln   (Adds details)",
        "date": "07262016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 4-Valero expects lower refinery utilization as margins tank "
    },
    {
        "content": "* On Canada wildfires - \"We fully recovered from those fires so far\" - Conf Call  Further company coverage:",
        "date": "07262016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy says fully recovered from Canada wildfires so far "
    },
    {
        "content": "* The company's costs of biofuels blending have risen in 2016  totaling $173 million in the second quarter versus $56 million during the same period in 2015",
        "date": "07262016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy's biofuels blending costs soar in Q2 2016 "
    },
    {
        "content": "July 26 U.S. refiner Valero Energy Corp's  quarterly profit fell nearly 40 percent due to lower refining margins as elevated gasoline stockpiles offset healthy demand.",
        "date": "07262016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Refiner Valero's profit slumps 40 pct on lower margins "
    },
    {
        "content": "Valero Energy Corp said on Tuesday it bought Kinder Morgan Inc's 50 percent stake in Parkway Pipeline LLC  previously a joint venture between the two companies.",
        "date": "07122016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero buys out partner in Louisiana-Mississippi pipeline "
    },
    {
        "content": "July 12 Valero Energy Corp said on Tuesday it bought Kinder Morgan Inc's 50 percent stake in Parkway Pipeline LLC  previously a joint venture between the two companies.",
        "date": "07122016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Valero buys out partner in Louisiana-Mississippi pipeline "
    },
    {
        "content": "July 12 Valero Energy Corp bought the remaining 50 percent stake in Parkway Pipeline LLC and said it would gain increased access to eastern United States by connecting the pipeline to Colonial Pipeline Co's Gulf Coast-to-U.S. Northeast system.",
        "date": "07122016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero buys remaining stake in Parkway Pipeline "
    },
    {
        "content": "* Bought remaining 50 percent membership interest in Parkway Pipeline Llc from a wholly owned subsidiary of Kinder Morgan",
        "date": "07122016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero acquires 100 percent ownership of Parkway Pipeline "
    },
    {
        "content": "HOUSTON  July 8 Valero Energy Corp has started operations on a 90 000 barrel per day (bpd) crude topping unit at its 100 000 bpd refinery in Houston  a company spokeswoman said on Friday.",
        "date": "07082016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero starts crude topping unit at Houston refinery "
    },
    {
        "content": "HOUSTON Valero Energy Corp plans a multi-unit overhaul at its 335 000 barrel per day Port Arthur  Texas  refinery  scheduled to begin in mid-September and continue through October  two sources familiar with plant operations said.",
        "date": "06082016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero plans Port Arthur refinery multi-unit overhaul: sources "
    },
    {
        "content": "LONDON  May 21 U.S. energy group Phillips 66  is in the final stages of selling the only oil refinery in Ireland  a source familiar with negotiations said on Saturday.",
        "date": "05222016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 2-Phillips 66 in final stages of selling Ireland's only oil refinery - sources "
    },
    {
        "content": "* Valero energy corporation declares regular cash dividend on common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "05122016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero energy sets qtrly cash dividend of 60 cents/shr "
    },
    {
        "content": "* Expect to continue to be well positioned to execute distribution growth strategy through 2017 - conf call",
        "date": "05032016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy sees Q2 refining cash operating expenses of about $3.75/barrel "
    },
    {
        "content": "U.S. refiner Valero Energy Corp  reported a lower-than-expected profit as margins fell in the first quarter due to a build-up of diesel and gasoline inventories.",
        "date": "05032016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero's profit misses estimates as product inventories soar "
    },
    {
        "content": "* Q1 earnings per share view $0.66 -- Thomson Reuters I/B/E/S",
        "date": "05032016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "BRIEF-Valero Energy reports Q1 adjusted earnings $0.60/shr "
    },
    {
        "content": "HOUSTON  Feb 13 Venezuelan PDVSA's unit in the United States  Citgo Petroleum  is working to restart some processing units at the Aruba refinery under a 25-year lease contract with the government of the Caribbean island  sources at the facility and firms involved told Reuters on Saturday.",
        "date": "02142016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Citgo  Aruba working to restart refinery under lease -sources "
    },
    {
        "content": "HOUSTON Valero Energy Corp's proposed oil-by-rail project at its northern California refinery was quashed by local planners this week  the first such facility on the U.S. West Coast to end a years-long wait for permits with a rejection.",
        "date": "02132016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "California planners reject Valero oil-by-rail project "
    },
    {
        "content": "NEW YORK  Feb 12 Valero Energy Corp  filed lawsuits against the U.S. Environmental Protection Agency on Friday to push the regulator to alter a U.S. policy designed to boost use of renewables in transportation fuels.",
        "date": "02122016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero Energy sues U.S. EPA over biofuels plan "
    },
    {
        "content": "HOUSTON  Feb 12 Valero Energy Corp's  proposed oil-by-rail project at its northern California refinery was quashed by local planners this week  the first such facility on the U.S. West Coast to end a years-long wait for permits with a rejection.",
        "date": "02122016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "California planners reject Valero oil-by-rail project "
    },
    {
        "content": "NEW YORK  Feb 12 Valero Energy Corp  filed lawsuits against the U.S. Environmental Protection Agency on Friday to push the regulator to alter a U.S. policy designed to boost use of renewables in transportation fuels.",
        "date": "02122016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Valero Energy sues U.S. EPA over biofuels plan "
    },
    {
        "content": "Valero Energy Corp filed lawsuits against the U.S. Environmental Protection Agency on Friday to push the regulator to alter a U.S. policy designed to boost use of renewables in transportation fuels.",
        "date": "02122016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero Energy sues EPA over biofuels plan "
    },
    {
        "content": "HOUSTON U.S. oil producers  refiners and logistics companies have dozens of crude-by-rail project throughout the United States  although U.S. crude movements via rail retreated to 785 143  barrels per day in the third quarter of 2015 from more than 1 million bpd in the second half of 2014.",
        "date": "01262016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Factbox: U.S. crude-by-rail projects; Hearings set on Phillips 66  Valero projects "
    },
    {
        "content": "Oil refiner Valero Energy Corp  reported a higher-than-expected quarterly profit  supported by lower crude costs and healthy demand for gasoline in the United States.",
        "date": "01282016",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero Energy reports better-than-expected profit "
    },
    {
        "content": "HOUSTON  Jan 26 County planners want to squash Phillips 66's proposal to transport heavy crude by rail to one of its California refineries  saying it is too risky to public health and the environment.",
        "date": "01262016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "California county planners oppose Phillips 66 oil-by-rail project "
    },
    {
        "content": "Jan 28 Oil refiner Valero Energy Corp  reported a higher-than-expected quarterly profit  supported by lower crude costs and healthy demand for gasoline in the United States.",
        "date": "01282016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Valero Energy reports better-than-expected profit "
    },
    {
        "content": "Jan 28 U.S. refiner Valero Energy Corp  reported a 74 percent decline in quarterly profit  hurt partly by lower refining margins.",
        "date": "01282016",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero Energy's profit falls on lower refining margins "
    },
    {
        "content": "HOUSTON Valero Energy Corp  was readying its 180 000 barrel per day (bpd) Memphis  Tennessee  refinery for possible flooding as early as this weekend  a company spokesman said on Wednesday.",
        "date": "12312015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero Memphis refinery prepares for possible flooding "
    },
    {
        "content": "HOUSTON Valero Energy Corp is starting up the first of two new crude topping units at a pair of its Texas refineries to increase light crude processing capability  a company spokesman said on Monday.",
        "date": "12142015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero starting up new crude topping unit at TX refinery "
    },
    {
        "content": "HOUSTON  Nov 16 A gasoline-producing fluidic catalytic cracking unit was not running on Monday after a fire broke out Sunday at Valero Energy Corp's 335 000 barrel per day (bpd) Port Arthur  Texas  refinery  sources familiar with plant operations said.",
        "date": "11162015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero port Arthur refinery FCCU shut after Sunday fire -sources "
    },
    {
        "content": "HOUSTON The large crude distillation unit at Valero Energy Corp's 335 000-barrel-per-day (bpd) Port Arthur  Texas  refinery was affected by the malfunction of a hydrotreating unit on Tuesday  according to sources familiar with plant operations.",
        "date": "11102015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero's Port Arthur large CDU affected by HTU upset: sources "
    },
    {
        "content": "U.S. refiner Valero Energy Corp  reported a better-than-expected quarterly profit  helped by robust demand for refined products and lower crude costs.",
        "date": "10282015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero pumps out strong profit as refining margins rise "
    },
    {
        "content": "Oct 28 U.S. refiner Valero Energy Corp  reported a better-than-expected quarterly profit  helped by robust demand for refined products and lower crude costs.",
        "date": "10282015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Valero pumps out strong profit as refining margins rise "
    },
    {
        "content": "Oct 28 U.S. refiner Valero Energy Corp's  quarterly profit jumped 30 percent as its refining margins grew due to robust prices for refined products and low crude costs.",
        "date": "10282015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero Energy profit rises 30 pct on higher refining margins "
    },
    {
        "content": "BOSTON  Oct 9 In a rare case of positive momentum in the beat-up energy sector  U.S. mutual funds have piled into shares of Tesoro Corp and Valero Energy Corp   two independent refinery companies taking advantage of cheap crude prices.",
        "date": "10092015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "U.S. funds grab refinery stock momentum in beat-up energy sector "
    },
    {
        "content": "BOSTON  Sept 30 One-in-four U.S. large-cap mutual funds have increased their stakes in energy companies this year and many have suffered heavier losses than their peers as a result of ill-timed bets.",
        "date": "09302015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "RPT-U.S. mutual funds that bet bigger on energy sector get burned "
    },
    {
        "content": "BOSTON  Sept 30 One-in-four U.S. large-cap mutual funds have increased their stakes in energy companies this year and many have suffered heavier losses than their peers as a result of ill-timed bets.",
        "date": "09302015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "U.S. mutual funds that bet bigger on energy sector get burned "
    },
    {
        "content": "Sept 9 Valero Energy Corp  the leading U.S. refiner  may soon return to its roots as a buyer of refineries  Chief Executive Officer Joe Gorder said on Wednesday.",
        "date": "09092015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "UPDATE 3-Valero CEO Gorder sees acquisition opportunities "
    },
    {
        "content": "TEXAS CITY  Texas  Aug 20 Valero Energy Corp's  Texas City refinery continued flaring on Thursday after a power transformer suffered an outage  a Reuters witness said.",
        "date": "08202015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero's Texas City refinery continues flaring after  outage - Reuters witness "
    },
    {
        "content": "HOUSTON  Aug 7 Production at Valero Energy Corp's 180 000-barrel-per-day (bpd) Memphis  Tennessee  refinery has been cut back during the week due to unit outages and disruptions  according to  people familiar with plant operations.",
        "date": "08082015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero Memphis production cut back due to unit outages -sources "
    },
    {
        "content": "NEW YORK  July 30 U.S. refiners like Valero Energy Corp are running plants at full tilt  squeezing the remaining dollars from stronger-than-expected surge in gasoline demand before the busy summer season is replaced by the chill of winter  executives said on Thursday.",
        "date": "07302015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "U.S. refiners squeeze out last drops of gasoline before winter "
    },
    {
        "content": "U.S. refiner Valero Energy Corp  reported a better-than-expected quarterly profit as its refining margins rose due to a steep fall in crude oil prices.",
        "date": "07302015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero Energy profit beats estimates as refining margins rise "
    },
    {
        "content": "July 30 U.S. refiner Valero Energy Corp  reported a better-than-expected quarterly profit as its refining margins rose due to a steep fall in crude oil prices.",
        "date": "07302015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 1-Valero Energy profit beats estimates as refining margins rise "
    },
    {
        "content": "July 30 U.S. refiner Valero Energy Corp's  quarterly profit more than doubled as refining margins rose due to a steep fall in oil prices.",
        "date": "07302015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Refiner Valero Energy's quarterly profit doubles "
    },
    {
        "content": "NEW YORK  July 14 Valero Energy Corp  one of the biggest U.S. oil refiners  is preparing to sell ethanol for export for the first time  the company said  betting on the $2 billion overseas market as U.S. demand remains plagued by political uncertainty.",
        "date": "07142015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "RPT-Valero expands into ethanol export market for 1st time "
    },
    {
        "content": "NEW YORK  July 14 Valero Energy Corp  one of the biggest U.S. oil refiners  is preparing to sell ethanol for export for the first time  the company said  betting on the $2 billion overseas market as U.S. demand remains plagued by political uncertainty.",
        "date": "07142015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero expands into ethanol export market for 1st time "
    },
    {
        "content": "HOUSTON Valero Energy Corp was preparing to restart production units at its 180 000 barrel per day (bpd) Memphis  Tennessee  refinery  which was hit by a power interruption on Sunday  sources familiar with plant operations said.",
        "date": "06082015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero preparing to restart Memphis refinery -sources "
    },
    {
        "content": "SINGAPORE  May 13 Asian jet fuel shipments to the United States West Coast region could pick up this month as a prolonged cut in throughput at a California refinery is drawing down inventories  traders said on Wednesday.",
        "date": "05132015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Asian jet fuel shipments to US West Coast to pick up in May - traders "
    },
    {
        "content": "Thomson Reuters April 28  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04282015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "SAN ANTONIO  April 30 Valero Energy Corp  is taking advantage of low oil prices to aggressively build out its refining and logistical assets  but new acquisitions are not planned  Chief Executive Joe Gorder said at the company's annual shareholders meeting on Thursday.",
        "date": "04302015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero CEO sees growth  but not acquisitions "
    },
    {
        "content": "Thomson Reuters April 30  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04302015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "TORONTO  March 10 The two oil trains that derailed and burst into flames in recent weeks in northern Ontario were both carrying synthetic crude to Valero Energy Corp's refinery near Quebec City  the U.S.-based company said on Tuesday.",
        "date": "03102015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Trains in Canada derailments carried synthetic crude for Valero "
    },
    {
        "content": "U.S. refiners Valero Energy Corp  and Phillips 66  reported better-than-expected quarterly profits as they processed more cheap crude oil amid buoyant demand for gasoline.",
        "date": "01292015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Cheap crude helps Valero  Phillips 66 profits beat estimates "
    },
    {
        "content": "Jan 29 U.S. refiners Valero Energy Corp  and Phillips 66 reported better-than-expected quarterly profits as they processed more cheap crude oil amid buoyant demand for gasoline.",
        "date": "01292015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "UPDATE 2-Cheap crude helps Valero  Phillips 66 profits beat estimates "
    },
    {
        "content": "Jan 29 U.S. refiner Valero Energy Corp  reported a 5 percent fall in quarterly income  hurt by a narrower spread between Brent and WTI crude and a drop in operating profit at its ethanol business.",
        "date": "01292015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Refiner Valero Energy's profit falls 5 pct "
    },
    {
        "content": "HOUSTON  Jan 28 Valero Energy Corp  Chairman and Chief Executive Joe Gorder said on Wednesday low oil prices are encouraging continued global demand for refined products like motor fuels gasoline and diesel.",
        "date": "01282015",
        "name": "Valero Energy Corporation",
        "news_type": "normal",
        "symbol": "VLO",
        "title": "Valero CEO says low oil prices encourage global fuel demand "
    },
    {
        "content": "HOUSTON Valero Energy Corp expects to complete giant tanks at its Corpus Christi  Texas  refinery in the first half of 2015 to hold crude for export to the company's 265 000 barrel per day (bpd) refinery in Quebec  according to an investor presentation posted on the Valero website on Tuesday.",
        "date": "01062015",
        "name": "Valero Energy Corporation",
        "news_type": "topStory",
        "symbol": "VLO",
        "title": "Valero to complete Corpus Christi export tanks in 2015 first half "
    }
]