[
    {
        "content": "* Vmware charts networking's software-defined future for enterprises and service providers with intent to acquire Velocloud Networks",
        "date": "11022017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Vmware reports intent to buy Velocloud Networks "
    },
    {
        "content": "* Vodafone Group agrees to enterprise licensing agreement with VMware Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Vodafone group agrees to enterprise licensing agreement with VMware "
    },
    {
        "content": "* Fujitsu and VMware extend global partnership to empower organizations' digital transformations",
        "date": "08282017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Fujitsu  VMware extend global partnership to empower organizations' digital transformations "
    },
    {
        "content": "* ‍Dell Technologies Inc​ - on Aug 23  co and its affiliates entered into purchase commitment supplement to stock purchase agreement with VMWare - SEC filing",
        "date": "08242017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-‍Dell Technologies says co and its affiliates entered into purchase commitment supplement to stock purchase agreement with VMWare "
    },
    {
        "content": "* VMware to collaborate with ADLINK to simplify IoT implementations",
        "date": "08232017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware to collaborate with ADLINK to simplify IoT implementations "
    },
    {
        "content": "* Q2 earnings per share view $1.15 -- Thomson Reuters I/B/E/S",
        "date": "08242017",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "BRIEF-VMWare reports Q2 non-GAAP earnings per share of $1.19 "
    },
    {
        "content": "* VMware and Google have expanded their partnership to enable enterprise-wide management of Chrome devices. Source text for Eikon: Further company coverage: (Reporting by Jaslein Mahil)",
        "date": "08222017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware  Google expand partnership to enable enterprise-wide management of Chrome devices "
    },
    {
        "content": "* Futures up: Dow 61 pts  S&P 7.5 pts  Nasdaq 31.75 pts (Adds details  comments  updates price)",
        "date": "08222017",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "US STOCKS-Wall St set to open higher as investors go bargain hunting "
    },
    {
        "content": "* Vmware Inc files for potential mixed shelf offering; amount not disclosed - sec filing‍​ Source text - (http://bit.ly/2uHiYj5) Further company coverage:",
        "date": "08142017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Vmware Inc files for potential mixed shelf offering amount not disclosed - SEC filing‍​ "
    },
    {
        "content": "* Claire Dixon appointed chief communications officer of VMware Source text for Eikon: Further company coverage:",
        "date": "07102017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware says Claire Dixon appointed chief communications officer "
    },
    {
        "content": "A federal jury on Monday issued a defense verdict for Dell Inc subsidiary VMware Inc in its $110 million licensing dispute with the software developer Phoenix Technologies Ltd.",
        "date": "06132017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "VMware prevails in $110 million software licensing dispute "
    },
    {
        "content": " (This June 1 story corrects paragraph 10 to show VMware's Q1 billings was $1.67 bln  not $1.35 bln  and above  not below  Wall Street estimates. Also removes reference to analyst comments)",
        "date": "06022017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "VMware beats profit estimates  raises full-year forecast "
    },
    {
        "content": "* Q1 earnings per share view $0.95 -- Thomson Reuters I/B/E/S",
        "date": "06012017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware Q1 adj earnings per share $0.99 "
    },
    {
        "content": "June 1 Virtualization software maker VMware Inc on Thursday reported a better-than-expected first-quarter profit and raised its full-year forecast  fueled by strong demand for its software used by companies to boost cloud computing efficiency.",
        "date": "06022017",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "CORRECTED-UPDATE 2-VMware beats profit estimates  raises full-year forecast (June 1) "
    },
    {
        "content": "June 1 VMware Inc reported a 44.1 pct rise in quarterly profit on Thursday  fueled by strong demand for its virtualization software used by companies to boost cloud computing efficiency.",
        "date": "06012017",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "VMware posts 44 pct rise in 1st-qtr profit "
    },
    {
        "content": "* On Monday announced its partnership with VMware to bring VMware’s technology to Multi-service Internet of Things  (IoT) Gateways and Edge Controllers Source text for Eikon:",
        "date": "04252017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Eurotech announces partnership with VMware "
    },
    {
        "content": "* VMware Inc - CEO Patrick Gelsinger's total compensation for 2016 was $14.8 million versus $14.4 million in 2015 - sec filing Source text - http://bit.ly/2oYMrEG Further company coverage:",
        "date": "04242017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware CEO's 2016 compensation was $14.8 mln vs $14.4 mln in 2015 "
    },
    {
        "content": "April 18 Paul Maritz  a technology executive who held senior roles at EMC Corp  Microsoft Corp and VMWare Inc  has joined Warburg Pincus LLC as an industry adviser  the private equity firm announced on Tuesday.",
        "date": "04182017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "MOVES-EMC executive joins Warburg Pincus as adviser "
    },
    {
        "content": "* VMware-On April 7 Dell technologies  controlling stockholder of co provided approval of its unit EMC Corp to proposed acquisition by VMware of Wavefront Source text:(http://bit.ly/2o7skk8) Further company coverage:",
        "date": "04122017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Dell  stockholder of co provided approval of its unit EMC Corp to proposed acquisition by VMware of Wavefront "
    },
    {
        "content": "* VMware to acquire WaveFront to accelerate delivery of its cross-cloud management services",
        "date": "04122017",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "BRIEF-VMware to acquire WaveFront to accelerate delivery of its cross-cloud management services "
    },
    {
        "content": "* VMware Inc says financial details of transaction were not disclosed",
        "date": "04042017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-OVH announces intent to acquire VMware vCloud air business "
    },
    {
        "content": "* Fujitsu and VMWare expand their strategic collaboration to offer IOT solutions for the automobile industry Source text for Eikon: Further company coverage:",
        "date": "03302017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Fujitsu and VMWare expands strategic collaboration "
    },
    {
        "content": "* VMware announces $300 million stock purchase agreement with Dell",
        "date": "03302017",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "BRIEF-VMware announces $300 mln stock purchase agreement with Dell "
    },
    {
        "content": "* CEO Patrick Gelsinger's FY 2016 total compensation was $14.84 million versus $14.4 million in FY 2015 - SEC filing",
        "date": "03272017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware CEO Patrick Gelsinger's FY 2016 total compensation was $14.84 mln vs $14.4 mln in FY 2015 - SEC filing "
    },
    {
        "content": "* Centurylink expands its collaboration with VMware to accelerate enterprise cloud adoption  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Centurylink expands collaboration with VMware to accelerate enterprise cloud adoption "
    },
    {
        "content": "* Board approves  transition to Dell fiscal calendar  52/53 week-year ending on the Friday closest to Jan. 31st",
        "date": "01262017",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware sees Q1 diluted non-GAAP EPS $0.93-$0.96 "
    },
    {
        "content": "* License revenue for q4 was $887 million  an increase of 8% from q4 of 2015",
        "date": "01262017",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "BRIEF-VMware posts Q4 gaap earnings per share $1.04 "
    },
    {
        "content": "* Appointment of Brett Shirk to post of senior vice president and general manager of Vmware's americas region  effective immediately.  Source text for Eikon:  Further company coverage:",
        "date": "11012016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Vmware appoints Brett Shirk as senior vice president and general manager of Vmware's Americas "
    },
    {
        "content": "* Q3 earnings per share view $1.10 -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware Q3 non-gaap earnings per share $1.14 "
    },
    {
        "content": "* QTS will now wholly own and control infrastructure supporting qts government cloud",
        "date": "10052016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-QTS acquires sole rights to mware fedramp compliant cloud platform "
    },
    {
        "content": "* VMware Inc says in addition  Egon Durban was elected to VMware board of directors",
        "date": "09072016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Michael Dell joins VMware board of directors as chairman "
    },
    {
        "content": "* IBM and VMware expand partnership to enable easy hybrid cloud adoption  Source text for Eikon:  Further company coverage:",
        "date": "08292016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-IBM and VMware expand partnership to enable easy hybrid cloud adoption "
    },
    {
        "content": "* Reaffirmed the fiscal year 2016 revenue and cash flow guidance that it had previously provided on July 18  2016  - sec filing",
        "date": "08262016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware reaffirms previously provided FY 2016 revenue  cash flow guidance "
    },
    {
        "content": "* VMware announces alliances and strategies for internet of things",
        "date": "08232016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware announces alliances and strategies for Internet of Things "
    },
    {
        "content": "* Ups share stake in Valeant Pharmaceuticals International Inc by 43.6 pct to 19.1 mln shares - SEC filing",
        "date": "08152016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Paulson & Co raises share stake in Valeant  Facebook - SEC filing "
    },
    {
        "content": "* Q2 earnings per share view $0.95 -- Thomson Reuters I/B/E/S",
        "date": "07182016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware Q2 GAAP earnings per share $0.62 "
    },
    {
        "content": "* Announces intent to acquire Arkin Net to help customers accelerate adoption of VMware NSX And software-defined data centers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06132016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware announces intent to acquire Arkin Net "
    },
    {
        "content": "* Third Point LLC  takes share stake of 1.2 million shares in VMware inc",
        "date": "05132016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Third Point LLC takes share stake in VMware  Chubb "
    },
    {
        "content": "* VMware Ceo Pat Gelsinger to step down after Dell-EMC deal closes",
        "date": "05112016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Vmware CEO Gelsinger to step down after Dell-EMC deal closes "
    },
    {
        "content": "* Says it confirms Bill Fathers  executive vice president and general manager  cloud services business unit  will leave Co effective May 3   Further company coverage:    ))",
        "date": "04272016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Vmware says executive VP of cloud services Bill Fathers to leave "
    },
    {
        "content": "April 27 Software maker VMware Inc said on Wednesday Bill Fathers  executive vice president and general manager of its cloud services business unit  will leave the company  effective May 3.",
        "date": "04272016",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "VMware's EVP for cloud services business leaving company "
    },
    {
        "content": "VMware Inc  reported a better-than-expected rise in quarterly revenue  helped by strong sales of its newer virtualization software  and the company also said it would buy back $1.2 billion of its Class A stock this year.",
        "date": "04202016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "VMware results  forecast boosted by strong sales of newer software "
    },
    {
        "content": "* Shares rise nearly 9 pct after market   (Adds details on vSphere bookings)",
        "date": "04202016",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "UPDATE 3-VMware results  forecast boosted by strong sales of newer software "
    },
    {
        "content": "* Q1 earnings per share view $0.84 -- Thomson Reuters I/B/E/S",
        "date": "04192016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-VMware reports Q1 GAAP earnings per share $0.38 "
    },
    {
        "content": "April 19 VMware Inc reported a 5.2 percent rise in quarterly revenue as strong growth in its newer software offerings more than made up for declining demand for its traditional server-virtualization software.",
        "date": "04192016",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "VMware quarterly revenue rises 5.2 pct "
    },
    {
        "content": "Virtualization software maker VMWare Inc said it appointed former Broadcom executive Rajiv Ramaswami as general manager and executive vice-president of its networking and security business.",
        "date": "02242016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "Former Broadcom executive Rajiv Ramaswami joins software maker VMWare "
    },
    {
        "content": "Feb 24 Virtualization software maker VMWare Inc  said it appointed former Broadcom executive Rajiv Ramaswami as general manager and executive vice-president of its networking and security business.",
        "date": "02242016",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "Former Broadcom exec Rajiv Ramaswami joins software maker VMWare "
    },
    {
        "content": "SAN FRANCISCO  Feb 22 Computing giant IBM  has expanded its partnership with VMWare  one of several initiatives it plans to announce Monday as it works to carve out a bigger role in the fast-growing field of cloud computing.",
        "date": "02222016",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "IBM inks deal with VMWare  tries to bolster cloud credentials "
    },
    {
        "content": "* Says signs agreement with U.S. firm VMware to set up JV in China with investment $50 million",
        "date": "01272016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Dawning Information  US firm VMware plan China JV "
    },
    {
        "content": "VMware Inc forecast 2016 revenue and profit below analysts' expectations  suggesting the software maker's strong growth in new businesses was not enough to compensate for weakness in its traditional server-virtualization software.",
        "date": "01272016",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "Software maker VMware to cut 800 jobs  sees weak 2016 "
    },
    {
        "content": "Jan 26 VMware Inc forecast 2016 revenue and profit below analysts' expectations  suggesting the software maker's strong growth in new businesses was not enough to compensate for weakness in its traditional server-virtualization software.",
        "date": "01272016",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "UPDATE 3-Software maker VMware to cut 800 jobs  sees weak 2016 "
    },
    {
        "content": "Jan 26 VMware Inc's quarterly profit rose 14.4 percent as demand increased for its virtualization software  which helps customers cut costs by running multiple operating systems on a single machine.",
        "date": "01262016",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "Software maker VMware's profit rises 14.4 pct "
    },
    {
        "content": "* Says signs non-binding mou with U.S. VMware international on plan to set up JV in China",
        "date": "10302015",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "BRIEF-Dawning Information plans China JV with US firm VMware "
    },
    {
        "content": "NEW YORK VMware shares sharply pared gains on Monday after CRN reported Apple will not renew an expiring VMware enterprise licensing agreement.",
        "date": "10052015",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "VMware shares pare gains after report Apple not renewing licensing agreement "
    },
    {
        "content": "Data storage company EMC Corp  is contemplating a deal under which it would be acquired by its unit VMware Inc   Re/code reported  citing sources briefed on the discussions.",
        "date": "08052015",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "EMC considering to be bought by unit VMware - Re/code "
    },
    {
        "content": "Aug 5 Data storage company EMC Corp is contemplating a deal under which it would be acquired by its unit VMware Inc  Re/code reported  citing sources briefed on the discussions.",
        "date": "08052015",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "UPDATE 1-EMC considering to be bought by unit VMware - Re/code "
    },
    {
        "content": "Aug 5 Data storage company EMC Corp is contemplating a deal under which it would be acquired by its unit VMware Inc  Re/code reported  citing sources briefed on the discussions.",
        "date": "08052015",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "EMC considering to bought by unit VMware - Re/code "
    },
    {
        "content": "WASHINGTON VMware Inc and Carahsoft Technology Corp will pay $75.5 million to settle allegations they misrepresented their commercial pricing practices and overcharged the U.S. government  the Justice Department said on Tuesday.",
        "date": "06302015",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "VMware  Carahsoft to pay U.S. $75.5 million to settle overcharging probe "
    },
    {
        "content": "WASHINGTON  June 30 VMware Inc and Carahsoft Technology Corp will pay $75.5 million to settle allegations they misrepresented their commercial pricing practices and overcharged the U.S. government  the Justice Department said on Tuesday.",
        "date": "06302015",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "VMware  Carahsoft to pay U.S. $75.5 mln to settle overcharging probe "
    },
    {
        "content": "* Selected as sole VMware Business Mobility partner in Norway",
        "date": "06302015",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "BRIEF-EVRY selected sole VMware Business Mobility partner in Norway "
    },
    {
        "content": "Data storage products maker EMC Corp slashed its full-year revenue and profit forecasts  blaming a strong dollar  and reported quarterly results that missed market expectations.",
        "date": "04222015",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "EMC rises on strong VMware results  despite slashing forecast "
    },
    {
        "content": "Virtualization software maker VMware Inc reported its slowest revenue growth in seven quarters as IT spending remained sluggish and a stronger dollar reduced the value of overseas sales.",
        "date": "04212015",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "VMware reports slowest revenue growth in seven quarters "
    },
    {
        "content": "* Posts Q1 rev $5.61 bln vs est. $5.73 bln   (Adds details  analysts' comments  updates shares)",
        "date": "04222015",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "UPDATE 2-EMC rises on strong VMware results  despite slashing forecast "
    },
    {
        "content": "April 21 Virtualization software maker VMware Inc reported its slowest revenue growth in seven quarters as IT spending remained sluggish and a stronger dollar reduced the value of overseas sales.",
        "date": "04212015",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "UPDATE 1-VMware reports slowest revenue growth in 7 quarters "
    },
    {
        "content": "April 21 Virtualization software maker VMware Inc reported an 11 percent rise in quarterly revenue due to strong demand for its products that help cut the cost of moving data to the cloud.",
        "date": "04212015",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "VMware 1st-qtr revenue rises 11 pct "
    },
    {
        "content": "NEW YORK EMC Corp  has decided against spinning off its majority stake in VMware Inc  after reviewing the idea over the last several months following pressure from activist investor Elliott Management Corp  three sources close to the matter said.",
        "date": "02272015",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "Exclusive: EMC to hold on to VMware stake - sources "
    },
    {
        "content": "Data storage equipment maker EMC Corp  which has been under pressure from activist investor Elliott Management Corp  forecast a lower-than-expected profit for the year and said it would cut jobs.",
        "date": "01292015",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "Data storage company EMC gives muted outlook  to cut jobs "
    },
    {
        "content": "Virtualization software maker VMware Inc's adjusted profit beat the average analyst estimate for the eighth straight quarter due to strong demand for its products that help cut the cost of moving data to the cloud.",
        "date": "01272015",
        "name": "Vmware Inc",
        "news_type": "topStory",
        "symbol": "VMW",
        "title": "VMware adjusted profit beats Street for eighth quarter in a row "
    },
    {
        "content": "Jan 27 Virtualization software maker VMware Inc's adjusted profit beat the average analyst estimate for the eighth straight quarter due to strong demand for its products that help cut the cost of moving data to the cloud.",
        "date": "01272015",
        "name": "Vmware Inc",
        "news_type": "normal",
        "symbol": "VMW",
        "title": "UPDATE 2-VMware adj profit beats Street for 8th qtr in a row "
    }
]