[
    {
        "content": "* Temasek Holdings (Private) Ltd takes share stake of 982 057 Class A shares in Vantiv Inc - SEC filing",
        "date": "11142017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Temasek Holdings takes share stake in Vantiv Inc  raises share stake in Amgen "
    },
    {
        "content": "* Vantiv Inc - Vantiv and Visa launch new small business merchant settlement service  fastaccess funding​ Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv and Visa launch new small business merchant settlement service  fastaccess funding​ "
    },
    {
        "content": "Aug 31 U.S. private equity firm Hellman & Friedman is the frontrunner in the race to acquire Nets   Scandinavia's largest payments processor  the Financial Times reported  citing people close to the discussions.",
        "date": "08312017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Hellman & Friedman leads race for $5 bln Nets deal- FT "
    },
    {
        "content": "COPENHAGEN  Aug 17 Nets A/S  Scandinavia's largest payments processor  is seeing \"considerable interest\" from potential buyers amid a wave of M&A activity  the company's chief executive said on Thursday.",
        "date": "08172017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 1-Nets CEO sees \"considerable interest\" from potential buyers "
    },
    {
        "content": "LONDON  Aug 10 Britain's leading share index slumped further on Thursday as weak housebuilders dragged along with companies going ex-dividend.",
        "date": "08102017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Cyclicals  housebuilders dent Britain's FTSE  Coca Cola HBC rises "
    },
    {
        "content": "Aug 10 Britain's FTSE 100 index is seen opening down 45 points on Thursday  according to financial spreadbetters  with futures down 0.01 percent ahead of the cash market open.",
        "date": "08102017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Aug 10 "
    },
    {
        "content": "    Aug 10 Britain's FTSE 100 index is seen opening down 45 points on Thursday  according to financial spreadbetters.          * BP: Australia's antitrust regulator said on Thursday it was concerned BP Plc's plan to buy the petrol stations of grocery giant Woolworths Ltd  would hurt competition  a sign it may block the A$1.8 billion ($1.4 billion) deal.     * SKY: Hedge fund manager Crispin Odey has said he is considering withdrawing his support for Twenty-First Century Fox's attempt",
        "date": "08102017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UK Stocks-Factors to watch on Aug 10 "
    },
    {
        "content": "Aug 8 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "08082017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LONDON U.S. credit card processing company Vantiv secured a deal to buy British-based rival Worldpay for 8 billion pounds ($10.4 billion) on Wednesday in a bid to create a $29 billion global payments powerhouse. | Video ",
        "date": "08092017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "U.S. payments firm Vantiv clinches $10 billion deal to buy Worldpay "
    },
    {
        "content": "LONDON U.S. credit card payments processor Vantiv  has finalised a deal to buy Britain's Worldpay  and the transaction is expected to be announced on Wednesday  sources with knowledge of the matter told Reuters.",
        "date": "08082017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "U.S. card firm Vantiv to announce Worldpay deal Wednesday: sources "
    },
    {
        "content": "* Vantiv has until Aug. 11 to make formal bid (Adds sources on timing  terms of the deal)",
        "date": "08082017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 2-U.S. card firm Vantiv to announce Worldpay deal Wednesday - sources "
    },
    {
        "content": "* NYSE will have primary listing with secondary LSE listing (Adds description of Worldpay in lead)",
        "date": "08092017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 4-U.S. payments firm Vantiv clinches $10 bln deal to buy Worldpay "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Worldpay has wrung ample concessions from Vantiv. The British payments group on Wednesday clinched a 7.9 billion pound ($10 billion) takeover by its U.S. rival after twice extending a bid deadline. It should be enough to appease unhappy UK investors.",
        "date": "08092017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Worldpay wrings ample concessions from Vantiv sale "
    },
    {
        "content": "* Vantiv says certain lenders have committed to make available to Vantiv LLC new unsecured bridge loan facility of up to $1.13 billion - SEC filing",
        "date": "08092017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv says certain lenders to give Vantiv LLC unsecured bridge loan of up to $1.13 bln - SEC filing "
    },
    {
        "content": "* Investor Forum has held a series of talks with Worldpay over the terms of its 9 billion stg sale to Vantiv of the U.S. - Sky News  citing sources Source text - http://bit.ly/2v2nLwy (Bengaluru Newsroom)",
        "date": "08032017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Investor Forum has held series of talks with Worldpay over the terms of its 9 bln stg sale to Vantiv - Sky News "
    },
    {
        "content": "LONDON  Aug 1 British payments firms Worldpay said on Tuesday that its U.S. suitor Vantiv has been granted a week-long extension to Aug. 8 to make a firm takeover bid or walk away for six months.",
        "date": "08012017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Vantiv granted extension to make firm bid for Worldpay "
    },
    {
        "content": "DUBLIN  Aug 8 Paddy Power Betfair's new chief executive Peter Jackson will take up the role within the next six to 12 months  the gambling firm's outgoing CEO said on Tuesday.",
        "date": "08082017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Paddy Power Betfair CEO sees successor in place in six to 12 months "
    },
    {
        "content": "Aug 9 Britain's FTSE 100 index is seen opening 40 points lower at 7503.2 on Wednesday  according to financial spreadbetters  with futures down 0.48 percent ahead of the cash market open.",
        "date": "08092017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Aug 9 "
    },
    {
        "content": "LONDON  Aug 9 U.S. card firm Vantiv has made a formal offer to buy Britain's biggest payments processor Worldpay for 8 billion pounds  ($10.39 billion)  five weeks after the deal was first announced.",
        "date": "08092017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "U.S. card firm Vantiv clinches $10bln takeover of Worldpay "
    },
    {
        "content": "LONDON  Aug 1 British payments firms Worldpay said on Tuesday that its U.S. suitor Vantiv has been granted a week-long extension to Aug. 8 to make a firm takeover bid or walk away for six months.",
        "date": "08012017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 1-Vantiv granted extension to make firm bid for Worldpay "
    },
    {
        "content": "Aug 8 Britain's FTSE 100 index is seen opening 16 points lower at 7516.3 on Tuesday  according to financial spreadbetters  with futures down 0.13 percent ahead of the cash market open.",
        "date": "08082017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Aug 8 "
    },
    {
        "content": "Aug 8 Payments processing company Paysafe Group said first-half adjusted core earnings rose 17.3 percent  as more people used the company's prepaid digital wallets to make payments.",
        "date": "08082017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 1-Paysafe reports 17.3 percent jump in H1 adjusted core earnings "
    },
    {
        "content": "* Q2 earnings per share view $0.82 -- Thomson Reuters I/B/E/S",
        "date": "08092017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv posts Q2 GAAP earnings per share $0.42 "
    },
    {
        "content": "LONDON  Aug 8 British payments firms Worldpay said on Tuesday that the deadline for its long-awaited deal with U.S. suitor Vantiv has been pushed back by yet another four days as the two companies need more time to reach a final agreement.",
        "date": "08082017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Worldpay granted second deadline extension for Vantiv deal "
    },
    {
        "content": "* Responds to an article \"that claims vantiv deceives merchants by marking up interchange fees​\"",
        "date": "07172017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv responds to article that claims Co deceives merchants by marking up interchange fees​ "
    },
    {
        "content": "Private equity firms Blackstone and CVC Capital Partners [CVC.UL] joined a rush to snap up payments companies on Friday with a 2.9 billion pound ($3.7 billion) bid for Paysafe Group.",
        "date": "07212017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Private equity bid for Paysafe stokes payments M&A boom "
    },
    {
        "content": "PARIS  July 17 French payments company Worldline has agreed to buy Swedish peer Digital River World Payments as merger activity in the payments sector picks up following this month's takeover of Worldpay.",
        "date": "07172017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "French payments group Worldline to buy Digital River World Payments "
    },
    {
        "content": "* Paysafe makes $470 mln bid for Merchants' Choice (Adds UBS analysis on price  Banker quote)",
        "date": "07212017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 4-Private equity bid for Paysafe stokes payments M&A boom "
    },
    {
        "content": "LONDON  July 21 Private equity group Permira has bought a stake of at least 10 percent in payments firm Klarna  one of Europe's most highly valued tech startups  the companies said on Friday.",
        "date": "07212017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 1-Permira joins payments rush by buying into Sweden's Klarna "
    },
    {
        "content": "U.S. credit card processor Vantiv agreed to buy Britain's Worldpay for 7.7 billion pounds ($10 billion) on Wednesday in a move expected to trigger further deals. | Video ",
        "date": "07052017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "U.S. card firm Vantiv goes global with $10 billion Worldpay buy "
    },
    {
        "content": "LONDON Worldpay Group Plc   Britain's largest payment processor  on Tuesday received rival bid approaches from U.S. credit card technology firm Vantiv Inc  and JPMorgan Chase Bank   sending its shares up by more than 25 percent.",
        "date": "07042017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "Worldpay shares soar on bid approaches from Vantiv  JPMorgan "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Worldpay discovered on Wednesday that a couple of birds in the bush are sometimes worth a bit more than one in the hand. A day after Britain’s biggest payment processor said it had received approaches from both Vantiv and JPMorgan  the company plumped for the former’s offer of nearly $10 billion in a mix of cash and shares. That took the shine off the share price of both the buyer and its target. Perhaps because the deal only makes sense with some very charitable",
        "date": "07052017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Vantiv sets punchy price on Worldpay "
    },
    {
        "content": "July 5 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "07052017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LONDON  July 4 A rally in Worldpay shares to a record high was not enough to offset a broad-based decline among British shares on Wednesday  after a strong start to the second half for the UK's top share index.",
        "date": "07042017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Britain's FTSE wilts though Worldpay surges "
    },
    {
        "content": "* But energy stocks weigh as oil drops (Writes through  adds details  closing prices)",
        "date": "07052017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Earnings support European shares but oil slump weighs "
    },
    {
        "content": "* Tech giants might decide to enter the fray (Updates JP Morgan comment  adds context)",
        "date": "07042017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 2-Worldpay shares soar on bid approaches from Vantiv  JPMorgan "
    },
    {
        "content": "LONDON  July 4 Worldpay Group Plc  Britain's largest payment processor  said on Tuesday that it had received separate takeover approaches from U.S. credit card technology firm Vantiv Inc and JPMorgan Chase Bank .",
        "date": "07042017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "CORRECTED-UPDATE 1-UK's Worldpay says had takeover approaches from Vantiv  JPMorgan "
    },
    {
        "content": "* Worldpay falls as prospect of rival bid fades (Adds details  closing prices)",
        "date": "07052017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Persimmon and housebuilders set foundations for FTSE gains "
    },
    {
        "content": "* Deal to trigger further consolidation- analysts (Adds analyst comments  details  context  updates shares)",
        "date": "07052017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UPDATE 2-U.S. card firm Vantiv goes global with $10 bln Worldpay buy "
    },
    {
        "content": "July 4 Worldpay Group Plc said on Tuesday it had received preliminary approaches from Vantiv Inc and JPMorgan Chase Bank in relation to the potential acquisition of the British payment processor.",
        "date": "07042017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "UK's Worldpay says had takeover approaches from Vantiv  JPMorgan "
    },
    {
        "content": "* Confirms that it has received preliminary approaches from Vantiv  Inc (\"Vantiv\") and JPMorgan Chase Bank (\"JPMorgan\") in relation to potential acquisition Source text for Eikon: Further company coverage: (Bengaluru Newsroom)",
        "date": "07042017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "BRIEF-Worldpay says approached for potential deal by Vantiv  JPMorgan "
    },
    {
        "content": "July 5 Worldpay Group Plc  Britain's largest payment processor said it had agreed to terms of a potential merger with U.S. credit card technology firm Vantiv Inc in a deal worth 7.7 billion pounds ($9.95 billion)  excluding debt.",
        "date": "07052017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Worldpay says agreed to be taken over by Vantiv in $10 bln deal "
    },
    {
        "content": "* Vantiv Inc and Worldpay Group Plc agree to key terms of possible offer",
        "date": "07052017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "BRIEF-Worldpay agrees terms of possible offer with Vantiv "
    },
    {
        "content": "Worldpay Group Plc   Britain's largest payment processor is \"close to\" recommending a takeover offer from U.S. credit card technology firm Vantiv Inc   Sky News reported citing sources.",
        "date": "07052017",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "Worldpay to back takeover from U.S. credit card tech firm Vantiv: Sky News "
    },
    {
        "content": "* Posera announces partnership with Vantiv and the certification and launch of SecureTablePay in the US market Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Posera announces partnership with Vantiv "
    },
    {
        "content": "* FY2017 earnings per share view $3.14  revenue view $2.11 billion -- Thomson Reuters I/B/E/S",
        "date": "04262017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv reports Q1 adj. earnings per share $0.68 "
    },
    {
        "content": "* Vantiv Inc - financial terms were not disclosed Source text for Eikon: Further company coverage:",
        "date": "04252017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv announces agreement to acquire Paymetric "
    },
    {
        "content": "* Q4 earnings per share view $0.72 -- Thomson Reuters I/B/E/S",
        "date": "02012017",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv reports Q4 GAAP earnings per share $0.29 "
    },
    {
        "content": "* It intends to repurchase 850 000 shares of its class A common stock at a price per share equal to Monday's closing share price",
        "date": "11212016",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv announces secondary public offering and associated repurchase of its common stock "
    },
    {
        "content": "* Vantiv announces agreement to acquire moneris solutions usa",
        "date": "11102016",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv to acquire Moneris Solutions USA for $425 million "
    },
    {
        "content": "* Vantiv announces agreement to acquire moneris solutions usa",
        "date": "11102016",
        "name": "Vantiv Inc",
        "news_type": "normal",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv to acquire Moneris Solutions USA for $425 mln "
    },
    {
        "content": "* FY 2016 earnings per share view $2.66  revenue view $1.87 billion -- Thomson Reuters I/B/E/S",
        "date": "10262016",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv posts Q3 gaap EPS of $0.41 "
    },
    {
        "content": "* Vantiv Inc files for potential stock shelf  size undisclosed -  SEC Filing  Source text - http://1.usa.gov/1U9DKMO Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05262016",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv Inc files for potential stock shelf  size undisclosed -  SEC Filing "
    },
    {
        "content": "* Q1 net revenue increased 15% to $431 million and pro forma adjusted net income per share increased 24% to $0.56",
        "date": "04262016",
        "name": "Vantiv Inc",
        "news_type": "topStory",
        "symbol": "VNTV",
        "title": "BRIEF-Vantiv qtrly gaap basis earnings per share $0.25 "
    }
]