[
    {
        "content": "* ‍On 15 november 2017 it concluded non-discretionary share buy-back programme that it announced on 25 august 2017​ Source text for Eikon: Further company coverage: (bangalore.newsroom@thomsonreuters.com)",
        "date": "11162017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone Group ‍says on 15 Nov 2017 concluded non-discretionary share buy-back programme "
    },
    {
        "content": "* ‍VODAFONE INDIA  IDEA CELLULAR TO SELL STANDALONE TOWER BUSINESSES IN INDIA TO ATC TELECOM INFRASTRUCTURE FOR ENTERPRISE VALUE OF INR78.5 BILLION​",
        "date": "11132017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "CORRECTED-BRIEF-Vodafone  Idea to sell standalone tower businesses in India "
    },
    {
        "content": "LONDON Vodafone   the world's second-largest mobile operator  has raised its full-year earnings forecast for the first time in recent history  as customers switch to using more mobile data on their smartphones rather than looking for wifi. | Video ",
        "date": "11142017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone lifts profit view as customers ditch wifi for mobile "
    },
    {
        "content": "Nov 13 Indian telecom carrier Idea Cellular Ltd posted its fourth straight quarterly loss on Monday  as it struggled with the aggressive pricing structure brought in by an upstart rival.",
        "date": "11132017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "CORRECTED-India's Idea Cellular posts smaller-than-expected Q2 loss "
    },
    {
        "content": "* Shares rise over 5 percent to three-month high (Adds more comments from CEO on convergence  Liberty Global)",
        "date": "11142017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 3-Vodafone lifts profit view as customers ditch wifi for mobile "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Vodafone is figuring out how to go it alone. The 58 billion pound mobile operator and cable group Liberty Global ended talks over a tie-up in 2015. The possibility of a deal hasn’t gone away. But an improving outlook and fibre-broadband growth plans in Germany and Britain make a combination with John Malone’s group – or anyone else – less urgent.",
        "date": "11142017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Breakingviews - Vodafone is doing just fine without Liberty "
    },
    {
        "content": "MILAN  Nov 14 The UK's top stock index rose on Tuesday as Tesco rallied after it won approval for a takeover and Vodafone reported strong results.",
        "date": "11142017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Britain's FTSE snaps losing streak  helped by Tesco  Vodafone "
    },
    {
        "content": "LONDON  Nov 14 Vodafone  the world's second largest mobile operator  raised its forecast for full-year earnings growth to around 10 percent  from 4-8 percent  on Tuesday after reporting a strong first half with growth driven by demand for data.",
        "date": "11142017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "RPT-Vodafone raises full-year outlook after strong first half​ "
    },
    {
        "content": "LONDRA  14 novembre Vodafone ha migliorato le previsioni di crescita dell'utile per l'esercizio in corso portandole intorno al 10% da 4-9% indicato in precedenza  dopo aver archivato il primo semestre all'insegna della solidità.",
        "date": "11142017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone migliora outlook su intero anno dopo primo semestre robusto "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_11142017.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     09:00 am: Science Minister Harsh Vardhan to inaugurate India-Canada Technology Summit in New Delhi.     10:00 am: Road Minister Nitin Gadkari to inspect NH-24 in New Delhi.     10:00 am: Heavy Indust",
        "date": "11142017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Morning News Call - India  November 14 "
    },
    {
        "content": "* Says Nokia and Vodacom have signed MoU under which the companies will trial Nokia 5G technology in South Africa Source text for Eikon: Further company coverage: (Helsinki Newsroom)",
        "date": "11072017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Nokia signs MoU with Vodacom on South Africa 5G trials "
    },
    {
        "content": "* ‍ANNOUNCED SIGNIFICANT EVOLUTION OF ITS BRAND POSITIONING STRATEGY  STRAPLINE AND VISUAL IDENTITY WORLDWIDE ​ Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "10052017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone Group ‍announces new brand positioning strategy​ "
    },
    {
        "content": "LONDON  Oct 5 \"The future is exciting. Ready?\"  Vodafone is asking in a new campaign it hopes will capture a sense of optimism about technology  an association mobile operators have to some extent lost in recent years to the likes of Facebook  Google and Apple.",
        "date": "10042017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "'The future is exciting. Ready?' asks Vodafone in new ad push "
    },
    {
        "content": "* LAUNCHES ABUSE OF DOMINANCE INVESTIGATION AGAINST VODACOM​‍​",
        "date": "10042017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-South Africa's Competition Commission launches abuse of dominance investigation against Vodacom​‍​ "
    },
    {
        "content": "* Vodafone and IBM join together to offer easy route to the cloud for enterprises Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone and IBM join together to offer easy route to the cloud for enterprises "
    },
    {
        "content": "LONDON/FRANKFURT Vodafone is to spend about 2 billion euros ($2.4 billion) on providing new ultra fast fiber broadband connections to homes and businesses in Germany  throwing down the gauntlet to rivals  including former state-owned monopoly Deutsche Telekom.",
        "date": "09112017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone to spend 2 billion euros on German fiber network "
    },
    {
        "content": "* Vodafone Group agrees to enterprise licensing agreement with VMware Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone group agrees to enterprise licensing agreement with VMware "
    },
    {
        "content": "* Ups pressure on rivals to upgrade slow German internet service",
        "date": "09112017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone to spend 2 bln euros on German fibre network "
    },
    {
        "content": "LONDON  Sept 11 Vodafone said it would spend about 2 billion euros ($2.4 billion) to provide around 13.7 million new ultrafast broadband connections to homes and businesses by the end of 2021 in Germany  its biggest European market.",
        "date": "09112017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone to invest 2 bln euros in German fibre connections "
    },
    {
        "content": "JOHANNESBURG  Sept 6 Vodafone has sold down its stake in South African subsidiary Vodacom by 5.2 percentage points  it announced on Wednesday  sending the African mobile firm's share price down by more than 6 percent.",
        "date": "09062017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone sells down shareholding in South Africa's Vodacom "
    },
    {
        "content": "* PROPOSED PLACING OF APPROXIMATELY 90 MILLION ORDINARY SHARES IN VODACOM",
        "date": "09052017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone to place about 90 million ordinary shares in Vodacom "
    },
    {
        "content": "* ‍HAS SOLD AN AGGREGATE OF 90 MILLION ORDINARY SHARES IN VODACOM AT A PRICE OF ZAR 165PER SHARE  RAISING GROSS PROCEEDS OF ZAR 14 850 MILLION​",
        "date": "09062017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone Group raises 14.85 bln rand from Vodacom stake sale "
    },
    {
        "content": "Sept 1 Aditya Birla Capital CEO Ajay Srinivasan and Aditya Birla Group Chairman Kumar Mangalam Birla speaking to reporters at a press conference:",
        "date": "09012017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "RPT-BRIEF-India's Aditya Birla Capital says applied for ARC license "
    },
    {
        "content": "Sept 1 Aditya Birla Capital CEO Ajay Srinivasan and Aditya Birla Group Chairman Kumar Mangalam Birla speaking to reporters at a press conference:",
        "date": "09012017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-India's Aditya Birla Capital says applied for ARC license "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  August 21 (Fitch) Fitch Ratings has affirmed UK-based Vodafone Group Plc's (VOD) Long-Term Issuer Default Rating (IDR) and senior unsecured rating at 'BBB+'. The Outlook on the IDR is Stable. A full list of rating actions is at the end of the commentary. Vodafone's (VOD) ratings capture the group's well-diversified mix of telecoms operations  premium position in consumer and enterprise markets  increasing emphasis on convergent ",
        "date": "08212017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Fitch Affirms Vodafone at 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Vodafone Group PLC files for potential mixed shelf  size not disclosed - SEC filing‍​ Source text : (http://bit.ly/2hhxD2k)",
        "date": "07312017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone Group PLC files for potential mixed shelf  size not disclosed - SEC filing‍​ "
    },
    {
        "content": "MUMBAI  July 24 India's antitrust regulator has approved the merger of Vodafone Group Plc's Indian unit with Idea Cellular  a lawyer representing Vodafone in the matter said on Monday.",
        "date": "07242017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "India's antitrust regulator approves $23 bln Vodafone India-Idea deal "
    },
    {
        "content": "LONDON Vodafone  the world's second largest mobile operator  reported better-than-expected 2.2 percent revenue growth in its first quarter  reflecting a robust performance in Italy and Spain and an acceleration in demand in Turkey.",
        "date": "07212017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone beats expectations with 'robust' performance "
    },
    {
        "content": "* Shares rise to six-week high of 231.25 pence (Adds CEO comments  shares  analyst reaction)",
        "date": "07212017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-Vodafone beats expectations with 'robust' performance "
    },
    {
        "content": "LONDON  July 21 UK shares rose on Friday  led by a rise in Vodafone's shares and gains among commodity stocks as blue chips headed for their best week in two months.",
        "date": "07212017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone leads Britain's FTSE higher  bid boosts mid cap Paysafe "
    },
    {
        "content": "* Ceo Vittorio Colao says exploring all option for indus  including potential ipo",
        "date": "07212017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone CEO says exploring all options for Indus towers stake "
    },
    {
        "content": "LONDON  July 21 Vodafone  the world's second largest mobile operator  reported better-than-expected 2.2 percent revenue growth in its first quarter  reflecting a robust performance in Italy and Spain and an acceleration in demand in Turkey.",
        "date": "07212017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone reports better-than-expected 2.2 pct growth in Q1 "
    },
    {
        "content": "* Notice of full redemption of $1 000 000 000 1.25 pct notes due September 2017 Source text for Eikon: Further company coverage:",
        "date": "07132017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone to redeem $1 bln 1.25 pct notes due September "
    },
    {
        "content": "* A JOINT VENTURE  AVEA-VODAFONE EVRENSEL IS ORTAKLIGI  ESTABLISHED BETWEEN UNIT AVEA (51%) AND VODAFONE (49%)",
        "date": "07052017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Turk Telekom says Avea-Vodafone Evrensel JV established between Avea and Vodafone "
    },
    {
        "content": "WELLINGTON New Zealand pay television provider Sky Network TV  on Monday said it was terminating a sales agreement to buy Vodafone's  local unit  a deal the country's competition regulator had ruled against.",
        "date": "06252017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Sky and Vodafone New Zealand walk away from sales deal  drop court appeal "
    },
    {
        "content": "WELLINGTON  June 26 New Zealand pay television provider Sky Network TV on Monday said it was terminating the sales agreement to buy Vodafone's local unit  a deal the country's competition regulator had ruled against.",
        "date": "06252017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Sky and Vodafone NZ drop sales agreement  Commerce Commission appeal "
    },
    {
        "content": "* Parties have also decided to withdraw appeal of Commerce Commission decision regarding proposed merger Source text for Eikon: Further company coverage:",
        "date": "06252017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Sky Network Television and Vodafone terminate sale & purchase agreement "
    },
    {
        "content": "* Vodafone and LG UPlus announce strategic partnership agreement for South Korea",
        "date": "06052017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone  LG UPlus announce strategic partnership agreement for S. Korea "
    },
    {
        "content": "* ACQUIRES A 100% STAKE IN VODAFONE KABEL DEUTSCHLAND FIELD SERVICES GMBH (VKDFS)",
        "date": "06082017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Solution 30 acquires Vodafone Kabel Deutschland Field Services "
    },
    {
        "content": "NAIROBI  May 26 Vodafone's popular mobile financial services M-Pesa will expand into more African countries  giving millions of people access to banking services without the need for a bank account  the chief executive of Safaricom said.",
        "date": "05262017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone's M-pesa money service to expand further into Africa - CEO "
    },
    {
        "content": "* Apax Partners Midmarket SAS  Fortino Capital and Vodafone Group Plc to combine Melita ltd and Vodafone Malta Ltd",
        "date": "05242017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone Malta to be combined with Melita Ltd "
    },
    {
        "content": "* Co and Vodafone have filed an amended notice of appeal in high court",
        "date": "05172017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Sky Network Television says Co and Vodafone filed amended notice of appeal in high court "
    },
    {
        "content": "WELLINGTON  May 18 New Zealand pay television provider Sky Network TV on Thursday said it had filed a second  more detailed appeal with courts against the Commerce Commission's decision to bar its purchase of Vodafone's local unit.",
        "date": "05172017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Sky and Vodafone move forward with appeal of NZ Commerce Commission decision "
    },
    {
        "content": "JOHANNESBURG UK-based telecoms group Vodafone moved to consolidate two of its African interests on Monday with the transfer of a 35 percent stake in Kenya's Safaricom to majority-owned South African subsidiary Vodacom.",
        "date": "05152017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone's SAfrican arm Vodacom to take over stake in Kenya's Safaricom "
    },
    {
        "content": "* Transfers a 35 pct interest in safaricom to vodacom in exchange for new ordinary shares in vodacom",
        "date": "05152017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone transfers a 35 pct stake in Safaricom to Vodacom "
    },
    {
        "content": "LONDON  May 16 European shares ended little changed on Tuesday as disappointing earnings updates weighed on banks and pharma stocks  but a well-received outlook from Vodafone helped Britain's FTSE 100 touch a record high.",
        "date": "05162017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Earnings drag on European shares  though Vodafone lifts telcos "
    },
    {
        "content": "LONDON  May 16 Vodafone Chief Executive Vittorio Colao said he was optimistic Britain would secure a Brexit deal that works for both sides because there was so much at stake for over 500 million European citizens.",
        "date": "05162017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Bucking the trend  Vodafone CEO says optimistic about Brexit deal "
    },
    {
        "content": "LONDON  May 11 Liberty Global's John Malone says he is open to doing separate deals with Vodafone and British broadcaster ITV  but has yet to make the valuations work.",
        "date": "05112017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Liberty's interest in Vodafone  ITV thwarted by valuations -Malone "
    },
    {
        "content": "* Operator says free cash flow will increase to about 5 mln euros",
        "date": "05162017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-Vodafone promises higher dividends as cash flow set to jump "
    },
    {
        "content": "* Updates weigh on BTG  CYBG  easyJet (Adds detail and quote  updates prices)",
        "date": "05162017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Earnings a drag on European shares  though Vodafone lifts telcos "
    },
    {
        "content": "* Decided that it is or may be the case that this Capita  Vodafone deal may be expected to result in a substantial lessening of competition in the United Kingdom",
        "date": "05102017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-UK's CMA refers Capita  Vodafone deal to phase 2 investigation "
    },
    {
        "content": "LONDON/MADRID Spain's Euskaltel  said on Tuesday it had made an offer of around 700 million euros ($770 million)  including debt  for Zegona's  Telecable  consolidating the Basque telecommunication company's lead in northern Spain.",
        "date": "05162017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Spain's Euskaltel buys Zegona's Telecable for around $770 million "
    },
    {
        "content": "LONDON  May 16 European shares retreated early on Tuesday as disappointing earnings updates weighed on banks and pharma firms  though a well-received update from Vodafone helped the FTSE 100 touch a record high.",
        "date": "05162017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Earnings a drag on European shares  though Vodafone boosts FTSE to fresh record "
    },
    {
        "content": "* CMA says Capita and Vodafone face an in-depth merger investigation  unless companies offer acceptable ways of addressing competition concerns.",
        "date": "05102017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Competition watchdog warns Capita  Vodafone on paging services "
    },
    {
        "content": "* Cfo says free cash flow step-up driven by growth in organic business as capex normalises",
        "date": "05162017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone sees cash flow improvement as regulation  capex ease "
    },
    {
        "content": "LONDON  May 16 Vodafone  the world's second biggest mobile operator  reported a 6.1 billion euro ($6.71 billion) loss for the year to end-March  dragged lower by its Indian unit it is merging with Idea Cellular.",
        "date": "05162017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Britain's Vodafone reports net loss of 6.1 bln euros "
    },
    {
        "content": "* Oia consents granted for proposed merger of Sky and Vodafone Source text for Eikon: Further company coverage:",
        "date": "04282017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Sky Network Television says OIA consents granted for proposed merger of Sky and Vodafone "
    },
    {
        "content": "* Proximus and Vodafone to renew their cooperation agreement for a period of five years",
        "date": "04272017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Proximus and Vodafone to renew their cooperation agreement for a period of five years "
    },
    {
        "content": "* Sky and vodafone are now assessing commission's reasons for decision",
        "date": "04132017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Sky Network Television Sky and Vodafone says assessing commission's reasons for decision "
    },
    {
        "content": "* New Zealand unit  2degrees  filed joint proposal with Vodafone  Spark for broadband  mobile services in rural New Zealand",
        "date": "04032017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Trilogy International says 2degrees to enter joint proposal to enhance broadband services in New Zealand rural communities "
    },
    {
        "content": "March 27 Italy public procurement agency Consip says:",
        "date": "03272017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Fastweb  Wind-Tiscali and BT-Vodafone joint ventures win Italy state contract "
    },
    {
        "content": "WELLINGTON  March 22 New Zealand pay television provider Sky Network TV on Wednesday filed an appeal against the Commerce Commission's decision to bar its purchase of Vodafone's local unit.",
        "date": "03212017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Sky TV appeals Commerce Commission's rejection of Vodafone NZ purchase "
    },
    {
        "content": "* Sky Network Television Limited (SKY) and Vodafone are today filing appeals in high court",
        "date": "03212017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Sky Network Television  Vodafone to appeal against NZ Commerce Commission's decision "
    },
    {
        "content": "March 21 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "03212017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "PRESS DIGEST - Wall Street Journal - March 21 "
    },
    {
        "content": "MUMBAI Britain's Vodafone Group  and Idea Cellular  agreed on Monday to merge their Indian operations in a $23 billion deal  creating the country's biggest telecoms business after the entry of a new rival sparked a brutal price war. | Video ",
        "date": "03202017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone  Idea in $23 billion deal to create new Indian telecom leader "
    },
    {
        "content": "* Jio's entry has upended sector  forcing mergers   (Adds Colao comments  reaction)",
        "date": "03202017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 4-Vodafone  Idea in $23 bln deal to create new Indian telecom leader "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Vodafone has its eye firmly on the top spot in India. A $23 billion merger of the UK-based telecom giant’s Indian operations with Idea Cellular will create the nation's top mobile operator amid a bloody price war. The structure is less than ideal  however  because it aims to satisfy both companies  and give a big say to an Indian tycoon all at once.",
        "date": "03202017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone's Indian synergies come at a high price "
    },
    {
        "content": "* Telefonica and Vodafone sign a commercial agreement for wholesale access to optic fiber network",
        "date": "03162017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Telefonica to grant Vodafone access to its optic fiber network "
    },
    {
        "content": "MILAN  March 20 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "03202017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European shares set for slightly lower open - For more see the LiveMarkets blog "
    },
    {
        "content": "MUMBAI  March 20 Britain's Vodafone Group  will merge its Indian subsidiary with local rival Idea Cellular within two years  Idea said on Monday.",
        "date": "03202017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone to merge India operations with Idea Cellular "
    },
    {
        "content": "* Unit AVEA submitted a joint offer together with Vodafone Telekomünikasyon for the tender issued by the Communication General Directorate of Ministry of Transport  Maritime and Communication for establishment and operation of mobile communication infrastructure in 1 472 locations with no mobile communication infrastructure",
        "date": "03132017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Turk Telekom unit Avea submits a joint offer for establishment of infrastructure project "
    },
    {
        "content": "LONDON  March 13 Mobile operator Vodafone  will create 2 100 new customer service jobs across Britain in the next two years as part of an investment drive to improve operations in its home market.",
        "date": "03132017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone to add over 2 000 British jobs to improve services "
    },
    {
        "content": "LONDON British mobile operator Vodafone risks being left on the sidelines as rivals converge to break free from just selling ever-cheaper data bundles and become internet companies offering combined services from phones to TV to broadband.",
        "date": "03102017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone pays the price for inertia as rivals pull ahead "
    },
    {
        "content": "* Vodafone UK to create 2 100 new customer service roles across midlands  north of England  Scotland and Wales",
        "date": "03132017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone to create 2 100 customer services jobs across UK "
    },
    {
        "content": "WELLINGTON  March 1 Sky Network Television  will not yet cancel its agreement to buy Vodafone's New Zealand unit after the country's competition regulator rejected the proposal  the firms said.",
        "date": "02282017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-NZ's Sky  Vodafone hold off on cancelling purchase contract "
    },
    {
        "content": "WELLINGTON  March 1 Sky Network Television  will not yet cancel its agreement to buy Vodafone's New Zealand unit after the country's competition regulator rejected the proposal  the firms said in a stock exchange statement.",
        "date": "02282017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "NZ's Sky and Vodafone hold off on cancelling deal contract "
    },
    {
        "content": "* It executes with Vodafone Greece a license agreement for 14 animated series for a total broadcasting of 174 hours",
        "date": "03062017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Mondo TV executes license agreement with Vodafone Greece "
    },
    {
        "content": "BARCELONA  Feb 28 The European Commission should help telecom firms by cutting spectrum costs and allowing more mergers to help offset the loss of revenue from the end of roaming charges in Europe  Vodafone Chief Executive Vittorio Colao said on Tuesday.",
        "date": "02282017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone calls on Brussels for help replacing lost roaming revenue "
    },
    {
        "content": "* Orange  Deutsche Telekom  and Globe to launch RCS messaging powered by Jibe RCS cloud from Google- blog",
        "date": "02242017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Google says Orange  Deutsche Telekom  and Globe to launch RCS messaging powered by Jibe RCS cloud- blog "
    },
    {
        "content": "* Commerce Commission of New Zealand - Commission declines clearance for Vodafone/Sky merger",
        "date": "02222017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Commerce Commission of New Zealand declines clearance for Vodafone/Sky merger "
    },
    {
        "content": "MUMBAI Bharti Airtel   India's largest telecoms network operator  is buying Norwegian Telenor's India unit  in yet another consolidation move in the South Asian nation's telecoms sector driven by upstart rival Jio's disruptive pricing.",
        "date": "02232017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Bharti Airtel to buy Telenor's India unit in response to Jio's onslaught "
    },
    {
        "content": "WELLINGTON  Feb 23 New Zealand's competition regulator on Thursday ruled against Sky Network Television's  acquisition of Vodafone's New Zealand unit for NZ$1.3 billion ($930 million).",
        "date": "02222017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "New Zealand competition regulator declines Sky TV purchase of Vodafone NZ "
    },
    {
        "content": "NAIROBI  Feb 21 A Kenyan lawmaker proposed breaking up Safaricom  the country's biggest telecoms operator  on Tuesday because of its role in providing mobile financial services.",
        "date": "02212017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone's Safaricom faces break-up call from Kenyan lawmaker "
    },
    {
        "content": "Feb 22 The following bids  mergers  acquisitions and disposals were reported by 1430 GMT on Wednesday:",
        "date": "02222017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Feb 21 The following bids  mergers  acquisitions and disposals were reported by 1500 GMT on Tuesday:",
        "date": "02212017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Feb 22 Australian shares snapped a three-day losing streak  ending marginally higher on Wednesday as gains by consumer stocks offset losses in many financial counters.",
        "date": "02222017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Australia shares snap three-day losing streak; NZ down "
    },
    {
        "content": "WELLINGTON Telecommunications company Spark  has asked a New Zealand court to rule a 36-hour pause must take place before Sky Network Television  can buy Vodafone's New Zealand unit  if the competition regulator approves the deal.",
        "date": "02202017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Spark asks court to suspend Sky takeover of Vodafone NZ "
    },
    {
        "content": "WELLINGTON  Feb 22 A New Zealand court on Wednesday ruled that a 36-hour pause must take place before Sky Network Television can buy Vodafone's New Zealand unit  if the competition regulator approves the deal.",
        "date": "02222017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "NZ court grants Spark's request for pause on Sky-Vodafone deal "
    },
    {
        "content": "WELLINGTON  Feb 20 Telecommunications company Spark has asked a New Zealand court to rule a 36-hour pause must take place before Sky Network Television can buy Vodafone's New Zealand unit if the competition regulator approves the deal.",
        "date": "02202017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-Spark asks court to suspend Sky takeover of Vodafone NZ "
    },
    {
        "content": "WELLINGTON  Feb 20 Telecommunications company Spark has asked a New Zealand court to rule a 36-hour pause must take place before Sky Network Television can buy Vodafone's NZ unit if the country's competition regulator decides in favour of the deal.",
        "date": "02192017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Spark NZ asks court for temporary stay of Sky's proposed takeover of Vodafone NZ "
    },
    {
        "content": "WELLINGTON  Feb 16 Sky Network Television  said if it gets regulatory clearance to buy Vodafone's  New Zealand unit it will not hold off on the deal to give rival Spark NZ time to challenge the regulator's decision in court  as requested.",
        "date": "02152017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Sky rejects Spark request to hold off on Vodafone NZ takeover "
    },
    {
        "content": "WELLINGTON  Feb 16 Sky Network Television  said that if it gets regulatory clearance to buy Vodafone's New Zealand unit it will not hold off on the deal to give rival Spark NZ time to challenge the regulator's decision in court  as requested.",
        "date": "02152017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Sky rejects Spark request to hold off on Vodafone NZ takeover "
    },
    {
        "content": "* SKY and Vodafone have received letters from legal counsel representing Spark  Trustpower and InternetNZ (parties)",
        "date": "02152017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-SKY Network Television updates on completion of proposed merger of co and Vodafone NZ businesses "
    },
    {
        "content": "* Wins tender to provide mobile services to public institutions.",
        "date": "02062017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-BRIEF-Magyar Telekom wins 5 bln forint mobile tender "
    },
    {
        "content": "* Says Airtel has provided Jio sufficient PoI capacity to serve over 190 million customers",
        "date": "02072017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Bharti Airtel says Airtel has provided Jio sufficient PoI capacity "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE  February 01 (Fitch) A planned merger between Vodafone Group Plc's  (BBB+/Stable) Indian subsidiary and Idea Cellular should help them withstand  intense price competition in the Indian telco market  but is unlikely to lead to  increased pricing power for operators in the short term  says Fitch Ratings. We  retain our negative outlook on the sector  as fierce competition and rising  capex will put pressure on most operators in",
        "date": "02012017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Fitch: Vodafone/Idea Merger Won't Ease Indian Telco Competition "
    },
    {
        "content": "MUMBAI A proposed merger between Vodafone's  India operation and Idea Cellular  would create a market leader in India's crowded and hyper-competitive telecoms sector  forcing smaller players into two likely options: merge or exit altogether.",
        "date": "02012017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone-Idea deal could speed up India telecoms consolidation "
    },
    {
        "content": "* Vodafone-Idea talks put focus on India's smaller mobile players",
        "date": "01312017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone-Idea deal could speed up India telecoms consolidation "
    },
    {
        "content": "LONDON  Feb 2 Vodafone  the world's second-biggest mobile operator  said on Thursday that the rate of growth in its international business division had slowed  echoing a similar warning given by British rival BT last week.",
        "date": "02022017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone joins BT in warning of pressures on international corporate business "
    },
    {
        "content": "LONDON/MUMBAI Britain's Vodafone Group  confirmed on Monday it was in talks to merge its Indian subsidiary with local rival Idea Cellular  in an all-share deal that would create a new market leader better able to contest a brutal new price war.",
        "date": "01302017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "As price war rages  Vodafone India seeks merger with rival Idea Cellular "
    },
    {
        "content": "* Q3 total customers 1.47 mln vs 1.50 mln yr-ago   (Adds official Q3 numbers)",
        "date": "01312017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone Qatar posts narrower Q3 loss as revenue rises "
    },
    {
        "content": "NEW YORK A New York state appeals court on Thursday said its door remains open for settlements of merger litigation where shareholders receive no money  approving an accord tied to Verizon Communications Inc's  $130 billion buyout of Vodafone Group Plc's  stake in their Verizon Wireless venture.",
        "date": "02022017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "New York court approves Verizon settlement over 'merger tax' objections "
    },
    {
        "content": "* Deal would reduce intense competition in India - analysts   (Updates with analyst quote  share prices details  background)",
        "date": "01302017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 3-As price war rages  Vodafone India seeks merger with rival Idea Cellular "
    },
    {
        "content": "Jan 30 The following bids  mergers  acquisitions and disposals were reported by 1115 GMT on Monday:",
        "date": "01302017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Idea Cellular Ltd clarifies on news item \"merger may be the best idea for Vodafone  sir ji!\" ",
        "date": "01302017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Idea Cellular says co has been in preliminary discussions with Vodafone "
    },
    {
        "content": "DUBAI  Jan 31 Vodafone Qatar  an affiliate of Vodafone Group  reported a narrowing third-quarter loss on Tuesday  according to Reuters calculations.",
        "date": "01312017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone Qatar posts narrower Q3 loss "
    },
    {
        "content": "To access the newsletter  click on the link:     http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_01312017.pdf          If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     10:00 am: NITI Aayog Chief Executive Amitabh Kant  DIPP Secretary Ramesh Abhishek at an event in New Delhi.          11:00 am: Budget session of parliament starts at New Delhi.          12:00 pm: Gov",
        "date": "01312017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Morning News Call - India  January 31 "
    },
    {
        "content": "NEW YORK  Feb 2 A New York state appeals court on Thursday said its door remains open for settlements of merger litigation where shareholders receive no money  approving an accord tied to Verizon Communications Inc's $130 billion buyout of Vodafone Group Plc's stake in their Verizon Wireless venture.",
        "date": "02022017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "NY court approves Verizon settlement over 'merger tax' objections "
    },
    {
        "content": "LONDON  Jan 30 Vodafone said on Monday it was in talks to merge its Indian operations with rival Idea Cellular in an all-share deal that could help the groups counter the fierce competition in the market.",
        "date": "01302017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone says in Indian merger talks with Idea Cellular "
    },
    {
        "content": "BERLIN Germany's highest federal court handed Vodafone  a victory on Tuesday in a dispute with Deutsche Telekom  over how the former state monopoly charges for the use of cable ducts  Vodafone said.",
        "date": "01242017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone wins German court victory over Telekom duct charges "
    },
    {
        "content": "* Prosiebensat.1 and Vodafone sign comprehensive distribution agreement  Source text - http://bit.ly/2kWQwp1 Further company coverage:    (Gdynia Newsroom)",
        "date": "02022017",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-ProSiebenSat.1 and Vodafone sign comprehensive distribution agreement "
    },
    {
        "content": "* Czech anti-monopoly office says fines Vodafone  O2 Czech Republic CZK 99 million for anti-competitive network connections",
        "date": "01092017",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Czech watchdog fines Vodafone  O2 Czech Republic CZK 99 mln for anti-competitive network connections "
    },
    {
        "content": "LONDON  Nov 29 Sky said it would enter the UK mobile market with a SIM-only deal that allows data allowances to roll over each month  and offers free calls to the 11 million British households that take its TV services.",
        "date": "11292016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Sky seeks to shake up UK mobile market with flexible data plans "
    },
    {
        "content": "* Ingenico Group  Oberthur Technologies and Vodafone join forces to revolutionize payment terminal connectivity with Ingenico connectivity/manager  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "11282016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Ingenico  Oberthur Technologies and Vodafone join forces "
    },
    {
        "content": "BARCELONA Liberty Global's chief executive said the cable group's joint venture with mobile operator Vodafone in the Netherlands did not signal more deals between the two companies in Europe.",
        "date": "11172016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Liberty says Vodafone Dutch joint venture 'probably not' a template for more deals "
    },
    {
        "content": "BARCELONA  Nov 17 Liberty Global's  chief executive said the cable group's joint venture with mobile operator Vodafone in the Netherlands did not signal more deals between the two companies in Europe.",
        "date": "11172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Liberty says Vodafone Dutch JV 'probably not' a template for more deals "
    },
    {
        "content": "BARCELONA  Nov 17 Liberty Global's  chief executive said the cable group's joint venture with mobile operator Vodafone in the Netherlands did not signal more deals between the two companies in Europe.",
        "date": "11172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Liberty says Vodafone Dutch JV 'probably not' a template for more deals "
    },
    {
        "content": "* cuts share stake in Time Warner Inc by 18.1 percent to 3.9 million shares",
        "date": "11142016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Greenlight Capital dissolves share stake in Twenty-First Century Fox  Vodafone Group "
    },
    {
        "content": "* opens two separate probes into Telecom Italia and Vodafone for alleged abuse of dominant position in the bulk text message (SMS) market  used by companies for notifications to clients",
        "date": "11162016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Italy antitrust opens probes into Telecom Italia  Vodafone "
    },
    {
        "content": "LONDON  Nov 15 Mobile telecoms group Vodafone  reported a first-half  net loss of 5 billion euros ($5.5 billion) on Tuesday after writing down the value of its Indian business by the same amount due to the start of a price war sparked by a powerful new rival.",
        "date": "11152016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "RPT-UPDATE 2-Vodafone takes $5 bln charge against new price war in India "
    },
    {
        "content": "LONDON Mobile telecoms group Vodafone  reported a first-half  net loss of 5 billion euros ($5.5 billion) on Tuesday after writing down the value of its Indian business by the same amount due to the start of a price war sparked by a powerful new rival.",
        "date": "11152016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone takes $5 billion charge against new price war in India "
    },
    {
        "content": "LONDON  Nov 15 British mobile phone group Vodafone reported a better-than-expected 4.3 percent rise in core earnings in the first half of the year  helped by improving trading in European markets like Germany and Italy.",
        "date": "11152016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone beats forecasts with 4.3 pct rise in first-half earnings "
    },
    {
        "content": "* Cuts low-margin services; post-pay customers jump 27.9 pct y-o-y   (Adds detail  context)",
        "date": "11082016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone Qatar's loss narrows as it cuts low-margin services "
    },
    {
        "content": "Nov 8 Vodafone Qatar  an affiliate of Vodafone Group  reported a narrowing second-quarter loss on Tuesday  according to Reuters calculations.",
        "date": "11082016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone Qatar posts narrower Q2 net loss "
    },
    {
        "content": "* Has entered into a new mobile access agreement with Telefonica in Spain which will replace current arrangement with Vodafone",
        "date": "11072016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Zegona says Telecable signs agreement with Telefonica in Spain "
    },
    {
        "content": "AMSTERDAM  Nov 4 Vodafone's Dutch subsidiary said on Friday it had sold fixed-line operations with around 150 000 customers to Deutsche Telekom  subsidiary T-Mobile Nederland for an undisclosed sum.",
        "date": "11042016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone sells Dutch fixed-line operations to T-Mobile "
    },
    {
        "content": "* Lawmaker to demand answers on what action taken   (Adds refund to be completed on Tuesday  American Bankers Association quote)",
        "date": "11072016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 3-Raid on 20 000 Tesco Bank accounts fuels cybercrime fears "
    },
    {
        "content": "* Further to the announcement dated 3 August 2016  Vodafone confirms that Vodafone Libertel (Vodafone Netherlands) has agreed to sell its consumer fixed business (Vodafone Thuis) to T-Mobile Netherlands Holding for an undisclosed sum.",
        "date": "11042016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone agrees sale of Netherlands' consumer fixed business to T-Mobile "
    },
    {
        "content": "LONDON Tesco Bank  owned by Britain's biggest retailer Tesco  halted all online transactions on Monday after money was stolen from 20 000 accounts in the country's first such cyber heist.",
        "date": "11072016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Raid on 20 000 Tesco Bank accounts fuels UK cybercrime fears "
    },
    {
        "content": "WELLINGTON  Oct 31 New Zealand's competition regulator on Monday asked for more detail on Sky Network Television's plan to buy Vodafone PLC for NZ$1.3 billion ($930.28 million)  citing concern it would dampen competition from rival broadband and mobile providers.",
        "date": "10302016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "NZ regulator raises competition concerns around Sky-Vodafone proposed deal "
    },
    {
        "content": "* Sky and Vodafone  both parties received a Letter Of Unresolved Issue  Source text for Eikon:  Further company coverage:",
        "date": "10302016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Sky Network Television updates on merger with  Vodafone NZ "
    },
    {
        "content": "Oct 24 AT&T Inc's plan to buy Time Warner Inc for $85.4 billion in the biggest global acquisition of the year will bring the second-largest U.S. bridge loan financing ever to a market hungry for mergers and acquisitions loans.",
        "date": "10242016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "TIMEWARNER-M&A/AT&T-LOANS-Market welcomes AT&T's $40 bln Time Warner loan "
    },
    {
        "content": "NEW YORK David Einhorn's Greenlight Capital sold out of its profitable stock holdings in UK telecommunications company Vodafone Group Plc  and German chemical business Evonik Industries AG   according to a letter sent to investors Friday and seen by Reuters.",
        "date": "10282016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Greenlight sells profitable Vodafone  Evonik stakes: letter "
    },
    {
        "content": "LONDON Britain has fined Vodafone  a record 4.6 million pounds ($5.60 million) for \"serious and sustained\" customer failures  including not updating accounts when mobile phone users topped up their credit to make calls. | Video ",
        "date": "10262016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone UK fined a record 4.6 million pounds for failing customers "
    },
    {
        "content": "NEW YORK  Oct 28 David Einhorn's Greenlight Capital sold out of its profitable stock holdings in UK telecommunications company Vodafone Group Plc and German chemical business Evonik Industries AG  according to a letter sent to investors Friday and seen by Reuters.",
        "date": "10282016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Greenlight sells profitable Vodafone  Evonik stakes -letter "
    },
    {
        "content": "LONDON  Oct 26 Britain's telecoms regulator Ofcom said it would fine Vodafone a record 4.6 million pounds ($5.60 million) for customer failures  including not crediting accounts when mobile phone users topped up.",
        "date": "10262016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "British regulator fines Vodafone 4.6 mln stg for failing customers "
    },
    {
        "content": "NEW YORK  Oct 23 When Time Warner Inc's  Jeff Bewkes welcomed AT&T Inc's Randall Stephenson for lunch at Time Warner Center in New York in late August  their meeting was supposed to be one of the catch-ups the two chief executives have had over the years.",
        "date": "10232016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "DEALTALK-For AT&T  Time Warner was always on the menu "
    },
    {
        "content": "LONDON  Oct 18 Vodafone has agreed a partnership with Iranian internet firm HiWeb to help modernise its network  the companies said on Tuesday  making the British company the latest Western firm to enter Iran after sanctions were lifted.",
        "date": "10182016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Britain's Vodafone enters Iranian market "
    },
    {
        "content": "LONDON  Oct 18 Vodafone said it would partner with Iranian internet company HiWeb to help it modernise its mobile network and IT infrastructure  making the British mobile phone group the latest western company to operate in Iran after sanctions were lifted.",
        "date": "10182016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Britain's Vodafone to partner with Iran's HiWeb to modernise network "
    },
    {
        "content": "* Signs sales and marketing agreement with Vodafone Dagitim Hizmetleri",
        "date": "10112016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Bimeks signs sales and marketing agreement with Vodafone Dagitim "
    },
    {
        "content": "* Bharti spends $2.13 bln  Jio spends $2.05 bln  Idea $1.92 bln",
        "date": "10062016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 2-India telecoms spectrum auction raises $9.9 bln  Vodafone tops spending "
    },
    {
        "content": "Oct 6 Vodafone Group's Indian unit has bought spectrum worth more than 200 billion rupees ($3 billion) in a government auction that ended on Thursday  a source with knowledge of developments told Reuters.",
        "date": "10062016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone's Indian unit spent $3 bln-plus in spectrum auction -source "
    },
    {
        "content": "* Vodafone and Afrimax Group today jointly announced a new non-equity partner market agreement for Cameroon  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "09232016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone  Afrimax announce partner market deal for Cameroon "
    },
    {
        "content": "MUMBAI Vodafone Group Plc has injected 477 billion rupees ($7.2 bln) into its Indian unit ahead of an auction of airwaves in the world's second-biggest mobile phone market  which has seen increased competition with the entry of a new player.",
        "date": "09222016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone injects $7.2 billion into Indian arm as competition intensifies "
    },
    {
        "content": " ",
        "date": "09222016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone India says gets $7.1 bln equity infusion from parent "
    },
    {
        "content": "MUMBAI  Sept 22 Vodafone India has received an equity infusion of 477 billion rupees ($7.15 billion) from Vodafone Group Plc in the first half of the current fiscal year ending in March  it said in a statement on Thursday.",
        "date": "09222016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone India gets $7.15 bln equity infusion from parent "
    },
    {
        "content": "Vodafone Group Plc   could benefit from a merger with Liberty Global Plc   according to a report in Barron's  which added the British telecommunications company's shares could also be poised for a 33 percent rise.",
        "date": "09112016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone stock could rise 33 percent  benefit from a merger: Barron's "
    },
    {
        "content": "* Welcomes decision of Kabel Deutschland Holding AG to withdraw appeal against second special audit",
        "date": "09062016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Elliott comments on Kabel Deutschland's appeal withdrawal "
    },
    {
        "content": "* Says will take a decision on IPO of its Indian unit by the end of the year  nothing decided yet",
        "date": "09052016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone to make decision on IPO of Indian unit by year-end - CEO "
    },
    {
        "content": "SEOUL Samsung Electronics Co Ltd  recalled all Galaxy Note 7 smartphones equipped with batteries it has found to be fire-prone and halted their sales in 10 markets  denting a revival of the firm's mobile business. | Video ",
        "date": "09022016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Samsung recalls Galaxy Note 7 phones after battery fires "
    },
    {
        "content": "NEW YORK  Sept 1 Verizon Communications Inc  said on Thursday that its chief financial officer  Francis Shammo  plans to retire at the end of the year and will step down from his role on Nov. 1.",
        "date": "09012016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-Verizon CFO Shammo to retire at the end of 2016 "
    },
    {
        "content": "* Fitch affirms Vodafone Group Plc at 'BBB+'; Outlook stable  Source text for Eikon:  Further company coverage:",
        "date": "08262016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Fitch affirms Vodafone Group Plc at 'BBB+'; Outlook stable "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  August 26 (Fitch) Fitch Ratings has affirmed UK based telecom operator  Vodafone Group Plc's Long-Term Issuer Default Rating (IDR) at 'BBB+' with a  Stable Outlook. A full list of rating actions is at the end of this commentary.   Vodafone is comfortably positioned at a 'BBB+' rating. The group benefits from  global scale  diverse operations and sound liquidity. Free cash flow (FCF)  generation  which has been under pressure fro",
        "date": "08262016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Fitch Affirms Vodafone Group Plc at 'BBB+'; Outlook Stable "
    },
    {
        "content": "MUMBAI  Aug 25 Vodafone Group Plc's  Indian unit is likely to delay filing the draft prospectus for its up to $3 billion initial public offering (IPO) until towards the end of the year  IFR reported on Thursday",
        "date": "08252016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone India to delay IPO filing until towards end-2016 - IFR "
    },
    {
        "content": "MUMBAI  Aug 25 Vodafone Group Plc's  Indian unit is likely to delay filing the draft prospectus for its up to $3 billion initial public offering (IPO) until towards the end of the year  IFR reported on Thursday",
        "date": "08252016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone India to delay IPO filing until towards end-2016 - IFR "
    },
    {
        "content": "MUMBAI  Aug 23 Vodafone Group Plc's  Indian arm is in exploratory talks around a possible merger with its smaller domestic rival Idea Cellular  according to a CNBC TV18 report on Tuesday  citing unnamed sources.",
        "date": "08232016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone India  Idea Cellular in exploratory merger talks - CNBC TV18 "
    },
    {
        "content": "WELLINGTON  Aug 16 Spark New Zealand  said on Tuesday it was formally opposing a merger between Sky Network Television Ltd and Vodafone Plc's New Zealand unit  stating that Sky's monopoly on premium sports content rights in New Zealand is a key concern.",
        "date": "08152016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Spark New Zealand opposes Sky Network-Vodafone tie-up "
    },
    {
        "content": "BRUSSELS  Aug 3 The European Commission has authorised on Wednesday a joint venture in the Netherlands between British telecoms firm Vodafone and U.S. cable operator Liberty Global in exchange for concessions.",
        "date": "08032016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Liberty Global  Vodafone win EU conditional approval for Dutch tie-up "
    },
    {
        "content": "BRUSSELS  Aug 3 The European Commission authorised a joint venture in the Netherlands between British telecoms firm Vodafone Group Plc and U.S. cable operator Liberty Global Plc in exchange for concessions.",
        "date": "08032016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Liberty Global  Vodafone win EU conditional approval for Dutch tie-up "
    },
    {
        "content": "BRUSSELS U.S. cable group Liberty Global and UK telecoms firm Vodafone are set to win EU antitrust approval for their plan to merge their Dutch operations after offering minor concessions  two people familiar with the matter said on Friday.",
        "date": "07292016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Exclusive: Liberty Global  Vodafone to win EU approval for Dutch tie-up - sources "
    },
    {
        "content": "BRUSSELS  July 29 U.S. cable group Liberty Global and UK telecoms firm Vodafone are set to win EU antitrust approval for their plan to merge their Dutch operations after offering minor concessions  two people familiar with the matter said on Friday.",
        "date": "07292016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "EXCLUSIVE-Liberty Global  Vodafone to win EU approval for Dutch tie-up - sources "
    },
    {
        "content": "* Says Vivek Badrinath will step down from the Nokia Board of Directors effective immediately due to his appointment as Chief Executive for Vodafone's Africa  Middle East and Asia-Pacific  Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "07292016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Nokia board member Vivek Badrinath steps down  joins Vodafone "
    },
    {
        "content": "* Vivek Badrinath as chief executive  africa  middle east  asia-pacific (amap) region",
        "date": "07292016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone names two new senior management members "
    },
    {
        "content": "* Mobile customers up 2.6 pct  revenue down 7 pct   (Adds detail  context)",
        "date": "07262016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone Qatar reports flat year-on-year loss for Q1 "
    },
    {
        "content": "DUBAI  July 26 Vodafone Qatar  an affiliate of Vodafone Group  reported on Tuesday a first-quarter loss that was flat to the corresponding period of last year.",
        "date": "07262016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone Qatar reports flat year-on-year loss for Q1 "
    },
    {
        "content": "LONDON Spain  Germany and Italy helped Vodafone  to produce stronger than expected first-quarter sales growth despite a drag from European Union roaming charge cuts and a weak home market.",
        "date": "07222016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone says Germany  Spain and Italy drive sales growth "
    },
    {
        "content": "* Vodafone Group and Liberty Global announce intention to appoint two senior executives for their proposed Netherlands joint venture  Source text for Eikon:  Further company coverage:",
        "date": "07192016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Liberty Global Vodafone Group says intend to appoint 2 executives for Netherlands joint venture "
    },
    {
        "content": "* Shares up 4.5 pct   (Adds CEO reaction  analyst reaction  shares)",
        "date": "07222016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-Vodafone says Germany  Spain and Italy drive sales growth "
    },
    {
        "content": "* Jeroen hoencamp to be appointed chief executive and Ritchy Drost to be appointed chief financial officer for Netherlands JV",
        "date": "07192016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone says Jeroen Hoencamp to be appointed CEO of Netherlands JV "
    },
    {
        "content": "LONDON  July 22 Vodafone's planned listing of its Indian business could help the British group if it pursues any further tie-ups with cable-TV company Liberty Global in Europe  its chief executive said on Friday.",
        "date": "07222016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone chief says India listing could help with any future Liberty tie-up "
    },
    {
        "content": "* Ceo says on brexit  urges pragmatic approach on both sides  situation will be clearer in 2-3 months",
        "date": "07222016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone urges pragmatic approach to UK-EU brexit negotiations "
    },
    {
        "content": "* Agreed to appoint Rachel Osborne as an executive director and chief financial officer of company",
        "date": "07112016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Domino's Pizza names Vodafone's Rachel Osborne as CFO "
    },
    {
        "content": "AMSTERDAM  July 6 The Dutch markets regulator on Wednesday asked for EU permission to conduct an antitrust review of a proposed merger between Liberty Global's Dutch cable company Ziggo and Vodafone's Dutch operations.",
        "date": "07062016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Dutch regulator asks EU if it can oversee Ziggo-Vodafone merger review "
    },
    {
        "content": "WELLINGTON  July 6 Auckland-based Sky Network Television Ltd said on Wednesday its shareholders voted almost unanimously in favour of a plan to acquire Vodafone PLC's  New Zealand unit for NZ$3.44 billion ($2.45 billion).",
        "date": "07062016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "NZ's Sky Network shareholders approve deal to buy Vodafone NZ unit "
    },
    {
        "content": "* Completes acquisition of 3 buildings with surface of over 61 000 square meters for 200 million euros ($220.68 million)",
        "date": "06302016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Coima Res completes acquisition of three buildings for EUR 200 mln "
    },
    {
        "content": "HONG KONG  June 23 Vodafone Group is likely to file a draft prospectus for the planned IPO of its Indian business in August with the listing expected in the fourth quarter  in a deal seen raising as much as $2.5 billion  people with direct knowledge of the matter told Reuters.",
        "date": "06232016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone plans to file for India IPO in Aug  listing seen in Q4 -sources "
    },
    {
        "content": "LONDON  June 21 The chief executive of Europe's biggest mobile group Vodafone warned that Britain needs to remain in the European Union to influence the development of the single market for digital services  one the fastest growing parts of the economy.",
        "date": "06212016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone CEO urges Britain to stay in EU to shape digital market "
    },
    {
        "content": "JOHANNESBURG  June 20 South African mobile phone operator MTN named Vodafone European cluster head Rob Shuter as its new chief executive on Monday.",
        "date": "06202016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "RPT-South Africa's MTN names Vodafone Europe head as new CEO "
    },
    {
        "content": "* JSE: MTN - appointment of new MTN Group President & Chief Executive Officer and other appointments",
        "date": "06202016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-MTN Group appoints of new group CEO "
    },
    {
        "content": "MADRID  June 13 British telecoms operator Vodafone will keep Spain's Ono as a separate company for tax reasons  a spokesman for the group said on Monday  after its 7.2 billion-euro ($8.1 billion) acquisition of the cable operator was sealed in 2014.",
        "date": "06132016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone to keep Spain's Ono as separate company for tax reasons "
    },
    {
        "content": "BRUSSELS  June 15 - European Union antitrust regulators will rule by July 19 whether to clear a plan by British mobile operator Vodafone and U.S. cable company Liberty Global  to merge their Dutch operations.",
        "date": "06152016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "EU to decide on Vodafone  Liberty Global's Dutch deal by July 19 "
    },
    {
        "content": "* Vodafone to appeal court decision   (Adds Vodafone  Elliott comment  details)",
        "date": "06102016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Court orders another audit of price in Kabel Deutschland case "
    },
    {
        "content": "FRANKFURT  June 10 A German court has handed a victory to hedge fund Elliott in an ongoing battle about the price Vodafone paid for Kabel Deutschland by ordering another audit of the value of the Germany's largest cable group.",
        "date": "06102016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Court orders another audit of price in Kabel Deutschland case "
    },
    {
        "content": "SYDNEY/WELLINGTON Vodafone PLC  said it was merging its New Zealand unit with the country's biggest pay-TV firm  Sky Network Television   in a $2.4 billion deal that will enable it to offer customers packages of entertainment  broadband and mobile.",
        "date": "06092016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone to merge New Zealand unit with Sky Network in $2.4 billion deal "
    },
    {
        "content": "ACCRA  June 8 Britain's Vodafone said on Wednesday that plans to return its Ghana operations to profit-making were hampered by the West African country's failure to fulfil its financial obligations as minority shareholder.",
        "date": "06082016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone says Ghana needs to meet financial obligations for growth "
    },
    {
        "content": "* Deal subject to regulatory clearance; Sky shares jump   (Recasts  add Vodafone shares  ownership and competition details)",
        "date": "06092016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 4-Vodafone to merge New Zealand unit with Sky Network in $2.4 bln deal "
    },
    {
        "content": "WELLINGTON  June 9 Britain's Vodafone Group Plc  on Thursday announced an effective takeover of leading New Zealand pay TV provider Sky Network Ltd in a NZ$3.4 billion ($2.42 billion) merger combining digital platforms with entertainment content.",
        "date": "06092016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "CORRECTED-UPDATE 2-Vodafone grabs control of Sky NZ in $2.4 bln merger "
    },
    {
        "content": "WELLINGTON  June 9 Sky Network Ltd and Vodafone Group Plc have announced a deal under which Sky and Vodafone's New Zealand unit would merge.",
        "date": "06082016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "New Zealand's Sky Network and Vodafone announce merger deal "
    },
    {
        "content": "June 8 Britain's FTSE 100 index is seen opening down by 14 points  or 0.2 percent  on Wednesday  according to financial bookmakers  with futures down about 0.1 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "06082016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-UK Stocks-Factors to watch on June 8 "
    },
    {
        "content": "* Determined there are reasonable grounds for believing Vodafone contravened GC14 of the general conditions between 1 Jan 2014 and 5 Nov 2015",
        "date": "06062016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-UK's Ofcom updates on investigation into Vodafone Ltd "
    },
    {
        "content": "June 8 Britain's FTSE 100 index is seen opening down by 14 points  or 0.2 percent  on Wednesday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed up 0.2 percent on Tuesday at 6 284.53  chalking up its third straight day of gains  as a rise in oil and energy shares offset weaker mining stocks.      * VODAFONE: Sky Network Ltd on Wednesday said it is in discussions with Vodafone Group Plc abo",
        "date": "06082016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UK Stocks-Factors to watch on June 8 "
    },
    {
        "content": "WELLINGTON Sky Network Ltd  on Wednesday said it is in discussions with Vodafone Group Plc  about a possible merger of their New Zealand businesses.",
        "date": "06082016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Sky Network confirms tie-up talks with Vodafone NZ "
    },
    {
        "content": "WELLINGTON  June 8 Sky Network Ltd on Wednesday said it is in discussions with Vodafone Group Plc  about a possible merger of their New Zealand businesses.",
        "date": "06082016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Sky Network confirms tie-up talks with Vodafone NZ "
    },
    {
        "content": "WELLINGTON  June 8 Sky Network Ltd on Wednesday said it is in discussions with Vodafone Group Plc  about a possible merger of their New Zealand businesses.",
        "date": "06082016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Sky Network confirms tie-up discussions with Vodafone NZ "
    },
    {
        "content": "* Paolo Bertoluzzo  its group chief commercial operations and strategy officer  has informed company of his intention to take up a new role in Italy",
        "date": "05232016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone says group chief commercial operations officer to exit in July;successor to be named in due course "
    },
    {
        "content": "LONDON Vodafone expects a bigger rise in profits this year after investment in faster networks boosted demand in Europe and helped the group return to underlying revenue and core earnings growth in the year just ended  the first annual rise since 2008. | Video ",
        "date": "05172016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone returns to profit growth with pick-up in Europe "
    },
    {
        "content": "* Capex to fall  not as much as expected as investment continues",
        "date": "05172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 3-Vodafone returns to profit growth with pick-up in Europe "
    },
    {
        "content": "LONDON/MILAN  May 17 European shares steadied on Tuesday with gains in companies such as Taylor Wimpey and Vodafone following encouraging updates and a rally in mining companies offset by a weaker auto sector.",
        "date": "05172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European shares end little changed; Taylor Wimpey  Vodafone rise "
    },
    {
        "content": "LONDON  May 17 European shares hit a two-week high on Tuesday  with companies such as Taylor Wimpey and Vodafone gaining after their encouraging updates and miners tracking a rally in major industrial metals.",
        "date": "05172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Miners help European shares to hit 2-week high "
    },
    {
        "content": "LONDON  May 17 European shares climbed on Tuesday following some encouraging company updates  with Taylor Wimpey leading the market higher after announcing a special dividend while Vodafone rose after positive earnings.",
        "date": "05172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European shares climb higher  led up by Taylor Wimpey "
    },
    {
        "content": "* Shares up 2.2 after full-year results  issues in-line guidance",
        "date": "05172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone CEO says focusing on improvement in UK customer service "
    },
    {
        "content": "LONDON  May 17 Mobile phone operator Vodafone  posted its first underlying growth in both full-year revenue and core earnings since 2008  helped by a return to top-line growth in Europe in the fourth quarter.",
        "date": "05172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone reports underlying earnings growth after European recovery "
    },
    {
        "content": "LONDON  May 10 Liberty Global would consider buying Telefonica's O2 UK mobile network if Brussels blocks its agreed sale to CK Hutchison but said the cable group also valued the flexibility it had in its current strategy of being a virtual mobile operator.",
        "date": "05102016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Liberty Global says Telefonica's O2 UK could be of interest "
    },
    {
        "content": "British telecoms operator Vodafone  has picked Bank of America Merrill Lynch (BofA)  Kotak Investment Banking and UBS as joint global coordinators of its Indian unit's IPO  people familiar with the matter said  kicking off its long-awaited listing plan.",
        "date": "04302016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone picks BofA  Kotak  UBS  other banks for India IPO: sources "
    },
    {
        "content": "A Vodafone US Inc employee suing the company for allegedly violating a settlement agreement in a compensation dispute cannot bring claims under labor law  a New York state judge has ruled.",
        "date": "04252016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "N.Y. judge tosses labor law claims in employee suit against Vodafone "
    },
    {
        "content": "* Active customers of M-Pesa increased by 27.1 pct to 25.3 million in year ended 31 march 2016  Source text for Eikon:  Further company coverage:    (London newsroom)",
        "date": "04252016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone says M-Pesa reaches 25 million customers "
    },
    {
        "content": "HONG KONG Vodafone Group has set the ball rolling for the long-awaited initial public offer of shares in its Indian subsidiary by inviting banks  including Citigroup  Goldman Sachs and Morgan Stanley  to make pitches to manage it  people with direct knowledge of the deal said.",
        "date": "04212016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone invites banks to pitch for $2-2.5 billion Indian IPO: sources "
    },
    {
        "content": "HONG KONG  April 21 Vodafone Group has invited banks including Citigroup  Goldman Sachs  and Morgan Stanley to submit pitches for running the book of its India's IPO  likely to raise $2-$2.5 billion  people with direct knowledge of the deal said.",
        "date": "04212016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone invites pitches from banks for India IPO - sources "
    },
    {
        "content": "* Purchased some TEM contracts from Vodafone for $4.5 million",
        "date": "04062016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Tangoe buys TEM contracts from Vodafone for $4.5 mln "
    },
    {
        "content": "ROME  March 16 Italian power utility Enel  is set to reach an agreement with mobile network operators Vodafone and Vimpelcom's Wind over its plans to help develop a national fibre-optic broadband network  Chief Executive Francesco Starace said on Wednesday.",
        "date": "03162016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Enel set to secure Italian fibre broadband deal with Vodafone  Wind "
    },
    {
        "content": "* Says will study detail of India budget proposal while continuing to seek resolution of tax dispute through international arbitration  Source text for Eikon: \"We will of course study the detail of what the Finance Minister has proposed today  while continuing to seek resolution of this matter through international arbitration. Vodafone has always maintained that there was no tax to pay at the time it completed its acquisition of Hutchison's business in 2007. This view was upheld unanimously by ",
        "date": "02292016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone says to study India's one-time tax dispute resolution proposal "
    },
    {
        "content": "BARCELONA  Feb 22 The chief executive of Vodafone underlined the benefits of the company's plan to work with Liberty Global in the Netherlands  an arrangement being closely watched by analysts and investors who hope the two firms will one day reach a wider deal.",
        "date": "02222016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone CEO talks up benefits of going Dutch with Liberty "
    },
    {
        "content": "* \u007fIntends to raise approximately £2.9 billion through issuance of mandatory convertible bonds\u007f\u007f",
        "date": "02182016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone to raise 2.9 bln stg in convertible bonds issue\u007f "
    },
    {
        "content": "LONDON  Feb 19 (IFR) - Vodafone was forced to include investor protection for the first time ever in regards to a planned \u007f3-4bn bond issue next week  after push back over a lack of covenants forced the telco to shelve a multi-billion dollar deal in November.",
        "date": "02192016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Investors call for Vodafone bond protection "
    },
    {
        "content": "* Vodafone to raise £2.88 bln through issuance of mandatory convertible bonds\u007f",
        "date": "02192016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone places 2.88 bln stg of mandatory convertible bonds "
    },
    {
        "content": "MUMBAI India's tax office has sent Vodafone a reminder to pay $2 billion in taxes and threatened the UK group with seizure of local assets if it fails to do so  despite the dispute being the subject of an international arbitration process.",
        "date": "02172016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Indian tax office tells Vodafone to pay $2 billion in tax dispute "
    },
    {
        "content": "MUMBAI India's tax office has sent Vodafone a reminder to pay $2 billion in taxes and threatened the UK group with seizure of local assets if it fails to do so  despite the dispute being the subject of an international arbitration process.",
        "date": "02172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Tax office tells Vodafone to pay $2 billion in tax dispute "
    },
    {
        "content": "LONDON  Feb 16 (IFR) - The merger of Liberty Global's Ziggo and Vodafone's Dutch operations should result in billions of euros of new high-yield bonds or leveraged loans  according to market participants.",
        "date": "02162016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Ziggo and Vodafone JV to lead to \u007f2bn of new debt "
    },
    {
        "content": "* Threatens with seizure of local assets in case of non-payment",
        "date": "02172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-Indian tax office tells Vodafone to pay $2 bln in tax dispute "
    },
    {
        "content": "AMSTERDAM/LONDON Mobile telecoms network operator Vodafone  and cable company Liberty Global  have agreed to combine their Dutch operations to create a stronger package of TV  broadband Internet and mobile  aiming to better take on former incumbent KPN .",
        "date": "02162016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone ties up with Liberty in Dutch deal to take on KPN "
    },
    {
        "content": "Feb 17 - The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02172016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "PRESS DIGEST- British Business - Feb 17 "
    },
    {
        "content": "MUMBAI  Feb 16 India's tax office has issued a reminder notice to Vodafone Group Plc about a tax demand worth more than $2 billion  saying it could seize the British telecoms company's assets in India if it is not paid.",
        "date": "02162016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone says gets $2 billion India tax reminder notice "
    },
    {
        "content": "* Vodafone says Indian tax department notice has references to asset seizures in the event of non-payment",
        "date": "02162016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone confirms having received a tax reminder from Indian tax dept "
    },
    {
        "content": "LONDON  Feb 16 European stocks were seen opening higher on Tuesday  tracking gains in Asian and U.S. equities while a rebound in oil prices also supported markets.",
        "date": "02162016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European Factors to Watch-Shares seen opening higher "
    },
    {
        "content": "Feb 15 UK phone network operator Vodafone Plc  and John Malone's cable company Liberty Global Plc  agreed on Monday to combine their operations in the Netherlands for a better footing in the local market.",
        "date": "02162016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "CORRECTED-UPDATE 1-Vodafone pays Liberty 1 bln euros for Dutch joint venture "
    },
    {
        "content": "Feb 15 UK phone network operator Vodafone Plc  and John Malone's cable company Liberty Global Plc  agreed on Monday to combine their operations in the Netherlands by creating a joint venture.",
        "date": "02162016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone  Liberty agree on Dutch joint venture "
    },
    {
        "content": "LONDON  Feb 5 Britain's top share index gained ground on Friday  led by shares of mobile phone group Vodafone .",
        "date": "02052016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Britain's FTSE rises as Vodafone advances "
    },
    {
        "content": "** Vodafone shares up c.2 pct after Nomura and Deutsche Bank analysts raised PTs on co following positive quarterly results",
        "date": "02052016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BUZZ-Vodafone: Nomura and Deutsche Bank raises PTs "
    },
    {
        "content": "LONDON Mobile phone company Vodafone  delivered its sixth consecutive quarter of underlying revenue growth on Thursday  as Germany and Italy led an improvement in Europe  its biggest regional business.",
        "date": "02042016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone says recovery in Europe still on track "
    },
    {
        "content": "* Q3 organic service revenue up 1.4 pct  in line with forecasts",
        "date": "02042016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-Vodafone says recovery in Europe still on track "
    },
    {
        "content": "Feb 2 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "02022016",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Feb 4 Vodafone CEO says on conference call with reporters:",
        "date": "02042016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone declines to comment further on Liberty Global talks "
    },
    {
        "content": "LONDON  Feb 4 Mobile phone company Vodafone  met expectations with a 1.4 percent rise in revenue in its third quarter  its sixth consecutive quarter of growth  as recovery in Europe gained pace.",
        "date": "02042016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone reports sixth quarter of growth as recovery takes hold "
    },
    {
        "content": "LONDON  Feb 2 Mobile phone networks operator Vodafone said on Tuesday it was in talks with John Malone's cable company Liberty Global about forming a joint venture in the Netherlands.",
        "date": "02022016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "CORRECTED-UPDATE 1-Vodafone in talks with Liberty Global on Dutch joint venture "
    },
    {
        "content": "LONDON  Feb 2 Mobile phone operator Vodafone  said on Tuesday it was in talks with John Malone's cable company Liberty Global about forming a joint venture in the Netherlands.",
        "date": "02022016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "CORRECTED-Vodafone in talks with Liberty Global on Dutch joint venture "
    },
    {
        "content": "* \u007fConfirms it is in discussions with Liberty Global Plc regarding creation of a joint ventur\u007fe",
        "date": "02022016",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone confirms in talks with Liberty Global about Netherlands JV "
    },
    {
        "content": "AMSTERDAM  Dec 10 Vodafone has filed suit against KPN for alleged anticompetitive behaviour  saying it was seeking 115 million euros ($126 million) in damages from the Dutch company.",
        "date": "12102015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone sues KPN for $126 mln over alleged anticompetitive behaviour "
    },
    {
        "content": "AMSTERDAM  Dec 10 Vodafone said on Thursday it had filed suit against KPN seeking 115 million euros ($126 million) in damages from the former Dutch telecoms monopoly.",
        "date": "12102015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone seeks 115 mln euros damages from KPN for 'anti-competitive behaviour' "
    },
    {
        "content": "* Vodafone and swisscom have agreed to extend their strategic partner market agreement by a further four years",
        "date": "12022015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone extends partnership with Swisscom for four years "
    },
    {
        "content": "MUMBAI India's Supreme Court has asked Vodafone Group Plc to pay 20 billion rupees ($302 million) to the government in relation to the phone carrier's plans to merge four of its operating businesses ahead of a share listing.",
        "date": "11242015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone asked to pay $302 million ahead of merger of India businesses "
    },
    {
        "content": "MUMBAI  Nov 24 India's Supreme Court has asked Vodafone Group Plc to pay 20 billion rupees ($302 million) to the government in relation to the phone carrier's plans to merge four of its operating businesses ahead of a share listing.",
        "date": "11242015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone asked to pay $302 mln ahead of merger of India businesses "
    },
    {
        "content": "LONDON Britain has signed six deals with India  including a 1.3 billion pound investment by Vodafone   British Trade Minister Francis Maude said on Thursday during a visit of Indian Prime Minister Narendra Modi to London.",
        "date": "11142015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Britain  India sign six deals  including Vodafone 1.3 billion pound investment "
    },
    {
        "content": "LONDON Britain has signed six deals with India  including a 1.3 billion pound investment by Vodafone   British Trade Minister Francis Maude said on Thursday during a visit of Indian Prime Minister Narendra Modi to London.",
        "date": "11132015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Britain  India sign six deals  including Vodafone 1.3 billion pound investment "
    },
    {
        "content": "LONDON Britain has signed six deals with India  including a 1.3 billion pound investment by Vodafone   British Trade Minister Francis Maude said on Thursday during a visit of Indian Prime Minister Narendra Modi to London.",
        "date": "11122015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Britain  India sign six deals  including Vodafone 1.3 billion pound investment "
    },
    {
        "content": "* Vodafone announces successful placing of non-dilutive equity-linked bonds due 2020",
        "date": "11192015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone places 600 mln stg of new debt financing "
    },
    {
        "content": "LONDON  Nov 12 Britain has signed six deals with India  including a 1.3 billion pound ($1.98 billion) investment by Vodafone  British Trade Minister Francis Maude said on Thursday during a visit of Indian Prime Minister Narendra Modi to London.",
        "date": "11122015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Britain  India sign six deals  including Vodafone 1.3 bln pound investment "
    },
    {
        "content": "* Announces intended issuance of non-dilutive equity-linked bonds due 2020",
        "date": "11192015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone announces intended issuance of bonds due 2020 "
    },
    {
        "content": "BARCELONA  Nov 11 Mobile networks operator Vodafone has looked at spinning off its entire emerging markets unit  which includes its interests in India  Africa  New Zealand  Qatar and Turkey  but decided the synergies it gives justified keeping the group together  Chief Executive Vittorio Colao said on Wednesday.",
        "date": "11112015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone says decided against spinning off emerging markets unit "
    },
    {
        "content": "* Vodafone and Globacom Limited today jointly announced a new  non-equity partnership agreement that covers Nigeria and Republic of Benin.",
        "date": "11062015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone announces non-equity partnership agreement with Globacom "
    },
    {
        "content": "LONDON  Nov 10 Vodafone took aim at Europe's former state telecoms companies like Deutsche Telekom  and BT on Tuesday  saying that unless regulators get tougher on giving their rivals better and cheaper access to their networks  new monopolies would emerge and customers would suffer.",
        "date": "11102015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone attacks Europe's former monopoly network operators "
    },
    {
        "content": "LONDON Vodafone's first-half earnings rose for the first time in four years after investment in faster 4G networks started to pay off and full-year results may be better than forecast  the company said on Tuesday.",
        "date": "11102015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone first-half earnings rise after four lean years "
    },
    {
        "content": "* To switch to reporting in euros in 2017 financial year   (Adds CEO comments  analyst reaction  shares)",
        "date": "11102015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-Vodafone first-half earnings rise after four lean years "
    },
    {
        "content": "MILAN  Nov 10 European shares reduced gains to turn lower by mid-morning on Tuesday as losses among commodity stocks and political uncertainty in Portugal more than offset a solid earnings reports from Vodafone.",
        "date": "11102015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European shares turn lower as commodities  Portugal weigh "
    },
    {
        "content": "Nov 10 Vodafone CEO says on a call with reporters:",
        "date": "11102015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone will take decision on India IPO in next fiscal year "
    },
    {
        "content": "MILAN  Nov 10 European shares opened higher on Tuesday  with Vodafone among the leading gainers after a strong earnings report  although political uncertainty continued to weigh on Portuguese stocks.",
        "date": "11102015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European shares open higher  Vodafone leads "
    },
    {
        "content": "* Under new  non-equity partnership  companies will roll out 3G and develop a number of new services in market using vodafone brand in Ukraine",
        "date": "10162015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone says to extend partner market agreement with Russia's MTS "
    },
    {
        "content": "MUMBAI  Oct 14 Vodafone Group Plc  the world's second-largest mobile operator by subscribers  is preparing for an initial public offering of its India unit  Chief Executive Vittorio Colao said  local TV channels reported on Wednesday.",
        "date": "10142015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone CEO says preparing for IPO of India unit  no timeline set - TV "
    },
    {
        "content": "* India's Bombay high court rules in favour of Vodafone in 85 billion rupees transfer pricing case - television channels  Further company coverage:    (Reporting By Swati Bhat)",
        "date": "10082015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-India's court rules in favour of Vodafone in 85 bln rupees transfer pricing case - TVS "
    },
    {
        "content": "LONDON  Oct 7 With a $120 billion merger with Liberty Global off the table  Vodafone boss Vittorio Colao needs his strategy of higher network investments and acquisitions of European cable companies to start paying off  quickly.",
        "date": "10072015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone goes back to basics after failed Liberty deal "
    },
    {
        "content": "* Says will cut 1 059 jobs in Spain following merger of its local unit with cable operator ONO",
        "date": "09302015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone says will cut 1 059 jobs in Spain following ONO purchase "
    },
    {
        "content": "LONDON  Sept 29 David Nish  former chief executive of asset manager and insurer Standard Life  will become a non-executive director of Vodafone from Jan 2016  Vodafone said on Tuesday.",
        "date": "09292015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "MOVES-Former Standard Life CEO Nish takes Vodafone directorship "
    },
    {
        "content": "* Appoints David Nish as a non-executive director  Source text for Eikon:  Further company coverage:    (London newsroom)",
        "date": "09292015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone appoints David Nish as a non-exec director "
    },
    {
        "content": "LONDON Vodafone and Liberty Global have abandoned  talks about a swap of business assets in Europe's converging mobile phone  broadband and TV markets  they said on Monday  having failed to agree on valuations. | Video ",
        "date": "09282015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone and Liberty Global end European tie-up talks "
    },
    {
        "content": "LONDON  Sept 28 Vodafone and Liberty Global have abandoned  talks about a swap of business assets in Europe's converging mobile phone  broadband and TV markets  they said on Monday  having failed to agree on valuations.",
        "date": "09282015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "REFILE-UPDATE 3-Vodafone and Liberty Global end European tie-up talks "
    },
    {
        "content": "LONDON  Sept 28 British shares fell on Monday  slightly underperforming the broader European market  hit by fresh fears over miner Glencore's ability to withstand a metals price slump and an end to deal talks at Vodafone.",
        "date": "09282015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "New all-time low for Glencore drags UK stocks lower "
    },
    {
        "content": "LONDON Talks between Vodafone and Liberty Global collapsed because the two companies could not agree on the valuation of assets on either side  but the door has not closed on potential future discussions  according to a person close to the talks.",
        "date": "09282015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone  Liberty talks broke down on asset values: source "
    },
    {
        "content": "LONDON  Sept 28 European shares slipped on Monday  with Vodafone lagging after ending talks with Liberty Global while Spanish shares tracked other markets after separatists won a majority of seats in an election in Catalonia.",
        "date": "09282015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European shares slip  Vodafone lags "
    },
    {
        "content": "LONDON  Sept 28 Talks between Vodafone  and Liberty Global collapsed because the two companies could not agree on the valuation of assets on either side  but the door has not closed on potential future discussions  according to a person close to the talks.",
        "date": "09282015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone  Liberty talks broke down on asset values-source "
    },
    {
        "content": "* Shares open 2.5 percent lower after liberty global  tie-up talks ended  Further company coverage:    (Reporting by UK Bureau)",
        "date": "09282015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone shares open 2.5 percent lower after Liberty Global tie-up talks ended "
    },
    {
        "content": "* Discussions with Liberty Global have terminated  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "09282015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone Group says talks with Liberty Global have ended "
    },
    {
        "content": "LONDON Cable operator Liberty Global  and mobile phone group Vodafone  have not worked out how to progress with an exchange of assets  months after they said they were in talks  Liberty's Chairman John Malone told Bloomberg.",
        "date": "09152015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Liberty's Malone says no progress on Vodafone deal: Bloomberg "
    },
    {
        "content": "LONDON  Sept 15 Cable operator Liberty Global  and mobile phone group Vodafone have not worked out how to progress with an exchange of assets  months after they said they were in talks  Liberty's Chairman John Malone told Bloomberg.",
        "date": "09152015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Liberty's Malone says no progress on Vodafone deal -Bloomberg "
    },
    {
        "content": "MILAN  Sept 10 Italy has raised 462 million euros ($518 million) from the sale of spectrum to Telecom Italia  and Vodafone that will be used for 4G mobile phone services.",
        "date": "09102015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Italy sells spectrum to Telecom Italia and Vodafone for 462 mln euros "
    },
    {
        "content": "FRANKFURT  Sept 3 German cable operator Kabel Deutschland has applied to delist from the Frankfurt stock market  it said on Thursday  following its acquisition by Vodafone.",
        "date": "09032015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone-owned Kabel Deutschland applies to delist "
    },
    {
        "content": "AMSTERDAM  Aug 27 There was no timeframe for talks between telecommunications group Liberty Global  and rival Vodafone on swapping assets from the two global companies' portfolios  the former's chief executive officer said on Thursday.",
        "date": "08272015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Liberty Global CEO: no timeframe on talks with Vodafone "
    },
    {
        "content": "ISTANBUL  Aug 28 Vodafone Turkey plans to pay the 778 million euro ($877 million)purchase price of five new 4G mobile phone frequencies with cash from its parent company this year  its local chief executive said on Friday.",
        "date": "08282015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone Turkey plans to pay 4G price from group resources "
    },
    {
        "content": "* Vodafone Turkey has secured 82.8 mhz of spectrum for a total cost of EUR 778 million",
        "date": "08262015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone says Vodafone Turkey acquires spectrum for 4G services "
    },
    {
        "content": "ANKARA  Aug 26 Turkey's auction of 4G mobile phone frequencies lured a higher than expected 3.96 billion euros ($4.5 billion) worth of bids  the agency running the process said on Wednesday  showing the appeal of Turkey's youthful and growing market.",
        "date": "08262015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 3-Turkey's 4G tender outstrips predictions with bids of 4 bln euros "
    },
    {
        "content": " ",
        "date": "08262015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-. "
    },
    {
        "content": "Aug 26 Chipmaker Qualcomm Inc said it agreed to sell its UK L-Band spectrum to Vodafone Group Plc  and Hutchison 3G UK Ltd in two separate deals.",
        "date": "08262015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Qualcomm to sell L-Band UK spectrum to Vodafone  Hutchison "
    },
    {
        "content": "DUBAI  Aug 20 Vodafone Group has scrapped its interest in obtaining a management contract to run one of Lebanon's two state-owned mobile operators  the UK-based company said on Thursday.",
        "date": "08202015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone drops out of bidding for Lebanese mobile contract "
    },
    {
        "content": "MADRID  Aug 7 French telecom group Orange  said on Friday its Spanish unit would raise the price of mobile and fixed-line bundles from next month  following similar moves by competitors Telefonica and Vodafone .",
        "date": "08072015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Orange raises prices in Spain after buying Jazztel "
    },
    {
        "content": "* Telecom seen setting aside money to cover antitrust risks   (Adds source  details)",
        "date": "08052015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Telecom Italia eyes settlement to stop 4 bln euro antitrust claims -sources "
    },
    {
        "content": "Aug 4 Italy's Telecom Italia SpA is considering merging its OpenAccess business unit that leases its landline network to rivals with its wholesale business to avoid antitrust charges of as much as 4 billion euros ($4.35 billion)  Bloomberg reported on Tuesday.",
        "date": "08042015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Telecom Italia weighs reorganization of business unit -Bloomberg "
    },
    {
        "content": "DUBAI  July 30 Vodafone Qatar  an affiliate of Vodafone Group  blamed stiff competition as it reported a widening first-quarter loss on Thursday that missed analyst estimates.",
        "date": "07302015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone Qatar Q1 net loss widens "
    },
    {
        "content": "* Also entered into an agreement with Vodafone Group PLC  regarding access to KPN's fixed network for a period of seven years",
        "date": "07282015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-KPN reaches agreement with ACM and Vodafone "
    },
    {
        "content": "* Ivan Dittrich  chief financial officer and executive director  has resigned from company to pursue his own interests",
        "date": "07272015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodacom Group says CFO resigns  appoints Till Streichert CFO "
    },
    {
        "content": "* With effect from 1 October 2015  CEOs of Vodafone's 4 largest European markets will become members of group executive committee",
        "date": "07212015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone says four European CEOs to join executive committee "
    },
    {
        "content": "* Property stocks gain on broker calls  mortgage data   (Updates with closing prices)",
        "date": "07242015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UK's FTSE dragged down by mining-sector sell-off "
    },
    {
        "content": "LONDON Vodafone  said an acceleration in quarterly sales growth should continue through the year  showing its recovery is moving on to a stronger footing and boosting its shares on Friday. | Video ",
        "date": "07242015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Recovery takes hold at Britain's Vodafone "
    },
    {
        "content": "* Shares up 3.4 percent  no comment on Liberty talks   (Adds CEO  analyst comments  details  background  shares)",
        "date": "07242015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 2-Recovery takes hold at Britain's Vodafone "
    },
    {
        "content": "LONDON  July 24 Britain's top share index edged higher on Friday  slightly underperforming broader European equities  with positive results from Vodafone balancing an ongoing sell-off in the mining sector.",
        "date": "07242015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UK's FTSE helped by corporate results  weighed down by mining shares "
    },
    {
        "content": "LONDON  July 24 European shares advanced on Friday  with well-received earnings updates from companies such as telecom major Vodafone and defence group Thales  supporting the market.",
        "date": "07242015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European shares advance  Vodafone and Thales lead "
    },
    {
        "content": "LONDON  July 24 Britain's top share index edged higher on Friday  in line with euro zone equities  boosted by positively received corporate updates from several companies  including Vodafone and Pearson.",
        "date": "07242015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone and Pearson lead Britain's FTSE higher "
    },
    {
        "content": "FRANKFURT  July 24 Germany's biggest cable operator Kabel Deutschland  a unit of Vodafone   added 102 000 Internet customers (RGUs) in the second quarter  taking its total to 2.7 million.",
        "date": "07242015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Kabel Deutschland sales rise 7 percent in second quarter "
    },
    {
        "content": "LONDON  July 15 Britain's top equity index gained ground on Wednesday as a rise in mining and utility stocks offset a drop at luxury goods maker Burberry and telecoms group Vodafone.",
        "date": "07152015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Britain's FTSE advances as miners and utilities rise "
    },
    {
        "content": "LONDON  July 15 Britain's top equity index fell on Wednesday as a drop in the shares of luxury goods maker Burberry and telecoms group Vodafone pushed the stock market lower.",
        "date": "07152015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Drops in Burberry and Vodafone push Britain' FTSE lower "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  July 09 (Fitch) Fitch Ratings has affirmed UK telecom operator Vodafone  Group Plc's (Vodafone) Long-term Issuer Default Rating (IDR) at 'BBB+' with a  Stable Outlook. A full list of rating actions is available at the end of this  commentary. Vodafone is comfortably positioned at the 'BBB+' rating level. The group  benefits from global scale  diverse operations and sound liquidity. Free cash  flow (FCF) generation and leverage a",
        "date": "07092015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Fitch Affirms Vodafone Group Plc at 'BBB+'; Outlook Stable "
    },
    {
        "content": "LONDON  June 22 Shares in Sky rose 5 percent on Monday  topping the FTSE 100 leaderboard  after a media report said the Murdoch family had rebuffed two offers for their 39 percent stake in the pan-European pay-TV group.",
        "date": "06222015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Sky up after report of rebuffed approach from Vivendi  Vodafone "
    },
    {
        "content": "ROME  June 18 A plan by part state-owned Italian broadband company Metroweb to roll out a fibre optic network across the country is almost ready and envisages an investment of 4-5 billion euros  the Italian head of mobile phone group Vodafone said.",
        "date": "06182015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Metroweb broadband plan sees 5 bln euros investment - Vodafone "
    },
    {
        "content": "* Vodafone has acquired rights to: . 2 x 10 mhz in 700 mhz band; . 2 x 10 mhz in 900 mhz band; . 20 mhz in 1.5 ghz band; and . 2 x 25 mhz in 1.8ghz band.",
        "date": "06192015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone Germany secures additional spectrum "
    },
    {
        "content": "LONDON  June 19 Vodafone has recruited Hannes Ametsreiter  the outgoing chief executive of Telekom Austria  to run its German business  the firm's biggest market where it is struggling in the face of fierce competition.",
        "date": "06192015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone hires Telekom Austria CEO to run German business "
    },
    {
        "content": "* Announced its intention to appoint Hannes Ametsreiter as Vodafone Germany Chief Executive pending supervisory board approval on 30 June 2015.",
        "date": "06192015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone names former Telekom Austria CEO as new Germany boss "
    },
    {
        "content": "FRANKFURT German regional wireless operator Airdata has challenged the EU's approval of Telefonica Deutschland's  8.6 billion euro ($9.6 billion) acquisition of E-Plus  saying concessions offered to allay competition concerns did not go far enough",
        "date": "06082015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Telefonica Deutschland's E-Plus takeover faces legal challenge "
    },
    {
        "content": "Network operator Vodafone Group Plc and cable telecoms company Liberty Global Plc are looking at a range of transactions including a merger  Bloomberg reported.",
        "date": "06042015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone  Liberty looking at merger: Bloomberg "
    },
    {
        "content": "June 4 Network operator Vodafone Group Plc  and cable telecoms company Liberty Global Plc  are looking at a range of transactions including a merger  Bloomberg reported.",
        "date": "06042015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone  Liberty looking at merger - Bloomberg "
    },
    {
        "content": "June 5 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "06052015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON Vodafone  the world's second biggest mobile company  said it is in early talks about exchanging selected assets with Europe's largest cable operator Liberty Global  which could enable each to better compete with rivals.",
        "date": "06052015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone in talks with Liberty Global on asset swap  not merger "
    },
    {
        "content": "* Vodafone shares finish down 2.4 pct   (Adds reaction  background)",
        "date": "06052015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 4-Vodafone in talks with Liberty Global on asset swap  not merger "
    },
    {
        "content": "* Caution after Greek payment delay  ahead of U.S. jobs   (Updates with closing prices)",
        "date": "06052015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UK's FTSE posts biggest weekly drop in 6 months  grocers slip "
    },
    {
        "content": "LONDON  June 5 Britain's top share index fell on Friday and was heading for its worst weekly performance in nearly six months  mirroring a broad sell-off in Europe  with some food retailers losing ground after Deutsche Bank cut its estimate for the UK grocery market.",
        "date": "06052015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "FTSE heads towards worst week in 6 months  grocers slip "
    },
    {
        "content": "LONDON  June 5 Britain's top share index fell on Friday and was heading for its worst weekly performance in nearly six months  mirroring a broad sell-off in Europe  with some food retailers losing ground after Deutsche Bank cut its estimate for the UK grocery market.",
        "date": "06052015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "FTSE heads for worst week in 6 months  grocers slip "
    },
    {
        "content": "DUBAI  June 3 Vodafone Qatar  an affiliate of Vodafone Group  reported a wider fourth-quarter loss on Wednesday.",
        "date": "06032015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone Qatar Q4 net loss widens "
    },
    {
        "content": "* Confirms that it is in early stages of discussions with Liberty Global",
        "date": "06052015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "REFILE-BRIEF-Vodafone in early talks with Liberty Global on asset swaps "
    },
    {
        "content": "MILAN Britain's Vodafone and Vimpelcom's Italian mobile phone unit Wind have signed a letter of intent with shareholders of broadband firm Metroweb to build a fiber-optic network in Italy  the companies said in a joint statement.",
        "date": "05292015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone  Wind sign letter of intent for Italy fiber-optic network "
    },
    {
        "content": "MILAN  May 29 Britain's Vodafone and Vimpelcom's Italian mobile phone unit Wind have signed a letter of intent with shareholders of broadband firm Metroweb to build a fibre-optic network in Italy  the companies said in a joint statement.",
        "date": "05292015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone  Wind sign letter of intent for Italy fibre-optic network "
    },
    {
        "content": "MILAN  May 29 Britain's Vodafone and Vimpelcom's Italian mobile phone unit Wind have signed a letter of intent with shareholders of broadband firm Metroweb to build a fiber optic network in Italy  the companies said in a joint statement.",
        "date": "05292015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone  Wind sign letter of intent for Italy fibre-optic network "
    },
    {
        "content": "LONDON  May 28 Some of the biggest investors in Vodafone say they are open to a European tie-up with Liberty Global  as the British company is now in a stronger position to negotiate a deal with John Malone's cable group.",
        "date": "05292015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "RPT-Vodafone investors open to Liberty deal "
    },
    {
        "content": "May 28 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "05282015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LONDON  May 28 Some of the biggest investors in Vodafone say they are open to a European tie-up with Liberty Global  as the British company is now in a stronger position to negotiate a deal with John Malone's cable group.",
        "date": "05282015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone investors open to Liberty deal "
    },
    {
        "content": "May 28 Vodafone Group PLC said on Thursday it sold its stake in Indian telecom infrastructure firm Bharti Infotel to its holding company Bharti Enterprises for $200 million.",
        "date": "05282015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone sells its stake in Bharti Infotel for $200 million "
    },
    {
        "content": "LONDON  May 22 Britain's top share index hit its highest level in 10 days on Friday  driven by a jump in network operator Vodafone's shares  which hit a 14-year high on the back of potential merger activity.",
        "date": "05222015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone hits 14-year high as M&A talk rumbles on "
    },
    {
        "content": "LONDON  May 22 Britain's top share index hit its highest level in 10 days on Friday  driven by a jump in network operator Vodafone's shares  which hit a 14-year high on the back of potential merger activity.",
        "date": "05222015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone hits 14-yr high as M&A talk rumbles on "
    },
    {
        "content": "A merger with Vodafone Group Plc  would be a \"great fit\" for Liberty Global Plc  in western Europe  Liberty Chairman John Malone said on Tuesday.",
        "date": "05192015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Malone says Liberty  Vodafone a 'great fit' in Europe: Bloomberg "
    },
    {
        "content": "* Vodafone announces multi-million pound network investment across Southampton  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "05222015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone to extend 3G and 4G coverage in Southampton "
    },
    {
        "content": "May 19 A merger with Vodafone Group Plc  would be a \"great fit\" for Liberty Global Plc in western Europe  Liberty Chairman John Malone said on Tuesday.",
        "date": "05192015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Malone says Liberty  Vodafone a 'great fit' in Europe -Bloomberg "
    },
    {
        "content": "LONDON  May 22 The pan-European FTSEurofirst 300 index steadied around the previous session's three-week highs on Friday  with investors focusing on speeches from leading central bankers due later in the day for hints about the market's near-term direction.",
        "date": "05222015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European shares steady near 3-week high  focus on central bankers "
    },
    {
        "content": "LONDON  May 19 Britain's top share index rose on Tuesday  with Land Securities leading the market higher after raising its dividend payout and  Reed Elsevier advancing following positive comments from a major investment bank.",
        "date": "05192015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Britain's FTSE gains  Land Securities up after dividend hike "
    },
    {
        "content": "LONDON  May 22 Britain's top share index rose on Friday and was set to end the week on a positive footing after telecoms company Vodafone extended a recent rally driven by merger speculation.",
        "date": "05222015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone boosts Britain's FTSE as M&A talk rumbles on "
    },
    {
        "content": "LONDON Britain's Vodafone posted a rise in quarterly sales for the first time in nearly three years on Tuesday in the clearest sign yet that Europe's mobile market is edging towards recovery. | Video ",
        "date": "05192015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone's return to growth hints at wider sector recovery "
    },
    {
        "content": "* Altice surges 11.6 pct on Suddenlink bid  Vodafone also gains",
        "date": "05202015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Telecoms takeover talk helps lift European shares "
    },
    {
        "content": "* Says Vodafone-Panafon's squeeze-out right for its remaining shares has been approved",
        "date": "05152015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone-Panafon's squeeze-out right for Hellas Online shares approved "
    },
    {
        "content": "LONDON  May 20 Britain's top share index climbed back towards earlier record highs on Wednesday  buoyed by gains in major bank stocks and after bid speculation lifted the shares of mobile network operator Vodafone.",
        "date": "05202015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UK's FTSE rises near record high as banks and Vodafone advance "
    },
    {
        "content": "LONDON  May 19 Britain's Vodafone posted a rise in quarterly sales for the first time in nearly three years on Tuesday in the clearest sign yet that Europe's mobile market is edging towards recovery.",
        "date": "05192015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "CORRECTED-UPDATE 2-Britain's Vodafone returns to quarterly sales growth "
    },
    {
        "content": "MUMBAI/HONG KONG A Hong Kong-based lobby group representing global banks and investors is considering challenging a controversial tax in the Supreme Court  escalating a row that has eroded investor confidence in Prime Minister Narendra Modi's government.",
        "date": "05132015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Foreign investor group mulls Supreme Court challenge to MAT "
    },
    {
        "content": "* Altice surges 11 pct on Suddenlink bid  Vodafone also gains",
        "date": "05202015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Stronger telecoms on M&A boost help European shares "
    },
    {
        "content": "MUMBAI/HONG KONG  May 13 A Hong Kong-based lobby group representing global banks and investors is considering challenging a controversial tax in India's Supreme Court  escalating a row that has eroded investor confidence in Prime Minister Narendra Modi's government.",
        "date": "05132015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Foreign investor group mulls Supreme Court challenge to India MAT tax "
    },
    {
        "content": "LONDON  May 20 Britain's top share index held firm on Wednesday  as bid speculation lifted mobile network operator Vodafone  whose gains offset a slump in the shares of luxury goods group Burberry.",
        "date": "05202015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Britain's FTSE kept steady by rise in Vodafone "
    },
    {
        "content": "LONDON  May 20 European shares edged up slightly on Wednesday after rebounding strongly in the previous session  with the telecoms sector getting a big lift from deal-making and takeover talk.",
        "date": "05202015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "European shares extend gains  telecoms get M&A boost "
    },
    {
        "content": "* Ceo Colao says combined BT and EE company should release spectrum  end sharing deal with 3   Further company coverage:",
        "date": "05192015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone's Colao says BT and EE should release spectrum "
    },
    {
        "content": "LONDON  May 19 Britain's Vodafone posted a rise in its quarterly sales measurement for the first time in nearly three years on Tuesday  helped by improving trends in its key European markets and demand for 4G mobile services.",
        "date": "05192015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Britain's Vodafone returns to quarterly sales growth "
    },
    {
        "content": "LONDON Vodafone's  shares jumped 4 percent on Wednesday after the chairman of Liberty Global   John Malone  said the two companies would make a \"great fit\"  reigniting long-running merger speculation.",
        "date": "05202015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone shares rise on Malone's Liberty tie-up comments "
    },
    {
        "content": "LONDON  May 20 Vodafone's shares jumped 4 percent on Wednesday after the chairman of Liberty Global   John Malone  said the two companies would make a \"great fit\"  reigniting long-running merger speculation.",
        "date": "05202015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone shares rise on Malone's Liberty tie-up comments "
    },
    {
        "content": "LONDON  May 20 Britain's top share index edged lower in choppy trade on Wednesday  weighed down by a hefty drop in luxury goods maker Burberry after it gave a lower outlook for 2016  although M&A talk around Vodafone supported the market.",
        "date": "05202015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Britain's FTSE edges lower after Burberry cuts outlook "
    },
    {
        "content": "* Battle comes as Italian govt pushes for digital plan   (Adds details  context)",
        "date": "04232015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Metroweb's state owner rejects Telecom Italia proposal - sources "
    },
    {
        "content": "FRANKFURT  April 20 Kabel Deutschland  shareholder Elliott has asked a Munich court to appoint two special auditors  who should investigate the 7.7 billion euro ($8.27 billion) acquisition of Germany's biggest cable firm by Vodafone.",
        "date": "04202015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Kabel Deutschland shareholder asks for more special auditors "
    },
    {
        "content": "MUMBAI  April 19 Indian tax authorities have issued a fresh notice to Vodafone Group Plc seeking re-assessment of tax returns for assessment year 2009-2010  news channel ET Now reported on Saturday citing sources familiar with the development.",
        "date": "04192015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "India issues fresh tax notice to Vodafone - report "
    },
    {
        "content": "April 15 Vodafone Group Plc Spanish CEO Antonio Coimbra:",
        "date": "04152015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone's Spanish CEO see revenues improving in 2015 "
    },
    {
        "content": "ROME Italian state-backed lender Cassa Depositi e Prestiti would be ready to buy out Metroweb if no buyer is found when Italian fund F2i decides to sell its stake  CDP Chairman Franco Bassanini said on Thursday.",
        "date": "04022015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Italian state-backed lender ready to buy out Metroweb if stake unsold "
    },
    {
        "content": "* Vodafone and Botswana Telecommunications Corporation Limited announce partner market agreement in Botswana  Source text for Eikon:  Further company coverage:",
        "date": "03272015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone in Botswana partner agreement "
    },
    {
        "content": "* Has acquired spectrum in 12 telecom circles in March 2015 spectrum auction for a total cost of 258.1 bln Indian rupees (2.78 bln stg)",
        "date": "03262015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone buys Indian telecom spectrum for 2.78 bln stg "
    },
    {
        "content": "March 25 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "03252015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Telecom Italia may give nod to restarting talks on Thursday",
        "date": "03252015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Telecom Italia may revive Metroweb talks after Vodafone move-sources "
    },
    {
        "content": "JOHANNESBURG Telecoms giant Vodafone has so far not held talks with South Africa over the London-listed firm buying Pretoria's stake in its local subsidiary Vodacom  chief executive Vittorio Colao said on Wednesday.",
        "date": "03252015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone CEO: no talks so far with South Africa over Vodacom stake "
    },
    {
        "content": "JOHANNESBURG  March 25 Telecoms giant Vodafone  has so far not held talks with South Africa over the London-listed firm buying Pretoria's stake in its local subsidiary Vodacom  chief executive Vittorio Colao said on Wednesday.",
        "date": "03252015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone CEO: no talks so far with S.Africa over Vodacom stake "
    },
    {
        "content": "JOHANNESBURG  March 25 Telecoms giant Vodafone  has held no talks with South Africa over the London-listed firm buying Pretoria's stake in its local subsidiary Vodacom  chief executive Vittorio Colao said on Wednesday.",
        "date": "03252015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone CEO: no talks so far with S.Africa over Vodacom stake "
    },
    {
        "content": "March 23 Last month Vodafone Qatar  an affiliate of Britain's Vodafone Group  said it had switched all its financial activity to Islamic transactions. In the following eight trading days  its shares jumped 22 percent in the heaviest turnover for over a year.",
        "date": "03232015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "MIDEAST MONEY-Gulf firms go Islamic as markets deepen "
    },
    {
        "content": "* Vodafone launches M-Pesa payments between Tanzania and Kenya  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "03092015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone launches M-Pesa payments between Tanzania and Kenya "
    },
    {
        "content": "* Vodafone netherlands and ericsson implement indoor picocell",
        "date": "03042015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone Netherlands implements Ericsson's indoor picocell "
    },
    {
        "content": "BARCELONA Europe's two biggest telecom operators have called on regulators to be flexible and pragmatic in finalising rules to protect the openness of the Internet  to allow them to give priority to certain kinds of data traffic on their networks.",
        "date": "03022015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "European telecoms firms call for pragmatism on net neutrality "
    },
    {
        "content": "* More consolidation deals expected   (Adds details on prices in Austria after mergers)",
        "date": "02272015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UPDATE 1-Europe's big telecoms roar back to health  worrying rivals "
    },
    {
        "content": "PARIS  Feb 27 Europe's big telecom firms are back to rude financial health after years of poor results and regulatory pressure  drawing crowds of new investors and protests from rivals who worry the formerly state-owned companies may rebuild their monopolies.",
        "date": "02272015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Europe's big telecoms roar back to health  worrying rivals "
    },
    {
        "content": "LONDON  Feb 24 Britain's top equity index was steady in sight of record highs on Tuesday  as a rise in the shares of miner BHP Billiton offset a fall in mobile operator Vodafone.",
        "date": "02242015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "UK's FTSE steady as Billiton offsets fall in Vodafone "
    },
    {
        "content": "* BT deal recreates dominant player in Britain  requires scrutiny",
        "date": "02052015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone CEO urges close scrutiny of BT deal "
    },
    {
        "content": "LONDON  Feb 5 A steady recovery in Europe helped Vodafone stem the rate of sales decline in its third quarter  putting the world's second-biggest mobile operator in touching distance of overall revenue growth once again.",
        "date": "02052015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-Vodafone posts higher than expected third-quarter sales "
    },
    {
        "content": "LONDON  Feb 5 A steady recovery in Europe helped Vodafone to stem the rate of sales decline in its third quarter  putting the world's second biggest mobile operator in touching distance of overall revenue growth once again.",
        "date": "02052015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone posts better than expected Q3 sales "
    },
    {
        "content": "MUMBAI  Feb 3 Vodafone Group Plc's  Indian unit said on Tuesday it had applied to the country's central bank for a permit to operate a payments bank  which are aimed at bringing basic banking services within the reach of millions.",
        "date": "02032015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Vodafone says applied for India payments bank permit "
    },
    {
        "content": "MUMBAI The Indian government has asked tax officials to apply the principle behind a tax ruling in favor of Vodafone Group Plc to all similar cases  a major boost to foreign firms including Royal Dutch Shell PLC.",
        "date": "01292015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "After Vodafone  India changes tax rules to boost investment "
    },
    {
        "content": "MUMBAI  Jan 28 India will not appeal a regional court ruling in favour of Vodafone Group Plc in a long-running tax dispute  the federal cabinet decided on Wednesday  in a move aimed at boosting investor confidence in Asia's third-largest economy.",
        "date": "01282015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "India will not appeal Vodafone tax ruling "
    },
    {
        "content": "MUMBAI  Jan 29 The Indian government has asked tax officials to apply the principle behind a tax ruling in favour of Vodafone Group Plc to all similar cases  a major boost to foreign firms including Royal Dutch Shell PLC .",
        "date": "01292015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UPDATE 1-After Vodafone  India changes tax rules to boost investment "
    },
    {
        "content": "MUMBAI  Jan 29 The Indian government has asked its tax officials to apply the principle behind a tax ruling involving Vodafone Group Plc to all similar transfer pricing cases  an official letter seen by Reuters showed.",
        "date": "01292015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "India applies principle behind Vodafone tax ruling to other cases "
    },
    {
        "content": "MUMBAI  Jan 29 India's decision to drop a tax dispute with Vodafone Group Plc is likely to mean relief for Royal Dutch Shell PLC and others caught in similar  protracted battles  as the government tries to attract much-needed foreign investment.",
        "date": "01292015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "India's Vodafone decision eases tax worries for Shell  others "
    },
    {
        "content": "BRUSSELS  Jan 27 Mobile operators such as Vodafone and Orange would be allowed to continue levying roaming charges over the next three years  according to an EU document  defying European lawmakers' proposal to scrap the fees by the end of this year.",
        "date": "01272015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "Mobile roaming fees should remain until 2018 - EU document "
    },
    {
        "content": "DUBAI  Jan 29 Vodafone Qatar  an affiliate of Vodafone Group  reported a widening third-quarter loss on Thursday as competition in the pay-as-you-go mobile sector intensified.",
        "date": "01292015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "Vodafone Qatar Q3 net loss widens -Reuters calculations "
    },
    {
        "content": "* And docomo pacific announce partner market agreement in guam and commonwealth of northern mariana islands (cnmi)  Source text for Eikon:  Further company coverage:",
        "date": "01262015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone and Docomo Pacific sign marketing deal in Guam  CNMI "
    },
    {
        "content": "MUMBAI  Jan 22 India is set to strike a bilateral tax agreement with the United States as early as this weekend  hoping to boost foreign investment and ease concerns raised by bruising disputes including cases against Vodafone  and Shell.",
        "date": "01222015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "India  U.S. near tax pact to boost foreign investment "
    },
    {
        "content": "* FTSE 100 ends up 0.5 pct; biggest weekly rise since late 2011",
        "date": "01232015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "FTSE records best week in three years; ABF leads "
    },
    {
        "content": "* FTSE 100 up 0.4 pct; eyes biggest wkly rise since late 2011",
        "date": "01232015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "FTSE heads for best week in three years; ABF leads "
    },
    {
        "content": "* FTSE 100 up 0.3 pct; eyes biggest weekly rise since late 2011",
        "date": "01232015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "FTSE on track for best week in three years; telecoms gain "
    },
    {
        "content": "* FTSE 100 up 0.6 pct; eyes biggest weekly rise since Nov '11",
        "date": "01232015",
        "name": "Vodafone Group Plc",
        "news_type": "normal",
        "symbol": "VOD",
        "title": "UK FTSE eyes best weekly rise in over 3 yrs as M&A boosts telcos "
    },
    {
        "content": "* CTO Steve Pusey to retire; Johan Wibergh appointed as successor",
        "date": "01152015",
        "name": "Vodafone Group Plc",
        "news_type": "topStory",
        "symbol": "VOD",
        "title": "BRIEF-Vodafone Group says CTO Steve Pusey to retire "
    }
]