[
    {
        "content": "LONDON  Nov 15 Hedge funds bought reinsurance stocks in the third quarter after prices tumbled on widespread losses after multiple hurricanes in North America  filings showed on Wednesday.",
        "date": "11152017",
        "name": "Validus Holdings Ltd",
        "news_type": "normal",
        "symbol": "VR",
        "title": "Hedge funds bet on reinsurance recovery "
    },
    {
        "content": "* Q3 earnings per share view $-3.30 -- Thomson Reuters I/B/E/S",
        "date": "10262017",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus posts Q3 loss per share $3.17 "
    },
    {
        "content": "* Validus specialty launches talbot-led $240 million political risk insurance binder in New York",
        "date": "09062017",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus Specialty launches talbot-led $240 million political risk insurance binder in New York "
    },
    {
        "content": "* Western World appoints Troy Fornof as vice president Source text for Eikon: Further company coverage:",
        "date": "08282017",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Western World appoints Troy Fornof as vice president "
    },
    {
        "content": "* Validus Holdings Ltd files for a potential mixed shelf offering; size undisclosed - SEC filing Source text - (http://bit.ly/2v5alT0) Further company coverage:",
        "date": "07282017",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus Holdings Ltd files for potential mixed shelf offering size undisclosed - SEC filing "
    },
    {
        "content": "* Validus reports net income available to Validus common shareholders of $101.1 million  or $1.25 per diluted common share and a 10.7% annualized return on average equity for the three months ended June 30  2017",
        "date": "07272017",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus quarterly earnings per share $1.25 "
    },
    {
        "content": "* Validus reports net income available to Validus common shareholders of $94.6 million  or $1.17 per diluted common share and a 10.2% annualized return on average equity for the three months ended march 31  2017",
        "date": "04262017",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus reports quarterly earnings per share $1.17 "
    },
    {
        "content": "* Validus Holdings Ltd qtrly total revenues $635.9 million versus $651.1 million",
        "date": "04262017",
        "name": "Validus Holdings Ltd",
        "news_type": "normal",
        "symbol": "VR",
        "title": "BRIEF-Validus holdings quarterly operating earnings per share $0.95 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 01 (Fitch) Fitch Ratings has affirmed Validus Holdings  Ltd.  (Validus) Issuer Default Rating (IDR) at 'A-'. Additionally  Fitch has affirmed  the 'A' Insurer Financial Strength (IFS) rating of Validus Reinsurance  Ltd.  (Validus Re). A full list of rating actions follows at the end of this release.  The Rating Outlook is Stable. KEY RATING DRIVERS The ratings affirmation reflects the company's strong business profile wit",
        "date": "03012017",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "Fitch Affirms Validus' Ratings; Outlook Stable "
    },
    {
        "content": "* Validus Holdings Ltd announces quarterly preferred share dividend and 8.6 % increase in quarterly common share dividend",
        "date": "02092017",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus Holdings Ltd announces quarterly preferred share dividend and 8.6 % increase in quarterly common share dividend "
    },
    {
        "content": "* Validus reports 2016 full year net income available to Validus common shareholders of $359.4 million  or $4.36 per diluted common share and a 9.7% return on average equity for the 2016 year",
        "date": "02022017",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus Holdings Q4 operating earnings per share $0.80 "
    },
    {
        "content": "CHICAGO  Jan 30 U.S. agricultural commodities trader Archer Daniels Midland Co has agreed to sell its Crop Risk Services (CRS) insurance business for $127.5 million to Validus Holdings Ltd  the companies announced on Monday.",
        "date": "01302017",
        "name": "Validus Holdings Ltd",
        "news_type": "normal",
        "symbol": "VR",
        "title": "ADM to sell crop insurance business to Validus Holdings "
    },
    {
        "content": "* Validus Holdings announces agreement with Archer Daniels Midland to acquire ADM crop risk services business",
        "date": "01302017",
        "name": "Validus Holdings Ltd",
        "news_type": "normal",
        "symbol": "VR",
        "title": "BRIEF-Validus Holdings says deal to acquire ADM's crop risk services business "
    },
    {
        "content": "* Archer Daniels Midland Co - expects to record a book gain upon deal closing",
        "date": "01302017",
        "name": "Validus Holdings Ltd",
        "news_type": "normal",
        "symbol": "VR",
        "title": "BRIEF-ADM says agreement for sale of Crop Risk Services business to Validus "
    },
    {
        "content": "* Provides initial estimate of losses from q2 2016 notable and non-notable loss events  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07112016",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus Holdings provides initial estimate of losses from Q2 2016 "
    },
    {
        "content": "* Validus holdings ltd says  revised timing for its q2 2016 earnings conference call  Source text for Eikon:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "06292016",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus Holdings ltd says revised timing for its Q2 2016 earnings conference call "
    },
    {
        "content": "* Public offering of depositary shares  $0.175 par value and $25 000 liquidation preference per share",
        "date": "06062016",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "BRIEF-Validus Holdings Ltd announces public offering of depositary shares representing series A preference shares "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 06 (Fitch) Fitch Ratings expects to assign a 'BBB' rating to  Validus Holdings  Ltd.'s (Validus) Series A non-cumulative perpetual preferred  issuance. Proceeds from this new issue will be used for general corporate  purposes. KEY RATING DRIVERS Under Fitch's rating methodology  Validus' new non-cumulative perpetual  preference shares receive 100% equity credit in evaluating financial leverage.  Fitch considers the prefere",
        "date": "06062016",
        "name": "Validus Holdings Ltd",
        "news_type": "normal",
        "symbol": "VR",
        "title": "Fitch Expects to Rate Validus' Preferred Issuance 'BBB' "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 10 (Fitch) Fitch Ratings has affirmed the ratings of Validus  Holdings  Ltd. (Validus). The affirmations include Validus' 'BBB+' senior  unsecured debt rating and 'A' Insurer Financial Strength (IFS) rating of Validus  Reinsurance  Ltd. (Validus Re). The Rating Outlook is Stable. A complete list of  rating actions is provided at the end of this release. KEY RATING DRIVERS Validus' ratings reflect the company's continue",
        "date": "02102016",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "Fitch Affirms Validus' Ratings; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 27 (Fitch) Fitch Ratings has affirmed the ratings of Validus  Holdings  Ltd. (Validus). These rating actions include Validus' senior unsecured  debt rating  which was affirmed at 'BBB+' and the Insurer Financial Strength  (IFS) rating of Validus Reinsurance  Ltd. (Validus Re)  which was affirmed at  'A'. The Rating Outlook is Stable. A complete list of rating actions is provided  at the end of this release. KEY RATING ",
        "date": "02272015",
        "name": "Validus Holdings Ltd",
        "news_type": "topStory",
        "symbol": "VR",
        "title": "Fitch Affirms Validus' Ratings; Outlook Stable "
    }
]