[
    {
        "content": "* Vertex receives CHMP positive opinion for Orkambi® (lumacaftor/ivacaftor) for the treatment of children with cystic fibrosis ages 6-11 with two copies of the f508del mutation in the European Union Source text for Eikon: Further company coverage:",
        "date": "11102017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex receives CHMP positive opinion for Orkambi for the treatment of children with cystic fibrosis ages 6-11 "
    },
    {
        "content": "Vertex Pharmaceuticals Inc  raised its outlook for full-year sales of its cystic fibrosis drugs as it released quarterly earnings on Wednesday  but the company reported disappointing results from two clinical trials and its shares tumbled 3 percent in after-hours trade.",
        "date": "10252017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "Vertex ups cystic fibrosis sales view  but 2 trials fail "
    },
    {
        "content": "Oct 25 Vertex Pharmaceuticals Inc raised its outlook for full-year sales of its cystic fibrosis drugs as it released quarterly earnings on Wednesday  but the company reported disappointing results from two clinical trials and its shares tumbled 3 percent in after-hours trade.",
        "date": "10252017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "UPDATE 1-Vertex ups cystic fibrosis sales view  but 2 trials fail "
    },
    {
        "content": "Oct 25 Vertex Pharmaceuticals Inc reported a wider third-quarter net loss on Wednesday  on higher costs and onetime items  and raised its outlook for full-year sales of its key cystic fibrosis drugs.",
        "date": "10252017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Vertex posts wider net loss  raises cystic fibrosis sales outlook "
    },
    {
        "content": "* Vertex announces acceptance of its applications for review of the tezacaftor/ivacaftor combination treatment in people with cystic fibrosis by the FDA and EMA",
        "date": "08242017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex says FDA sets action date of Feb 28  2018 for its Tezacaftor/Ivacaftor Combination Treatment "
    },
    {
        "content": "* FDA approves Kalydeco (Ivacaftor) for more than 600 people ages 2 and older with Cystic Fibrosis who have certain residual function mutations",
        "date": "08012017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-FDA approves Kalydeco(Ivacaftor) for more than 600 people ages 2 and older with Cystic Fibrosis who have certain residual function mutations "
    },
    {
        "content": "* Vertex says interested in acquiring early stage assets in disease areas consistent with cystic fibrosis",
        "date": "07262017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex interested in early stage assets consistent with CF focus "
    },
    {
        "content": "Vertex Pharmaceuticals Inc  reported a better-than-expected profit for the third straight quarter  helped by improved sales of its cystic fibrosis (CF) drugs.",
        "date": "07262017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Vertex Pharma's quarterly profit beats estimates "
    },
    {
        "content": "July 26 Vertex Pharmaceuticals Inc reported a better-than-expected profit for the third straight quarter  helped by improved sales of its cystic fibrosis (CF) drugs.",
        "date": "07262017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "UPDATE 1-Vertex Pharma's quarterly profit beats estimates "
    },
    {
        "content": "July 26 Vertex Pharmaceuticals Inc reported a quarterly profit  compared with a year-ago loss  helped by higher sales of its cystic fibrosis (CF) drugs.",
        "date": "07262017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Vertex Pharma reports quarterly profit "
    },
    {
        "content": "NEW YORK The major U.S. stock indexes closed at record highs on Wednesday helped partly by technology stocks  which surpassed a long-standing mark  despite gains on the Dow being capped by a sharp drop in IBM shares. | Video ",
        "date": "07192017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "Wall Street at new highs as tech breaches dot-com era record "
    },
    {
        "content": "NEW YORK  July 19 The Nasdaq Composite and the S&P 500 hit record highs on Wednesday  powered by technology stocks and a more than 20 percent jump in Vertex Pharmaceuticals  while gains on the Dow were capped by a sharp drop in IBM shares.",
        "date": "07192017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "US STOCKS SNAPSHOT-S&P  Nasdaq at records as Vertex rallies; IBM slips "
    },
    {
        "content": "Shares of Vertex Pharmaceuticals Inc soared to touch a record high on Wednesday  a day after the drugmaker revealed data on its triple combinations of cystic fibrosis (CF) treatments that wowed both analysts and investors.",
        "date": "07192017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Vertex Pharma shares hit life high as cystic fibrosis data wows "
    },
    {
        "content": "July 18 Vertex Pharmaceuticals Inc on Tuesday said three different triple combinations of cystic fibrosis treatments significantly improved patient lung function in clinical trials  bolstering its goal of a therapy that could help up to 90 percent of patients with the life-shortening lung disease.",
        "date": "07182017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Vertex reports positive results for cystic fibrosis triple combos "
    },
    {
        "content": "* Vertex announces reimbursement agreement in Italy for ORKAMBI(®) (Lumacaftor/Ivacaftor) Source text for Eikon: Further company coverage:",
        "date": "07132017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex announces reimbursement agreement for ORKAMBI in Italy "
    },
    {
        "content": "July 18 Vertex Pharmaceuticals Inc said on Tuesday three different triple combinations of cystic fibrosis treatments significantly improved patient lung function in clinical trials  bolstering its goal of a therapy that could help up to 90 percent of patients with the life-shortening lung disease.",
        "date": "07182017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "UPDATE 1-Vertex reports positive results for cystic fibrosis triple combos "
    },
    {
        "content": "* Vertex pharmaceuticals inc issues positive results from three different triple drug combination cystic fibrosis trials",
        "date": "07182017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex issues positive results from three different triple drug combination cystic fibrosis trials "
    },
    {
        "content": "June 14 Diversified healthcare company Johnson & Johnson said on Wednesday its experimental flu drug significantly reduced the presence of the virus in patients with a type of influenza in a mid-stage study.",
        "date": "06142017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "UPDATE 2-Johnson & Johnson's flu drug succeeds in mid-stage trial "
    },
    {
        "content": "* Concert pharmaceuticals announces shareholder approval of CTP-656 asset purchase agreement with Vertex Pharmaceuticals",
        "date": "05242017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Concert pharmaceuticals announces shareholder approval of CTP-656 asset purchase agreement with Vertex Pharmaceuticals "
    },
    {
        "content": "* Qtrly total cf product revenues were $480.6 million compared to $393.6 million for q1 of 2016",
        "date": "04272017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex Q1 non-gaap earnings per share $0.41 "
    },
    {
        "content": "March 30 An anti-inflammatory drug being developed by Corbus Pharmaceuticals Holdings as an add-on treatment for cystic fibrosis demonstrated promising safety and was well tolerated in a small midstage study  according to data released by the company on Thursday.",
        "date": "03302017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Corbus drug shows promise as add-on therapy for cystic fibrosis "
    },
    {
        "content": "March 28 Vertex Pharmaceuticals Inc said on Tuesday its Kalydeco cystic fibrosis treatment given with an experimental drug demonstrated significant improvements in lung function in a pair of late-stage trials the company plans to use to seek approval for the combination therapy.",
        "date": "03282017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "UPDATE 2-Vertex cystic fibrosis combination succeeds in late-stage trials "
    },
    {
        "content": "Vertex Pharmaceuticals Inc said on Tuesday its Kalydeco cystic fibrosis treatment given with an experimental drug demonstrated significant improvements in lung function in a pair of late-stage trials the company plans to use to seek approval of the combination therapy.",
        "date": "03282017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Vertex cystic fibrosis combination succeeds in late-stage trials "
    },
    {
        "content": "March 28 Vertex Pharmaceuticals Inc on Tuesday said its Kalydeco cystic fibrosis treatment given with an experimental drug demonstrated significant improvements in lung function in a pair of late stage trials the company plans to use to seek approval of the combination therapy.",
        "date": "03282017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Vertex cystic fibrosis combination succeeds in late stage trials "
    },
    {
        "content": "* Vertex to acquire CTP-656 from Concert Pharmaceuticals for the treatment of cystic fibrosis  Source text for Eikon:  Further company coverage:",
        "date": "03062017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex to acquire CTP-656 from Concert Pharmaceuticals "
    },
    {
        "content": "* X-Chem and Vertex enter into multi-target genetic disease collaboration",
        "date": "05162017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-X-Chem and Vertex enter into multi-target genetic disease collaboration "
    },
    {
        "content": "* Vertex reports full-year and fourth-quarter 2016 financial results",
        "date": "01252017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex Pharmaceuticals Q4 earnings per share $0.13 "
    },
    {
        "content": "Vertex Pharmaceuticals Inc  said on Sunday that it expected full-year 2017 revenue from its Orkambi cystic fibrosis treatment of $1.1 billion to $1.3 billion and revenue from its Kalydeco treatment of $690 million to $710 million.",
        "date": "01092017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "Vertex issues revenue outlook for cystic fibrosis treatments "
    },
    {
        "content": "Jan 8 Vertex Pharmaceuticals Inc said on Sunday that it expected full-year 2017 revenue from its Orkambi cystic fibrosis treatment of $1.1 billion to $1.3 billion and revenue from its Kalydeco treatment of $690 million to $710 million.",
        "date": "01092017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Vertex Pharmaceuticals revenue outlook for cystic fibrosis treatments "
    },
    {
        "content": "Massachusetts's highest court on Monday revived a lawsuit by a shareholder of Vertex Pharmaceuticals Inc seeking access to corporate records to investigate whether the drugmaker's board breached its duties to investors.",
        "date": "03202017",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "Vertex investor can proceed with records lawsuit - Mass. top court "
    },
    {
        "content": "* Q3 earnings per share view $0.18 -- Thomson Reuters I/B/E/S",
        "date": "10252016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex Pharmaceuticals Q3 adj. earnings 16 cents/share "
    },
    {
        "content": "* Announces planned initiation of phase 2 studies evaluating the next-generation correctors VX-440 and VX-152 in triple combination regimens to treat the underlying cause of cystic fibrosis",
        "date": "10252016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex says data from study of VX-152 expected in second half of 2017 "
    },
    {
        "content": "* Vertex Pharma - on oct 13 amended and expanded research  development and commercialization agreement with cystic fibrosis foundation therapeutics inc",
        "date": "10142016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex Pharma: Amended and expanded agreement with Cystic Fibrosis Foundation Therapeutics "
    },
    {
        "content": "Sept 28 Vertex Pharamceuticals Inc said the U.S. Food and Drug Administration expanded the use of its cystic fibrosis drug to treat a new subgroup of patients with the rare genetic disorder.",
        "date": "09282016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "FDA approves expanded use of Vertex Pharma's cystic fibrosis drug "
    },
    {
        "content": "Aug 22 Medivation's $14 billion sale to U.S. drug giant Pfizer Inc for a hefty premium  the largest U.S. biotechnology acquisition so far this year  had investors on Monday speculating about more dealmaking in the sector.",
        "date": "08222016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Pfizer's Medivation buy seen prescribing more biotech M&A "
    },
    {
        "content": "* Vertex and Moderna establish exclusive collaboration to discover and develop mrna therapeutics(tm) for cystic fibrosis",
        "date": "07062016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex Pharmaceuticals and Moderna collaborate to discover and develop MRNA Therapeutics for cystic fibrosis "
    },
    {
        "content": "* Deal to acquire worldwide rights to VXC-486/VXC-100 and a portfolio of innovative antibacterial compounds",
        "date": "05252016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Spero Therapeutics to acquire worldwide rights to Vertex's VXC-486/VXC-100 "
    },
    {
        "content": "* Files for potential mixed shelf; size not disclosed - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05032016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex Pharmaceuticals files for potential mixed shelf "
    },
    {
        "content": "* Q1 earnings per share view $0.29 -- Thomson Reuters I/B/E/S",
        "date": "04272016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "BRIEF-Vertex reports Q1 GAAP loss per share $0.17 including items "
    },
    {
        "content": "LONDON  March 23 A new cystic fibrosis treatment from Vertex Pharmaceuticals has been rejected as too expensive by Britain's healthcare cost agency NICE.",
        "date": "03232016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "UK cost agency says \"no\" to pricey Vertex cystic fibrosis drug "
    },
    {
        "content": "The U.S. Food and Drug Administration has denied the expanded use of Vertex Pharmaceutical Inc's bestseller  Kalydeco  in certain cystic fibrosis patients  the company said on Friday.",
        "date": "02052016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "FDA rejects expanded use of Vertex's cystic fibrosis drug "
    },
    {
        "content": "Feb 5 The U.S. Food and Drug Administration has denied the expanded use of Vertex Pharmaceutical Inc's  bestseller  Kalydeco  in certain cystic fibrosis patients  the company said on Friday.",
        "date": "02052016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "CORRECTED-FDA rejects expanded use of Vertex's cystic fibrosis drug "
    },
    {
        "content": "* Amounts to deferral of about $300 mln in U.S. revenue - analyst",
        "date": "02052016",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "UPDATE 2-FDA rejects expanded use of Vertex cystic fibrosis drug "
    },
    {
        "content": "Vertex Pharmaceuticals Inc said it received a subpoena from the U.S. Department of Justice in the third quarter related to its marketed medicines  seeking documents related primarily to its \"good laboratory practices\" in a bioanalytical lab.",
        "date": "10312015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "Vertex Pharma receives subpoena from Department of Justice "
    },
    {
        "content": "Oct 30 Vertex Pharmaceuticals Inc said it received a subpoena from the U.S. Department of Justice in the third quarter related to its marketed medicines  seeking documents related primarily to its \"good laboratory practices\" in a bioanalytical lab.",
        "date": "10312015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "UPDATE 1-Vertex Pharma receives subpoena from Department of Justice "
    },
    {
        "content": "Vertex Pharmaceuticals Inc's unique combination therapy for a rare lung disorder was given the green light by U.S. health regulators  extending the company's reach to the most common form of genetic mutation responsible for cystic fibrosis.",
        "date": "07022015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "Vertex Pharma's lung disorder therapy wins FDA nod "
    },
    {
        "content": "July 2 Vertex Pharmaceuticals Inc's  unique combination therapy for a rare lung disorder was given the green light by U.S. health regulators  extending the company's reach to the most common form of genetic mutation responsible for cystic fibrosis.",
        "date": "07022015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "UPDATE 2-Vertex Pharma's lung disorder therapy wins FDA nod "
    },
    {
        "content": "July 2 Vertex Pharmaceuticals Inc's  combination therapy for a rare lung disorder was approved by U.S. health regulators   extending the company's reach to now treat the most common form of genetic mutation responsible for cystic fibrosis.",
        "date": "07022015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Vertex Pharma's combination cystic fibrosis therapy wins FDA nod "
    },
    {
        "content": "WASHINGTON  May 12 A divided U.S. Food and Drug Administration advisory committee on Tuesday said research data does not show definitively that Vertex Pharmaceutical Inc's  drug lumacaftor has a positive effect on cystic fibrosis patients when used in combination with the company's approved therapy  Kalydeco.",
        "date": "05122015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "FDA panel fails to find Vertex lumacaftor positive for cystic fibrosis "
    },
    {
        "content": "WASHINGTON A U.S. Food and Drug Administration advisory committee on Tuesday recommended approval of Vertex Pharmaceuticals Inc's combination cystic fibrosis therapy  finding it to be safe and effective for patients ages 12 and up.",
        "date": "05122015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "FDA panel recommends Vertex cystic fibrosis treatment "
    },
    {
        "content": "WASHINGTON  May 12 A U.S. Food and Drug Administration advisory committee on Tuesday recommended approval of Vertex Pharmaceuticals Inc's combination cystic fibrosis therapy  finding it to be safe and effective for patients ages 12 and up.",
        "date": "05122015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "UPDATE 2-US FDA panel recommends Vertex cystic fibrosis treatment "
    },
    {
        "content": "* Vertex's stock up 1.7 pct in afternoon trade   (Recasts  adds details; updates shares)",
        "date": "05082015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "topStory",
        "symbol": "VRTX",
        "title": "UPDATE 2-FDA staff questions value of Vertex's cystic fibrosis combo "
    },
    {
        "content": "May 4 Corbus Pharmaceuticals Holdings Inc's  experimental drug for cystic fibrosis  a rare lung-scarring disease  could be a real money spinner and pose a challenge to rival Vertex Pharmaceuticals Inc's  successful treatment  Kalydeco.",
        "date": "05042015",
        "name": "Vertex Pharmaceuticals Incorporated",
        "news_type": "normal",
        "symbol": "VRTX",
        "title": "Tiny Corbus looks to take on Vertex with experimental lung drug "
    }
]