[
    {
        "content": "* Vistra Energy reports third quarter 2017 results  narrows 2017 guidance  and initiates 2018 guidance",
        "date": "11032017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "BRIEF-Vistra Energy Corp Q3 earnings per share $0.64​ "
    },
    {
        "content": "Texas-based electricity producer Vistra Energy Corp  is in talks to buy Dynegy Inc   the Wall Street Journal reported on Wednesday  citing people familiar with the matter.",
        "date": "10252017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "Vistra Energy in talks to buy Dynegy: WSJ "
    },
    {
        "content": "* Dynegy - upon termination of deal with Vistra Energy  under specified circumstances Vistra may be required to pay co termination fee of $100 million‍​",
        "date": "10302017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "BRIEF-Dynegy says under specified circumstances Vistra may be required to pay co termination fee of $100 mln  upon termination of deal "
    },
    {
        "content": "Oct 25 Texas-based electricity producer Vistra Energy Corp is in talks to buy Dynegy Inc  the Wall Street Journal reported on Wednesday  citing people familiar with the matter.",
        "date": "10252017",
        "name": "Vistra Energy Corp",
        "news_type": "normal",
        "symbol": "VST",
        "title": "Vistra Energy in talks to buy Dynegy - WSJ "
    },
    {
        "content": "Vistra Energy Corp  said on Monday it would buy Dynegy Inc  in an all-stock deal worth $1.74 billion  combining two Texas-based power producers in the latest merger in an industry dealing with shrinking profit margins. | Video ",
        "date": "10302017",
        "name": "Vistra Energy Corp",
        "news_type": "normal",
        "symbol": "VST",
        "title": "Vistra to buy Dynegy in $1.7 billion Texas power producer deal "
    },
    {
        "content": "* Dynegy investors to get 0.652 Vistra shares  21 pct of new firm",
        "date": "10302017",
        "name": "Vistra Energy Corp",
        "news_type": "normal",
        "symbol": "VST",
        "title": "UPDATE 3-Vistra to buy Dynegy in $1.7 billion Texas power producer deal "
    },
    {
        "content": "Oct 30 Vistra Energy will buy Dynegy Inc in an all-stock deal  the U.S. utilities said on Monday  creating a company with a market value of more than $10 billion.",
        "date": "10302017",
        "name": "Vistra Energy Corp",
        "news_type": "normal",
        "symbol": "VST",
        "title": "Vistra Energy to buy Dynegy in all-stock deal "
    },
    {
        "content": "NEW YORK  Oct 13 U.S. power firm Vistra Energy Corp said on Friday that it would shut two coal-fired plants for economic reasons  as closures in the industry continue apace despite the environment regulator saying this week he wanted to end the \"war on coal.\"",
        "date": "10132017",
        "name": "Vistra Energy Corp",
        "news_type": "normal",
        "symbol": "VST",
        "title": "Coal plant closures continue even as U.S. ends 'Clean Power Plan' "
    },
    {
        "content": "* ‍Luminant - Estimates that about 200 employees will be impacted by Big Brown closure​",
        "date": "10132017",
        "name": "Vistra Energy Corp",
        "news_type": "normal",
        "symbol": "VST",
        "title": "BRIEF-Luminant to close two Texas power plants "
    },
    {
        "content": "* Vistra to acquire corporate services business from Deutsche Bank",
        "date": "09142017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "BRIEF-Vistra to buy corporate services business from Deutsche Bank "
    },
    {
        "content": "* Vistra Energy says ‍effective Aug 17  Vistra Operations  unit of co  entered an amendment to Credit Agreement  dated Oct 3  2016​ - SEC filing",
        "date": "08172017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "BRIEF-Vistra Energy's unit enters amendment to Credit Agreement dated Oct 3  2016​ "
    },
    {
        "content": "* Vistra Energy reports second quarter 2017 results and reaffirms 2017 guidance",
        "date": "08042017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "BRIEF-Vistra Energy reports Q2 loss per share ‍$0.06 "
    },
    {
        "content": "* Vistra energy announces agreement to acquire 1 054 mw ccgt plant in odessa  texas",
        "date": "07062017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "BRIEF-Vistra Energy to acquire 1 054 MW CCGT plant in Odessa  Texas "
    },
    {
        "content": "* Qtrly net income per weighted average share of common stock outstanding $0.18 Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "BRIEF-Vistra Energy reports first quarter 2017 results "
    },
    {
        "content": "Power producer Vistra Energy Corp has proposed to take over debt-laden rival Dynegy Inc  the Wall Street Journal reported on Thursday  citing people familiar with the matter.",
        "date": "05192017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "Vistra Energy in takeover talks with Dynegy: WSJ "
    },
    {
        "content": "May 18 Power producer Vistra Energy Corp has proposed to take over debt-laden rival Dynegy Inc  the Wall Street Journal reported on Thursday  citing people familiar with the matter.",
        "date": "05192017",
        "name": "Vistra Energy Corp",
        "news_type": "normal",
        "symbol": "VST",
        "title": "Vistra Energy in takeover talks with Dynegy - WSJ "
    },
    {
        "content": "* VISTRA ENERGY ACQUIRES SOLAR DEVELOPMENT PROJECT  STRENGTHENS INTEGRATED BUSINESS MODEL",
        "date": "05172017",
        "name": "Vistra Energy Corp",
        "news_type": "topStory",
        "symbol": "VST",
        "title": "BRIEF-VISTRA ENERGY ACQUIRES UPTON COUNTY SOLAR 2 DEVELOPMENT PROJECT IN WEST TEXAS "
    }
]