[
    {
        "content": "* Qtrly ‍normalized funds from operations per diluted common share $1.04​",
        "date": "10272017",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas reports Q3 adjusted FFO per share $1.04 "
    },
    {
        "content": "* Ventas Inc - ‍Todd W. Lillibridge to transition out of top executive role in early 2018​",
        "date": "07282017",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas announces Lillibridge Healthcare Services CEO transition "
    },
    {
        "content": "* Q2 earnings per share view $0.45 -- Thomson Reuters I/B/E/S",
        "date": "07282017",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "BRIEF-Ventas reports 2017 second quarter results "
    },
    {
        "content": "* Ventas reaffirms expected sale of 36 skilled nursing facilities for $700 million to facilitate kindred healthcare’s exit from its skilled nursing segment",
        "date": "07012017",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas reaffirms expected sale of 36 skilled nursing facilities for $700 mln "
    },
    {
        "content": "* Ventas Inc - on April 25 units entered into a second amended and restated credit and guaranty agreement - SEC filing",
        "date": "04282017",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas Inc says units entered into a second amended and restated credit and guaranty agreement - sec filing "
    },
    {
        "content": "* Ventas Inc says 2017 guidance consistent with previously announced company expectations",
        "date": "04282017",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "BRIEF-Ventas Inc Q1 EPS $0.44 from continuing operations "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 27 (Fitch) Fitch Ratings has assigned 'BBB+' ratings to $400  million of 3.1% senior unsecured notes due 2023 and $400 million of 3.85% senior  unsecured notes due 2027 issued by Ventas Realty  L.P.  an operating partnership  of Ventas Inc. (NYSE: VTR). A full list of Fitch's current ratings on VTR  follows at the end of this release. KEY RATING DRIVERS The 'BBB+' rating and Stable Outlook reflect VTR's diverse portfolio",
        "date": "03272017",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "Fitch Rates Ventas' Senior Notes due 2023 and 2027 'BBB+' "
    },
    {
        "content": "* Ventas Inc - Pricing of public offering of $400 million aggregate principal amount of 3.10% senior notes due 2023",
        "date": "03222017",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas announces pricing of senior notes "
    },
    {
        "content": "* Ventas Inc in talks to buy part or all of Brookdale Senior Living Inc after  Blackstone Group LP lost interest in Brookdale- WSJ  citing sources  Source text : http://on.wsj.com/2lYm2CG Further company coverage:",
        "date": "02162017",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas in talks to buy part or all of Brookdale Senior Living - WSJ "
    },
    {
        "content": "* Ventas comments on full year 2016 expectations and issues preliminary 2017 outlook",
        "date": "01102017",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas sees FY 2017 adjusted FFO per share $4.12 to $4.18 "
    },
    {
        "content": "* Kindred Healthcare Inc - expect our exit from skilled nursing facility business to be accretive to earnings",
        "date": "11142016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Kindred announces agreements with Ventas Inc "
    },
    {
        "content": "* Ventas Inc - Kindred expected to purchase 36 ventas skilled nursing facilities for $700 million",
        "date": "11142016",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "BRIEF-Ventas reports agreements with Kindred Healthcare to facilitate Kindred's exit from the skilled nursing segment "
    },
    {
        "content": "* Commented on announcement by Kindred Healthcare Inc that it intends to exit skilled nursing facility business",
        "date": "11082016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas  Kindred continue discussions on sale of 36 Ventas-owned SNFS that Kindred operates "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 07 (Fitch) Fitch Ratings has affirmed Ventas  Inc.'s (VTR)  Issuer Default Rating (IDR) at 'BBB+'. The Rating Outlook is Stable. A full list  of rating actions follows the end of the release.  KEY RATING DRIVERS The 'BBB+' rating and Stable Outlook reflect Ventas' diverse portfolio of  healthcare properties  demonstrated and consistent access to multiple sources of  capital  adequate liquidity and deep management team.",
        "date": "10072016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "Fitch Affirms Ventas' Ratings at 'BBB+'; Outlook Stable "
    },
    {
        "content": "* To provide secured debt financing of $700 million to unit of Ardent Health Services in connection with Ardent's agreement to buy LHP Hospital Group",
        "date": "10052016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas expects loan to be accretive to 2017 normalized funds "
    },
    {
        "content": "* SEC investigation regarding co's former accounting firm's determination that it was not independent of Co completed with no action against Co",
        "date": "09262016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas believes investigation by SEC is over "
    },
    {
        "content": "* Priced a public offering of $450 million aggregate principal amount of 3.25% senior notes due 2026 at 99.811% of principal amount",
        "date": "09142016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas reports pricing of senior notes offering "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 14 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to the  senior unsecured notes due 2026 issued by Ventas Realty  L.P. (Issuer Default  Rating 'BBB+'/Outlook Stable)  the operating partnership of Ventas  Inc.  (NYSE: VTR). A full list of ratings follows at the end of this release.  KEY RATING DRIVERS The 'BBB+' rating and Stable Outlook reflect Ventas' diverse portfolio of  healthcare properties  demonstrated an",
        "date": "09142016",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "Fitch Rates Ventas' 2026 Senior Unsecured Notes 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Issued and sold 10. 2 million shares of its common stock  par value $0.25 per share - SEC filing",
        "date": "07112016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas issued and sold 10.2 mln shares of its common stock "
    },
    {
        "content": "* Total consideration for transaction is $1.5 billion plus assumption of $33 million of liabilities",
        "date": "07052016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas to buy life science and medical real estate assets of Wexford Science "
    },
    {
        "content": "* Ventas announces public offering of 9 000 000 shares of common stock",
        "date": "07052016",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "BRIEF-Ventas announces public offering of 9 mln shares of common stock "
    },
    {
        "content": "* Intends to use proceeds from offering to fund portion of $1.5 billion purchase price of real estate portfolio of Wexford Science & Technology  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07062016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas announces pricing of common stock offering "
    },
    {
        "content": "* Ventas elects Walter C. Rakowich and Roxanne M. Martino to board of directors  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06072016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas elects Walter Rakowich and Roxanne Martino to board "
    },
    {
        "content": "* Says priced a public offering of $400 million aggregate principal amount of 3.125% senior notes due 2023",
        "date": "05252016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas says priced $400 mln of 3.125% senior notes due 2023 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 25 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to the  senior unsecured notes due 2023 issued by Ventas Realty  L.P. (Issuer Default  Rating 'BBB+'/Outlook Stable)  the operating partnership of Ventas  Inc.  (NYSE: VTR). A full list of ratings follows at the end of this release.  KEY RATING DRIVERS The 'BBB+' rating and Stable Outlook reflect Ventas' diverse portfolio of  healthcare properties  demonstrated and cons",
        "date": "05252016",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "Fitch Rates Ventas' Senior Unsecured Notes due 2023 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Ventas commences tender offer for 1.55% senior notes due 2016",
        "date": "05252016",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "BRIEF-Ventas commences tender offer for 1.55% senior notes due 2016 "
    },
    {
        "content": "* Says ceo debra cafaro's  2015 total compensation was $10.9 million versus $10.1 million in 2014 - sec filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03292016",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "BRIEF-Ventas CEO Cafaro's 2015 total compensation was $10.9 mln "
    },
    {
        "content": "Ventas Inc  a healthcare real estate investment trust  is buying Ardent Medical Services Inc for $1.75 billion to expand its hospitals business at a time when more Americans are seeking healthcare services under the Affordable Care Act.",
        "date": "04062015",
        "name": "Ventas Inc",
        "news_type": "topStory",
        "symbol": "VTR",
        "title": "Ventas buys private hospital chain for $1.75 billion "
    },
    {
        "content": "April 6 Ventas Inc  a healthcare real estate investment trust  is buying Ardent Medical Services Inc for $1.75 billion to expand its hospitals business at a time when more Americans are seeking healthcare services under the Affordable Care Act.",
        "date": "04062015",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "CORRECTED-UPDATE 2-Ventas buys private hospital chain for $1.75 bln "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 06 (Fitch) Fitch Ratings has affirmed its ratings on Ventas   Inc. (NYSE: VTR) and certain rated subsidiaries (collectively  Ventas) following  the company's announcements that it intends to spin-off 355 primarily post-acute  skilled nursing facility (SNF) properties operated by regional and local care  providers (spin-off) and also acquire the real estate of Ardent Health Services  for a net value of approximately $1.4 ",
        "date": "04062015",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "Fitch Affirms Ventas  Inc.'s IDR at 'BBB+' on SNF Spin-off and Ardent Announcements; Outlook Stable "
    },
    {
        "content": "April 6 Ventas Inc said it would buy privately held hospital chain Ardent Medical Services Inc for $1.75 billion in cash.",
        "date": "04062015",
        "name": "Ventas Inc",
        "news_type": "normal",
        "symbol": "VTR",
        "title": "Ventas buys private hospital chain for $1.75 bln "
    }
]