[
    {
        "content": "Verizon Communications Inc  no. 1 U.S. wireless carrier  is close to a new deal with the National Football League for digital streaming rights  Bloomberg reported  citing people familiar with the matter.",
        "date": "11182017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon close to announcing digital streaming deal with NFL: Bloomberg "
    },
    {
        "content": "* Verizon is also in early stages of exploring acquiring parts of 21st Century Fox - CNBC  citing DJ Further company coverage:",
        "date": "11162017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon also in early stages of exploring acquiring parts of 21st Century Fox - CNBC "
    },
    {
        "content": "NEW YORK  Nov 13 AT&T Inc and Verizon Communications Inc said on Monday they have agreed to lease hundreds of new cell towers from owner and operator Tillman Infrastructure  a move they hope will give them more leverage in negotiations with major U.S. tower vendors.",
        "date": "11132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AT&T  Verizon strike tower agreement in effort to diversify vendors "
    },
    {
        "content": "* Company  ‍AT&T & Tillman Infrastructure have entered joint agreement to build hundreds of cell towers​",
        "date": "11132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon  ‍AT&T  Tillman Infrastructure enter agreement to build cell towers​ "
    },
    {
        "content": "WASHINGTON  Nov 8 Former Yahoo Chief Executive Marissa Mayer apologized on Wednesday for two massive data breaches at the internet company  blaming Russian agents for at least one of them  at a hearing on the growing number of cyber attacks on major U.S. companies.",
        "date": "11092017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Former Yahoo CEO apologizes for data breaches  blames Russians "
    },
    {
        "content": "* Mariana Agathoklis named communications Vice President at Verizon Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon names Mariana Agathoklis as VP of communications "
    },
    {
        "content": "* Oath  a unit of Verizon  says launches board of advisors chaired by Serena Williams​ Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Oath  a unit of Verizon  says launches board of advisors chaired by Serena Williams​ "
    },
    {
        "content": "SAN FRANCISCO  Nov 1 Chipmaker Qualcomm Inc and private equity firm JMC Capital Partners are looking to sell their stakes in a joint venture that operates more than 1 300 free WiFi kiosks fashioned from old phone booths around New York City  according to people familiar with the matter.",
        "date": "11022017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Qualcomm  JMC seek to exit Alphabet-backed New York WiFi project -sources "
    },
    {
        "content": "* Verizon to redeem debt securities Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to redeem debt securities "
    },
    {
        "content": "WASHINGTON AT&T Inc   Verizon Communications Inc  and T-Mobile US Inc  are being awarded a U.S. defense contract worth $199 million for wireless services and devices  the Pentagon said on Monday.",
        "date": "10302017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "AT&T  Verizon  T-Mobile win $994 million U.S. defense contract: Pentagon "
    },
    {
        "content": "SoftBank Group Corp and Deutsche Telekom AG have reached an impasse in their talks to merge Sprint Corp and T-Mobile US Inc  sources said  sending shares in the Japanese Internet giant sliding. | Video ",
        "date": "10312017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "SoftBank  Deutsche Telekom hit wall in Sprint  T-Mobile talks: sources "
    },
    {
        "content": "WASHINGTON  Oct 30 AT&T Inc  Verizon Communications Inc and T-Mobile US Inc are being awarded a U.S. defense contract worth $199 mln for wireless services and devices  the Pentagon said on Monday.",
        "date": "10302017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AT&T  Verizon  T-Mobile win $994 mln U.S. defense contract -Pentagon "
    },
    {
        "content": "Oct 30 SoftBank Group Corp and Deutsche Telekom AG have reached an impasse in their talks to merge Sprint Corp and T-Mobile US Inc  sources said  sending shares in the Japanese Internet giant sliding.",
        "date": "10312017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 5-SoftBank  Deutsche Telekom hit wall in Sprint  T-Mobile talks -sources "
    },
    {
        "content": "* Verizon announces expiration and results of its tender offers for five series of its notes",
        "date": "10242017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon announces expiration and results of tender offers for 5 series of notes "
    },
    {
        "content": "Corning Inc  posted its sixth straight quarter of profit and revenue beat as demand remained strong for its flagship Gorilla Glass used in smartphones and its fiber optic products from telecom companies looking to upgrade their networks.",
        "date": "10242017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Gorilla Glass fuels Corning's profit  revenue beat "
    },
    {
        "content": "* Shares rise as much as 6.6 pct (Adds CEO  analyst comment; updates share movement)",
        "date": "10242017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Gorilla Glass fuels Corning's profit  revenue beat "
    },
    {
        "content": "NEW YORK Verizon Communications Inc's  quarterly revenue topped Wall Street analyst estimates on Thursday and the company added more phone subscribers than expected  sending shares of the No. 1 U.S. wireless carrier up in mid-morning trading. | Video ",
        "date": "10192017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon quarterly revenue tops estimates as subscribers rise "
    },
    {
        "content": "NEW YORK  Oct 19 Verizon Communications Inc's quarterly revenue topped Wall Street analyst estimates on Thursday and the company added more phone subscribers than expected  sending shares of the No. 1 U.S. wireless carrier up in mid-morning trading. Verizon has struggled to fend off smaller rivals T-Mobile US Inc and Sprint Corp in a mature market for wireless service.",
        "date": "10192017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Verizon quarterly revenue tops estimates as subscribers rise "
    },
    {
        "content": "NEW YORK  Oct 19 Verizon Communications Inc's quarterly profit met Wall Street analyst estimates as the No. 1 U.S. wireless carrier added subscribers.",
        "date": "10192017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon quarterly profit meets estimates as subscribers rise "
    },
    {
        "content": "* Q3 earnings per share view $0.98 -- Thomson Reuters I/B/E/S",
        "date": "10192017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications Q3 adj. EPS $0.98 "
    },
    {
        "content": "* Verizon says will offer iPhone X for pre-order beginning October 27​ Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to offer iPhone X for pre-order beginning Oct. 27​ "
    },
    {
        "content": "* Verizon files final term sheet related to offering of €1.25 billion 1.375% notes due 2026  €750 million 1.875% notes due 2029  €1.5 billion 2.875% notes due 2038",
        "date": "10232017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon files final term sheet related to offering of €1.25 bln 1.375 pct notes due 2026 "
    },
    {
        "content": "* Verizon announces pricing terms of its tender offers for five series of its notes",
        "date": "10232017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon prices tender offers for five series of notes "
    },
    {
        "content": "WASHINGTON Verizon Communications Inc  said on Tuesday it will pay $17.7 million to resolve a probe by U.S. regulators and the Justice Department into potential payment violations related to a federal school broadband program.",
        "date": "10172017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon to pay $17.7 million to resolve school broadband probe "
    },
    {
        "content": "Oct 17 Spanish language broadcaster Univision Communications Inc has sent a letter to the U.S. media regulator lambasting Verizon Communications Inc for pulling its networks from 4.7 million of its customers on Monday without warning.",
        "date": "10172017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Univision appeals to regulator after Verizon pulls the plug "
    },
    {
        "content": "Oct 17 Spanish language broadcaster Univision Communications Inc has sent a letter to the U.S. media regulator lambasting Verizon Communications Inc for pulling Univision's networks from 4.7 million of its customers on Monday without warning.",
        "date": "10172017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Univision appeals to regulator after Verizon pulls the plug "
    },
    {
        "content": "* Verizon announces tender offers for five series of its notes",
        "date": "10162017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon announces tender offers for five series of its notes "
    },
    {
        "content": "* LICT Corp - announces filing of legal action by PTPMS Communications against Straight Path Communications to obtain amount related to wireless licenses​",
        "date": "10102017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-LICT announces PTPMS Communications' filing for legal action against Straight Path Communications "
    },
    {
        "content": "WASHINGTON  Oct 10 Verizon Communication Inc media chief Marni Walden confirmed on Tuesday she had decided to leave the telecommunications company next year after it became clear she would not become its next chief executive.",
        "date": "10102017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon media chief departing after not getting top job "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Yahoo is like a zombie feasting on Verizon’s brains. Marni Walden  a top executive at the $200 billion U.S. telecom group  is leaving just a day after the internet firm she helped to acquire tripled its tally of customer accounts exposed to a 2013 hack. While the company suggests the timing is a coincidence  it’s clear that Yahoo is a problem that continues to fester.",
        "date": "10052017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Breakingviews - Yahoo’s corpse keeps festering at Verizon "
    },
    {
        "content": "WASHINGTON The chairman of the U.S. Senate Commerce Committee said on Tuesday he plans to hold a hearing later this month over massive data breaches at Equifax Inc  and Yahoo  which is now owned by Verizon Communications Inc .",
        "date": "10042017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Senate panel to hold hearing on Yahoo  Equifax breaches "
    },
    {
        "content": "Verizon Communications Inc  on Wednesday said Marni Walden  executive vice president and president of global media  will leave the company in February 2018.",
        "date": "10042017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon's media head Marni Walden to leave "
    },
    {
        "content": "Oct 4 Verizon Communications Inc on Wednesday said Marni Walden  executive vice president and president of global media  will leave the company in February 2018.",
        "date": "10042017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon's media head Marni Walden to leave "
    },
    {
        "content": "Oct 4 Verizon Communications Inc on Wednesday said Marni Walden  executive vice president and president  global media  will leave the company in February 2018.",
        "date": "10042017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon's media head to leave company in February "
    },
    {
        "content": "* Marni Walden  EVP and president of global media  announces plans to leave Verizon",
        "date": "10042017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon- Marni Walden  EVP and president of global media  announces plans to leave "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_10042017.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     10:00 am: Oil Minister Dharmendra Pradhan to address India Gas Infrastructure Conference 2017 in New Delhi.     10:00 am: Godrej Agrovet IPO opens for subscriptions in Mumbai.     10:30 am: Cabinet l",
        "date": "10042017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Morning News Call - India  October 4 "
    },
    {
        "content": "WASHINGTON  Sept 26 U.S. Senate Majority Leader Mitch McConnell on Tuesday moved to force the Senate to vote later this week on the nomination of Federal Communications Commission Chairman Ajit Pai to serve another five-year term.",
        "date": "09262017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. Senate plans to vote on FCC chairman tenure this week "
    },
    {
        "content": "* We announced Wide Open West few weeks ago   deals with corning  straight path   XO acquisition set us up  well for 5G environment-CEO",
        "date": "09142017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon CEO says moved on from potentially acquiring a cable company "
    },
    {
        "content": "Verizon Communications Inc  said on Thursday that it has moved on from plans to acquire cable companies and instead will focus on building out its own fiber infrastructure.",
        "date": "09142017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon has moved on from plans to acquire cable companies: CEO "
    },
    {
        "content": "Sept 14 Verizon Communications Inc said on Thursday that it has moved on from plans to acquire cable companies and instead will focus on building out its own fiber infrastructure.",
        "date": "09142017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon has moved on from plans to acquire cable companies - CEO "
    },
    {
        "content": "* Says co  Sprint  T-Mobile and Verizon are joining forces to create a mobile authentication taskforce​",
        "date": "09082017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-AT&T  Sprint  T-Mobile and Verizon team up to develop mobile authentication solution "
    },
    {
        "content": "* Says ‍declared quarterly dividend of 59 cents per outstanding share  an increase of 1.25 cents per share  or 2.2 percent  from previous quarter​ Source text for Eikon: Further company coverage:",
        "date": "09072017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon increases qtrly dividend by 2.2 pct to $0.59/ outstanding share "
    },
    {
        "content": "A U.S. judge said Yahoo must face nationwide litigation brought on behalf of well over 1 billion users who said their personal information was compromised in three massive data breaches.",
        "date": "08312017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Yahoo must face litigation by data breach victims: U.S. judge "
    },
    {
        "content": "Aug 31 A U.S. judge said Yahoo must face nationwide litigation brought on behalf of well over 1 billion users who said their personal information was compromised in three massive data breaches.",
        "date": "08312017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo must face litigation by data breach victims -U.S. judge "
    },
    {
        "content": "* Verizon - ‍will redeem certain series of notes on September 22  2017​ Source text for Eikon: Further company coverage:",
        "date": "08232017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to redeem debt securities "
    },
    {
        "content": "NEW YORK  Aug 22 Verizon Communications Inc said on Tuesday that it was introducing a cheaper unlimited mobile data plan with some limits as it tries to lure customers away from rival wireless carriers.",
        "date": "08222017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon launches cheaper unlimited plan to compete with rivals "
    },
    {
        "content": "* Verizon announces an increase to the waterfall cap in  early participation results of  and election of early settlement for  its tender offers for 29 series of notes of Verizon and certain of its subsidiaries",
        "date": "08142017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to increase waterfall cap in its tender offers "
    },
    {
        "content": "* Verizon announces accepted amounts and pricing terms of its tender offers for 29 series of notes of verizon and certain of its subsidiaries",
        "date": "08152017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon says has increased waterfall cap from $1.5 bln to $2.12 bln "
    },
    {
        "content": "* Straight Path Communications Inc - ‍approximately 99% votes cast at special meeting of stockholders were in favor of proposal​ Source text for Eikon: Further company coverage:",
        "date": "08022017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Straight Path stockholders approve merger with Verizon "
    },
    {
        "content": "* Named an enterprise infrastructure solutions (EIS) contract solutions provider by U.S. General services administration​ Source text for Eikon: Further company coverage:",
        "date": "08022017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon ‍named EIS contract solutions provider by U.S. General services administration​ "
    },
    {
        "content": "SYDNEY  Aug 4 (IFR) - Verizon Communications (Baa1/BBB+/A–) has reopened Australia's Kangaroo bond market for global corporate issuers with a stunning four-tranche print that can only encourage further issuance from offshore blue chips.",
        "date": "08042017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon stuns Kangaroo market with debut bond print Down Under "
    },
    {
        "content": "* Verizon- to purchase fiber network infrastructure in Chicago market from Wideopenwest; deal for $225 million‍​",
        "date": "08012017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to purchase infrastructure in Chicago market from Wideopenwest "
    },
    {
        "content": "* Wideopenwest Inc - to sell Chicago Fiber Network to Verizon​‍​",
        "date": "08012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Wideopenwest Inc to sell Chicago Fiber Network to Verizon​‍​ "
    },
    {
        "content": "* Verizon announces tender offers for 29 series of notes of verizon and certain of its subsidiaries",
        "date": "08012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon reports tender offers for 29 series of notes of co and certain units "
    },
    {
        "content": "* Verizon - ‍new Moto Z(2) force edition available for preorder from Verizon on Tuesday​ Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon says ‍new Moto Z(2) Force edition available for preorder from Verizon "
    },
    {
        "content": "* Globetouch and Verizon Telematics to work with General Motors for OnStar expansion Source text for Eikon: Further company coverage:",
        "date": "07242017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Globetouch and Verizon Telematics to work with General Motors for OnStar expansion "
    },
    {
        "content": "U.S. wireless carrier Verizon Communications Inc  is in talks to acquire cable operator WideOpenWest Inc's  fiber network in the Chicago area for more than $200 million  according to people familiar with the matter.",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon in talks to buy WideOpenWest's Chicago network: sources "
    },
    {
        "content": "July 27 U.S. wireless carrier Verizon Communications Inc is in talks to acquire cable operator WideOpenWest Inc's fiber network in the Chicago area for more than $200 million  according to people familiar with the matter.",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon in talks to buy WideOpenWest's Chicago network -sources "
    },
    {
        "content": "* Dow up 0.19 pct  S&P off 0.05 pct  Nasdaq down 0.22 pct (Updates to early afternoon)",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St trims gains as tech stocks weigh "
    },
    {
        "content": "Verizon Communications Inc reported quarterly revenue that topped expectations on Thursday as the No. 1 U.S. wireless carrier attracted more subscribers with its unlimited data plan. | Video ",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon quarterly subscriber additions top estimates; shares up "
    },
    {
        "content": "* Indexes up: Dow 0.30 pct  S&P 0.12 pct  Nasdaq 0.37 pct (Updates to open)",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Facebook  Verizon power Wall St to record levels "
    },
    {
        "content": "NEW YORK  July 27 Comcast Corp on Thursday reported quarterly results that topped analysts' estimates on higher revenue in its filmed entertainment and theme parks businesses  even as the No. 1 U.S. cable operator lost more video subscribers.",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Comcast 2nd-qtr results top estimates on film  theme parks growth "
    },
    {
        "content": "July 27 Verizon Communications Inc reported quarterly revenue that topped expectations on Thursday as the No. 1 U.S. wireless carrier attracted more subscribers with its unlimited data plan.",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Verizon quarterly subscriber additions top estimates; shares up "
    },
    {
        "content": "July 27 Verizon Communications Inc's quarterly revenue rose marginally  its first increase in four quarters  as the No. 1 U.S. wireless carrier attracted more subscribers with its unlimited data plans.",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-Verizon's revenue rises for first time in 4 quarters "
    },
    {
        "content": "* Q2 adjusted non-gaap earnings per share $0.96 excluding items",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications Q2 earnings per share $1.07 "
    },
    {
        "content": "NEW YORK Comcast Corp's  quarterly results topped Wall Street analysts' estimates on higher revenue in its filmed entertainment and theme parks businesses  even as the No. 1 U.S. cable operator lost video subscribers.",
        "date": "07272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Comcast results top estimates on film  theme parks growth "
    },
    {
        "content": "* Verizon - Able to confirm that only access to cloud storage area by a person other than Verizon or its vendor was a researcher who brought this issue to co's attention",
        "date": "07122017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon says records contained in the data set pertained to 6 mln unique customers "
    },
    {
        "content": "NEW YORK/WASHINGTON  July 12 Facebook Inc   Twitter Inc  Alphabet Inc and dozens of other major technology companies protested online on Wednesday against proposed changes to U.S. net neutrality rules that prohibit broadband providers from giving or selling access to certain internet services over others.",
        "date": "07122017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Tech firms protest proposed changes to U.S. net neutrality rules "
    },
    {
        "content": "June 19 Shares of Altaba Inc  the holding company left behind after Yahoo Inc's sale of its core internet business to Verizon Communications Inc  will begin trading on the Nasdaq on Monday.",
        "date": "06192017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Altaba  formerly Yahoo  to start trading on Monday "
    },
    {
        "content": "Verizon Communications Inc  said on Thursday it expected to incur about $500 million in pre-tax expenses in the second quarter as a result of its $4.48 billion purchase of Yahoo Inc's  core business.",
        "date": "06152017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon to incur $500 million in pre-tax costs from Yahoo deal "
    },
    {
        "content": "June 15 Verizon Communications Inc said on Thursday it expected to incur about $500 million in pre-tax expenses in the second quarter as a result of its $4.48 billion purchase of Yahoo Inc's core business.",
        "date": "06152017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon to incur $500 mln in pre-tax costs from Yahoo deal "
    },
    {
        "content": "* Expects to record severance  acquisition and integration related expenses of approximately $500 million pre-tax in Q2 of 2017",
        "date": "06152017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon expects to record expenses of about $500 mln pre-tax in Q2 "
    },
    {
        "content": "June 15 Verizon Communications Inc said on Thursday it expected to incur about $500 million in pre-tax expenses in the second quarter as a result of its $4.48 billion purchase of Yahoo Inc's core business.",
        "date": "06152017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to incur $500 mln in pre-tax costs from Yahoo deal "
    },
    {
        "content": "Verizon Communications Inc  said on Tuesday it closed its $4.48 billion acquisition of Yahoo Inc's  core business and that Marissa Mayer  chief executive of the internet  company  had resigned. | Video ",
        "date": "06142017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon closes Yahoo deal  Mayer steps down "
    },
    {
        "content": "June 13 Verizon Communications Inc said on Tuesday it closed its $4.48 billion acquisition of Yahoo Inc's core business and that Marissa Mayer  chief executive of the internet  company  had resigned.",
        "date": "06132017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon closes Yahoo deal  Mayer steps down "
    },
    {
        "content": "June 13 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "June 13 Verizon Communications Inc said on Tuesday it closed its $4.48 billion acquisition of Yahoo Inc's core business and that Marissa Mayer  chief executive of the internet company  had resigned.",
        "date": "06132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon closes Yahoo deal; Mayer steps down "
    },
    {
        "content": "* Verizon completes Yahoo acquisition  creating a diverse house of 50+ brands under new Oath subsidiary",
        "date": "06132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon completes Yahoo acquisition  Mayer resigns from Yahoo "
    },
    {
        "content": "Verizon Communications Inc  is expected to cut about 2 000 jobs when it completes its $4.48 billion acquisition of Yahoo Inc's  core assets next week  a person briefed on the matter said.",
        "date": "06082017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon plans to cut 2 000 jobs at Yahoo  AOL: source "
    },
    {
        "content": "June 8 Verizon Communications Inc is expected to cut about 2 000 jobs when it completes its $4.48 billion acquisition of Yahoo Inc's core assets next week  a person briefed on the matter said.",
        "date": "06082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon plans to cut 2 000 jobs at Yahoo  AOL -source "
    },
    {
        "content": "June 8 Yahoo Inc shareholders on Thursday approved the company's pending sale of its core internet business to Verizon Communications Inc for $4.48 billion  according to preliminary results from a shareholder meeting.",
        "date": "06082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo shareholders approve sale of core business to Verizon "
    },
    {
        "content": "June 8 Verizon Communications Inc is expected to cut about 2 000 jobs when it completes its $4.48 billion acquisition of Yahoo Inc's core assets next week  a person briefed on the matter said.",
        "date": "06082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon plans to cut about 2 000 jobs at Yahoo  AOL - source "
    },
    {
        "content": "* Yahoo stockholders approve sale of Yahoo’s operating business to Verizon",
        "date": "06082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Yahoo stockholders approve sale of Yahoo’s operating business to Verizon "
    },
    {
        "content": "* Verizon to redeem debt securities Source text for Eikon: Further company coverage:",
        "date": "05312017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to redeem debt securities "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 01 (Fitch) Fitch Ratings has affirmed the 'A-' Long-Term Issuer Default Ratings (IDRs) and senior unsecured debt ratings for Verizon Communications Inc. (Verizon; NYSE: VZ) and its subsidiaries. Fitch has also affirmed Verizon's Short-Term IDR and commercial paper (CP) ratings at 'F2'. The Rating Outlook remains Stable. A full list of ratings actions follows at the end of this release. KEY RATING DRIVERS Competitive Positi",
        "date": "06012017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Fitch Affirms Verizon's IDR at 'A-'; Outlook Stable "
    },
    {
        "content": "* Sets quarterly dividend of $0.5775 per share Source text for Eikon: Further company coverage:",
        "date": "06012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon sets quarterly dividend of $0.5775 per share "
    },
    {
        "content": "* Verizon CEO Lowell McAdam at JPM conference- building fiber infrastructure better than the alternative of buying spectrum",
        "date": "05222017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon CEO says Yahoo deal expected to close around mid-June- JPM conference "
    },
    {
        "content": "May 18 The U.S. Federal Communications Commission voted 2-1 on Thursday to advance a Republican plan to reverse the Obama administration's 2015 \"net neutrality\" order.",
        "date": "05182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-U.S. FCC votes 2-1 to advance repeal of Obama-era internet rules "
    },
    {
        "content": "The U.S. Federal Communications Commission voted 2-1 on Thursday to advance a Republican plan to reverse the Obama administration's 2015 \"net neutrality\" order.",
        "date": "05182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC votes 2-1 to advance repeal of Obama-era internet rules "
    },
    {
        "content": "May 18 The U.S. Federal Communications Commission will hold an initial vote on Thursday on a Republican plan to reverse the Obama administration's 2015 \"net neutrality\" order.",
        "date": "05182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC to take initial vote to roll back Obama-era internet rules "
    },
    {
        "content": "Yahoo Inc said on Tuesday it would buy back up to $3 billion shares through a tender offer to provide liquidity to stockholders looking to sell the stock ahead of the company's pending deal with Verizon Communications Inc.",
        "date": "05162017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Yahoo to buy back $3 billion shares in tender offer "
    },
    {
        "content": "May 16 Yahoo Inc said on Tuesday it would buy back up to $3 billion shares through a tender offer to provide liquidity to stockholders looking to sell the stock ahead of the company's pending deal with Verizon Communications Inc.",
        "date": "05162017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Yahoo to buy back $3 bln shares in tender offer "
    },
    {
        "content": "May 16 Yahoo Inc said on Tuesday it would buy back $3 billion of its common shares  ahead of the company's pending deal with Verizon Communications Inc.",
        "date": "05162017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-Yahoo to buy back $3 bln shares "
    },
    {
        "content": "* Verizon internotes will be senior unsecured obligations of Verizon and may be offered on a recurring basis",
        "date": "05152017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon launches retail notes program "
    },
    {
        "content": "* voip-pal.com announces plans to increase damage demands in lawsuits versus Apple  Verizon and AT&T",
        "date": "05152017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Voip-Pal.Com plans to increase damage demands in lawsuits versus Apple  Verizon and AT&T "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 12 (Fitch) Fitch Ratings has assigned an 'A-' rating to Verizon Communications Inc.'s (NYSE: VZ) issuance of $1.5 billion senior unsecured floating rate notes due 2020. Proceeds will be used for general corporate purposes  which may include the repayment of outstanding debt. Verizon's Long-Term Issuer Default Rating (IDR) is 'A-'  and the Rating Outlook is Stable. KEY RATING DRIVERS Competitive Position: The ratings are sup",
        "date": "05122017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Fitch Rates Verizon's Sr. Unsecured Offering 'A-'; Outlook Stable "
    },
    {
        "content": "* Offering $1.5 billion of floating rate notes due 2020 - sec filing",
        "date": "05122017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon offering $1.5 bln of floating rate notes due 2020 "
    },
    {
        "content": "May 12 U.S. wireless spectrum holder Globalstar Inc is working with financial advisers on a potential sale of the company  according to sources familiar with the matter.",
        "date": "05122017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Wireless spectrum holder Globalstar explores sale -sources "
    },
    {
        "content": "NEW YORK Verizon Communications Inc  does not see an urgent need to undertake a big strategic merger or acquisition  its chief executive said on Monday  as some Wall Street analysts have urged the wireless company to do.",
        "date": "05082017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon does not feel pressure to do big deal: CEO "
    },
    {
        "content": "* Straight Path - upon termination of Verizon merger  under certain circumstances  co may be required to pay Verizon termination fee equal to $38 million",
        "date": "05112017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Straight Path says co may be required to pay Verizon a fee of $38 mln upon termination of merger "
    },
    {
        "content": "NEW YORK  May 8 Verizon Communications Inc does not see an urgent need to undertake a big strategic merger or acquisition  its chief executive said on Monday  as some Wall Street analysts have urged the wireless company to do.",
        "date": "05082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon does not feel pressure to do big deal -CEO "
    },
    {
        "content": "* Verizon won't talk about hypothetical deals - ceo at analyst meeting",
        "date": "05082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon won't talk about hypothetical deals - ceo at analyst meeting "
    },
    {
        "content": "Verizon Communications Inc  snapped up wireless spectrum holder Straight Path Communications Inc  in a $3.1 billion deal  roughly double rival AT&T's  initial offer  as Verizon seeks an advantage in the race toward a 5G network. | Video ",
        "date": "05112017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon beats AT&T to buy spectrum holder Straight Path "
    },
    {
        "content": "May 11 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "05112017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Straight Path Communications Inc  said on Monday an unnamed telecommunications company had raised its offer to buy the wireless spectrum holder  in the latest move in a bidding war with AT&T Inc .",
        "date": "05082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Straight Path gets higher offer from unnamed bidder "
    },
    {
        "content": "May 11 Verizon Communications Inc snapped up wireless spectrum holder Straight Path Communications Inc in a $3.1 billion deal  roughly double rival AT&T's initial offer  as Verizon seeks an advantage in the race toward a 5G network.",
        "date": "05112017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-Verizon beats AT&T to buy spectrum holder Straight Path "
    },
    {
        "content": "May 11 Straight Path Communications Inc said it agreed to be bought by No.1 U.S. wireless carrier Verizon Communications Inc for an enterprise value of about $3.1 billion.",
        "date": "05112017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Straight Path to be bought by Verizon "
    },
    {
        "content": "May 8 Straight Path Communications Inc said on Monday an unnamed telecommunications company had raised its offer to buy the wireless spectrum holder  in the latest move in a bidding war with AT&T Inc.",
        "date": "05082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Straight Path gets higher offer from unnamed bidder "
    },
    {
        "content": "* Will provide around 17 million kilometres of fibre-optic cables to U.S. phone group Verizon over the next three years Source text for Eikon: Further company coverage: (Reporting by Milan Newsroom)",
        "date": "05082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Prysmian to sell fibre-optic cables to Verizon for $300 mln "
    },
    {
        "content": "* Verizon to enter into definitive agreement to acquire Straight Path Communications for $184.00 per share in all stock deal; Straight Path Communications to terminate definitive agreement with AT&T",
        "date": "05112017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to acquire Straight Path Communications for an enterprise value of about $3.1 bln "
    },
    {
        "content": "* Verizon Communications to buy Straight Path Communications for more than $3 billion  after beating rival AT&T Inc in bidding war - WSJ  citing sources Source text : http://on.wsj.com/2q53KVc",
        "date": "05112017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to buy Straight Path for more than $3 billion- WSJ "
    },
    {
        "content": "Comcast Corp and Charter Communications Inc will announce a wireless partnership on Monday  according to a source familiar with the matter  as the cable providers prepare to enter a highly competitive and oversaturated market for mobile service in the United States.",
        "date": "05082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Comcast  Charter to announce wireless partnership on Monday: source "
    },
    {
        "content": "May 7 Comcast Corp and Charter Communications Inc will announce a wireless partnership on Monday  according to a source familiar with the matter  as the cable providers prepare to enter a highly competitive and oversaturated market for mobile service in the United States.",
        "date": "05082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-Comcast  Charter to announce wireless partnership on Monday -source "
    },
    {
        "content": "WASHINGTON  May 7 Francis Ford Coppola  director of classic films such as \"The Godfather\" and \"Apocalypse Now \" has sent a letter to the top U.S. telecommunications regulator to urge support for \"net neutrality \" which prevents internet companies from blocking  throttling or giving \"fast lanes\" to particular websites.",
        "date": "05082017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Director Francis Ford Coppola weighs in on preserving net neutrality "
    },
    {
        "content": "* Verizon - in Q1 earnings release  co indicated it was on track for return to pre-vodafone credit rating profile by 2018-2019 timeframe",
        "date": "05052017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon no longer expects to be able to achieve an upgrade to pre-vodafone credit rating in 2018-2019 timeframe "
    },
    {
        "content": "WASHINGTON A federal appeals court on Monday declined to rehear a challenge to the Obama administration's landmark \"net neutrality\" rules requiring internet providers to guarantee equal access to all websites.",
        "date": "05012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. appeals court will not rehear 'net neutrality' challenge "
    },
    {
        "content": "WASHINGTON  May 1 A federal appeals court on Monday declined to rehear a challenge to the Obama administration's landmark \"net neutrality\" rules requiring internet providers to guarantee equal access to all websites.",
        "date": "05012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-U.S. appeals court will not rehear 'net neutrality' challenge "
    },
    {
        "content": "* Verizon launches software-defined perimeter service to help enterprises proactively prevent cyberattacks Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon launches software-defined perimeter service "
    },
    {
        "content": "WASHINGTON  April 27 The head of the Federal Communications Commission on Thursday released a 58-page draft plan to reverse the landmark 2015 \"net neutrality\" order and disclosed the agency may withdraw \"bright line\" rules barring internet companies from blocking  throttling or giving \"fast lanes\" to some websites.",
        "date": "04272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC chief unveils plan to scrap Obama-era internet rules "
    },
    {
        "content": "NEW YORK  April 27 Comcast Corp quarterly profit topped estimates as the No. 1 U.S. cable operator added video subscribers  and movies such as \"Fifty Shades Darker\" and \"Get Out\" drove an increase in filmed entertainment revenue.",
        "date": "04272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Comcast profit tops estimates on video subscribers  film success "
    },
    {
        "content": "April 26 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04262017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "PRESS DIGEST - Wall Street Journal - April 26 "
    },
    {
        "content": "Verizon Communications Inc  has made an offer for Straight Path Communications Inc   topping an earlier bid from AT&T Inc   in a move that starts a bidding war for a company holding spectrum used in 5G technology  according to a source familiar with the matter.",
        "date": "04252017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon's bid challenges AT&T's offer for Straight Path: source "
    },
    {
        "content": "* Launched FIOS Gigabit connection priced at $69.99 a month standalone and starting at $79.99 a month for triple play bundle when ordered online Source text for Eikon: Further company coverage:",
        "date": "04242017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon launch FIOS Gigabit connection priced at $69.99 a month standalone "
    },
    {
        "content": "* Straight Path shares up 12.5 pct (Adds analyst comment  adds detail on share price)",
        "date": "04252017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Verizon's bid challenges AT&T's offer for Straight Path -source "
    },
    {
        "content": "April 25 Straight Path Communications Inc said on Tuesday it received a $104.64 per-share all-stock buyout offer from a \"multi-national telecommunications company\"  which it said was superior to AT&T Inc's offer of $95.63 per share.",
        "date": "04252017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Straight Path receives \"superior\" offer to AT&T's buyout bid "
    },
    {
        "content": "WASHINGTON  April 24 The head of the U.S. Federal Communications Commission is expected to unveil his strategy this week to overturn landmark 2015 net neutrality rules  a move that will kickoff a new battle over the future of the internet.",
        "date": "04242017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "FCC chairman expected to unveil strategy to reverse net neutrality -sources "
    },
    {
        "content": "Verizon reported its first-ever quarterly loss of subscribers  even as it offered an unlimited data plan in an attempt to fend off smaller rivals like T-Mobile US and Sprint.",
        "date": "04202017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Business Watch: A first for Verizon "
    },
    {
        "content": "Verizon Communications Inc  on Thursday reported its first-ever quarterly loss of subscribers  even as it offered an unlimited data plan  raising questions on whether the No. 1 U.S. wireless carrier may need a larger acquisition than Yahoo to diversify its business. | Video ",
        "date": "04202017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon profit  revenue miss Wall Street view as subscribers dash "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Verizon's M&A signal is starting to come in a little clearer. The U.S. telecommunications titan reported a 20 percent drop in quarterly profit as a new sales initiative failed to attract customers. Its strategy behind buying AOL and Yahoo is perplexing. All of it probably helps explain why Chief Executive Lowell McAdam just indicated he's open to the idea of a bigger deal.",
        "date": "04202017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon's M&A signal comes in a little clearer "
    },
    {
        "content": "April 20 Verizon Communications Inc on Thursday reported its first-ever quarterly loss of subscribers  even as it offered an unlimited data plan  raising questions on whether the No. 1 U.S. wireless carrier may need a larger acquisition than Yahoo to diversify its business.",
        "date": "04202017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Verizon profit  revenue miss Wall Street view as subscribers dash "
    },
    {
        "content": "* Q1 revenue $29.8 billion versus i/b/e/s view $30.77 billion",
        "date": "04202017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications Q1 earnings per share $0.84 "
    },
    {
        "content": "April 20 Verizon Communications Inc  the No. 1 U.S. wireless carrier  reported a 20 percent fall in quarterly profit as it lost wireless postpaid subscribers despite the re-launch of unlimited data plans.",
        "date": "04202017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon reports 20 pct fall in quarterly profit "
    },
    {
        "content": "NEW YORK Verizon Communications Inc has agreed to buy optical fiber from Corning Inc for at least $1.05 billion over the next three years as the No. 1 U.S. wireless carrier aims to improve its network infrastructure  the companies said on Tuesday.",
        "date": "04182017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon  Corning agree to $1.05 billion fiber deal "
    },
    {
        "content": "Yahoo Inc  reported a 22.1 percent increase in quarterly revenue on Tuesday  ahead of the sale of its core internet business to Verizon Communications Inc .",
        "date": "04182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo's first-quarter revenue jumps 22 percent "
    },
    {
        "content": "NEW YORK  April 18 Verizon Communications Inc has agreed to buy optical fiber from Corning Inc for at least $1.05 billion over the next three years as the No. 1 U.S. wireless carrier aims to improve its network infrastructure  the companies said on Tuesday.",
        "date": "04182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon  Corning agree to $1.05 bln fiber deal "
    },
    {
        "content": "April 18 Yahoo Inc reported a 22.1 percent increase in quarterly revenue on Tuesday  ahead of the sale of its core internet business to Verizon Communications Inc .",
        "date": "04182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo's 1st-qtr revenue jumps 22 pct "
    },
    {
        "content": "April 18 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  April 18 Verizon Communications Inc has agreed to buy optical fiber from Corning Inc for at least $1.05 billion over the next three years as the No. 1 U.S. wireless carrier aims to improve its network infrastructure  the companies said on Tuesday.",
        "date": "04182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon  Corning agree to $1.05 bln fiber deal "
    },
    {
        "content": "* Verizon agrees to $1.05 billion three-year minimum purchase agreement with Corning for next-generation optical solutions",
        "date": "04182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon signs 3-year minimum purchase deal with Corning for fiber optic cable "
    },
    {
        "content": "* Verizon agrees to $1.05 billion fiber-optic cable deal to grow its Fios platform - CNBC",
        "date": "04182017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon  Corning agree to three-year fiber deal for $1.05 bln - CNBC "
    },
    {
        "content": "April 13 Verizon Communications Inc is considering making a buyout offer for Straight Path Communications Inc which would top AT&T Inc's $1.25 billion bid  people familiar with the matter said.",
        "date": "04142017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon considering topping AT&T's bid for Straight Path -sources "
    },
    {
        "content": "NEW YORK  April 13 T-Mobile US Inc bid $8 billion and Dish Network Corp $6.2 billion to win the bulk of broadcast airwaves spectrum for sale in a government auction  the U.S. Federal Communications Commission said on Thursday.",
        "date": "04132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-T-Mobile  Dish bid combined $14 bln in U.S. airwaves auction -FCC "
    },
    {
        "content": "* Largest winner in U.S. wireless spectrum auction with $8 billion bid; Comcast bid $1.7 billion; Verizon did not bid - FCC",
        "date": "04132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-T-Mobile largest winner in US wireless spectrum auction-FCC "
    },
    {
        "content": "NEW YORK The U.S. Federal Communications Commission may announce the winners of the government's $19.8 billion spectrum auction as early as Thursday  industry officials told Reuters.",
        "date": "04132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "FCC could announce spectrum results as early as Thursday: industry "
    },
    {
        "content": "* Verizon - during Q1 2017  Verizon Communications Inc Reorganized customer groups within its wireline segment",
        "date": "04112017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon reorganizes customer groups within its wireline segment "
    },
    {
        "content": "NEW YORK  April 13 The U.S. Federal Communications Commission may announce the winners of the government's $19.8 billion spectrum auction as early as Thursday  industry officials told Reuters.",
        "date": "04132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "FCC could announce spectrum results as early as Thursday -industry "
    },
    {
        "content": "WASHINGTON The chairman of the U.S. Federal Communications Commission is moving quickly to replace the Obama administration's landmark net neutrality rules and wants internet service providers to voluntarily agree to maintain an open internet  three sources briefed on the meeting said Thursday.",
        "date": "04072017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC chairman plans fast-track repeal of net neutrality: sources "
    },
    {
        "content": "WASHINGTON  April 6 The chairman of the U.S. Federal Communications Commission is moving quickly to replace the Obama administration's landmark net neutrality rules and wants internet service providers to voluntarily agree to maintain an open internet  three sources briefed on the meeting said Thursday.",
        "date": "04072017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC chairman plans fast-track repeal of net neutrality -sources "
    },
    {
        "content": "The No. 1 U.S. wireless carrier Verizon Communications Inc  has been buying streaming rights from television network owners ahead of a nationwide launch of an online TV service  according to people familiar with the matter.",
        "date": "03302017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon looking to launch online TV service: sources "
    },
    {
        "content": "March 30 The No. 1 U.S. wireless carrier Verizon Communications Inc  has been buying streaming rights from television network owners ahead of a nationwide launch of an online TV service  according to people familiar with the matter.",
        "date": "03302017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon looking to launch online TV service - sources "
    },
    {
        "content": "* Verizon Communications securing streaming rights from TV network owners in preparation for nationwide launch of live online TV service - Bloomberg Source text : https://bloom.bg/2oejvt3 Further company coverage:",
        "date": "03302017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon prepares nationwide launch of live online TV service - BBG "
    },
    {
        "content": "Verizon Communications Inc  said on Friday that Hans Vestberg  the former Ericsson chief executive officer  has joined the company and will lead a team building out its fiber network infrastructures amid growing competition from smaller rivals.",
        "date": "03312017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon hires ex-Ericsson CEO  sets new operating structure "
    },
    {
        "content": "WASHINGTON The Republican head of the Federal Communications Commission on Thursday proposed easing regulatory requirements in the $45 billion business data services market  a win for companies like AT&T Inc  CenturyLink Inc  Verizon Communications Inc and others.",
        "date": "03302017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "FCC to vote to reform $45 billion business data market "
    },
    {
        "content": "WASHINGTON  March 30 The Republican head of the Federal Communications Commission on Thursday proposed easing regulatory requirements in the $45 billion business data services market  a win for companies like AT&T Inc  CenturyLink Inc  Verizon Communications Inc and others.",
        "date": "03302017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC to vote to reform $45 billion business data market "
    },
    {
        "content": "March 31 Verizon Communications Inc said on Friday that Hans Vestberg  the former Ericsson chief executive officer  has joined the company and will lead a team building out its fiber network infrastructures amid growing competition from smaller rivals.",
        "date": "03312017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon hires ex-Ericsson CEO  sets new operating structure "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 30 (Fitch) Fitch Ratings has assigned a 'BBB' rating to American Tower Corporation's (AMT) offering of EUR500 million senior unsecured notes due 2025. Net proceeds from the offering will be used to repay existing debt on its 2013 revolving credit facility (RCF). Proceeds may also be used for general corporate purposes. As of Dec. 31  2016  pro forma outstanding borrowings on AMT's 2013 RCF totaled approximately $1.7 billi",
        "date": "03302017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Fitch Rates American Tower's EUR500MM Debt Offering 'BBB'; Outlook Stable "
    },
    {
        "content": "March 31 Verizon Communications Inc said on Friday it would change its operating structure to focus on three areas  and named former Ericsson Chief Executive Officer Hans Vestberg to lead its newly created network and technology team.",
        "date": "03312017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon creates new operating structure  hires former Ericsson CEO "
    },
    {
        "content": "* Verizon positions senior leadership to accelerate delivery of next-generation services",
        "date": "03312017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon changes operating structure "
    },
    {
        "content": "* Verizon - will redeem $514 million of 6.100pct notes due 2018 and $533 million of 5.50pct notes due 2018 on April 24  2017  Source text for Eikon:  Further company coverage:",
        "date": "03232017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to redeem debt securities "
    },
    {
        "content": "U.S. wireless carriers Verizon Communications Inc  and AT&T Inc  said on Wednesday they have suspended digital advertising on Google's YouTube and other advertising platforms not related to search over concerns that their ads may have run next to extremist videos.",
        "date": "03232017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon  AT&T suspend ads from Google over offensive videos "
    },
    {
        "content": "March 22 U.S. wireless carriers Verizon Communications Inc and AT&T Inc said on Wednesday they have suspended digital advertising on Google's YouTube and other advertising platforms not related to search over concerns that their ads may have run next to extremist videos.",
        "date": "03232017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-Verizon  AT&T suspend ads from Google over offensive videos "
    },
    {
        "content": "* Verizon to offer Iphone 7 and Iphone 7 plus (product)red special edition and new 9.7-inch ipad on March 24  Source text for Eikon:  Further company coverage:",
        "date": "03222017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to offer Iphone 7 and Iphone 7 plus (product)red special edition and new 9.7-inch Ipad on March 24 "
    },
    {
        "content": "* Verizon announces pricing terms of its tender offers for 30 series of notes of Verizon and certain of its subsidiaries",
        "date": "03172017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon announces pricing terms of its tender offers for 30 series of notes of Verizon  certain of its subsidiaries "
    },
    {
        "content": "* Verizon and CBS Corporation announce multiyear content carriage agreement",
        "date": "03152017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon and CBS Corp announce multiyear content carriage agreement "
    },
    {
        "content": "NEW YORK  March 13 Verizon Communications Inc  sought almost triple the price reduction that it ultimately obtained for Yahoo Inc's core assets following two massive cyber attacks at the internet company  according to a Yahoo filing.",
        "date": "03132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon sought $925 mln discount for Yahoo merger  got $350 mln "
    },
    {
        "content": "NEW YORK Verizon Communications Inc  sought almost triple the price reduction that it ultimately obtained for Yahoo Inc's  core assets following two massive cyber attacks at the internet company  according to a Yahoo filing.",
        "date": "03132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon sought $925 million discount for Yahoo merger  got $350 million "
    },
    {
        "content": "Ligado Networks  the wireless satellite venture formerly known as LightSquared Inc that emerged from bankruptcy in 2015  is working with financial advisers to explore strategic alternatives  according to people familiar with the matter.",
        "date": "03132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Exclusive: Ligado Networks hires banks to explore options - sources "
    },
    {
        "content": "* Verizon announces tender offers for 30 series of notes of Verizon and certain of its subsidiaries",
        "date": "03132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon announces tender offers for 30 series of notes of Verizon and some of its units "
    },
    {
        "content": "* Upon closing of sale transaction with Verizon  Alexi Wellman will serve as chief financial and accounting officer for Altaba Inc",
        "date": "03132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Yahoo says Marissa Mayer will continue to be CEO prior closing  of transaction with Verizon "
    },
    {
        "content": "* Says Verizon chooses datamena for Middle East expansion  Source text for Eikon:  Further company coverage:",
        "date": "03072017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon chooses datamena for Middle East expansion "
    },
    {
        "content": "NEW YORK  March 1 U.S. regulators on Wednesday blocked some Obama administration rules on the eve of implementation  regulations that would have subjected broadband providers to stricter scrutiny than web sites face to protect customers' private data.",
        "date": "03012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-U.S. FCC blocks stricter broadband privacy rules from taking effect "
    },
    {
        "content": "* Verizon board declares quarterly dividend and reauthorizes share repurchase plan",
        "date": "03032017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon's board authorizes stock repurchase of up to 100 mln shares "
    },
    {
        "content": "NEW YORK The U.S. Federal Communications Commission on Wednesday blocked some Obama administration rules approved last year that would have subjected broadband providers to stricter scrutiny than websites  a victory for internet providers such as AT&T Inc  Comcast Corp and Verizon Communications Inc .",
        "date": "03012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-U.S. FCC blocks stricter broadband privacy rules from taking effect "
    },
    {
        "content": "NEW YORK  March 1 The U.S. Federal Communications Commission on Wednesday blocked some Obama administration rules approved last year that would have subjected broadband providers to stricter scrutiny than websites  a victory for internet providers such as AT&T Inc   Comcast Corp and Verizon Communications Inc  .",
        "date": "03012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC blocks stricter broadband privacy rules from taking effect "
    },
    {
        "content": "* Verizon to deliver 5G service to pilot customers in 11 markets across U.S. by mid 2017  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon says to deliver 5G service to pilot customers in 11 markets across U.S. by mid 2017 "
    },
    {
        "content": "Feb 22 Verizon Communications Inc said on Wednesday it would offer its high-speed wireless 5G network to certain customers in 11 U.S. cities in the first half of 2017.",
        "date": "02222017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to offer 5G to select customers in 11 U.S. cities "
    },
    {
        "content": "Verizon Communications Inc  said on Tuesday it would buy Yahoo Inc's  core business for $4.48 billion  lowering its original offer by $350 million in the wake of two massive cyber attacks at the internet company. | Video ",
        "date": "02212017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon  Yahoo agree to lowered $4.48 billion deal following cyber attacks "
    },
    {
        "content": "Feb 21 Verizon Communications Inc said on Tuesday it would buy Yahoo Inc's core business for $4.48 billion  lowering its original offer by $350 million in the wake of two massive cyber attacks at the internet company.",
        "date": "02212017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Verizon  Yahoo agree to lowered $4.48 bln deal following cyber attacks "
    },
    {
        "content": "* Yahoo - under terms of spa amendment termination fee to be paid by yahoo to verizon in certain circumstances is reduced to $134.3 million - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "02212017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Yahoo under terms of SPA amendment  termination fee to be paid by Yahoo to Verizon in certain circumstances is reduced to $134.3 mln "
    },
    {
        "content": "* Verizon simplifies prepaid offerings  introduces new 2 GB plan",
        "date": "02202017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon simplifies prepaid offerings  introduces new 2 GB plan "
    },
    {
        "content": "* Says under amended terms  Verizon and Yahoo have agreed to reduce price Verizon will pay to acquire Yahoo's operating business by $350 million",
        "date": "02212017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon says to cut price to acquire Yahoo's operating business by $350 mln "
    },
    {
        "content": "Feb 21 Verizon Communications Inc  the No. 1 U.S. wireless carrier  said on Tuesday it agreed to buy the core internet business of Yahoo Inc for $4.48 billion  reflecting a $350 million cut to the original price.",
        "date": "02212017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon revises deal with Yahoo to $4.48 bln "
    },
    {
        "content": "Feb 21 Verizon agreed to a revised deal to buy Yahoo Inc's core internet business for $4.83 billion  as much as $350 million less than the original price  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02212017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon  Yahoo agree to cut deal price by as much as $350 mln - WSJ "
    },
    {
        "content": "NEW YORK  Feb 16 AT&T Inc said on Thursday it would make its unlimited data plan available to all wireless customers who pay a monthly bill  days after rival Verizon Communications Inc announced an unlimited option.",
        "date": "02162017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AT&T expands access to unlimited plan after Verizon launch "
    },
    {
        "content": "* Verizon  Yahoo agree to cut merger price by as much as $350 million - CNBC  citing DJ",
        "date": "02212017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon  Yahoo agree to cut merger price by as much as $350 mln - CNBC  citing DJ "
    },
    {
        "content": "NEW YORK Verizon Communications Inc's  announcement that it will once again offer an unlimited pricing plan marks a shift in its thinking as a price war among the four biggest U.S. wireless carriers accelerates. | Video ",
        "date": "02132017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon's move to unlimited data ups ante in wireless war "
    },
    {
        "content": "NEW YORK  Feb 13 Verizon Communications Inc's  announcement that it will once again offer an unlimited pricing plan marks a shift in its thinking as a price war among the four biggest U.S. wireless carriers accelerates.",
        "date": "02132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon's move to unlimited data ups ante in wireless war "
    },
    {
        "content": "NEW YORK  Feb 13 Verizon Communications Inc's  announcement that it will once again offer an unlimited pricing plan marks a shift in its thinking as a price war among the four biggest U.S wireless carriers accelerates.",
        "date": "02132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-Verizon's move to unlimited data ups ante in wireless war "
    },
    {
        "content": "Verizon Communications Inc  is close to a revised deal to buy Yahoo Inc's  core internet business for $250 million to $350 million less than the original agreed price of $4.83 billion  according to a source briefed on the matter. | Video ",
        "date": "02152017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon close to Yahoo deal  price cut of $250-350 million: sources "
    },
    {
        "content": "* Indexes up: Dow 0.63 pct  S&P 0.44 pct  Nasdaq 0.49 pct   (Updates to early afternoon)",
        "date": "02132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-S&P tops $20 trillion as \"Trump trade\" fires up "
    },
    {
        "content": "* Introducing Verizon Unlimited  an \"unlimited plan in wireless\"  Source text for Eikon:  Further company coverage:",
        "date": "02132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon introduces Verizon Unlimited "
    },
    {
        "content": "Feb 15 Verizon Communications Inc is close to a revised deal to buy Yahoo Inc's core internet business for $250 million to $350 million less than the original agreed price of $4.83 billion  according to a source briefed on the matter.",
        "date": "02152017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Verizon close to Yahoo deal  price cut of $250-350 mln -sources "
    },
    {
        "content": "Verizon Communications Inc is close to a revised deal to buy Yahoo Inc's core internet business for $250 million to $350 million less than the original agreed price of $4.83 billion  according to a source briefed on the matter.",
        "date": "02152017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon close to Yahoo deal  price cut of $250-350 mln -sources "
    },
    {
        "content": "NEW YORK Verizon Communications Inc will introduce an unlimited data plan on Monday  its first in more than five years  in its latest effort to lure customers as competition rises between network carriers.",
        "date": "02132017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon reintroduces unlimited data plan as competition rises "
    },
    {
        "content": "Feb 15 Verizon Communications Inc has tentatively reached a revised deal that would lower by about $250 million the price to acquire Yahoo Inc's core internet business  Bloomberg reported on Wednesday.",
        "date": "02152017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon reaches tentative agreement to lower price of Yahoo deal-Bbg "
    },
    {
        "content": "* Verizon reduces Yahoo deal price by $250 million in revised deal - Bloomberg",
        "date": "02152017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon reduces Yahoo deal price by $250 mln in revised deal - Bloomberg "
    },
    {
        "content": "WASHINGTON The U.S. telecommunications regulator said on Friday it was closing inquiries into sponsored data programs and TV services offered by AT&T Inc  Verizon Communications Inc   Comcast Corp   T-Mobile USA Inc  without taking any action.",
        "date": "02032017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "U.S. telecommunications regulator closes 'sponsored data' probe "
    },
    {
        "content": "WASHINGTON  Feb 3 The U.S. Federal Communications Commission said on Friday it was closing inquiries into sponsored data programs and TV services offered by AT&T Inc  Verizon Communications Inc  Comcast Corp   T-Mobile USA Inc undertaken during the Obama administration without taking any action.",
        "date": "02032017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC closes 'sponsored data' inquiries "
    },
    {
        "content": "NEW YORK  Feb 2 A New York state appeals court on Thursday said its door remains open for settlements of merger litigation where shareholders receive no money  approving an accord tied to Verizon Communications Inc's $130 billion buyout of Vodafone Group Plc's stake in their Verizon Wireless venture.",
        "date": "02022017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "NY court approves Verizon settlement over 'merger tax' objections "
    },
    {
        "content": "NEW YORK A New York state appeals court on Thursday said its door remains open for settlements of merger litigation where shareholders receive no money  approving an accord tied to Verizon Communications Inc's  $130 billion buyout of Vodafone Group Plc's  stake in their Verizon Wireless venture.",
        "date": "02022017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "New York court approves Verizon settlement over 'merger tax' objections "
    },
    {
        "content": "NEW YORK New York filed a lawsuit on Wednesday accusing Charter Communications Inc of short-changing customers who were promised faster internet speeds than it could deliver.",
        "date": "02012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "New York sues Charter  alleges Time Warner fraud on internet speeds "
    },
    {
        "content": "NEW YORK  Feb 1 New York filed a lawsuit on Wednesday accusing Charter Communications Inc of short-changing customers who were promised faster internet speeds than it could deliver.",
        "date": "02012017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-New York sues Charter  alleges Time Warner fraud on internet speeds "
    },
    {
        "content": "NEW YORK  Jan 27 (IFR) - Holders of Verizon Communications debt are pushing the company to amend terms on an exchange offer for nearly US$30bn of debt following reports that it could buy cable operator Charter Communications.",
        "date": "01272017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon bondholders want more in debt exchange after M&A rumors "
    },
    {
        "content": "Jan 27 The following bids  mergers  acquisitions and disposals were reported by 1030 GMT on Friday:",
        "date": "01272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Digital Bridge Holdings LLC  a firm that invests in data centers  has agreed to acquire Vantage Data Centers Management Co LLC from buyout firm Silver Lake Partners for well over $1 billion  including debt  people familiar with the matter said on Thursday.",
        "date": "01272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Digital Bridge to acquire Vantage Data Centers for $1 billion: sources "
    },
    {
        "content": "* Verizon Communications Inc files final term sheet related to its offerintg of $1.48 billion 4.95% notes due 2047  - SEC filing  Source text: (http://bit.ly/2kjEcic) Further company coverage:",
        "date": "01252017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications files final term sheet related to its notes offering "
    },
    {
        "content": "Jan 26 Digital Bridge Holdings LLC  a firm that invests in data centers  has agreed to acquire Vantage Data Centers Management Co LLC from buyout firm Silver Lake Partners for well over $1 billion  including debt  people familiar with the matter said on Thursday.",
        "date": "01272017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Digital Bridge to acquire Vantage Data Centers for $1 bln -sources "
    },
    {
        "content": "* Verizon announces private exchange offers for 18 series of notes and related tender offers open to certain investors",
        "date": "01252017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon announces private exchange offers for 18 series of notes and related tender offers open to certain investors "
    },
    {
        "content": "Verizon Communications Inc\tis interested in exploring a combination with U.S. cable company Charter Communication Inc as part of a long list of acquisition targets  but no proposal has been made for a tie-up between the two companies  sources told Reuters on Thursday. | Video ",
        "date": "01262017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Speculation builds on a Verizon-Charter tie-up  no offer made "
    },
    {
        "content": "Jan 26 Verizon Communications Inc    is interested in exploring a combination with U.S. cable company Charter Communication Inc  as part of a long list of acquisition targets  but no proposal has been made for a tie-up between the two companies  sources told Reuters on Thursday.",
        "date": "01262017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Speculation builds on a Verizon-Charter tie-up  no offer made "
    },
    {
        "content": "Jan 26 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "01262017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  Jan 26 Verizon Communications Inc   the No. 1 U.S. wireless carrier  has not proposed an acquisition to Charter Communications Inc  according to sources.",
        "date": "01262017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon has not proposed an acquisition to Charter-sources "
    },
    {
        "content": "Jan 26 Verizon Communications Inc is exploring a combination with cable company Charter Communications Inc  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "01262017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon exploring deal with cable company Charter - WSJ "
    },
    {
        "content": "* Verizon is exploring a combination with Charter; efforts preliminary and may not result in deal - CNBC  citing DJ    Source text: http://bit.ly/2k77PWE",
        "date": "01262017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon exploring combination with Charter; efforts preliminary  may not result in deal - CNBC "
    },
    {
        "content": "WASHINGTON  Jan 20 Outgoing U.S. Federal Communications Commission Chairman Tom Wheeler warned Republicans against dismantling the Obama administration's landmark \"net neutrality\" protections that bar internet service providers from slowing consumer access to web content.",
        "date": "01202017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Outgoing FCC chair warns against overturning net neutrality "
    },
    {
        "content": "Verizon Communications Inc's  quarterly profit missed estimates and the No. 1 U.S. wireless carrier added fewer subscribers than anticipated in the fourth quarter as it struggles to fend off rivals in a maturing wireless market.",
        "date": "01242017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon earnings  subscriber additions fall short of estimates "
    },
    {
        "content": "Jan 23 Yahoo Inc reported a 15.4 percent rise in quarterly revenue on Monday  ahead of a proposed sale of its core internet business to Verizon Communications Inc .",
        "date": "01232017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Yahoo revenue rises 15.4 pct amid Verizon deal uncertainty "
    },
    {
        "content": "* Shares down 4.5 pct   (Adds CFO quote  context  updates shares)",
        "date": "01242017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Verizon earnings  subscriber additions fall short of estimates "
    },
    {
        "content": "* Verizon CFO on yahoo deal- \"we have not yet reached any final conclusions yet\"- conf call",
        "date": "01242017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon CFO says co has not reached any final conclusions on Yahoo deal "
    },
    {
        "content": "* Yahoo-Due to pending deal with Verizon  co will not have an earnings call or webcast for its results for quarter and full year ended December 31  2016  Source text for Eikon:  Further company coverage: [YHOO.O VZ.N]",
        "date": "01172017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Yahoo says will not have earnings call for results for quarter and FY ended Dec. 31 "
    },
    {
        "content": "* Q4 adjusted non-GAAP earnings per share $0.86 excluding items",
        "date": "01242017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon reports Q4 adjusted earnings $0.86 per share "
    },
    {
        "content": "Jan 24   Verizon Communications Inc  whose deal to buy Yahoo Inc's core assets has been cast into doubt by data breaches at the internet company  reported a 5.6 percent fall in quarterly revenue on Tuesday as it struggles to fend off rivals in a maturing U.S. wireless market.",
        "date": "01242017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon reports 5.6 percent fall in quarterly revenue "
    },
    {
        "content": "Jan 9 Yahoo Inc said Monday that it would rename itself Altaba Inc and Chief Executive Officer Marissa Mayer would step down from the board after the closing of its deal with Verizon Communications Inc.",
        "date": "01102017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 1-Yahoo to be named Altaba  Mayer to leave board after Verizon deal "
    },
    {
        "content": "Yahoo Inc said Monday that it would rename itself Altaba Inc and Chief Executive Officer Marissa Mayer would step down from the board after the closing of its deal with Verizon Communications Inc. | Video ",
        "date": "01112017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Yahoo to be named Altaba  Mayer to leave board after Verizon deal "
    },
    {
        "content": "SAN FRANCISCO  Jan 12 Straight Path Communications Inc said on Thursday it would pay $15 million to settle a federal probe of claims that the wireless spectrum owner had submitted false data to renew airwave licenses  sparking a 30 percent rally in its stock.",
        "date": "01122017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Straight Path settles U.S. license investigation  shares jump "
    },
    {
        "content": "SAN FRANCISCO  Jan 12 Straight Path Communications Inc  a holder of licenses to wireless spectrum  said it has settled with the U.S. Federal Communications Commission  resolving an investigation into the company.",
        "date": "01122017",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Straight Path settles with FCC over licenses "
    },
    {
        "content": "Jan 9 Yahoo Inc said Chief Executive Officer Marissa Mayer would step down from the board after the closing of its deal with Verizon Communications Inc.",
        "date": "01092017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "REFILE-Yahoo's Marissa Mayer to resign from board after Verizon deal closes "
    },
    {
        "content": "A senior Verizon Communications Inc  executive said on Thursday that the company was unsure about its planned acquisition of Yahoo Inc's  internet business.",
        "date": "01062017",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon executive says company unsure about Yahoo deal "
    },
    {
        "content": "LONDON US data center operator Equinix  has doubled the size of a leveraged loan it is raising to back its acquisition of data centers from Verizon Communications   increasing it to €1bn and tightening pricing following overwhelming investor demand  banking sources said on Wednesday.",
        "date": "12142016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "LPC-Equinix doubles acquisition loan to €1 billion "
    },
    {
        "content": "NEW YORK Yahoo Inc  came under renewed scrutiny by federal investigators and lawmakers on Thursday after disclosing the largest known data breach in history  prompting Verizon Communications Inc  to demand better terms for its planned purchase of Yahoo's internet business. | Video ",
        "date": "12162016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Yahoo under scrutiny after latest hack  Verizon seeks new deal terms "
    },
    {
        "content": "Verizon Communications Inc   the No. 1 U.S. wireless carrier  is selling 29 data centers in the United States and Latin America to Equinix Inc  for $3.6 billion  as the telecom giant focuses on its core business.",
        "date": "12062016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon to sell data centers to Equinix for $3.6 billion "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission has approved Verizon Communications Inc's $1.8 billion acquisition of Carl Icahn's XO Communications fiber-optic business  an agency order published on Thursday said.",
        "date": "11172016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "FCC approves Verizon acquisition of Icahn's XO Communications "
    },
    {
        "content": "* Verizon acquires LQD WiFi to humanize the citizen engagement experience",
        "date": "11142016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon buys New York-based LQD WiFi "
    },
    {
        "content": "WASHINGTON  Nov 17 The U.S. Federal Communications Commission has approved Verizon Communications Inc's $1.8 billion acquisition of Carl Icahn's XO Communications fiber-optic business  an agency order published on Thursday said.",
        "date": "11172016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC approves Verizon acquisition of Icahn's XO Communications "
    },
    {
        "content": "Verizon Communications Inc's  AOL digital media unit will lay off 5 percent of its workforce  or about 500 people  to consolidate operations after recent acquisitions  a person familiar with the situation said on Thursday.",
        "date": "11172016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AOL to cut 500 jobs  mostly in corporate units: source "
    },
    {
        "content": "Nov 17 Verizon Communications Inc's AOL digital media unit will lay off 5 percent of its workforce  or about 500 people  to consolidate operations after recent acquisitions  a person familiar with the situation said on Thursday.",
        "date": "11172016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-AOL to cut 500 jobs  mostly in corporate units -source "
    },
    {
        "content": "Nov 17 Digital media company AOL  owned by Verizon Communications Inc  will lay off 5 percent of its workforce  or about 500 employees  a source familiar with the situation said.",
        "date": "11172016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AOL to cut 5 pct of its workforce - source "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Yahoo is hacking out more wiggle room for Verizon. The beleaguered internet firm waited until the day after the U.S. election to reveal a hacker's July claim to have certain user data. That's when it inked a $4.8 billion sale to the telecommunications giant. The latest hit to Yahoo's reputation gives Verizon extra firepower to snag a better deal.",
        "date": "11102016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Yahoo hacks out more wiggle room for Verizon "
    },
    {
        "content": "Nov 9 U.S. satellite TV operator Dish Network Corp reported a lower-than-expected quarterly profit on Wednesday as it lost more pay-TV subscribers due to stiff competition from online video services.",
        "date": "11092016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Dish Network posts lower-than-expected profit  loses subscribers "
    },
    {
        "content": "* On November 3  board approved amendments to section 4.13 of company's bylaws - SEC filing",
        "date": "11042016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications says board approved amendments to section 4.13 of co's bylaws - SEC filing "
    },
    {
        "content": "* Verizon to redeem debt securities  Source text for Eikon:  Further company coverage:",
        "date": "11042016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to redeem debt securities "
    },
    {
        "content": "* Verizon invests in content discovery  recommendation and experience with acquisition of Vessel's Technology",
        "date": "10262016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon invests in content discovery  recommendation and experience with acquisition of Vessel's Technology "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 26 (Fitch) Fitch Ratings has assigned an 'A-' rating to Verizon  Communications Inc.'s (Verizon; NYSE: VZ) multi-tranche offering of Euro and  Sterling senior unsecured notes. Proceeds will be used for general corporate  purposes  including the acquisitions of Fleetmatics Group PLC and XO Holdings'  wireline assets as well as for the potential repayment of debt  depending on  market conditions. Verizon's Long-Term Issue",
        "date": "10262016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Fitch Rates Verizon's Sr. Unsecured Note Offering 'A-'; Outlook Stable "
    },
    {
        "content": "A Verizon Communications Inc executive said the acquisition of Yahoo Inc still makes sense  but the telecommunications company needs more information about the email provider's massive breach of accounts.",
        "date": "10262016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon executive says company needs more information about Yahoo hack "
    },
    {
        "content": "* Shares touch 9-year high at $50.41   (Adds CEO and analyst comments  updates shares)",
        "date": "10242016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-T-Mobile raises forecast; sees \"upside\" from AT&T-Time Warner deal "
    },
    {
        "content": "Oct 26 A Verizon Communications Inc  executive said the acquisition of Yahoo Inc still makes sense  but the telecommunications company needs more information about the email provider's massive breach of accounts.",
        "date": "10262016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon exec says company needs more information about Yahoo hack "
    },
    {
        "content": "Oct 26 A Verizon executive said the acquisition of Yahoo still makes sense  but the telecommunications giant needs more information about the email provider's massive breach of accounts.",
        "date": "10262016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon exec says company needs more information about Yahoo hack "
    },
    {
        "content": "BOSTON  Oct 25 Many actively managed U.S. mutual funds were cool toward AT&T Inc even before the telecom giant's planned $85.4 billion acquisition of Time Warner Inc .",
        "date": "10252016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. funds downbeat on AT&T even before Time Warner deal "
    },
    {
        "content": "Verizon Communications Inc  added fewer than expected wireless subscribers in the third quarter due to intense competition  and indicated it may renegotiate a deal to buy Yahoo Inc after a breach of Yahoo user email accounts.",
        "date": "10202016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon revenue drops as subscriber additions disappoint "
    },
    {
        "content": "* Verizon's initial inventory of pixel XL 128GB is sold out;  All other models in stock - Verizon spokesman   Further company coverage:",
        "date": "10192016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon's initial inventory of Pixel XL 128GB sold out - Verizon spokesman "
    },
    {
        "content": "* Global gauge of equities hits one-week high  then falls   (Updates to U.S. market close)",
        "date": "10202016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "GLOBAL MARKETS-Dollar hits 7-mth high on ECB's Draghi  pressures oil  stocks "
    },
    {
        "content": "SAN FRANCISCO Yahoo Inc reported better-than-expected quarterly adjusted profit on Tuesday  a boost for the beleaguered company whose deal to sell its core business to Verizon Communications Inc has been shaken by a massive data breach. | Video ",
        "date": "10192016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo profit beats Wall St.  some analysts worry over effect of hack "
    },
    {
        "content": "* Dow up 0.09 pct  S&P down 0.11 pct  Nasdaq down 0.15 pct   (Updates to late afternoon  changes byline)",
        "date": "10202016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St dips as Verizon drags; AmEx curbs losses "
    },
    {
        "content": "SAN FRANCISCO  Oct 18 Yahoo Inc  reported better-than-expected quarterly adjusted profit on Tuesday  a boost for the beleaguered company whose deal to sell its core business to Verizon Communications Inc has been shaken by a massive data breach.",
        "date": "10182016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 3-Yahoo profit beats Wall St  some analysts worry over effect of hack "
    },
    {
        "content": "Oct 20 Verizon Communications Inc added fewer than expected wireless subscribers in the third quarter due to intense competition  and indicated it may renegotiate a deal to buy Yahoo Inc after a breach of Yahoo user email accounts.",
        "date": "10202016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Verizon revenue drops as subscriber additions disappoint "
    },
    {
        "content": "* Indexes down: Dow 0.36 pct  S&P 0.42 pct  Nasdaq 0.48 pct   (Adds details  comments  updates prices)",
        "date": "10202016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St falls as weak earnings dent optimism; oil drags "
    },
    {
        "content": "* Qtrly GAAP revenue $1 305 million versus $1 226 million last year",
        "date": "10182016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Yahoo reports 3rd-qtr non-GAAP earnings of $0.20 per share "
    },
    {
        "content": "Oct 18 Yahoo Inc reported a 6.5 percent rise in quarterly revenue on Tuesday  positive news for the beleaguered company whose deal to sell its core business to Verizon Communications Inc has been shaken by a massive data breach.",
        "date": "10182016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo revenue rises 6.5 pct "
    },
    {
        "content": "* Indexes down: Dow 0.02 pct  S&P 0.1 pct  Nasdaq 0.1 pct   (Updates to open)",
        "date": "10202016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St flat amid mixed earnings reports "
    },
    {
        "content": "* Q3 revenue $30.9 billion versus I/B/E/S view $31.14 billion",
        "date": "10202016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Q3 adj non-GAAP earnings per share $1.01 "
    },
    {
        "content": "Oct 20 Verizon Communications Inc  the No. 1 U.S. wireless carrier that has agreed to buy Yahoo Inc's  core business  reported a 6.7 percent drop in quarterly revenue on Thursday as it discounted heavily to attract subscribers.",
        "date": "10202016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon reports 6.7 pct fall in 3rd-qtr revenue "
    },
    {
        "content": "Oct 14 Yahoo Inc said on Friday that it would not hold a call or webcast when it reports third-quarter results on Tuesday  citing its pending $4.83 billion deal with Verizon Communications Inc.",
        "date": "10142016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo not to hold quarterly earnings call or webcast "
    },
    {
        "content": "WASHINGTON Verizon Communications Inc  said on Thursday it has a \"reasonable basis\" to believe Yahoo Inc's massive data breach of email accounts represents a material impact that could allow Verizon to withdraw from its $4.83 billion deal to buy the technology company.",
        "date": "10132016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon says Yahoo hack 'material ' could affect deal "
    },
    {
        "content": "WASHINGTON  Oct 13 Verizon Communications Inc  said on Thursday it has a \"reasonable basis\" to believe Yahoo Inc's massive data breach of email accounts represents a material impact that could allow Verizon to withdraw from its $4.83 billion deal to buy the technology company.",
        "date": "10132016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-Verizon says Yahoo hack 'material ' could affect deal "
    },
    {
        "content": "WASHINGTON  Oct 13 Verizon Communications Inc  general counsel  Craig Silliman  said on Thursday the company has a \"reasonable basis\" to believe that Yahoo Inc's  massive data breach of at least 500 million email accounts represents a material impact that could allow Verizon to withdraw from its $4.83 billion deal to buy Yahoo.",
        "date": "10132016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-Verizon believes Yahoo email hacking 'material ' could affect deal "
    },
    {
        "content": "WASHINGTON Verizon Communications Inc  said on Thursday it has a \"reasonable basis\" to believe Yahoo Inc's  massive data breach of email accounts represents a material impact that could allow Verizon to withdraw from its $4.83 billion deal to buy the technology company.",
        "date": "10142016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon says Yahoo hack 'material ' could affect deal "
    },
    {
        "content": "Oct 13 Verizon Communications Inc said on Thursday it plans to close call centers in five states  including its home state of New York  as the No. 1 wireless company trims head count and reorganizes operations in a saturated wireless market.",
        "date": "10132016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-Verizon closing call centers in five U.S. states  3 200 jobs affected "
    },
    {
        "content": "Oct 13 Verizon Communications Inc  the No. 1 U.S. wireless company  said on Thursday it would close call centers in five states  including its home state of New York.",
        "date": "10132016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to close call centers in 5 states "
    },
    {
        "content": "Verizon Communications Inc  said on Thursday it plans to close call centers in five states  including its home state of New York  as the No. 1 wireless company trims head count and reorganizes operations in a saturated wireless market. | Video ",
        "date": "10142016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon closing call centers in five U.S. states  3 200 jobs affected "
    },
    {
        "content": "* Verizon is closing call centers in five states  including its home state of new york - NYT",
        "date": "10132016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon is closing call centers in five states  including home state of New York - NYT "
    },
    {
        "content": "SAN FRANCISCO  Oct 12 An international civil liberties group that has worked with web companies on human rights and surveillance issues is asking Verizon Communications Inc to examine a secret email scanning program run by its acquisition target Yahoo Inc and improve on its user protection record.",
        "date": "10122016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Civil liberties group urges Verizon to shore up Yahoo user protection "
    },
    {
        "content": "Verizon Communications  is pressing for a $1 billion discount off its pending $4.8 billion agreement to buy Yahoo   the New York Post reported  citing sources.",
        "date": "10062016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon pushes for $1 billion discount on Yahoo deal: New York Post "
    },
    {
        "content": "Oct 6 Verizon Communications is pressing for a $1 billion discount off its pending $4.8 billion agreement to buy Yahoo  the New York Post reported  citing sources.",
        "date": "10062016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon pushes for $1 bln discount on Yahoo deal - NY Post "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission will vote on Oct. 27 on a revised proposal for rules to safeguard privacy of broadband users.",
        "date": "10062016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "FCC to vote on revised broadband privacy regulations "
    },
    {
        "content": "WASHINGTON  Oct 6 The U.S. Federal Communications Commission will vote on Oct. 27 on a revised proposed regulation setting rules to safeguard the privacy of broadband users.",
        "date": "10062016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC to vote on revised broadband privacy regulations "
    },
    {
        "content": "FRANKFURT  Oct 7 Serious human rights concerns have been raised by a Reuters report that Yahoo had scanned the emails of hundreds of millions of users at the request of a U.S. intelligence service  a United Nations' human rights advocate said on Friday.",
        "date": "10072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo email scan report raises rights concerns -U.N. expert "
    },
    {
        "content": "LONDON  Oct 7 (IFR) - The cracks began to show in the sterling corporate bond market  just one week into the BoE's stimulus programme  as indigestion following a spate of new supply and torrid currency moves left investors holding big losses.",
        "date": "10072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Shine comes off sterling credit despite BoE firepower "
    },
    {
        "content": "* Verizon CFO says company won't offer unlimited data in wireless - Goldman Sachs conf",
        "date": "09222016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon CFO says company won't offer unlimited data in wireless - Goldman Sachs conf "
    },
    {
        "content": "Sept 23 Yahoo Inc was sued on Friday by a user who accused it of gross negligence over a massive 2014 hacking in which information was stolen from at least 500 million accounts.",
        "date": "09232016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Yahoo is sued for gross negligence over huge hacking "
    },
    {
        "content": "SEOUL  Sept 21 U.S. carrier Verizon Communications Inc has begun taking orders for Samsung Electronics Co Ltd's new Galaxy Note 7 smartphones  after having stopped sales of the device earlier due to fire-prone batteries.",
        "date": "09212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. carrier Verizon starts taking orders for new Samsung Note 7 phones "
    },
    {
        "content": "* Verizon and Hearst announce the creation of Complex Networks",
        "date": "09142016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon and Hearst announce the creation of Complex Networks "
    },
    {
        "content": "SAN FRANCISCO  Sept 12 The mission to merge Yahoo's assets with AOL and Verizon's will lead to \"some job changes\" according to AOL CEO Tim Armstrong.",
        "date": "09122016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AOL CEO Tim Armstrong says Yahoo deal will spark 'job changes' "
    },
    {
        "content": "* Announced it has signed an agreement to purchase Sensity Systems inc.",
        "date": "09122016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon communications to purchase Sensity Systems inc. "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 06 (Fitch) Fitch Ratings has assigned an 'A-' rating to  Verizon Communications Inc.'s (Verizon; NYSE: VZ) $2.059 billion of senior  unsecured 4.2% notes due 2046. Proceeds will be used to repay the $870 million  principal balance of the 4.8% notes due 2044  as well as for general corporate  purposes. The company's Long-Term Issuer Default Rating (IDR) is 'A-' and the  Rating Outlook is Stable. KEY RATING DRIVERS Comp",
        "date": "09062016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Fitch Rates Verizon's Sr. Unsecured Note Offering 'A-'; Outlook Stable "
    },
    {
        "content": "NEW YORK  Sept 1 Verizon Communications Inc  said on Thursday that its chief financial officer  Francis Shammo  plans to retire at the end of the year and will step down from his role effective Nov. 1.",
        "date": "09012016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon CFO Shammo to retire at the end of 2016 "
    },
    {
        "content": "NEW YORK  Sept 1 Verizon Communications Inc  said on Thursday that its chief financial officer  Francis Shammo  plans to retire at the end of the year and will step down from his role on Nov. 1.",
        "date": "09012016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon CFO Shammo to retire at the end of 2016 "
    },
    {
        "content": "* Files for potential mixed shelf; size not disclosed - SEC filing  Source: (http://bit.ly/2bYIHMu) Further company coverage:",
        "date": "09012016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications files for potential mixed shelf "
    },
    {
        "content": "* New CFO Matthew Ellis base salary will increase to $700 000  target short-term incentive opportunity will increase from 90% to 150% of base salary  Source text (http://bit.ly/2ciTxi9) Further company coverage:",
        "date": "09012016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon- new CFO's base salary to increase to $700 000 "
    },
    {
        "content": "* Files for offering of $2.06 million of notes due 2046 - SEC filing  Source: (http://bit.ly/2c1avA2) Further company coverage:",
        "date": "09022016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications files for offering of $2.06 mln of notes "
    },
    {
        "content": "* Declared a qtrly dividend of 57.75 cents per outstanding share  an increase of 1.25 cents per share  or 2.2 percent  from previous quarter  Source text for Eikon:  Further company coverage:",
        "date": "09012016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon declares qtrly dividend of 57.75 cents/share "
    },
    {
        "content": "* Notice to holders of redemption of notes and termination of listing on taipei exchange",
        "date": "08232016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications will redeem all of outstanding 4.80% notes  due September 23  2044 "
    },
    {
        "content": "* Announced multi-platform content offering for nbcuniversal's coverage of games of xxxi olympiad to commence on aug 5  Source text for Eikon:  Further company coverage:",
        "date": "08042016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon announces content offering for NBCuniversal's coverage of Games of XXXI Olympiad "
    },
    {
        "content": "* Ronan Dunne named President of Verizon Wireless  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "08022016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications - Ronan Dunne named President of Verizon Wireless "
    },
    {
        "content": "Verizon Communications Inc said on Monday it would buy GPS vehicle tracking firm Fleetmatics Group Plc for about $2.4 billion in cash to bolster its expansion into the connected vehicle and fleet management market.",
        "date": "08012016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon to buy vehicle management company Fleetmatics for $2.4 billion "
    },
    {
        "content": "Aug 1 Verizon Communications Inc said on Monday it would buy GPS vehicle tracking firm Fleetmatics Group Plc for about $2.4 billion in cash to bolster its expansion into the connected vehicle and fleet management market.",
        "date": "08012016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-Verizon to buy vehicle management company Fleetmatics for $2.4 bln "
    },
    {
        "content": "Aug 1 Verizon Communications Inc said it will buy GPS vehicle tracking company Fleetmatics Group Plc  for about $2.4 billion in cash.",
        "date": "08012016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to buy Fleetmatics for about $2.4 bln "
    },
    {
        "content": "* Fleetmatics cancels previously scheduled quarterly conference call  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08012016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to acquire Fleetmatics "
    },
    {
        "content": "* BP Trinidad and Tobago LLC  and Atlantic LNG today announced successful sanction of Trinidad onshore compression (TROC) project",
        "date": "07292016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-BP Trinidad & Tobago and Atlantic LNG announce successful sanction of the Trinidad Onshore Compression project "
    },
    {
        "content": "NEW YORK  July 28 For the oil industry  Yahoo Inc's decision this week to sell its core business to Verizon Communications Inc for $4.8 billion does not matter all that much. Their world already changed a few months ago  when the company said it would jettison its messaging system that has been the norm for oil traders since the late 1990s.",
        "date": "07282016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Bytes and barrels: the origins of oil traders' love of Yahoo "
    },
    {
        "content": "* Files for floating rate notes offering; size not disclosed -  Sec filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07272016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications files for floating rate notes offering "
    },
    {
        "content": "* Moody's expects the deal between Yahoo and Verizon to close in the first quarter of 2017",
        "date": "07252016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Moody's says Verizon's purchase of Yahoo will not impact its baa1 rating "
    },
    {
        "content": "July 25 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "07252016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* If purchase agreement is terminated  company may be required to pay Verizon a termination fee of $144.8 million in certain circumstances - SEC filing",
        "date": "07252016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Yahoo  Verizon set termination fee for core business deal at $144.8 mln - SEC filing "
    },
    {
        "content": "* Will get non-exclusive  worldwide  perpetual  royalty-free license to all of Yahoo's IP that is not being conveyed with operating business  Source text - http://bit.ly/2anhx2d Further company coverage:",
        "date": "07252016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to get Yahoo's IP license that is not being conveyed with oper business "
    },
    {
        "content": "* Until closing  Yahoo will continue to operate independently",
        "date": "07252016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to buy Yahoo's operating business for $4.83 bln "
    },
    {
        "content": "July 25 Verizon Communications Inc said it had agreed to buy Yahoo Inc's core internet business for $4.83 billion in cash  ending a lengthy sale process for the fading Web pioneer.",
        "date": "07252016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to buy Yahoo's core business for $4.83 billion "
    },
    {
        "content": "* Fitch affirms Verizon's IDR at 'A-'; Outlook stable  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07262016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Fitch affirms Verizon's IDR at 'A-' Outlook stable "
    },
    {
        "content": "July 24 Verizon Communications Inc will announce an agreement on Monday to buy Yahoo Inc for about $5 billion  according to a person familiar with the matter.",
        "date": "07242016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon to announce $5 billion deal to buy Yahoo  Monday -source "
    },
    {
        "content": "Verizon Communications Inc  disappointed Wall Street on Tuesday by reporting a smaller-than-expected subscriber gain for its main wireless business  while its CEO gave few details about plans to increase revenue from its planned purchase of Yahoo Inc's  internet assets.",
        "date": "07262016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon posts subscriber gain shortfall  says Yahoo to fuel media push "
    },
    {
        "content": "July 26 Verizon Communications Inc  disappointed Wall Street on Tuesday by reporting a smaller-than-expected subscriber gain for its main wireless business  while its CEO gave few details about plans to increase revenue from its planned purchase of Yahoo Inc's  internet assets.",
        "date": "07262016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 6-Verizon posts subscriber gain shortfall  says Yahoo to fuel media push "
    },
    {
        "content": "July 24 Verizon Communications Inc will announce an agreement on Monday to buy Yahoo Inc for about $5 billion  according to a person familiar with the matter.",
        "date": "07242016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to announce $5 billion deal to buy Yahoo  Monday -source "
    },
    {
        "content": "* Verizon reports 2Q results  reflecting continued strong operations while advancing key strategic and financial initiatives",
        "date": "07262016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications reports Q2 earnings per share $0.17 "
    },
    {
        "content": "July 26 Verizon Communications Inc  the No. 1 U.S. wireless carrier by subscribers  reported a 5.3 percent fall in quarterly revenue as more customers opted for cheaper plans.",
        "date": "07262016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon reports 5.3 pct fall in revenue "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO  July 25 Verizon Communications Inc said on Monday it would buy Yahoo Inc's core internet properties for $4.83 billion in cash  marking the end of the line for a storied Web pioneer and setting the stage for a big new internet push by the telecom giant.",
        "date": "07262016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 7-Verizon to buy Yahoo's core business for $4.8 bln in digital ad push "
    },
    {
        "content": "Yahoo Inc  is focusing on U.S. telecommunications company Verizon Communications Inc  as the buyer of its core business after reviewing final bids that it received this week  people familiar with the matter said on Friday. | Video ",
        "date": "07222016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon emerges as front-runner in Yahoo auction: sources "
    },
    {
        "content": "* Indexes up: Dow 0.15 pct  S&P 0.34 pct  Nasdaq 0.49 pct   (Updates to late afternoon)",
        "date": "07222016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St edges higher  led by telecoms; GE weighs "
    },
    {
        "content": "July 22 Yahoo Inc is focusing on U.S. telecommunications company Verizon Communications Inc as the buyer of its core business after reviewing final bids that it received this week  people familiar with the matter said on Friday.",
        "date": "07222016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "REFILE-UPDATE 3-Verizon emerges as front-runner in Yahoo auction -sources "
    },
    {
        "content": "July 22 Verizon Communications Inc is the lead bidder to acquire Yahoo Inc's core business  Bloomberg reported on Friday.",
        "date": "07222016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon nearing deal to acquire Yahoo's core business - Bloomberg "
    },
    {
        "content": "WASHINGTON  July 21 The U.S. Federal Communications Commission said Thursday it is pausing its review of Verizon Communication Inc's planned $1.8 billion acquisition of Carl Icahn's XO Communications fiber-optic business.",
        "date": "07212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. pauses review of Verizon deal to buy XO Holdings "
    },
    {
        "content": "SAN FRANCISCO July 21 Former Yahoo executive Dan Rosensweig has not worked at the pioneering internet company in nearly a decade.",
        "date": "07212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "RPT-Silicon Valley's Yahoo diaspora mourns company's decline "
    },
    {
        "content": "* U.S. General Services Administration awarded extensions to Verizon for contracts held by co under agency's Networx program",
        "date": "07202016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-U.S. General Services Administration extends Networx contracts with Verizon "
    },
    {
        "content": "July 19 Leading bidders for Yahoo Inc's  core business are Verizon Communications Inc  Quicken Loans Inc founder Dan Gilbert and Vector Capital Management  Bloomberg reported on Tuesday  citing people familiar with the matter.",
        "date": "07192016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon among leading bidders for Yahoo's core business-Bloomberg "
    },
    {
        "content": "SAN FRANCISCO July 21 Former Yahoo executive Dan Rosensweig has not worked at the pioneering internet company in nearly a decade.",
        "date": "07212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Silicon Valley's Yahoo diaspora mourns company's decline "
    },
    {
        "content": "* Verizon  Quicken Loans  Vector Capital said among likely winning Yahoo bidders - Bloomberg citing sources",
        "date": "07192016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon  Quicken  Vector said among likely winning Yahoo bidders - BBG "
    },
    {
        "content": "* Has entered pre-commercial 5G testing  which is currently underway in multiple locations in New Jersey  Massachusetts  and Texas  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07112016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon announces completion of its 5G radio specification "
    },
    {
        "content": "July 7 Tony Whittemore  a former senior banker at Deutsche Bank  is joining Barclays as executive chairman of mergers and acquisitions (M&A) in New York starting on Thursday  the London-based bank said in an internal memo.",
        "date": "07072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "MOVES-Barclays hires new executive M&A chairman Whittemore "
    },
    {
        "content": "NEW YORK  July 6 Verizon Communications Inc   the No. 1 U.S. wireless provider  said on Wednesday that it would increase plan rates but expand data buckets by 30 percent to its customers  who increasingly consume content through mobile devices.",
        "date": "07062016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon raises wireless plan rates  offers more data "
    },
    {
        "content": "NEW YORK (IFR) - Mobile phone giant Verizon has mandated banks for the first ever securitization to be backed by cell phone contracts in the US  one of the banks managing the deal told IFR on Tuesday.",
        "date": "06282016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon hires banks for debut cell phone ABS "
    },
    {
        "content": "* Verizon to enhance significantly its connected vehicle business with the acquisition of Telogis",
        "date": "06212016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to acquire privately-held Telogis Inc "
    },
    {
        "content": "NEW YORK Unions representing nearly 40 000 Verizon Communications Inc  workers ratified a new labor deal on Friday  the company said  ending a months-long dispute that had prompted a nearly 7-week employee strike.",
        "date": "06172016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Unions ratify Verizon labor contract "
    },
    {
        "content": "NEW YORK  June 17 Unions representing nearly 40 000 Verizon Communications Inc workers ratified a new labor deal on Friday  the company said  ending a months-long dispute that had prompted a nearly 7-week employee strike.",
        "date": "06172016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Unions ratify Verizon labor contract "
    },
    {
        "content": "NEW YORK U.S. telecommunications rivals Verizon Communications Inc and AT&T Inc are set to go through to the third and final round of bidding in the auction for Yahoo Inc's core internet assets  according to people familiar with the matter.",
        "date": "06132016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Exclusive: Verizon  AT&T set to make final round of bids for Yahoo web assets - sources "
    },
    {
        "content": "June 9 Verizon Communications Inc did not submit the highest offer this week in the second round of bidding for Yahoo Inc's core internet assets  according to a person familiar with the matter.",
        "date": "06092016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon's bid for Yahoo's web assets topped by others -source "
    },
    {
        "content": "* Yahoo receives multiple bids for core biz at or above $5 bln; Verizon bid over $3.5 bln  among lower bids - CNBC  citing sources",
        "date": "06092016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Yahoo receives multiple bids for core biz at or above $5 billion - CNBC  citing sources "
    },
    {
        "content": "NEW YORK The seven-week strike by Verizon Communications Inc's  wireline workers will hurt the company's second-quarter earnings and potentially cost up to 7 cents per share  its chief financial officer said.",
        "date": "06082016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon strike seen hitting second-quarter earnings: CFO "
    },
    {
        "content": "Verizon Communications Inc plans to submit a second-round bid of around $3 billion for Yahoo Inc's core internet business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06072016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon to submit $3 billion bid for Yahoo's internet business: WSJ "
    },
    {
        "content": "NEW YORK  June 8 The seven-week strike by Verizon Communications Inc's wireline workers will hurt the company's second-quarter earnings and potentially cost up to 7 cents per share  its chief financial officer said.",
        "date": "06082016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon strike seen hitting second-quarter earnings -CFO "
    },
    {
        "content": "June 6 Verizon Communications Inc plans to submit a second-round bid of around $3 billion for Yahoo Inc's core internet business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon to submit $3 bln bid for Yahoo's internet business - WSJ "
    },
    {
        "content": "June 6 Verizon Communications Inc plans to submit a second-round bid of around $3 billion for Yahoo Inc's core internet business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to submit $3 bln bid for Yahoo's internet business - WSJ "
    },
    {
        "content": "* Verizon to bid $3 bln for Yahoo's web assets in second round of bidding; bid to exclude Yahoo's patents & real estate-CNBC  citing DJ",
        "date": "06072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to bid $3 bln for Yahoo's web assets in second round of bidding - CNBC  citing DJ "
    },
    {
        "content": "* Sets quarterly dividend of $0.565 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06022016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon Communications sets quarterly dividend of $0.565 per share "
    },
    {
        "content": "WASHINGTON  June 3 The U.S. economy created the fewest number of jobs in more than 5-1/2-years in May as manufacturing and construction employment fell sharply  which could make it harder for the Federal Reserve to raise interest rates.",
        "date": "06032016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "WRAPUP 6-Weak U.S. employment report dims prospect of Fed rate hike "
    },
    {
        "content": "WASHINGTON  June 3 A strike by Verizon  workers likely crimped U.S. job gains in May  but employment growth should still be strong enough to confirm a tightening labor market and push the Federal Reserve closer to raising interest rates soon.",
        "date": "06032016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "WRAPUP 1-U.S. job gains in May likely dented by Verizon strike "
    },
    {
        "content": "A tentative deal between Verizon Communications Inc  and leaders of striking unions includes 1 400 new jobs and pay raises topping 10 percent  the company and unions representing about 40 000 workers said on Monday  hoping to end a walkout that has lasted nearly seven weeks. | Video ",
        "date": "05312016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon  unions agree to pay raises  new jobs to end strike "
    },
    {
        "content": "May 30 A tentative deal between Verizon Communications Inc and leaders of striking unions includes 1 400 new jobs and pay raises topping 10 percent  the company and unions representing about 40 000 workers said on Monday  hoping to end a walkout that has lasted nearly seven weeks.",
        "date": "05312016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 7-Verizon  unions agree to pay raises  new jobs to end strike "
    },
    {
        "content": "* Verizon Reaches Tentative Agreements With Unions Representing Wireline Employees",
        "date": "05302016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon reaches tentative agreements with unions representing wireline employees "
    },
    {
        "content": "May 30 Verizon Communications Inc has agreed to add 1 300 new jobs on the U.S. East Coast and provide 10.9 percent in pay raises over four years under a tentative deal between the company and unions  the Communications Workers of America said on Monday.",
        "date": "05302016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. union say Verizon to add 1 300 jobs  provide 10.9 pct pay hikes "
    },
    {
        "content": "* Deal With Verizon Provides For $1250 Signing Bonus In Mid-Atlantic; $1000 Signing Bonus  $250 Healthcare Reimbursement Account In Northeast",
        "date": "05302016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Union CWA says 4-yr proposed agreement with Verizon provides 10.9 pct in raises "
    },
    {
        "content": "NEW YORK Verizon Communications Inc and unions representing nearly 40 000 wireline workers have reached a tentative deal to end a strike that has stretched for more than month  U.S. Secretary of Labor Thomas Perez said on Friday.",
        "date": "05272016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon and unions reach tentative deal to end strike "
    },
    {
        "content": "NEW YORK  May 27 Verizon Communications Inc  and unions representing nearly 40 000 wireline workers have reached a tentative deal \"in principle\" to end a strike that started April 13th  U.S. Secretary of Labor Thomas Perez said on Friday.",
        "date": "05272016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-Verizon and unions reach tentative deal to end strike "
    },
    {
        "content": "May 24 Verizon Communications Inc Chief Executive Officer Lowell McAdam said on Tuesday the ongoing strike by the No.1 U.S. wireless provider's nearly 40 000 union employees could pressure second-quarter results.",
        "date": "05242016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon CEO says strike may impact second-quarter results "
    },
    {
        "content": "WASHINGTON The strike by Verizon Communications Inc  workers will probably trim U.S. non-farm payroll growth in May by at least 35 000 jobs  a Labor Department report showed on Friday.",
        "date": "05272016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon strike seen lowering U.S. May payrolls by 35 000 jobs "
    },
    {
        "content": "WASHINGTON  May 27 The strike by Verizon Communications Inc workers will probably trim U.S. non-farm payroll growth in May by at least 35 000 jobs  a Labor Department report showed on Friday.",
        "date": "05272016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon strike seen lowering U.S. May payrolls by 35 000 jobs "
    },
    {
        "content": "NEW YORK  May 27 Verizon Communications Inc  and unions representing nearly 40 000 wireline workers have reached a tentative deal to end a strike that has stretched for more than month  U.S. Secretary of Labor Thomas Perez  said on Friday.",
        "date": "05272016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon and unions reach tentative deal to end labor strike "
    },
    {
        "content": "WASHINGTON  May 27 The strike by Verizon Communications Inc workers will likely trim U.S. nonfarm payroll growth in May by at least 35 000 jobs  a Labor Department report showed on Friday.",
        "date": "05272016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon strike seen cutting 35 000 jobs off U.S. May payrolls "
    },
    {
        "content": "* Thursday  striking Verizon workers to converge outside a summit where Verizon CFO will be speaking - workers union  Further company coverage:",
        "date": "05182016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Striking Verizon workers to protest Verizon CFO "
    },
    {
        "content": "May 17 Verizon Communications Inc and representatives from two striking unions will continue contract discussions in Washington this week with the help of the U.S. Department of Labor  the regulator said.",
        "date": "05182016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon  striking unions to continue talks  U.S. Labor Dept. says "
    },
    {
        "content": "Verizon Communications Inc  and representatives from two striking unions will return to the negotiating table on Tuesday after a weekend meeting with U.S. Secretary of Labor Thomas Perez.",
        "date": "05162016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon  striking unions set talks after meeting with U.S. official "
    },
    {
        "content": "May 16 Verizon Communications Inc and representatives from two striking unions will return to the negotiating table on Tuesday after a weekend meeting with U.S. Secretary of Labor Thomas Perez.",
        "date": "05162016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "REFILE-Verizon  striking unions set talks after meeting with U.S. official "
    },
    {
        "content": "* Parties in ongoing Verizon labor dispute agree to return to 'bargaining table' on Tuesday - U.S. Secretary of Labor Thomas Perez  Further company coverage:",
        "date": "05162016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Parties in ongoing Verizon labor dispute agree to return to 'bargaining table' on Tuesday "
    },
    {
        "content": "* Verizon says its enterprise solutions unit to launch new cloud backup service using actifio's platform  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05112016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon's enterprise solutions unit to launch new cloud backup service using Actifio's platform "
    },
    {
        "content": "NEW YORK Verizon Communications Inc said on Tuesday it has reached a settlement with ESPN in a lawsuit over the slimmed-down Verizon-Fios pay-TV offering that had left the sports channel out of the basic package.",
        "date": "05102016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon  ESPN reach settlement in Fios pay-TV lawsuit "
    },
    {
        "content": "NEW YORK  May 10 Verizon Communications Inc  said on Tuesday it has reached a settlement with ESPN in a lawsuit over the slimmed-down Verizon-Fios pay-TV offering that had left the sports channel out of the basic package.",
        "date": "05102016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon  ESPN reach settlement in Fios pay-TV lawsuit "
    },
    {
        "content": "NEW YORK  May 10 Verizon Communications Inc  said on Tuesday it has reached a  settlement with ESPN in a lawsuit over its Fios pay-TV offering.",
        "date": "05102016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon and ESPN reach settlement in Fios pay-TV lawsuit "
    },
    {
        "content": "* Continues to expect approximately $1 billion of transformation program costs",
        "date": "05032016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Sprint posts Q4 loss per share $0.14 "
    },
    {
        "content": "* Verizon selects Gemalto to migrate to next-generation advanced OTA technology for 4G LTE services  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "05032016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Gemalto selected by Verizon in business deal "
    },
    {
        "content": "Dozens of Verizon Communications Inc  landline workers  on strike since mid-April after contract talks hit an impasse  marched on the company's annual shareholder meeting in Albuquerque  New Mexico  on Thursday and several people were arrested for blocking traffic  unions said.",
        "date": "05052016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Striking union workers protest at Verizon shareholder meeting "
    },
    {
        "content": "Verizon Communications Inc said it had presented a revised and \"final\" contract proposal to unions representing nearly 40 000 striking workers  who walked off their jobs in mid-April after talks over a new labor agreement hit an impasse.",
        "date": "04282016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Strike-hit Verizon makes 'final' contract proposal to unions "
    },
    {
        "content": "Verizon Communications Inc said it had presented a revised and \"final\" contract proposal to unions representing nearly 40 000 striking workers  who walked off their jobs in mid-April after talks over a new labor agreement hit an impasse.",
        "date": "04282016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon offers updated 'final' contract proposal to worker unions "
    },
    {
        "content": "April 28 Verizon Communications Inc said it presented unions with an improved contract proposal for about 36 000 workers in the U.S. Northeast and Mid-Atlantic regions.",
        "date": "04282016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon offers improved contract proposal to worker unions "
    },
    {
        "content": "* Company increased its wage offer to 7.5 percent over term of contract",
        "date": "04282016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon meets with unions and makes contract proposal "
    },
    {
        "content": "A New York state judge on Wednesday ordered Verizon Communications Inc workers who are on strike in the state to stop engaging in \"violence  sabotage or vandalism\" and set other restrictions on their picketing.",
        "date": "04272016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "N.Y. judge tells Verizon picketers to cease violence  vandalism "
    },
    {
        "content": "NEW YORK  April 27 A strike by nearly 40 000 Verizon Communications Inc workers is in its third week with unions and the company still far apart on contract talks  even as employee healthcare benefits are set to expire on Saturday.",
        "date": "04272016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon  striking unions at impasse as health benefits to expire "
    },
    {
        "content": "* Says Verizon reports 57 suspected incidents of network sabotage and related criminal activity in past two weeks  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04272016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon reports 57 suspected incidents of network sabotage and related criminal activity in past two weeks "
    },
    {
        "content": "* Verizon and Hearst Enter Into Agreement to Acquire Complex to Expand Joint Portfolio of Millennial Digital Video Channels",
        "date": "04182016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon and Hearst Enter Into Agreement to Acquire Complex to Expand Joint Portfolio of Millennial Digital Video Channels "
    },
    {
        "content": "Verizon Communications Inc said an ongoing strike by its wireline workers was expected to hurt earnings in the current quarter  even as it reported first-quarter net income that met analyst expectations amid strong tablet sales. | Video ",
        "date": "04212016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Strike to pressure Verizon earnings; Q1 net income meets estimates "
    },
    {
        "content": "April 21 Wall Street suffered its first loss in four sessions on Thursday after a mixed bag of quarterly reports and a warning by Verizon Communications that a strike by workers would likely impact its bottom line.",
        "date": "04212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall Street cedes ground after mixed bag of earnings "
    },
    {
        "content": "April 21 Wall Street suffered its first loss in four sessions on Thursday after a mixed bag of quarterly reports and a warning by Verizon Communications that a strike by workers would likely impact its bottom line.",
        "date": "04212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-US STOCKS-Wall Street cedes ground after mixed bag of earnings "
    },
    {
        "content": "April 21 Verizon Communications Inc said an ongoing strike by its wireline workers was expected to hurt earnings in the current quarter  even as it reported first-quarter net income that met analyst expectations amid strong tablet sales.",
        "date": "04212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 5-Strike to pressure Verizon earnings; Q1 net income meets estimates "
    },
    {
        "content": "* Verizon delivers continued earnings and operational growth in Q1",
        "date": "04212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon reports Q1 earnings per share $1.06 "
    },
    {
        "content": "April 21 Verizon Communication Inc  reported 0.6 percent rise in total operating revenue as heavy promotions helped the No. 1 U.S. wireless carrier attract more postpaid subscribers.",
        "date": "04212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon's quarterly revenue rises 0.6 percent "
    },
    {
        "content": "NEW YORK  April 14 A one-day-old strike by nearly 40 000 Verizon Communications Inc employees is causing equipment installation delays for new Internet and TV customers  a Verizon executive acknowledged on Thursday.",
        "date": "04142016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon servicing current customers  delays new installations in strike "
    },
    {
        "content": "* CWA and IBEW met with verizon to discuss contract covering workers in Pennsylvania  New Jersey  Delaware  Maryland  D.C.  Virginia  West Virginia",
        "date": "04152016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-CWA-CWA and IBEW met with Verizon to discuss contract covering workers in Pennsylvania  New Jersey  Delaware  Maryland  D.C.  Virginia  West Virginia "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  WEEK AHEAD  Markets have a number of issues to focus on next week  beginning with the outcome of Sunday's meeting of oil ministers from the major oil producing nations. But nobody should get their hopes up all that much for a major change in OPEC's pr",
        "date": "04152016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "What to Watch in the Week Ahead and on Monday  April 18 "
    },
    {
        "content": "WASHINGTON  April 15 The Obama administration on Friday weighed in on the debate over allowing consumers to switch from pricey cable television boxes to less expensive devices  urging regulators to set an example for the rest of government on how to boost competition.",
        "date": "04152016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Obama urges more consumer choices for cable TV set-top boxes "
    },
    {
        "content": "WASHINGTON  April 15 The Obama administration on Friday weighed into the debate over allowing consumers to switch pricey cable television boxes for less expensive devices  urging an agency to set an example for other parts of government to boost competition.",
        "date": "04152016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Obama urges agency to open competition in cable TV boxes "
    },
    {
        "content": "* Mayor Martin Walsh announced new partnership with co to replace copper-based infrastructure with fiber-optic network platform across Boston",
        "date": "04122016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Mayor Martin Walsh announces $300 mln partnership with Verizon for fiber-optic network platform "
    },
    {
        "content": "NEW YORK Nearly 40 000 Verizon workers walked off the job on Wednesday in one of the largest U.S. strikes in recent years after contract talks hit an impasse  and got a boost as U.S. Democratic presidential hopeful Bernie Sanders joined them at a Brooklyn rally ahead of the New York primary next week. | Video ",
        "date": "04132016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "About 40 000 unionized Verizon workers walk off the job "
    },
    {
        "content": "NEW YORK  April 13 Nearly 40 000 Verizon workers walked off the job on Wednesday in one of the largest U.S. strikes in recent years after contract talks hit an impasse  and got a boost as U.S. Democratic presidential hopeful Bernie Sanders joined them at a Brooklyn rally ahead of the New York primary next week.",
        "date": "04132016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 6-About 40 000 unionized Verizon workers walk off the job "
    },
    {
        "content": "NEW YORK Verizon Communications Inc's wireline employees will go on strike starting Wednesday after reaching an impasse in talks over a new labor contract  union officials said on Monday. | Video ",
        "date": "04112016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon wireline workers' strike to start Wednesday: unions "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Verizon Communications  workers are bolstering unions' cautious comeback. The telecom company's staff walked out in one of the largest U.S. strikes in years after contract talks stalled. Add a Supreme Court win  minimum-wage hikes and a big role in presidential races  and organized labor's future begins to look a bit brighter.",
        "date": "04132016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Breakingviews: Verizon workers bolster unions' cautious comeback "
    },
    {
        "content": "* CWA and IBEW leaders call strike against verizon and its customers",
        "date": "04132016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon says CWA and IBEW leaders call strike against co "
    },
    {
        "content": "NEW YORK  April 11 Verizon Communications Inc's  wireline employees will go on strike starting Wednesday after reaching an impasse in talks over a new labor contract  union officials said on Monday.",
        "date": "04112016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon wireline workers' strike to start Wednesday -unions "
    },
    {
        "content": "NEW YORK  April 11 Verizon Communications Inc's  wireline employees have decided to go on strike starting April 13  as no resolution is seen in ongoing contract talks  the unions representing its wireline unit workers said on Monday.",
        "date": "04112016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon's wireline employees plan to strike starting April 13  unions say "
    },
    {
        "content": "* Verizon workers to strike to save good jobs and ensure quality service for customers",
        "date": "04132016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Nearly 40 000 Verizon workers set to go on strike - unions "
    },
    {
        "content": "* Verizon willing to acquire the company's Yahoo Japan stake to help sweeten the offer - Bloomberg  citing sources",
        "date": "04072016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to proceed with Yahoo bid  Google weighs offer- Bloomberg  citing sources "
    },
    {
        "content": "* Indexes down: Dow 1.1 pct  S&P 1.3 pct  Nasdaq 1.5 pct   (Updates to late afternoon)",
        "date": "04072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St falls amid global growth worries "
    },
    {
        "content": "* Indexes down: Dow 1 pct  S&P 1.2 pct  Nasdaq 1.5 pct   (Updates to close)",
        "date": "04072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St drops amid global growth worries "
    },
    {
        "content": "Verizon Communications Inc  said it agreed to buy a 24.5 percent stake in AwesomenessTV  whose YouTube channels are among the most popular on the video site  for about $160 million.",
        "date": "04062016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon to buy 24.5 percent stake in AwesomenessTV "
    },
    {
        "content": "April 6 Verizon Communications Inc said it agreed to buy a 24.5 percent stake in AwesomenessTV  whose YouTube channels are among the most popular on the video site  for about $160 million.",
        "date": "04062016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon to buy 24.5 pct stake in AwesomenessTV "
    },
    {
        "content": "* Verizon  Dreamworks animation  Hearst and awesomenesstv to redefine premium mobile video",
        "date": "04062016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon to buy about 24.5 pct stake in AwesomenessTV "
    },
    {
        "content": "April 6 Verizon Communications Inc said it agreed to buy a 24.5 percent stake in AwesomenessTV and create a new short-form mobile video service as part of the deal.",
        "date": "04062016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to buy 24.5 pct stake in AwesomenessTV "
    },
    {
        "content": "WASHINGTON  March 31 The U.S. Federal Communications Commission on Thursday advanced a proposal to ensure the privacy of broadband Internet users by barring providers from collecting user data without consent.",
        "date": "03312016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "FCC advances privacy proposal for U.S. internet users "
    },
    {
        "content": "* Netflix admits for first time that it throttles videos on most mobile networks around the world  including Verizon and AT&T networks -CNBC  citing DJ",
        "date": "03242016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Netflix admits for first time that it throttles videos on most mobile networks around the world  including Verizon and AT&T networks -CNBC  citing DJ "
    },
    {
        "content": "* Pricing of its previously announced cash tender offer  for up to $5.5 billion aggregate purchase price",
        "date": "03212016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon prices tender offer for all series of Waterfall notes "
    },
    {
        "content": "* \"see protecting an open internet as a business imperative that is inextricably tied to our future success\"  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "03212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon communications inc - \"see protecting an open internet as a business imperative that is inextricably tied to our future success\" "
    },
    {
        "content": "* Verizon Communications Inc says has increased Waterfall cap from $4 billion aggregate purchase price to $5.5 billion aggregate purchase price",
        "date": "03212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "BRIEF-Verizon announces early participation results and upsizing of its tender offer for all series of Waterfall notes "
    },
    {
        "content": "NEW YORK  March 20 A quiet decision by private equity firm Blackstone Group LP to recently sell three TV stations may foreshadow uncertain returns for some selling TV airwaves and lower wireless demand in the U.S. government's upcoming spectrum auction  industry watchers say.",
        "date": "03202016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Blackstone makes quiet sale ahead of FCC airwaves auction "
    },
    {
        "content": "NEW YORK  March 20 A quiet decision by private equity firm Blackstone Group LP to recently sell three TV stations may foreshadow uncertain returns for some selling TV airwaves and lower wireless demand in the U.S. government's upcoming spectrum auction  industry watchers say.",
        "date": "03212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "RPT-Blackstone makes quiet sale ahead of FCC airwaves auction "
    },
    {
        "content": "* Verizon announces modification of pricing terms and deadlines for all series of Waterfall notes in its tender offer",
        "date": "03142016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon modifies pricing terms and deadlines for all series of Waterfall notes "
    },
    {
        "content": "New York Times Co said on Monday Andrew Rosenthal would step down as the newspaper's editorial page editor in late April  and would be succeeded by James Bennet  editor-in-chief of the Atlantic.",
        "date": "03142016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "New York Times' editorial page editor Andrew Rosenthal to step down "
    },
    {
        "content": "Ratings agency Moody's Investors Services said on Tuesday that a proposal by U.S. communications regulators to impose privacy restrictions on broadband providers like Verizon Communications Inc  AT&T Inc  Comcast Corp  and Charter Communications Inc was \"credit-negative.\"",
        "date": "03152016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "FCC Internet privacy proposal could harm broadband providers - Moody's "
    },
    {
        "content": "WASHINGTON  March 15 Ratings agency Moody's Investors Services said on Tuesday that a proposal by U.S. communications regulators to impose privacy restrictions on broadband providers like Verizon Communications Inc  AT&T Inc  Comcast Corp and Charter Communications Inc  was \"credit-negative.\"",
        "date": "03152016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-U.S. FCC Internet privacy proposal could harm broadband providers - Moody's "
    },
    {
        "content": "March 15 Ratings agency Moody's Investors Services said Tuesday a proposal by U.S. communications regulators to impose privacy restrictions on broadband providers like Verizon Communications Inc  AT&T Inc  Comcast Corp and Charter Communications Inc is \"credit negative.\"",
        "date": "03152016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Moody's says FCC internet privacy proposal could harm broad internet providers "
    },
    {
        "content": "WASHINGTON Verizon Communications Inc  will pay a $1.35 million fine and agreed to a three-year consent decree after the Federal Communications Commission said on Monday it found the company's wireless unit violated the privacy of its users.",
        "date": "03072016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon Wireless to pay $1.35 mln fine to settle U.S. privacy probe "
    },
    {
        "content": "WASHINGTON Verizon Communications Inc  will pay a $1.35 million fine and agreed to a three-year consent decree after the Federal Communications Commission said on Monday it found the company's wireless unit violated the privacy of its users.",
        "date": "03072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon Wireless to pay $1.35 million fine to settle U.S. privacy probe "
    },
    {
        "content": "WASHINGTON  March 7 Verizon Communications Inc  will pay a $1.35 million fine and agreed to a three-year consent decree after the Federal Communications Commission said on Monday it found the company's wireless unit violated the privacy of its users.",
        "date": "03072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon Wireless to pay $1.35 mln fine to settle U.S. privacy probe "
    },
    {
        "content": "WASHINGTON  March 7 Verizon Communications Inc  will pay a $1.35 million fine and agreed to three-year consent decree after the Federal Communications Commission said the company's wireless unit violated the privacy of its users.",
        "date": "03072016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon Wireless will pay $1.35 million fine to settle U.S. privacy probe "
    },
    {
        "content": "SAN FRANCISCO  March 3 Yahoo Inc is exploring the sale of $1 billion to $3 billion of patents  property and other \"non-core assets \" its chief financial officer said on Thursday.",
        "date": "03032016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Yahoo exploring sale of $1 bln-$3 bln in 'non-core assets' -CFO "
    },
    {
        "content": "NEW YORK Verizon Communications Inc supports \"the availability of strong encryption with no backdoors \" Chief Executive Lowell McAdam said on Wednesday  weighing in the showdown between Apple Inc and U.S. authorities over mobile device encryption.",
        "date": "02252016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon supports 'strong encryption with no backdoors': CEO "
    },
    {
        "content": "NEW YORK  Feb 24 Verizon Communications Inc  supports \"the availability of strong encryption with no backdoors \" Chief Executive Lowell McAdam said on Wednesday  weighing in the showdown between Apple Inc and U.S. authorities over mobile device encryption.",
        "date": "02242016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon supports 'strong encryption with no backdoors' -CEO "
    },
    {
        "content": "NEW YORK  Feb 24 Verizon Communications Inc  supports \"the availability of strong encryption with no backdoors \" Chief Executive Lowell McAdam said on Wednesday in response to the legal showdown between Apple Inc and U.S. law enforcement over mobile device encryption.",
        "date": "02242016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon supports 'strong encryption with no backdoors' - CEO "
    },
    {
        "content": "* Kudelski Group and Verizon enter into patent cross license agreement and resolve all pending patent litigation  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "02232016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Kudelski and Verizon enter into patent cross license agreement "
    },
    {
        "content": "NEW YORK Verizon Communications Inc  which launched its pay TV plan \"Fios Custom TV\" last year to let viewers choose bundles of channels they want to watch  has redesigned the offering.",
        "date": "02232016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon redesigns its Fios Custom TV offering "
    },
    {
        "content": "Feb 22 The No-1 U.S. wireless phone provider Verizon Communications Inc said it would buy XO Communications' fiber-optic network business for about $1.8 billion.",
        "date": "02222016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to buy XO Communications' fiber-optic business "
    },
    {
        "content": "* New custom TV users can pick 1 of 2 plans: 'essentials' with no sports channels and 'sports & more ' which includes ESPN  Source text for Eikon:  Further company coverage:",
        "date": "02192016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Verizon communications - New custom TV users can pick 1 of 2 plans "
    },
    {
        "content": "NEW YORK  Feb 19 Verizon Communications Inc   which launched its pay TV plan \"Fios Custom TV\" last year to let viewers choose bundles of channels they want to watch  has redesigned the offering.",
        "date": "02232016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "REFILE-UPDATE 2-Verizon redesigns its Fios Custom TV offering "
    },
    {
        "content": "BARCELONA  Feb 22 Commitments AT&T Inc  made to build out fixed high-speed Internet services to gain regulatory approval for its $48.5 billion purchase of DIRECTV will give it the edge over U.S. rival Verizon in the roll-out of the next generation of cellular technology  AT&T's strategy chief said on Monday.",
        "date": "02232016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-AT&T says has edge in 5G due to expanded Internet access "
    },
    {
        "content": "Feb 22 Verizon Communications Inc  the No.1 U.S. wireless service provider  said it would buy Carl Icahn-owned XO Communications' fiber-optic network business for about $1.8 billion.",
        "date": "02222016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon to buy XO Communications' fiber-optic business "
    },
    {
        "content": "NEW YORK  Feb 19 Verizon Communications Inc   which launched its pay TV plan \"FiOS Custom TV\" last year to let viewers choose bundles of channels they want to watch  has redesigned the offering.",
        "date": "02192016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon redesigns its FiOS Custom TV offering "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO  Feb 12 Alphabet Inc's  Google will not participate in the U.S. Federal Communications Commission's upcoming auction of broadcast airwaves that can help the wireless industry improve coverage  a spokeswoman told Reuters on Friday.",
        "date": "02122016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Google says will not participate in 2016 U.S. airwaves auction "
    },
    {
        "content": "LONDON A Virgin Atlantic [VA.UL] flight heading to New York returned to London Heathrow airport on Sunday after a \"laser beam incident\"  the British airline said.",
        "date": "02152016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Virgin Atlantic turns flight back to UK after laser incident "
    },
    {
        "content": "Verizon Communications Inc  has given Tim Armstrong  chief executive officer of its AOL unit  a leading role in exploring a possible bid for Yahoo Inc's  assets  Bloomberg reported  citing a person with knowledge of the situation.",
        "date": "02082016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon enlists AOL CEO to explore Yahoo deal: Bloomberg "
    },
    {
        "content": "Feb 8 Verizon Communications Inc has given Tim Armstrong  chief executive officer of its AOL unit  a leading role in exploring a possible bid for Yahoo Inc's  assets  Bloomberg reported  citing a person with knowledge of the situation.",
        "date": "02082016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-UPDATE 1-Verizon enlists AOL CEO to explore Yahoo deal - Bloomberg "
    },
    {
        "content": "Feb 8 Verizon Communications Inc has given Tim Armstrong  chief executive officer of its AOL unit  a leading role in exploring a possible bid for Yahoo Inc's  assets  Bloomberg reported.",
        "date": "02082016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-Verizon enlists AOL CEO to explore Yahoo deal - Bloomberg "
    },
    {
        "content": "WASHINGTON  Jan 27 The U.S. Federal Communications Commission on Wednesday proposed competition in the pay television set-top box market  a move that could let consumers swap costly cable industry boxes for cheaper service through devices like tablets.",
        "date": "01272016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-U.S. proposes TV set-top box competition to let in new players "
    },
    {
        "content": "NEW YORK  Jan 22 Verizon Communications Inc  is in talks with advertisers and content makers to offer sponsored video  such as sports games and music concerts  to users of its mobile-video service go90 at some time in the future  CFO Fran Shammo told Reuters.",
        "date": "01222016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon eyes brands  content for go90 sponsored video "
    },
    {
        "content": "Verizon Communications Inc on Thursday reported higher-than-expected revenue for the fourth quarter as heavy promotions helped it counter aggressive offers and discounts from rivals and win new users. | Video ",
        "date": "01212016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon adds 1.5 million new monthly users; revenue beats estimates "
    },
    {
        "content": "Jan 21 Verizon Communications Inc on Thursday reported higher-than-expected revenue for the fourth quarter as heavy promotions helped it counter aggressive offers and discounts from rivals and win new users.",
        "date": "01212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-Verizon adds 1.5 million new monthly users; revenue beats estimates "
    },
    {
        "content": "Jan 21 Verizon Communications Inc  the No. 1 U.S. wireless carrier by subscribers  reported a 3.2 percent increase in quarterly revenue as heavy promotions helped it to check customer defections.",
        "date": "01212016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon revenue rises 3.2 pct "
    },
    {
        "content": "Jan 19 Verizon Communications Inc said on Tuesday it launched a beta version of FreeBee Data  a service through which content providers sponsor data services to consumers.",
        "date": "01192016",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon launches sponsored data service "
    },
    {
        "content": "Verizon Communications Inc  has started a process to sell its data center assets  hoping to fetch more than $2.5 billion  people familiar with the matter said on Tuesday  as the U.S. telecommunications conglomerate focuses on its core business.",
        "date": "01062016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Exclusive: Verizon launches auction to sell data centers - sources "
    },
    {
        "content": "Verizon Communications Inc  has started a process to sell its data center assets  hoping to fetch more than $2.5 billion  people familiar with the matter said on Tuesday  as the U.S. telecommunications conglomerate focuses on its core business.",
        "date": "01052016",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Exclusive: Verizon launches auction to sell data centers - sources "
    },
    {
        "content": "WASHINGTON  Dec 13 New York Attorney General Eric Schneiderman invited the public on Sunday to test the speed of their Internet and submit the results online as part of an ongoing probe into whether large providers may be short-changing customers with slower-than-advertised speeds.",
        "date": "12132015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "New York attorney general solicits help from the public in broadband probe "
    },
    {
        "content": "Caroline Campbell  an AOL spokeswoman  confirmed to Reuters that the company was re-aligning and a portion of its workforce has been impacted.",
        "date": "12082015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "AOL to cut 100 jobs  mainly in its dial-up business: Techcrunch "
    },
    {
        "content": "Dec 8 Digital media company AOL has laid off around 100 employees  mainly in its dial-up business  as it looks to eliminate overlap with parent Verizon Communcations Inc   Techcrunch.com reported on Tuesday. (http://tcrn.ch/1N9bTvM)",
        "date": "12082015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AOL to cut 100 jobs  mainly in its dial-up business - Techcrunch "
    },
    {
        "content": "Verizon Communications Inc's  chief financial officer Fran Shammo  said the No. 1 U.S. wireless carrier could look at buying Yahoo Inc's  core business  which includes Mail  its news and sports sites and advertising technology  if it is a good fit.",
        "date": "12072015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon could explore Yahoo's Internet business  CFO says "
    },
    {
        "content": "WASHINGTON A U.S. appeals court heard arguments on Friday over the legality of the Federal Communications Commission's net neutrality rules  in a case that may ultimately determine how consumers get access to content on the Internet.",
        "date": "12042015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. appeals court hears challenge to net neutrality rules "
    },
    {
        "content": "WASHINGTON  Dec 4 A U.S. appeals court heard arguments on Friday over the legality of the Federal Communications Commission's net neutrality rules  in a case that may ultimately determine how consumers get access to content on the Internet.",
        "date": "12042015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-U.S. appeals court hears challenge to net neutrality rules "
    },
    {
        "content": "WASHINGTON  Dec 4 A three-judge U.S. appeals court panel on Friday will consider whether the Federal Communications Commission's (FCC) net neutrality rules are legal  hearing arguments from major cable and telecommunications trade associations and AT&T Inc.",
        "date": "12042015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. court to hear challenge to net neutrality rules "
    },
    {
        "content": "Plans by Yahoo Inc's  board to consider selling its struggling Internet business sent the company's shares up nearly 6 percent on Wednesday  as investors cheered a potential new way to separate Yahoo's traditional services from its valuable investment in Chinese Web merchant Alibaba. | Video ",
        "date": "12032015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo shares rise as board meets and considers sale of Web business "
    },
    {
        "content": "Dec 7 Verizon Communications Inc's chief financial officer Fran Shammo  said the No. 1 U.S. wireless carrier could look at buying Yahoo Inc's core business  which includes Mail  its news and sports sites and advertising technology  if it is a good fit.",
        "date": "12072015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon could explore Yahoo's Internet business  CFO says "
    },
    {
        "content": "Dec 7 Verizon Communications Inc's  finance chief  Fran Shammo  said the No. 1 U.S. wireless carrier could look at buying Yahoo Inc's core business  which includes Mail  its news and sports sites and advertising technology.",
        "date": "12072015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon could consider buying Yahoo's internet business "
    },
    {
        "content": "Dec 2 Plans by Yahoo Inc's board to consider selling its struggling Internet business sent the company's shares up nearly 6 percent on Wednesday  as investors cheered a potential new way to separate Yahoo's traditional services from its valuable investment in Chinese Web merchant Alibaba.",
        "date": "12032015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Yahoo shares rise as board meets and considers sale of Web business "
    },
    {
        "content": "Plans by Yahoo Inc's  board to consider selling its struggling Internet business sent the company's shares up more than 5 percent on Wednesday  as investors cheered a potential new way to separate Yahoo's traditional services from its valuable investment in Chinese Web merchant Alibaba. | Video ",
        "date": "12022015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Yahoo shares rise as board meets and considers sale of Web business "
    },
    {
        "content": "Dec 2 Plans by Yahoo Inc's board to consider selling its struggling Internet business sent the company's shares up more than 5 percent on Wednesday  as investors cheered a potential new way to separate Yahoo's traditional services from its valuable investment in Chinese Web merchant Alibaba.",
        "date": "12022015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Yahoo shares rise as board meets and considers sale of Web business "
    },
    {
        "content": "NEW YORK Verizon Communications Inc's CFO Fran Shammo said on Tuesday that media reports saying that the wireless provider is looking to sell some assets from its enterprise business unit were \"speculative\" and that the company will continue supporting enterprise customers.",
        "date": "11102015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon CFO says reports on enterprise assets sales 'speculative' "
    },
    {
        "content": "NEW YORK  Nov 10 Verizon Communications Inc's  CFO Fran Shammo said on Tuesday that media reports saying that the wireless provider is looking to to sell some assets from its enterprise business unit were \"speculative\" and that the company will continue supporting enterprise customers.",
        "date": "11102015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon CFO says reports on enterprise assets sales \"speculative\" "
    },
    {
        "content": "Verizon Communications Inc signed a deal with the National Basketball Association to bring daily league highlights to Verizon's new mobile video streaming app Go90  the New York Times reported on Wednesday.",
        "date": "11042015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon signs content deal with NBA for video streaming app 'Go90' - NYT "
    },
    {
        "content": "NEW YORK Verizon Communications Inc is exploring a sale of its enterprise assets which could be worth as much as $10 billion  according to people familiar with the matter  as the largest U.S. wireless carrier seeks to focus on its core business.",
        "date": "11062015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Exclusive: Verizon weighing $10 billion sale of enterprise assets - sources "
    },
    {
        "content": "Nov 4 Verizon Communications Inc signed a deal with the National Basketball Association to bring daily league highlights to Verizon's new mobile video streaming app Go90  the New York Times reported on Wednesday.",
        "date": "11042015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-Verizon signs content deal with NBA for video streaming app 'Go90' - NYT "
    },
    {
        "content": "* Says its subsidiaries Opentv  Inc. and Nagra France SAS have filed a patent infringement suit against Verizon Communications Inc. and its subsidiary AOL Inc. in the United States district court for eastern district of Texas  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "11022015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Kudelski says its Opentv and Nagra file patent suit against Verizon "
    },
    {
        "content": "NEW YORK Verizon Communications Inc  is trying to pave the way for developers to connect more devices to the Web  as its \"Internet of Things\" business has touched $500 million so far this year  an executive said on Wednesday.",
        "date": "10282015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon says Internet of Things revenue at $500 million year-to-date "
    },
    {
        "content": "NEW YORK  Oct 28 Verizon Communications Inc  is trying to pave the way for developers to connect more devices to the Web  as its \"Internet of Things\" business has touched $500 million so far this year  an executive said on Wednesday.",
        "date": "10282015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon says Internet of Things revenue at $500 mln year-to-date "
    },
    {
        "content": "Oct 26 New York state's attorney general is probing whether three major Internet providers could be shortchanging consumers by charging them for faster broadband speeds and failing to deliver the speeds being advertised  according to documents seen by Reuters.",
        "date": "10262015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 1-NY launches probe into speeds at big Internet broadband providers "
    },
    {
        "content": "* Shares rise about 2 pct premarket   (New throughout  adds details from conference call  comments from CFO  analysts  estimates  updates stock price)",
        "date": "10202015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 3-Verizon results beat estimates as promotions pay off "
    },
    {
        "content": "* Dow up 0.15 pct  S&P up 0.2 pct  Nasdaq down 0.05 pct   (Adds details  changes comment  updates prices)",
        "date": "10202015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St little changed as earnings gain momentum "
    },
    {
        "content": "Verizon Communications Inc reported better-than-expected quarterly revenue and profit as heavy promotions helped the company attract postpaid subscribers amid the launch of Apple Inc's new iPhones.",
        "date": "10202015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon revenue beats as promotions help attract postpaid users "
    },
    {
        "content": "* Futures down: Dow 16 pts  S&P 4 pts  Nasdaq 6.75 pts   (Adds details  comment  updates prices)",
        "date": "10202015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St set to open little changed as results roll in "
    },
    {
        "content": "* Shares rise about 2 pct premarket   (Adds analyst comment  estimates  details; updates shares)",
        "date": "10202015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon revenue beats as promotions help attract postpaid users "
    },
    {
        "content": "Oct 20 Verizon Communication Inc  the largest U.S. wireless service provider  reported a 5 percent rise in quarterly revenue as heavy promotions helped attract postpaid subscribers.",
        "date": "10202015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon's quarterly revenue rises 5 pct "
    },
    {
        "content": "-- Note: Reuters has not verified this story and does not vouch for its accuracy",
        "date": "10082015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "MEDIA-Verizon to raise price of grandfathered unlimited data plans by $20- the Verge "
    },
    {
        "content": "Verizon Communications Inc launched its new mobile video app \"go90\" on Thursday  looking to corner market share in the mobile ad industry dominated by Google Inc and Facebook Inc.",
        "date": "10012015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon launches new mobile video service 'go90' "
    },
    {
        "content": "Oct 1 Verizon Communications Inc launched its new mobile video app \"go90\" on Thursday  looking to corner market share in the mobile ad industry dominated by Google Inc  and Facebook Inc.",
        "date": "10012015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon launches new mobile video service \"go90\" "
    },
    {
        "content": "NEW YORK  Sept 26 Sprint Corp will not join the U.S. government's auction of airwaves set for early 2016  as it has adequate airwaves to currently build out its network and for its future needs  the company said on Saturday.",
        "date": "09262015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 1-Sprint says will sit out of 2016 airwaves auction "
    },
    {
        "content": "NEW YORK Verizon Communications Inc announced on Thursday it would begin to offer roaming wireless service in Cuba next week  becoming the first U.S. company to do so.",
        "date": "09172015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon first to offer cellphone roaming in Cuba "
    },
    {
        "content": "NEW YORK  Sept 17 Verizon Communications Inc  announced on Thursday it would begin to offer roaming wireless service in Cuba next week  becoming the first U.S. company to do so.",
        "date": "09172015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon first to offer cellphone roaming in Cuba "
    },
    {
        "content": "Verizon Communications Inc  said earnings may \"plateau\" next year as evolving consumer habits drive changes to its wireless business model and as the telecom company forays into new markets such as mobile video amid stiff competition.",
        "date": "09172015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon says earnings may 'plateau' in 2016 "
    },
    {
        "content": "Sept 17 Verizon Communications Inc said earnings may \"plateau\" next year as evolving consumer habits drive changes to its wireless business model and as the telecom company forays into new markets such as mobile video amid stiff competition.",
        "date": "09172015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon says earnings may \"plateau\" in 2016 "
    },
    {
        "content": "LAS VEGAS If Verizon's new mobile video service go90 succeeds in grabbing the attention of millenials who increasingly watch content on mobile devices  a streaming option for TVs could be next.",
        "date": "09112015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon says TV streaming could be added to new mobile video service "
    },
    {
        "content": "Sept 11 Want to own the new iPhone without burning a hole in your pocket every month? Sprint seems to be the cheapest option in the United States.",
        "date": "09112015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Sprint's plan for new iPhone trumps other U.S. carriers "
    },
    {
        "content": "NEW YORK  Sept 8 Verizon Communications Inc  will launch a trial version of its new mobile video service on Tuesday  aiming to prove that telecom players can compete with mobile ad industry titans Google Inc and Facebook Inc.",
        "date": "09082015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon launches trial of mobile video service in test for telecom industry "
    },
    {
        "content": "NEW YORK  Aug 11 A U.S. judge has ordered Cablevision Systems Corp to stop running advertisements accusing rival Verizon Communications Inc of lying about having the fastest wireless network.",
        "date": "08112015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. judge tells Cablevision to stop calling Verizon 'liar' "
    },
    {
        "content": "WASHINGTON  Aug 6 The U.S. Federal Communications Commission on Thursday denied T-Mobile US Inc's  request that more airwaves be set aside for smaller wireless companies like itself to bid on during a government auction next year.",
        "date": "08062015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 2-U.S. FCC rejects T-Mobile request to limit spectrum for Verizon  AT&T "
    },
    {
        "content": "The U.S. Federal Communications Commission on Thursday denied T-Mobile US Inc's request that more airwaves be set aside for smaller wireless companies like itself to bid on during a government auction next year.",
        "date": "08062015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "FCC rejects T-Mobile request to limit spectrum for AT&T  Verizon "
    },
    {
        "content": "Thousands of Verizon Communications Inc workers on the U.S. East Coast were poised to strike on Sunday after the company failed to reach agreement with unions as contract negotiations went to the wire  U.S. media reported on Saturday.",
        "date": "08012015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon workers in U.S. East could strike on Sunday: media "
    },
    {
        "content": "Aug 1 Thousands of Verizon Communications Inc  workers on the U.S. East Coast were poised to strike on Sunday after the company failed to reach agreement with unions as contract negotiations went to the wire  U.S. media reported on Saturday.",
        "date": "08012015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon workers in U.S. East could strike on Sunday -media "
    },
    {
        "content": "NEW YORK  Aug 2 Verizon Communications Inc  and the unions representing its wireline unit employees on the U.S. East Coast said work will go on and talks continue after their current contract expired.",
        "date": "08022015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon's workers say no strike for now  union talks continue "
    },
    {
        "content": "NEW YORK  Aug 2 Verizon Communications Inc  and the unions representing its wireline unit employees on the U.S. East Coast said work will go on and talks continue after their current contract expired.",
        "date": "08032015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "RPT-Verizon's workers say no strike for now  union talks continue "
    },
    {
        "content": "Thousands of Verizon Communications Inc workers on the U.S. East Coast could strike on Sunday with no sign of an agreement as contract negotiations with unions went to the wire  a union spokeswoman said on Saturday.",
        "date": "08022015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon workers in U.S. East could strike on Sunday  union says "
    },
    {
        "content": "Aug 1 Thousands of Verizon Communications Inc  workers on the U.S. East Coast could strike on Sunday with no sign of an agreement as contract negotiations with unions went to the wire  a union spokeswoman said on Saturday.",
        "date": "08022015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon workers in U.S. East could strike on Sunday  union says "
    },
    {
        "content": "Verizon Communications Inc  the largest U.S. wireless service provider  said on Friday there was little progress in negotiations with its wireline unit workers on the U.S. East Coast  ahead of the expiry of the current contracts on Aug. 1.",
        "date": "07312015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon sees little progress in talks with wireline workers "
    },
    {
        "content": "July 31 Verizon Communications Inc  the largest U.S. wireless service provider  said on Friday there was little progress in negotiations with its wireline unit workers on the U.S. East Coast  ahead of the expiry of the current contracts on Aug. 1.",
        "date": "07312015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon sees little progress in talks with wireline workers "
    },
    {
        "content": "NEW YORK  July 31 (IFR) - After a stellar start to 2015 the tide has turned against US high-yield issuers  leading to a breakdown in the primary market as investors have become far more sensitive to risk.",
        "date": "07312015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US high-yield shaken by contagion fears "
    },
    {
        "content": "NEW YORK  July 24 Verizon Communication Inc's  wireline unit workers on the U.S. East Coast have voted to go on strike  if needed  amid contract negotiations  the unions representing them said on Saturday.",
        "date": "07252015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon wireline workers authorize strike amid contract negotiations "
    },
    {
        "content": "NEW YORK  July 21 Verizon Communications Inc 's  upcoming mobile video service will drive revenue with a combination of highly targeted ads  exclusive content and pay-per-view live concerts and sporting events  Chief Financial Officer Fran Shammo said in an interview on Tuesday.",
        "date": "07212015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Targeted ads to drive mobile video business  Verizon CFO says "
    },
    {
        "content": "July 21 Verizon Communications Inc on Tuesday lowered its full-year revenue target as it fends promotions from its competitors.",
        "date": "07212015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "RPT-UPDATE 3-Verizon cuts revenue outlook as price war continues "
    },
    {
        "content": "July 21 Verizon Communications Inc on Tuesday lowered its full-year revenue target after users on average paid less for its services during the second quarter amid continuing industry competition and promotional activity.",
        "date": "07212015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "RPT-UPDATE 2-Verizon profit beats on customer additions; revenue outlook lowered "
    },
    {
        "content": "July 21 Verizon Communications Inc on Tuesday lowered its full-year revenue target after users on average paid less for its services during the second quarter amid continuing industry competition and promotional activity.",
        "date": "07212015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Verizon profit beats on customer additions; revenue outlook lowered "
    },
    {
        "content": "Thomson Reuters July 21  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                **",
        "date": "07212015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "July 21 Verizon Communications Inc  the biggest U.S. wireless service provider  reported a 2.4 percent rise in quarterly revenue as it added 1.1 million postpaid wireless subscribers ahead of the launch its online video service.",
        "date": "07212015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "REFILE-Verizon revenue rises as more subscribers sign up "
    },
    {
        "content": "WASHINGTON  June 25 The Federal Communications Commission is considering capping bidding discounts that small businesses can receive in U.S. auctions of airwaves  after Dish Network Corp partners sought $3 billion in discounts under current rules.",
        "date": "06252015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 1-U.S. FCC may cap small-business discount in airwaves auctions "
    },
    {
        "content": "WASHINGTON  June 25 U.S. Federal Communications Commission Chairman Tom Wheeler wants the agency to reject a T-Mobile US Inc request that more airwaves be set aside for smaller wireless companies like itself to bid on during a government auction next year.",
        "date": "06252015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. FCC chair wants no further restrictions for AT&T  Verizon in 2016 auction "
    },
    {
        "content": "Verizon Communications Inc  said it offered salary hikes to 38 000 employee in its East wireline business after its first negotiating session with representatives of the Communications Workers of America and the International Brotherhood of Electrical Workers.",
        "date": "06222015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon offers hikes to 38 000 employees after starting union negotiations "
    },
    {
        "content": "June 22 Verizon Communications Inc said it offered salary hikes to 38 000 employee in its East wireline business after its first negotiating session with representatives of the Communications Workers of America and the International Brotherhood of Electrical Workers.",
        "date": "06222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-Verizon offers hikes to 38 000 employees after starting union negotiations "
    },
    {
        "content": "NEW YORK Cablevision Systems Corp has dropped a lawsuit against Verizon Communications Inc as it sought to combine the case  involving a television commercial that had targeted Verizon's FiOS  with another between the rival companies.",
        "date": "06182015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Cablevision to combine claims vs. Verizon in advertising cases "
    },
    {
        "content": "NEW YORK  June 18 Cablevision Systems Corp  has dropped a lawsuit against Verizon Communications Inc  as it sought to combine the case  involving a television commercial that had targeted Verizon's FiOS  with another between the rival companies.",
        "date": "06182015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Cablevision to combine claims vs. Verizon in advertising cases "
    },
    {
        "content": "NEW YORK  June 18 Cablevision Systems Corp  on Thursday dropped a lawsuit against Verizon Communications Inc that had asked a court to declare as truthful a television commercial claiming Verizon's FiOS service does not only use fiber optic cable.",
        "date": "06182015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Cablevision drops Verizon lawsuit over commercial targeting FiOS "
    },
    {
        "content": "NEW YORK Cablevision Systems Corp sued Verizon Communications Inc on Tuesday  seeking a judge's finding that its television commercial claiming Verizon's FiOS service does not solely use fiber optic cable is truthful.",
        "date": "05192015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Cablevision sues Verizon over commercial targeting FiOS "
    },
    {
        "content": "NEW YORK  May 19 Cablevision Systems Corp  sued Verizon Communications Inc on Tuesday  seeking a judge's finding that its television commercial claiming Verizon's FiOS service does not solely use fiber optic cable is truthful.",
        "date": "05192015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 2-Cablevision sues Verizon over commercial targeting FiOS "
    },
    {
        "content": "NEW YORK  May 19 Cablevision Systems Corp  sued Verizon Communications Inc on Tuesday  seeking a judge's finding that a Cablevision television commercial claiming that Verizon's FiOS service does not solely use fiber optic cable is actually truthful.",
        "date": "05192015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Cablevision sues Verizon over claims in commercial targeting FiOS "
    },
    {
        "content": "NEW YORK Verizon Communications has made clear what it hopes to gain with the $4.4 billion purchase of AOL: a better way to sell mobile video ads.",
        "date": "05132015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon's top goal with AOL: mobile video advertising "
    },
    {
        "content": "May 12 AOL Inc Chief Executive Tim Armstrong's six year path to transforming the venerable dial-up Internet provider into a marketable mobile ad specialist was filled with bumps.",
        "date": "05122015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AOL's Armstrong charted bumpy path to big Verizon sale "
    },
    {
        "content": "Verizon Communications Inc  is buying AOL Inc  in a $4.4 billion bet that a push into mobile video and targeted advertising can help the biggest U.S. telecommunications company find new growth avenues. | Video ",
        "date": "05122015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to buy AOL in $4.4 billion mobile video push "
    },
    {
        "content": "* 10-yr U.S. Treasury yields slip after touching 6-month highs",
        "date": "05122015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St ends weaker as global bond worries deepen "
    },
    {
        "content": "* AOL shares jump 18.4 pct; Verizon down 0.4 pct   (Adds links to graphic  Breakingviews TV)",
        "date": "05122015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 7-Verizon to buy AOL in $4.4 bln mobile video push "
    },
    {
        "content": "May 12 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "05122015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* 10-yr U.S. Treasury yields slip after touching 6-month highs",
        "date": "05122015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St cuts losses as global bond worries weigh "
    },
    {
        "content": "* 10-yr U.S. Treasury yields slip after touching 6-month highs",
        "date": "05122015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Global bond worries push Wall Street lower "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 12 (Fitch) Fitch Ratings has affirmed Verizon Communications Inc.'s  (Verizon; NYSE: VZ) Issuer Default Ratings (IDRs) and debt ratings following its  announcement that it has reached an agreement to purchase AOL Inc. (AOL) for $50  per share  or approximately $4.4 billion. The ratings have been affirmed as follows: Verizon Communications Inc. --Long-term IDR at 'A-'; --Senior unsecured debt at 'A-'; --Senior unsecured revo",
        "date": "05122015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Fitch Affirms Verizon's IDR at 'A-'; Outlook Stable "
    },
    {
        "content": "* 10-yr U.S. Treasury yields fall after touching 6-month highs",
        "date": "05122015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St pares early losses as US Treasuries rebound "
    },
    {
        "content": "April 27 ESPN sued Verizon Communications  on Monday for breach of contract involving a new pay-TV offering  as the cable sports network fired the latest volley in a mounting battle with the telecommunications company.",
        "date": "04272015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 2-ESPN sues Verizon  escalates battle over new pay-TV offering "
    },
    {
        "content": "ESPN sued Verizon Communications on Monday for breach of contract involving a new pay TV offering  as the cable sports network fired the latest volley in a mounting battle with the telecommunications company.",
        "date": "04272015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "ESPN sues Verizon  escalates battle over new pay TV offering "
    },
    {
        "content": "Verizon Communications Inc's quarterly profit beat analysts' expectations  helped by higher net addition of postpaid subscribers as users added more devices to data plans. | Video ",
        "date": "04212015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon profit beats estimates as more users sign up "
    },
    {
        "content": "April 22 Verizon Communications Inc acted on its own when the company decided how to offer ESPN and other Walt Disney Co channels in smaller custom TV packages  a spokeswoman for ESPN said on Wednesday.",
        "date": "04222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "ESPN says Verizon made unilateral decision on custom TV offerings "
    },
    {
        "content": "NEW YORK Verizon Communications Inc said on Thursday that Walt Disney Co and Twenty-First Century Fox are not running ads promoting the wireless carrier's recently launched FiOS Custom TV service on its channels in the New York market.",
        "date": "04232015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon says Disney  Fox pull ads promoting Custom TV in N.Y. "
    },
    {
        "content": "* Dow components Verizon  DuPont and United Tech beat estimates",
        "date": "04212015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St set to rise as results beat low expectations "
    },
    {
        "content": "April 22 Verizon Communications Inc acted on its own when the company decided how to offer ESPN and other Walt Disney Co channels in smaller custom TV packages  a spokeswoman for ESPN said on Wednesday.",
        "date": "04222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-ESPN says Verizon made unilateral decision on custom TV offerings "
    },
    {
        "content": "NEW YORK  April 23 Verizon Communications Inc  said on Thursday that Walt Disney Co is not running ads promoting the wireless carrier's recently launched Fios Custom TV service on its channels in the New York market.",
        "date": "04232015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Disney not running ads promoting FiOS Custom TV in NY "
    },
    {
        "content": "April 22 Verizon Communications Inc acted on its own when the company decided how to offer ESPN and other Walt Disney Co channels in smaller custom TV packages  a spokeswoman for ESPN said on Wednesday.",
        "date": "04232015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-UPDATE 1-ESPN says Verizon made unilateral decision on custom TV offerings "
    },
    {
        "content": "A slew of Dow 30 companies report results in the week: Chemicals conglomerate DuPont  industrial conglomerate United Technologies Corp  property and casualty insurer Travelers Companies Inc and wireless carrier Verizon Communications Inc on Tuesday; McDonald's Corp  AT&T Inc  Boeing Co and Coca-Cola Co on Wednesday; and diversified manufacturer 3M Co  Procter & Gamble and Microsoft Corp on Thursday. While DuPont is expected to report lower first-quarter results  Travelers Companies Inc's first-q",
        "date": "04172015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 1-What to Watch in the Week Ahead and on Monday  April 20 "
    },
    {
        "content": "NEW YORK  April 16 Verizon Communications Inc  is rolling out a new pay TV plan that allows consumers to choose every month bundles of channels they want to see  hoping the flexibility will lure customers away from cable rivals and upstart Web TV companies.",
        "date": "04172015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "RPT-Verizon to offer custom pay TV with monthly programming bundles "
    },
    {
        "content": "NEW YORK  April 16 Verizon Communications Inc  is rolling out a new pay TV plan that allows consumers to choose every month bundles of channels they want to see  hoping the flexibility will lure customers away from cable rivals and upstart Web TV companies.",
        "date": "04172015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to offer custom pay TV with monthly programming bundles "
    },
    {
        "content": "NEW YORK  April 16 Verizon Communications Inc  will offer college sports programming in its upcoming online video service targeted at families and younger viewers who increasingly watch content on mobile devices  the company said on Thursday.",
        "date": "04162015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon adds college sports to mobile video service "
    },
    {
        "content": "April 14 When a cyber security breach hits the news  those most closely involved often have incentive to play up the sophistication of the attack.",
        "date": "04142015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "RPT-User mistakes aid most cyber attacks  Verizon and Symantec studies show "
    },
    {
        "content": "Hackers  most likely from China  have been spying on governments and businesses in Southeast Asia and India uninterrupted for a decade  researchers at internet security company FireEye Inc  said.",
        "date": "04132015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Chinese hackers target Southeast Asia  India  researchers say "
    },
    {
        "content": "NEW YORK  April 14 AT&T Inc and three cable and wireless trade groups filed separate lawsuits on Tuesday challenging the U.S. Federal Communications Commission over its new web traffic regulations.",
        "date": "04142015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-AT&T  trade groups mount court challenge to FCC Internet rules "
    },
    {
        "content": "NEW YORK AT&T Inc  and three cable and wireless trade groups filed separate lawsuits on Tuesday challenging the U.S. Federal Communications Commission over its new web traffic regulations.",
        "date": "04142015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AT&T  trade groups mount court challenge to FCC Internet rules "
    },
    {
        "content": "NEW YORK Cable and wireless trade groups filed separate lawsuits on Tuesday challenging the U.S. Federal Communications Commission over its new web traffic regulations.",
        "date": "04142015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Trade groups mount legal challenges to FCC's new Internet rules "
    },
    {
        "content": "April 14 When a cyber security breach hits the news  those most closely involved often have incentive to play up the sophistication of the attack.",
        "date": "04142015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "User mistakes aid most cyber attacks  Verizon and Symantec studies show "
    },
    {
        "content": "NEW YORK Verizon Communications Inc may rely largely on advertising for revenue from its upcoming online video service  Chief Financial Officer Fran Shammo said in an interview.",
        "date": "03262015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon's online video service revenue may depend on ads: CFO "
    },
    {
        "content": "T-Mobile US Inc rolled out cellular and data plans for business customers  taking aim at a lucrative market segment long dominated by larger rivals AT&T Inc and Verizon Communications Inc.",
        "date": "03182015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "T-Mobile takes aim at business market with new cellular plans "
    },
    {
        "content": "AUSTIN  Tx.  March 16 As his likely rivals spent the weekend shaking hands in New Hampshire  potential Republican candidate Rand Paul flew to Texas to court the software developers and entrepreneurs who are likely to play a central role in the 2016 election.",
        "date": "03162015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Rand Paul woos donors and hackers at tech conference "
    },
    {
        "content": "March 18 T-Mobile US Inc rolled out cellular and data plans for business customers  taking aim at a lucrative market segment long dominated by larger rivals AT&T Inc and Verizon Communications Inc.",
        "date": "03182015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-T-Mobile takes aim at business market with new cellular plans "
    },
    {
        "content": "March 18 T-Mobile US Inc rolled out various promotions and cheap data plans for businesses to take away market share from larger rivals AT&T Inc and Verizon Communications Inc.",
        "date": "03182015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "T-Mobile rolls out promotions for businesses "
    },
    {
        "content": "NEW YORK  March 18 Sony Corp on Wednesday launched its PlayStation Vue Web video service in three cities  targeting customers looking for cheaper alternatives to cable with packages starting at $50.",
        "date": "03182015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Sony's PlayStation Vue online TV service launches at $50 a month "
    },
    {
        "content": "March 11 Verizon Communications Inc will offer more than 200 hours a year of original online programming from DreamWorks Animation and its AwesomenessTV unit in a bid to reach families and younger viewers who increasingly watch video on mobile devices  the companies said on Wednesday.",
        "date": "03112015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "DreamWorks  AwesomenessTV to make original shows for Verizon "
    },
    {
        "content": "NEW YORK AT&T Inc  will link its connected car and smart home technologies to bolster its foothold in the fast-growing market for Internet-connected devices  a new battleground for the company and rivals ranging from Verizon  to Google Inc .",
        "date": "03022015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "AT&T to hook up its automated home and connected car services "
    },
    {
        "content": "* Ericsson Radio Dot System installed at Verizon regional headquarters building in Metro Detroit  Link to press release: http://hugin.info/1061/R/1897997/673870.pdf Further company coverage:    (Reporting By Bjorn Rundstrom)",
        "date": "02272015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "BRIEF-Ericsson wins Radio Dot System from Verizon "
    },
    {
        "content": "WASHINGTON  Feb 18 T-Mobile's chief executive on Wednesday called the recent U.S. auction of airwaves \"a disaster\" for American consumers as he took aim at rules that allowed Dish Network Corp to partner with companies that may qualify for some $13 billion in discounts.",
        "date": "02182015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "T-Mobile presses U.S. to change rules for sale of airwaves "
    },
    {
        "content": "Feb 6 The following bids  mergers  acquisitions and disposals were reported by 1100 GMT on Friday:",
        "date": "02062015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Feb 3 The following bids  mergers  acquisitions and disposals were reported by 1030 GMT on Tuesday:",
        "date": "02032015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "SAN FRANCISCO  Feb 5 Verizon Communications  said it would sell wireline assets to Frontier Communications for $10.54 billion in cash and sell and lease cell phone towers for around $5 billion to American Tower in a deal that will help it pay off recent wireless spectrum purchases.",
        "date": "02062015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 4-Verizon to sell wireline operations  towers worth $15.6 bln "
    },
    {
        "content": "SAN FRANCISCO Verizon Communications Inc  will sell wireline assets to Frontier Communications Corp  for $10.54 billion in cash and cell phone towers worth over $5 billion to American Tower Corp  the company said on Thursday.",
        "date": "02052015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to sell wireline operations and towers worth over $15 bln "
    },
    {
        "content": "SAN FRANCISCO  Feb 5 Verizon Communications Inc  will sell wireline assets to Frontier Communications Corp  for $10.54 billion in cash and cell phone towers worth over $5 billion to American Tower Corp  the company said on Thursday.",
        "date": "02052015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-Verizon to sell wireline operations and towers worth over $15 bln "
    },
    {
        "content": "SAN FRANCISCO  Feb 5 Frontier Communications Corp  will buy Verizon Communications Inc's  wireline operations in three U.S. states for $10.54 billion in cash  the regional telephone operator said on Thursday.",
        "date": "02052015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Frontier to buy Verizon wireline assets for $10.54 bln "
    },
    {
        "content": "Verizon Communications Inc  is nearing wrapping up deals to sell more than $10 billion in assets  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02022015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon close to deals to sell over $10 billion in assets: WSJ "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO  Feb 4 Verizon Communications is close to selling wireline assets worth $10 billion to regional telephone operator Frontier Communications Corp  a person familiar with the matter said on Wednesday.",
        "date": "02052015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to sell assets worth $10 billion to Frontier - source "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO Verizon Communications is close to selling wireline assets worth $10 billion to regional telephone operator Frontier Communications Corp  a person familiar with the matter said on Wednesday.",
        "date": "02052015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon to sell assets worth $10 billion to Frontier:  source "
    },
    {
        "content": "Feb 2 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "02022015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 02 (Fitch) On Jan. 30  2015  the Federal Communications  Commission (FCC) announced the winning bidders in the AWS-3 spectrum action.  Verizon Communications Inc.'s (Verizon; NYSE: VZ) total winning bids amounted to  approximately $10.4 billion. This amount was well under the level which would  have triggered a negative rating action ($15 billion) by Fitch. In Fitch's view   Verizon's ratings (Issuer Default Rating and",
        "date": "02022015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Fitch: Verizon's 'A-' Rating Not Affected by Spectrum Bidding "
    },
    {
        "content": "Feb 2 Verizon Communications Inc is nearing deals to sell more than $10 billion in assets  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02022015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon close to deals to sell over $10 bln in assets - WSJ "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO AT&T Inc  spent close to half the total in the record-setting U.S. sale of airwaves for mobile data  with Dish Network Corp  spending heavily to manage a surprise win at No.2 ahead of Verizon  results showed on Friday.",
        "date": "01302015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AT&T top buyer at U.S. airwaves auction; Dish spends big "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO  Jan 30 AT&T Inc  spent close to half the total in the record-setting U.S. sale of airwaves for mobile data  with Dish Network Corp  spending heavily to manage a surprise win at No.2 ahead of Verizon  results showed on Friday.",
        "date": "01302015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-AT&T top buyer at U.S. airwaves auction; Dish spends big "
    },
    {
        "content": "WASHINGTON  Jan 30 AT&T Inc  Verizon Communications Inc and bidding partners of Dish Network Corp spent the most on the record-setting U.S. sale of wireless airwaves for mobile data  known as AWS-3  according to auction results released on Friday.",
        "date": "01302015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "AT&T  Verizon  Dish bid the most in U.S. airwaves auction "
    },
    {
        "content": "NEW YORK  Jan 29 Cablevision Systems Corp  on Thursday sued Verizon Communications Inc  accusing it of falsely advertising to consumers on television  radio and the Internet that its WiFi service is the fastest available.",
        "date": "01302015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Cablevision sues Verizon  alleges false WiFi advertising "
    },
    {
        "content": "WASHINGTON Verizon Communications Inc will pay a $2 million fine and spend $3 million on compliance programs to settle a government inquiry into calls not going through to some customers in rural areas  U.S. regulators said on Monday.",
        "date": "01262015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Verizon to pay $5 million for problems with calls to U.S. rural areas "
    },
    {
        "content": "WASHINGTON  Jan 26 Verizon Communications Inc  will pay a $2 million fine and spend $3 million on compliance programs to settle a government inquiry into calls not going through to some customers in rural areas  U.S. regulators said on Monday.",
        "date": "01262015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon to pay $5 mln for problems with calls to U.S. rural areas "
    },
    {
        "content": "WASHINGTON The Obama administration on Monday unveiled an ambitious plan to control health costs by moving the $2.9 trillion U.S. health systems away from costly fee-for-service medicine  beginning with the Medicare program for the elderly and disabled.",
        "date": "01262015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. govt unveils goal to move Medicare away from fee-for-service "
    },
    {
        "content": "WASHINGTON  Jan 29 The U.S. Federal Communications Commission raised a record $44.9 billion in the auction of so-called AWS-3 airwaves that closed on Thursday  marking the highest point yet in the wireless industry's appetite for more spectrum.",
        "date": "01292015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 3-U.S. wireless spectrum auction raises record $44.9 billion "
    },
    {
        "content": "WASHINGTON  Jan 26 The Obama administration on Monday unveiled an ambitious plan to control health costs by moving the $2.9 trillion U.S. health systems away from costly fee-for-service medicine  beginning with the Medicare program for the elderly and disabled.",
        "date": "01262015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-U.S. govt unveils goal to move Medicare away from fee-for-service "
    },
    {
        "content": "WASHINGTON  Jan 26 Verizon Communications Inc will pay a $2 million fine and commit $3 million to a new compliance program to settle a U.S. government inquiry into low call answer rates to numerous rural areas  the Federal Communications Commission said on Monday.",
        "date": "01262015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon agrees to $5 mln settlement over rural call completion "
    },
    {
        "content": "SAN FRANCISCO  Jan 26 Cablevision System Corp  said on Monday it would launch in February a wireless Internet phone service to give users an alternative to pricier data plans from cellular companies such as AT&T and Verizon.",
        "date": "01262015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Cablevision to launch WiFi phone service for data-hungry users "
    },
    {
        "content": "NEW YORK  Jan 22 U.S. stocks rose to session highs ahead of the close on Thursday after the European Central Bank announced larger than expected measures to stimulate the region's sagging economy.",
        "date": "01222015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "REFILE-US STOCKS-Wall St gains after ECB stimulus move; banks lead "
    },
    {
        "content": "Verizon Communications Inc said on Thursday that quarterly revenue rose 6.8 percent as it added more customers during the competitive holiday season but profit margins narrowed in its wireless business due to pricing and promotions. | Video ",
        "date": "01222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon posts higher revenue; wireless margins narrow "
    },
    {
        "content": "Jan 22 Verizon Communications Inc said on Thursday that quarterly revenue rose 6.8 percent as it added more customers during the competitive holiday season but profit margins narrowed in its wireless business due to pricing and promotions.",
        "date": "01222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-UPDATE 3-Verizon posts higher revenue; wireless margins narrow "
    },
    {
        "content": "* Indexes up: Dow 0.7 pct  S&P 500 0.8 pct  Nasdaq 0.9 pct   (Updates to midday trading)",
        "date": "01222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St gains after ECB stimulus move "
    },
    {
        "content": "Jan 22 Verizon Communications Inc's  quarterly revenue rose 6.8 percent due to higher net addition of postpaid subscribers and a rise in average revenue per account as users added more devices to shared data plans.",
        "date": "01222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "CORRECTED-Verizon revenue rises as retail postpaid subscribers increase "
    },
    {
        "content": "* Indexes up: Dow 0.7 pct  S&P 0.8 pct  Nasdaq 1 pct   (Updates to midday trading)",
        "date": "01222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-ECB measures lift Wall St in volatile session "
    },
    {
        "content": "* Dow  S&P 500 and Nasdaq all rise 0.7 pct   (Updates to midday trading)",
        "date": "01222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St rallies in volatile session after ECB measures "
    },
    {
        "content": "* Dow down 0.2 pct  S&P 500 flat  Nasdaq down 0.2 pct   (Updates to market open)",
        "date": "01222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Wall St drops despite ECB move as earnings disappoint "
    },
    {
        "content": "* Futures up: Dow 52 pts  S&P 6.75 pts  Nasdaq 9.75 pts   (Updates with data  ECB move)",
        "date": "01222015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "US STOCKS-Futures point to higher open after ECB measures "
    },
    {
        "content": "Jan 13 Verizon Communications Inc  unveiled an Internet and wireless car service on Tuesday that lets drivers of older cars get help during a breakdown or find out about repairs and maintenance that might be needed.",
        "date": "01132015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon launches 'connected car' product for older vehicles "
    },
    {
        "content": "Jan 6 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "01062015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Verizon Communications Inc Chief Executive Lowell McAdam said the company is not planning any major acquisitions  following a report that Verizon had approached AOL Inc for a potential deal.",
        "date": "01062015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon not pursuing AOL takeover: CEO "
    },
    {
        "content": "* Sees Q4 sales at top end of view  10 pct rise in FY sales",
        "date": "01082015",
        "name": "Verizon Communications Inc",
        "news_type": "topStory",
        "symbol": "VZ",
        "title": "UPDATE 2-Strong December demand boosts Spirent's 4th-quarter orders "
    },
    {
        "content": "Jan 6 Verizon Communications Inc Chief Executive Lowell McAdam said the company is not planning any major acquisitions  following a report that Verizon had approached AOL Inc for a potential deal.",
        "date": "01062015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon not pursuing AOL takeover - CEO "
    },
    {
        "content": "WASHINGTON  Jan 7 The head of the U.S. FCC on Wednesday proposed raising the definition of the high-speed Internet to downloads at 25 megabits per second (Mbps)  a more than a six-fold increase from the current standard.",
        "date": "01082015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "U.S. regulator wants faster speeds for Internet broadband "
    },
    {
        "content": "Jan 6 The following corporate finance-related stories were reported by media:",
        "date": "01062015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "RPT-Market Chatter- Corporate finance press digest - Jan 6 "
    },
    {
        "content": "Jan 6 The following corporate finance-related stories were reported by media:",
        "date": "01062015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Market Chatter- Corporate finance press digest - Jan 6 "
    },
    {
        "content": "Verizon Communications Inc  approached AOL Inc  about a potential acquisition or joint venture to expand its mobile-video offerings  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "01062015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon approaches AOL on potential deal: Bloomberg "
    },
    {
        "content": "Jan 5 Verizon Communications Inc  approached AOL Inc about a potential acquisition or joint venture to expand its mobile-video offerings  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "01062015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "UPDATE 1-Verizon approaches AOL on potential deal -Bloomberg "
    },
    {
        "content": "Jan 5 Verizon Communications Inc  approached AOL Inc about a potential acquisition or joint venture to expand its mobile-video offerings  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "01062015",
        "name": "Verizon Communications Inc",
        "news_type": "normal",
        "symbol": "VZ",
        "title": "Verizon approaches AOL on potential deal - report "
    }
]