[
    {
        "content": "* Takes share stake of 7.7 million shares in Redfin Corp - SEC filing",
        "date": "11142017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Tiger Global Management takes share stake in Redfin  Weibo  Autodesk "
    },
    {
        "content": "* Q3 earnings per share view $0.45 -- Thomson Reuters I/B/E/S",
        "date": "11072017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Weibo reports third quarter non-gaap earnings per share $0.51 "
    },
    {
        "content": "* Weibo Corp announces proposed offering of US$700 million convertible senior notes",
        "date": "10242017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Weibo Corp announces proposed offering of US$700 million convertible senior notes "
    },
    {
        "content": "* Weibo announces selected results for the quarter ended September 30  2017",
        "date": "10242017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "BRIEF-Weibo reports Q3 revenue $320 mln "
    },
    {
        "content": "* Weibo corporation prices offering of $800 million convertible senior notes",
        "date": "10262017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Weibo Corp prices offering of $800 mln convertible senior notes "
    },
    {
        "content": "BEIJING  Sept 27 Chinese social media firm Weibo Corp is looking to recruit citizen censors to help weed out sensitive content on its platform  rewarding those who report the highest numbers of offending posts with iPhones and tablets.",
        "date": "09272017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "China's Weibo looks to reward citizen censors with iPhones  tablets "
    },
    {
        "content": "BEIJING China's cyber watchdog has handed down maximum penalties to several of the country's top tech firms  including Tencent Holdings Ltd   Baidu Inc  and Weibo Corp   for failing to properly censor online content.",
        "date": "09252017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "China's cyber watchdog imposes top fines on tech firms over censorship "
    },
    {
        "content": "* Owning about 3 million shares of Sina issued statement on decision to nominate two independent candidates for election to Sina's board",
        "date": "09182017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Aristeia Capital nominates two independent candidates for election to Sina's board "
    },
    {
        "content": "* US fund seeks two directors in Chinese media company's board",
        "date": "09192017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "U.S. hedge fund seeks Sina board seats  pushes for sale to Weibo "
    },
    {
        "content": "* OKCoin  Huobi to halt yuan-based trades by Oct. 31 (Adds OKCoin and Huobi announcements  BTC price in para 7-8)",
        "date": "09152017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "UPDATE 4-Beijing cryptocurrency exchanges told to announce trading halt-source "
    },
    {
        "content": "SHANGHAI Chinese search engine giant Baidu Inc said on Monday it had hired the finance chief of Weibo Corp as its chief financial officer  marking a leadership change for the firm as its hones its focus onto artificial intelligence.",
        "date": "09182017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "Baidu hires Weibo CFO Herman Yu as finance chief amid AI push "
    },
    {
        "content": "* Baidu looking to shift focus towards mobile  AI (Adds details  Baidu chairman comments; alters dateline)",
        "date": "09182017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "UPDATE 1-Baidu hires Weibo CFO Herman Yu as finance chief amid AI push "
    },
    {
        "content": "Sept 17 Baidu Inc said Jennifer Li stepped down as its chief financial officer and the biggest search engine operator in China named Herman Yu as its new CFO  effective immediately.",
        "date": "09182017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "Baidu hires Weibo CFO as its finance chief "
    },
    {
        "content": "* Baidu Inc - Herman Yu joins Baidu from Weibo Corp  where he has served as chief financial officer since 2015",
        "date": "09182017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "BRIEF-Baidu appoints Herman Yu as Chief Financial Officer "
    },
    {
        "content": "* Q2 revenue $253.4 million versus I/B/E/S view $246.7 million",
        "date": "08092017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Weibo Q2 earnings per share $0.33 "
    },
    {
        "content": "BEIJING China is investigating its top social media sites  including WeChat and Weibo  for failing to comply with cyber laws  the latest step in the country's push to secure the internet and maintain strict Communist Party control over content. | Video ",
        "date": "08112017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "China investigates top local social media sites in push to control content "
    },
    {
        "content": "Aug 11 Facebook Inc  whose social media platform is blocked in China  authorized a local company to launch a photo-sharing application in the country in May  the New York Times reported  citing a person with knowledge of the company's plans.",
        "date": "08112017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "Facebook OKs local firm's launch of Moments-like app in China-NYT "
    },
    {
        "content": "HONG KONG Chinese news aggregator Toutiao  backed by Sequoia Capital and CCB International  is raising at least $2 billion at a valuation of over $20 billion in its latest funding round  people familiar with the matter told Reuters.",
        "date": "08112017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "Chinese startup Toutiao raising funds at over $20 billion valuation: sources "
    },
    {
        "content": "* Toutiao's valuation has jumped around 40-fold in 3 yrs (Adds Toutiao comments  revenue target  industry context)",
        "date": "08112017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "UPDATE 2-Chinese startup Toutiao raising funds at over $20 bln valuation -sources "
    },
    {
        "content": "* Names popular social media platforms WeChat  Weibo (Adds Baidu comment  no comment from Tencent  Weibo  context)",
        "date": "08112017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "UPDATE 2-China investigates top local social media sites in push to control content "
    },
    {
        "content": "Aug 11 Hong Kong shares fell 2 percent on Friday  dragged down by a sell-off in internet-related shares and fears over the impact of rising tensions between the United States and North Korea.",
        "date": "08112017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "Hong Kong shares suffer worst week in 2017 on North Korea jitters "
    },
    {
        "content": "BEIJING  Aug 11 China's top cyber authority said on Friday it is investigating several of China's most popular internet platforms over breaches of cyber laws.",
        "date": "08112017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "China cyber authority says Baidu  Tencent  Weibo platforms under investigation "
    },
    {
        "content": "BEIJING  July 28 China National Petroleum Corp is gradually resuming operations at its closed Changqing gas field in China's western province Shaanxi  the company said on social media site Weibo on Friday.",
        "date": "07282017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "China's CNPC resumes part of gas production at Changqing field "
    },
    {
        "content": "* Weibo -became aware of a public notice issued by state administration of press  publication  radio  film and television of people's republic of china",
        "date": "06222017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Weibo announces receipt of a SAPPRFT notice "
    },
    {
        "content": "BEIJING Beijing has shut down online video services of three popular Chinese media sites in a swift action that unleashed financial shockwaves and posed a firm warning to the country's online video industry: clean up  or close down. | Video ",
        "date": "06232017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "China's authorities tighten noose around online video content "
    },
    {
        "content": "* Analysts say internet companies can adjust to new rules (Recasts  adds context  analyst comment  user comments)",
        "date": "06232017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "UPDATE 1-China's authorities tighten noose around online video content "
    },
    {
        "content": "SINGAPORE  June 22 China has told three major web portals to shut down their video and audio streaming services  saying they carry politically-related material that breaks state rules and social commentary which incites negative opinions.",
        "date": "06232017",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "REFILE-China's authorities tighten noose around online video  audio content "
    },
    {
        "content": "* Sina Corp -based on 71.4 million ordinary shares of sina outstanding as of june 7  sina will distribute 7.1 million class a shares of weibo to sina shareholders",
        "date": "06082017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Sina announces details of distribution of Weibo shares "
    },
    {
        "content": "* Q1 revenue $199.2 million versus I/B/E/S view $186.8 million",
        "date": "05162017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Weibo Q1 earnings per share $0.21 "
    },
    {
        "content": "* WEIBO REPORTS FOURTH QUARTER AND FISCAL YEAR 2016 FINANCIAL RESULTS",
        "date": "02222017",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-WEIBO REPORTS Q4 EARNINGS PER SHARE $0.19 "
    },
    {
        "content": "* Quarterly advertising and marketing revenue increased 48% year over year to $156.7 million",
        "date": "11212016",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Weibo reports Q3 earnings per share $0.14 "
    },
    {
        "content": "* Alibaba reports class A share stake of 68.1 pct in Weibo Corp as of September 9  2016 - SEC filing  Source: (http://bit.ly/2c6wBV7) Further company coverage:",
        "date": "09092016",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Alibaba reports class A share stake of 68.1 pct in Weibo Corp "
    },
    {
        "content": "* Sina will distribute one Weibo class A ordinary share to holder of each ten Sina ordinary shares",
        "date": "08312016",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Sina announces distribution of Weibo shares "
    },
    {
        "content": "* Q2 revenue $146.9 million versus I/B/E/S view $142.3 million",
        "date": "08082016",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Weibo reports Q2 EPS $0.12 "
    },
    {
        "content": "SINGAPORE  Feb 25 China has urged the country's most popular microblog Weibo to clean up pornographic material on its social networking site in the latest attempt by authorities to regulate online content.",
        "date": "02252016",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "China urges microblog Weibo to clean up pornographic posts "
    },
    {
        "content": "* To trial word count limit removal: CEO   Further company coverage:",
        "date": "01202016",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "BRIEF-Chinese microblog Weibo to trial word count limit removal "
    },
    {
        "content": "HONG KONG Chinese microblog Weibo Corp will invest $142 million in China's dominant taxi-hailing firms Didi Taxi and Kuaidi Taxi  a U.S. Securities and Exchange Commission filing showed.",
        "date": "05272015",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "China's Weibo to invest $142 million in taxi-hailing apps: SEC filing "
    },
    {
        "content": "HONG KONG  May 27 Chinese microblog Weibo Corp  will invest $142 million in China's dominant taxi-hailing firms Didi Taxi and Kuaidi Taxi  a U.S. Securities and Exchange Commission filing showed.",
        "date": "05272015",
        "name": "Weibo Corporation",
        "news_type": "normal",
        "symbol": "WB",
        "title": "China's Weibo to invest $142 mln in taxi-hailing apps - SEC filing "
    },
    {
        "content": "SHANGHAI  April 7 China's Dongxing Securities  said it had formed an Internet banking partnership with Sina Corp  operator of a major web portal and microblogging service Weibo Corp.",
        "date": "04072015",
        "name": "Weibo Corporation",
        "news_type": "topStory",
        "symbol": "WB",
        "title": "Dongxing Securities  Sina to partner on Internet banking "
    }
]