[
    {
        "content": "* Q3 earnings per share view $0.50 -- Thomson Reuters I/B/E/S",
        "date": "11092017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-PharMerica Q3 2017 adjusted earnings per share $0.46 "
    },
    {
        "content": "* Walgreens Boots Alliance completes long-term global supply agreement with Fareva",
        "date": "10312017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance completes supply agreement with Fareva "
    },
    {
        "content": "* Shares up 6 pct; AmerisourceBergen  Cardinal Health gain (Adds comments from conference call  updates shares)",
        "date": "10262017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 3-Wal-Mart tie-up helps McKesson top profit estimates "
    },
    {
        "content": "* Walgreens Boots Alliance says director John Anthony Lederer reports purchase of 20 000 shares at average price of $67/share on October 26 - SEC filing Source text: (http://bit.ly/2zRm2LV) Further company coverage:",
        "date": "10302017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance says director John Anthony Lederer reports purchase of 20 000 shares on Oct. 26 "
    },
    {
        "content": "WASHINGTON  Oct 30 A Federal Trade Commission judge has ruled against the online seller 1-800 Contacts  which the agency accused of hammering out deals with rivals that made it harder for consumers to comparison shop  the agency said on Monday.",
        "date": "10302017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "FTC judge rules against 1-800 Contacts on antitrust charges "
    },
    {
        "content": "U.S. drugstore chain Walgreens Boots Alliance Inc's  quarterly profit and revenue beat Wall Street estimates  as the company filled millions of more drug prescriptions thanks to newly won contracts from pharmacy benefit managers.",
        "date": "10252017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens beats profit estimates as new contracts provide boost "
    },
    {
        "content": "Oct 25 U.S. drugstore chain Walgreens Boots Alliance Inc's quarterly profit and revenue beat Wall Street estimates  as the company filled millions of more drug prescriptions thanks to newly won contracts from pharmacy benefit managers.",
        "date": "10252017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 2-Walgreens beats profit estimates as new contracts provide boost "
    },
    {
        "content": "* Walgreens Boots Alliance reports fourth quarter and fiscal 2017 results",
        "date": "10252017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots reports Q4 adjusted earnings per share $1.31 "
    },
    {
        "content": "Oct 25 U.S. drugstore company Walgreens Boots Alliance Inc's profit fell 22 percent in the fourth quarter  hurt mainly by a more than $300 million fee it paid Rite Aid Corp after their failed attempt to merge.",
        "date": "10252017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens profit falls 22 pct in 4th quarter "
    },
    {
        "content": "Shares of drug retailers Walgreens Boots Alliance Inc   CVS Health Corp  and Rite Aid Corp  tumbled on Friday after reports that Amazon.com Inc  was looking to make a move into selling drugs online.",
        "date": "10062017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Drug chains tumble on reports Amazon eyeing their pie "
    },
    {
        "content": "BRUSSELS  Oct 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10032017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "EU mergers and takeovers (Oct 3) "
    },
    {
        "content": "BRUSSELS  Oct 5 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10052017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "EU mergers and takeovers (Oct 5) "
    },
    {
        "content": "Sept 28 Drug store operator Rite Aid Corp reported a rise in quarterly net income on the back of a termination fee it got due to Walgreens Boots Alliance Inc's failed attempt to buy its smaller rival.",
        "date": "09282017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "REFILE-Rite Aid posts profit due to fees from failed Walgreens merger deal "
    },
    {
        "content": "* Q2 earnings per share view $-0.01 -- Thomson Reuters I/B/E/S",
        "date": "09282017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Rite Aid reports fiscal 2018 Q2 results "
    },
    {
        "content": "Sept 21 Impax Laboratories Inc is in talks to merge with privately held Amneal Pharmaceuticals LLC  the Wall Street Journal reported on Thursday  citing people familiar with the matter.",
        "date": "09212017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-Generic drugmaker Impax Labs in talks to merge with Amneal - WSJ "
    },
    {
        "content": "Walgreens Boots Alliance Inc  is set to revise its agreement to buy some Rite Aid Corp  stores  a move that may be enough for the drugstore chain operator to resolve outstanding antitrust concerns  Bloomberg reported. | Video ",
        "date": "09182017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens to revise Rite Aid stores deal for antitrust approval: Bloomberg "
    },
    {
        "content": "U.S. antitrust regulators have allowed a slimmed-down deal for drugstore chain Walgreens Boots Alliance Inc  to buy about 42 percent of Rite Aid Corp's  U.S. stores for $4.38 billion  Walgreens said on Tuesday.",
        "date": "09192017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens gets regulatory nod for slimmed-down Rite Aid deal "
    },
    {
        "content": "Sept 18 Walgreens Boots Alliance Inc is set to revise its agreement to buy some Rite Aid Corp stores  a move that may be enough for the drugstore chain operator to resolve outstanding antitrust concerns  Bloomberg reported.",
        "date": "09182017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-Walgreens to revise Rite Aid stores deal for antitrust approval - Bbg "
    },
    {
        "content": "Sept 19 U.S. antitrust regulators have allowed a slimmed-down deal for drugstore chain Walgreens Boots Alliance Inc to buy about 42 percent of Rite Aid Corp's U.S. stores for $4.38 billion  Walgreens said on Tuesday.",
        "date": "09192017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 2-Walgreens gets regulatory nod for slimmed-down Rite Aid deal "
    },
    {
        "content": "* Rite Aid secures regulatory clearance to sell 1 932 stores and related assets for $4.375 billion to Walgreens Boots Alliance under amended and restated agreement",
        "date": "09192017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Rite Aid gets regulatory clearance to sell 1 932 stores and related assets for $4.38 bln to Walgreens "
    },
    {
        "content": "Sept 18 Walgreens Boots Alliance Inc is set to revise its agreement to buy some Rite Aid Corp stores  a move enough for the drugstore chain operator to resolve outstanding antitrust concerns  Bloomberg reported.",
        "date": "09182017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens to revise Rite Aid stores deal for antitrust approval - Bbg "
    },
    {
        "content": "* Restated purchase agreement with Rite Aid replaces one in June  which included 2 186 stores  related assets for $5.18 billion",
        "date": "09192017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens expects to realize annual synergies from new Rite Aid deal of over $300 mln "
    },
    {
        "content": "Sept 19 Drugstore chain Walgreens Boots Alliance Inc said it received regulatory clearance to buy 1 932 stores  three distribution centers and inventory from Rite Aid Corp for $4.38 billion.",
        "date": "09192017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens gets regulator's nod to buy Rite Aid stores "
    },
    {
        "content": "* Reopened over 350 drugstores throughout Florida including Jacksonville  Miami  Orlando  Tampa  Tallahassee  West Palm beach Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens reopens hundreds of stores throughout Florida "
    },
    {
        "content": "JERUSALEM/LONDON/FRANKFURT Teva Pharmaceutical Industries   is looking to team up with other drugmakers to fund some of its development pipeline as it struggles with debts and expiring patents.",
        "date": "08162017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Israel's Teva seeks partners for new drugs to relieve pressure "
    },
    {
        "content": "* Walgreens Boots Alliance Inc says on August 1  2017  company entered into an amendment agreement to revolving credit agreement - SEC filing",
        "date": "08022017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens enters into an amendment agreement to revolving credit agreement "
    },
    {
        "content": "* Walgreens- In first nine months of 2017  prescriptions related to 340B program was less than 1 percent of retail pharmacy USA division prescription volume",
        "date": "07242017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance comments on 340B program "
    },
    {
        "content": "* Walgreens to bring nearly 500 jobs  including 191 new positions  to chandler  arizona",
        "date": "07252017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens to bring nearly 500 jobs  including 191 new positions  to Chandler "
    },
    {
        "content": "* Walgreens Boots Alliance to enter into long-term global supply agreement with Fareva",
        "date": "07252017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance to enter into long-term global supply agreement with Fareva "
    },
    {
        "content": "* Mute expands from 891 to 4 300 Walgreens pharmacy/drug stores.",
        "date": "07182017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Rhinomed has received purchase orders from Walgreens "
    },
    {
        "content": "* Freshii Inc - ‍announced expansion of brand into New York City under Walgreens name​ Source text for Eikon: Further company coverage:",
        "date": "07102017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Freshii expands into New York City under Walgreens name​ "
    },
    {
        "content": "* Says  Board of Directors has declared a quarterly dividend of 40 cents per share",
        "date": "07122017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance increases quarterly dividend by 6.7 pct to 40 cents per share "
    },
    {
        "content": "A slimmed-down Rite Aid Corp  could lose much of its bargaining heft with insurers and makers of branded drugs at a time when it is trying to turn around its flagging pharmacy business  analysts said.",
        "date": "06302017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens deal offers no lasting relief to Rite Aid "
    },
    {
        "content": "* Walgreens and Labcorp collaborate to bring patient service centers for laboratory testing to select Walgreens stores",
        "date": "06282017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens  Labcorp collaborate to bring patient service centers for laboratory testing to select Walgreens stores "
    },
    {
        "content": "Fred's Inc  which is buying stores from Rite Aid as part of the company's deal to be acquired by Walgreens  said its board adopted a shareholder rights plan in light of \"increased trading activity\" ahead of a decision on the deal.",
        "date": "06282017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Fred's adopts poison pill ahead of Walgreens-Rite Aid deal decision "
    },
    {
        "content": "Drugstore chain Walgreens Boots Alliance Inc scrapped its deal to buy Rite Aid Corp after failing to win antitrust approval  but said it would instead buy nearly half of the smaller rival's U.S. stores for $5.18 billion.",
        "date": "06292017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens scraps Rite Aid merger  will instead buy half its stores "
    },
    {
        "content": "June 28 Fred's Inc  which is buying stores from Rite Aid as part of the company's deal to be acquired by Walgreens  said its board adopted a shareholder rights plan in light of \"increased trading activity\" ahead of a decision on the deal.",
        "date": "06282017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-Fred's adopts poison pill ahead of Walgreens-Rite Aid deal decision "
    },
    {
        "content": "* Walgreens to buy 2 186 Rite Aid stores  3 distribution centers",
        "date": "06292017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 6-Walgreens scraps Rite Aid merger  will instead buy half its stores "
    },
    {
        "content": "June 28 Fred's Inc said its board adopted a short-term shareholder rights plan in light of \"increased trading activity\" related to its involvement in Walgreens Boots Alliance's deal to buy Rite Aid Corp .",
        "date": "06282017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Fred's adopts rights plan ahead of Walgreens-Rite Aid deal decision "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Walgreens Boots Alliance has at least salvaged something from the wreckage of its deal to buy rival U.S. drugstore chain Rite Aid. After antitrust pushback on the full-strength $9.4 billion deal  Walgreens has abandoned it and is instead buying over 2 000 of Rite Aid's stores for $5.2 billion. For Chief Executive Officer Stefano Pessina  doing about half the deal with half the benefits is something – but it's a modest return on at least 20 months' work.",
        "date": "06292017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens salvages mild boost from intense effort "
    },
    {
        "content": "June 21 Theranos Inc has told its investors it has reached an agreement in principle to settle a lawsuit by Walgreens Boots Alliance Inc that had alleged the laboratory startup breached their contract  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06212017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Theranos  Walgreens reach agreement to settle lawsuit - WSJ "
    },
    {
        "content": "* Theranos  Walgreens reach deal to settle lawsuit; tentative agreement calls for Theranos to pay Walgreens less than $30 million - WSJ Source text - http://on.wsj.com/2sp74eU Further company coverage:",
        "date": "06212017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Theranos  Walgreens reach deal to settle lawsuit - WSJ "
    },
    {
        "content": "* U.S. economy grew 1.4 pct in Q1 vs prior reading of 1.2 pct",
        "date": "06292017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "US STOCKS-Wall St extends losses as tech selloff deepens "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 29 (Fitch) Fitch Ratings has affirmed Walgreens Boots Alliance  Inc.'s (WBA) 'BBB' Long-Term Issuer Default Rating (IDR) following its proposed purchase of 2 186 Rite Aid Corporation locations for $5.175 billion. A full list of ratings follows at the end of this release. Fitch views the new proposal  which replaces WBA's previous proposal to acquire Rite Aid in its entirety  to be a strategic positive based on increased g",
        "date": "06292017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Fitch Affirms Walgreens Boots Alliance at 'BBB' Following Revised Rite Aid Corp Transaction "
    },
    {
        "content": "* U.S. economy grew 1.4 pct in Q1 vs prior reading of 1.2 pct",
        "date": "06292017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "US STOCKS-Wall St lower as tech selloff outweighs bank gains "
    },
    {
        "content": "* This quarter we've begun to implement a program in certain stores to simplify our offering and improve retail operational performance",
        "date": "06292017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots CEO- \"View this deal as being more attractive than the transaction it replaces\" "
    },
    {
        "content": "* U.S. economy grew 1.4 pct in Q1 vs prior reading of 1.2 pct",
        "date": "06292017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "US STOCKS-S&P  Dow flat as tech losses offset gains in banks "
    },
    {
        "content": "* Futures: Dow up 15 pts  S&P up 1.75 pts  Nasdaq down 31.5 pts",
        "date": "06292017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "RPT-US STOCKS-S&P  Dow set to open slightly higher as banks get Fed boost "
    },
    {
        "content": "Shares of drugstore chain Rite Aid Corp  fell sharply on Friday on a report that indicated its proposed merger with Walgreens Boots Alliance Inc  was having trouble winning U.S. antitrust approval.",
        "date": "06092017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Rite Aid share prices fall on report regarding Walgreens deal "
    },
    {
        "content": "June 9 Shares of drugstore chain Rite Aid Corp fell sharply on Friday on a report that indicated its proposed merger with Walgreens Boots Alliance Inc was having trouble winning U.S. antitrust approval.",
        "date": "06092017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 2-Rite Aid share prices fall on report regarding Walgreens deal "
    },
    {
        "content": "The Federal Trade Commission's staff is prepared to recommend that the agency sue to stop Walgreens Boots Alliance Inc from buying rival drugstore chain Rite Aid Corp  policy news company Capitol Forum reported on Friday.",
        "date": "06092017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "FTC staff to advise blocking Walgreens deal to buy Rite Aid -Capitol Forum "
    },
    {
        "content": "June 9 Regulatory authorities are set to advise blocking U.S. drugstore chain Walgreens Boots Alliance Inc's deal to buy smaller rival Rite Aid Corp  CNBC reported on Friday  citing a report.",
        "date": "06092017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "FTC to advise blocking Walgreens deal to buy Rite Aid - CNBC "
    },
    {
        "content": "* Walgreens Boots Alliance - as pending acquisition of rite aid corp was not consummated on or before june 1  2017  co required to redeem multiple notes",
        "date": "06022017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens says required to redeem multiple notes as pending acquisition of Rite Aid was not consummated on or before June 1  2017 "
    },
    {
        "content": "CVS Health Corp  reported a bigger-than-expected quarterly profit as higher margins in its pharmacy business helped offset the loss of major contracts last year.",
        "date": "05022017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "CVS Health's profit beats as pharmacy margins rise "
    },
    {
        "content": "Walgreens Boots Alliance has agreed to pay $9.86 million to resolve allegations that it billed California's Medicaid program for claims in which it falsely certified drugs had been properly prescribed for particular diagnoses.",
        "date": "04212017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens to pay $9.86 million to resolve false billing claims "
    },
    {
        "content": "* Walgreens Boots Alliance says quarterly dividend increased year-over-year by 4.2 percent to $0.375 per share Source text for Eikon: Further company coverage:",
        "date": "04202017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance declared regular quarterly dividend of $0.375/shr "
    },
    {
        "content": "* José E. Almeida  chairman and ceo of Baxter International  elected to Walgreens Boots Alliance board of directors",
        "date": "04192017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance elects Baxter International CEO José Almeida to its board "
    },
    {
        "content": "* Walgreens - beginning April 25 Walgreens Healthcare Clinics in select markets will offer testing services for STIs Source text for Eikon: Further company coverage:",
        "date": "04182017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens' healthcare clinics to offer STI tests in select markets "
    },
    {
        "content": "* On conf call- developing plans to introduce enhanced beauty offering to over 1 000 additional stores by end of the calendar year",
        "date": "04052017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens on conf call- expect to close around 60 more stores "
    },
    {
        "content": "Drugstore chain operator Walgreens Boots Alliance Inc  reported a surprise drop in quarterly sales on Wednesday  citing challenging market conditions in Europe and the impact of a stronger dollar.",
        "date": "04052017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens posts surprise sales drop on weakness in Europe "
    },
    {
        "content": "April 5 Drugstore chain operator Walgreens Boots Alliance Inc reported a surprise drop in quarterly sales on Wednesday  citing challenging market conditions in Europe and the impact of a stronger dollar.",
        "date": "04052017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 2-Walgreens posts surprise sales drop on weakness in Europe "
    },
    {
        "content": "April 5 Drugstore chain operator Walgreens Boots Alliance Inc  reported a surprise drop in quarterly sales  citing challenging market conditions in continental Europe  and as a strong dollar reduced the value of sales outside the United States.",
        "date": "04052017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "CORRECTED-UPDATE 1-Walgreens reports surprise drop in quarterly sales "
    },
    {
        "content": "April 5 Drugstore chain operator Walgreens Boots Alliance Inc  reported a surprise drop in quarterly sales  citing \"challenging market conditions in continental Europe\" and as a strong dollar reduced the value of sales outside the United States.",
        "date": "04052017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens reports surprise drop in quarterly sales "
    },
    {
        "content": "* Walgreens said ready to sell more assets to win Rite Aid nod - Bloomberg  citing sources",
        "date": "03142017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens to sell more assets to win Rite Aid nod - Bloomberg "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 27 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Walgreens Boots Alliance  Inc.'s (WBA) new $4.8 billion and $1 billion term loan  credit facilities as well as its $1 billion revolving credit facility (RCF).  These facilities  which are expected to be used to finance the proposed Rite Aid  acquisition  replace $6.8 billion in funding commitments which expired Jan. 27   2017.  The $4.8 billion term loan is stru",
        "date": "02272017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Fitch Rates Walgreens Boots Alliance  Inc.'s New Term Loans and RCF 'BBB' "
    },
    {
        "content": "* Says  on February 22  2017 entered into a term loan credit agreement",
        "date": "02232017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance enters into a term loan credit agreement "
    },
    {
        "content": "* Walgreens Boots Alliance and WPP announce global marketing and communications partnership",
        "date": "01312017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance and WPP announce global marketing and communications partnership "
    },
    {
        "content": "WASHINGTON The chief executive of Walgreens Boots Alliance Inc  said Thursday that the biggest U.S. drug store chain was pressing on with its purchase of smaller Rite Aid Corp   which was announced in October 2015 and has not closed.",
        "date": "01262017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens working to finalize Rite Aid deal  clear antitrust hurdles "
    },
    {
        "content": "Drugstore chain Walgreens Boots Alliance Inc  said its deal to buy smaller rival Rite Aid Corp  would now take six months longer to close and also reduced its offer price as it expects to divest more stores to gain regulatory approval.",
        "date": "01302017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens delays Rite Aid deal again  cuts offer price "
    },
    {
        "content": "Jan 30 Drugstore chain Walgreens Boots Alliance Inc said its deal to buy smaller rival Rite Aid Corp  would now take six months longer to close and also reduced its offer price as it expects to divest more stores to gain regulatory approval.",
        "date": "01302017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 4-Walgreens delays Rite Aid deal again  cuts offer price "
    },
    {
        "content": "Jan 30 Walgreens Boots Alliance Inc said its deal to buy smaller rival Rite Aid Corp will now close six months later than expected and could include the divestiture of up to 1 200 stores to gain regulatory approval.",
        "date": "01302017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens pushes Rite Aid deal close by 6 months  reduces offer price "
    },
    {
        "content": "* Walgreens Boots Alliance and Rite Aid enter into amendment and extension to merger agreement",
        "date": "01302017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance and Rite Aid enter into amendment and extension to merger agreement "
    },
    {
        "content": "* Cardtronics and Walgreens extend and expand atm relationship  Source text for Eikon:  Further company coverage:",
        "date": "01172017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Cardtronics and Walgreens extend  expand ATM relationship "
    },
    {
        "content": "NEW YORK Walgreens Boots Alliance Inc  will pay $50 million to resolve a U.S. lawsuit accusing it of violating federal law by providing beneficiaries of government healthcare programs discounts and other incentives to fill their prescriptions at its pharmacies.",
        "date": "01192017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens to pay $50 million to resolve U.S. prescription kickback case "
    },
    {
        "content": "The U.S. Federal Trade Commission is not satisfied with Walgreens Boots Alliance Inc's  plan to divest stores to win antitrust clearance for its acquisition of Rite Aid Corp   Bloomberg reported  citing people familiar with the matter.",
        "date": "01202017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "FTC not sold on Walgreens' plan to win nod for Rite Aid deal: Bloomberg "
    },
    {
        "content": "Jan 20 The U.S. Federal Trade Commission is not satisfied with Walgreens Boots Alliance Inc's plan to divest stores to win antitrust clearance for its acquisition of Rite Aid Corp  Bloomberg reported  citing people familiar with the matter.",
        "date": "01202017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 2-FTC not sold on Walgreens' plan to win nod for Rite Aid deal-BBG "
    },
    {
        "content": "Jan 20 The U.S. Federal Trade Commission is not satisfied with Walgreens Boots Alliance Inc's plan to divest stores to win antitrust clearance for its acquisition of Rite Aid Corp  Bloomberg reported on Friday.",
        "date": "01202017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "FTC dissatisfied with Walgreens' plan to win nod for Rite Aid deal-BBG "
    },
    {
        "content": "* Walgreens and FedEx team up to offer FedEx dropoff and pickup at thousands of Walgreens locations nationwide",
        "date": "01112017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens and FedEx teams up to offer FedEx dropoff and pickup at Walgreens locations nationwide "
    },
    {
        "content": "* Walgreens Boots Alliance's plan to win U.S. antitrust clearance for acquisition of Rite Aid has not satisfied officials at FTC - Bloomberg  citing sources",
        "date": "01202017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens' plan to win antitrust nod for Rite Aid deal has not satisfied FTC - Bloomberg "
    },
    {
        "content": "Walgreens Boots Alliance Inc  reported a better-than-expected quarterly profit as recent partnerships with pharmacy benefit managers (PBMs) and insurance companies helped boost sales of prescription drugs as well as non-drug items.",
        "date": "01052017",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens profit beats estimates on PBM partnerships "
    },
    {
        "content": "Rite Aid Corp said it would sell 865 stores to Fred's Inc for $950 million to satisfy antitrust concerns over its proposed takeover by Walgreens Boots Alliance Inc.",
        "date": "12202016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Rite Aid to sell 865 stores to Fred's "
    },
    {
        "content": "WASHINGTON/NEW YORK  Nov 9 U.S. corporate dealmakers were likely to put major merger plans on hold as they assess whether President-elect Donald Trump will follow through on his populist promises and a threat to block AT&T Inc's  purchase of Time Warner Inc  or act more like traditional business-friendly Republicans.",
        "date": "11092016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 5-Trump victory clouds outlook for Time Warner-AT&T  other mergers "
    },
    {
        "content": "* Selling stockholders  CEO entered agreement where selling stockholders agreed to sell 2 million shares to CEO's affiliate  Source text: [http://bit.ly/2fpRCGm] Further company coverage:",
        "date": "11042016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance enters into an underwriting agreement "
    },
    {
        "content": "Oct 19 Supermarket chain Kroger Co is questioning whether to proceed with buying divested stores from Walgreens Boots Alliance Inc as part of its proposed acquisition of Rite Aid Corp  a source familiar with the situation said on Wednesday.",
        "date": "10192016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Kroger balks at buying stores from Walgreens-Rite Aid deal -source "
    },
    {
        "content": "Drugstore chain Walgreens  said it expected its Rite Aid acquisition  to close three months later than planned  and included the smaller rival's profit in its full-year forecast  suggesting the company expected the deal to win regulatory approval.",
        "date": "10202016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens sees Rite Aid deal closing in early 2017 "
    },
    {
        "content": "* Forecasts FY adj. profit of $4.85-$5.20/shr  includes Rite Aid",
        "date": "10202016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 3-Walgreens sees Rite Aid deal closing in early 2017 "
    },
    {
        "content": "* On conf call-  seeing impact of action in tobacco where we have reduced base and visibility   focusing on helping customers who want to stop smoking",
        "date": "10202016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens CEO on conf call- Included some part of Rite Aid potential profit in our guidance  confident about this deal "
    },
    {
        "content": "Oct 20 Walgreens Boots Alliance Inc  the largest U.S. drugstore operator by store count  reported a jump in quarterly profit  helped by cost-cutting and said it now expected its acquisition of Rite Aid Corp to close in early 2017.",
        "date": "10202016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens profit jumps  Rite Aid deal seen closing in 2017 "
    },
    {
        "content": "* Walgreens Boots Alliance reports fourth quarter and fiscal 2016 results",
        "date": "10202016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance posts Q4 adjusted earnings $1.07/share "
    },
    {
        "content": "* Companies now expect transaction will close in early calendar 2017.",
        "date": "10202016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance and Rite Aid report extension of merger agreement end date "
    },
    {
        "content": "Pharmacy giant Walgreens Boots Alliance must face claims that it misled shareholders about a sharp spike in generic drug prices in 2013  a federal judge in Chicago has ruled.",
        "date": "10042016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens must face securities fraud lawsuit - ruling "
    },
    {
        "content": "NEW YORK  Oct 3 A decade after JPMorgan Chase & Co said with great fanfare that it would make life easier for customers by putting its cash machines into Duane Reade drug stores in New York City and Walgreens stores in Florida  the big bank is retreating.",
        "date": "10032016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "JPMorgan prepares to pull Chase ATMs from Walgreens stores "
    },
    {
        "content": "NEW YORK  Oct 3 A decade after JPMorgan Chase & Co said with great fanfare that it would make life easier for customers by putting its cash machines into Duane Reade drug stores in New York City and Walgreens stores in Florida  the big bank is retreating.",
        "date": "10032016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-JPMorgan prepares to pull Chase ATMs from Walgreens stores "
    },
    {
        "content": "Drugstore chain Walgreens Boots Alliance Inc  said it would likely have to divest between 500 and 1000 stores  more than its previous estimate  to win regulatory approval for its planned acquisition of Rite Aid Corp .",
        "date": "09082016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens expects to sell more stores than estimated for Rite Aid deal "
    },
    {
        "content": "* Continues to expect deal to close in second half of this year",
        "date": "09082016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 2-Walgreens expects to sell more stores than estimated for Rite Aid deal "
    },
    {
        "content": "Sept 8 Drugstore chain Walgreens Boots Alliance Inc said it would likely have to divest between 500 and 1000 stores to win regulatory approval for its planned acquisition of Rite Aid Corp.",
        "date": "09082016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens says may have to sell 500-1000 stores for Rite Aid deal approval "
    },
    {
        "content": "* Walgreens Boots Alliance provides update on its pending acquisition of Rite Aid",
        "date": "09082016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance provides update on its pending acquisition of Rite Aid "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 01 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Walgreens Boots Alliance  Inc.'s (WBA) $1 billion unsecured term loan. The loan  is structured in two $500 million tranches  with one maturing in March 2017 and  the other maturing one year following the date of the close of the Rite Aid  Corporation (Rite Aid) acquisition  pending regulatory approval. Proceeds will  be used to partly fund the company's acquisi",
        "date": "09012016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Fitch Rates Walgreens Boots Alliance  Inc. $1B Unsecured Term Loan 'BBB' "
    },
    {
        "content": "* Commitments under certain bridge term loan credit deal  dated as of December 18  2015  automatically reduced by $1.0 billion",
        "date": "08312016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance entered into a term loan credit agreement - SEC Filing "
    },
    {
        "content": "Aug 29 Walgreens Boots Alliance Inc said it would combine its central specialty pharmacy and mail service businesses with pharmacy benefit manager Prime Therapeutics  as part of a long-term agreement.",
        "date": "08292016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens to partner with pharmacy benefit manager Prime Therapeutics "
    },
    {
        "content": "Aug 29 Walgreens Boots Alliance Inc said it would partner with pharmacy benefit manager Prime Therapeutics to reduce drug procurement costs.",
        "date": "08292016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-Walgreens to partner with pharmacy benefit manager Prime Therapeutics "
    },
    {
        "content": "* Walgreens and Prime Therapeutics agree to form strategic alliance; includes retail pharmacy network agreement and combines companies' central specialty pharmacy and mail service businesses",
        "date": "08292016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens and Prime Therapeutics Agree to Form Strategic Alliance "
    },
    {
        "content": "* Says  exercises second tranche of warrants to purchase AmerisourceBergen shares",
        "date": "08252016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens exercises second tranche of warrants to purchase AmerisourceBergen shares "
    },
    {
        "content": "* Announced that its retail pharmacy U.S. division plans to cease operations at its drugstore.com and beauty.com properties.",
        "date": "07282016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "CORRECTED-BRIEF-Walgreens to shut U.S. retail pharmacy business on two of its websites "
    },
    {
        "content": "* Walgreens Boots Alliance announces secondary common stock offering  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07262016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance announces secondary stock offering "
    },
    {
        "content": "July 6 Walgreens Boots Alliance Inc  the No.1 U.S. drugstore operator by store count  reported a lower-than-expected increase in quarterly sales  hurt by weak demand for over-the-counter drugs and other products.",
        "date": "07062016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "RPT-UPDATE 4-Walgreens U.S. retail sales rise less than expected "
    },
    {
        "content": "Walgreens Boots Alliance Inc   the No.1 U.S. drugstore operator by store count  reported a lower-than-expected increase in quarterly sales  hurt by weak demand for over-the-counter drugs and other products. | Video ",
        "date": "07062016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens U.S. retail sales rise less than expected "
    },
    {
        "content": "* Shares fall as much as 3.5 percent   (Adds analyst comment)",
        "date": "07062016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 4-Walgreens U.S. retail sales rise less than expected "
    },
    {
        "content": "* CEO -have already improved base salary for lowest wage workers",
        "date": "07062016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots CEO says difficult to gauge impact from Brexit at this time "
    },
    {
        "content": "* Walgreens Boots Alliance reports fiscal 2016 third quarter results",
        "date": "07062016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance Q3 adjusted EPS $1.18 "
    },
    {
        "content": "July 6 Drugstore operator Walgreens Boots Alliance Inc reported a 2.4 percent rise in quarterly sales  helped by demand for Medicare Part D drugs and non-pharmacy products in the United States.",
        "date": "07062016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Drugstore operator Walgreens quarterly sales rise 2.4 pct "
    },
    {
        "content": "* Indexes down: Dow 0.38 pct  S&P 0.59 pct  Nasdaq 0.87 pct   (Adds details  comments  updates prices)",
        "date": "06102016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "US STOCKS-Wall St down sharply on oil drop  global growth worries "
    },
    {
        "content": "June 12 Walgreens Boots Alliance said it is terminating its relationship with Theranos and closing operations at all 40 Theranos Wellness Centers at its stores in Arizona.",
        "date": "06132016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens terminates relationship with Theranos; closes 40 centers in Arizona "
    },
    {
        "content": "* Valeant is attempting to restructure deal with Walgreens - FT  citing sources  Source text - (http://on.ft.com/28kwZSO) Further company coverage:    (Bengaluru Newsroom)",
        "date": "06082016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Valeant is attempting to restructure deal with Walgreens - FT  citing sources "
    },
    {
        "content": "June 9 Drugstore operator Walgreens Boots Alliance Inc said on Thursday it named two executive vice presidents to the role of co-chief operating officers.",
        "date": "06092016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Drugstore operator Walgreens Boots Alliance appoints co-COOs "
    },
    {
        "content": "* Files its quarterly report   (Adds details about quarterly report  updates shares)",
        "date": "06072016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 6-Valeant CEO cuts outlook for 'distracted' company  shares plunge "
    },
    {
        "content": "* Walgreens Boots Alliance announced changes to senior management team for next phase of evolution",
        "date": "06092016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance appoints two Co-COOs "
    },
    {
        "content": "* Walgreens Boots Alliance says intends to use proceeds to fund a portion of cash consideration payable in acquisition of Rite Aid Corporation",
        "date": "05262016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance says priced $6 bln of unsecured notes "
    },
    {
        "content": "* Says pursuant to previously signed agreement  Rosenstein has stepped down from Walgreens Boots Alliance Board",
        "date": "05202016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance says Rosenstein steps stepped down from board "
    },
    {
        "content": "Walgreens Boots Alliance Inc. is making the opioid antidote naloxone available without a prescription in all its pharmacies in New Mexico  part of a plan to make the drug readily available in 35 states by the end of this year.",
        "date": "05172016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens makes overdose remedy prescription-free in New Mexico "
    },
    {
        "content": "May 17 Walgreens Boots Alliance Inc said on Tuesday it would no longer require a prescription for the opioid antidote naloxone at all of its pharmacies in New Mexico.",
        "date": "05172016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "CORRECTED-Walgreens makes overdose drug prescription-free in New Mexico "
    },
    {
        "content": "* Walgreens makes naloxone available without requiring a prescription in all New Mexico pharmacies",
        "date": "05172016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens makes naloxone available without prescription at New Mexico pharmacies "
    },
    {
        "content": "* Goldman Sachs Group selling 6 mln shares of Walgreens at $77.65 for top ten holder - CNBC citing source  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05162016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Goldman Sachs selling 6 mln shares of Walgreens at $77.65 for top ten holder - CNBC "
    },
    {
        "content": "* Walgreens Boots Alliance announces secondary common stock offering",
        "date": "05052016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "BRIEF-Walgreens Boots Alliance announces secondary offering "
    },
    {
        "content": "* Amerisourcebergen announces three year extension of strategic  long-term relationship with walgreens boots alliance",
        "date": "05052016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "BRIEF-Amerisourcebergen announces 3-year extension of strategic relationship with Walgreens Boots Alliance "
    },
    {
        "content": "April 21 Walgreen Co agreed to pay $500 000 and reform its advertising practices to settle allegations its Walgreens and Duane Reade stores in New York routinely overcharged consumers and tricked them into thinking they were getting great deals.",
        "date": "04212016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens  Duane Reade settle NY overcharge probe "
    },
    {
        "content": "April 21 Walgreen Co agreed to reform its advertising practices and pay $500 000 to settle allegations its Walgreens and Duane Reade stores in New York overcharged consumers at the register and used price tags that fooled them into thinking they were getting great deals.",
        "date": "04212016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-Walgreens  Duane Reade settle NY overcharge probe "
    },
    {
        "content": "Walgreens Boots Alliance Inc  reported a better-than-expected quarterly profit  helped by cost cutting and synergies from taking full control of European pharmacy chain Alliance Boots.",
        "date": "04052016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Drugstore operator Walgreens Boots profit beats estimates "
    },
    {
        "content": "* Raises lower end of FY adj profit forecast by 5 cents   (Adds details  forecast)",
        "date": "04052016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 2-Drugstore operator Walgreens Boots profit beats estimates "
    },
    {
        "content": "April 5 Walgreens Boots Alliance Inc  which has offered to buy smaller rival Rite Aid Corp  reported quarterly net sales that missed analysts' estimates  hurt by a weak flu season and low reimbursement rates.",
        "date": "04052016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Drugstore operator Walgreens Boots sales miss estimates "
    },
    {
        "content": "March 7 Valeant Pharmaceuticals International Inc   the subject of intense scrutiny over its business practices and pricing policies  said it would release preliminary quarterly results and guidance on March 15  raising hopes the company will serve up some positive news after months of uncertainty.",
        "date": "03072016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 2-Valeant sets earnings date  shares jump on hope for positive news "
    },
    {
        "content": "Walgreens Boots Alliance Inc   the largest U.S. drugstore chain  threatened to terminate its relationship with Theranos Inc unless the blood-testing company quickly fixes the problems found by federal inspectors at its laboratory in California  the Wall Street Journal reported.",
        "date": "02112016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens threatens to pull out of Theranos partnership: WSJ "
    },
    {
        "content": "Feb 10 Walgreens Boots Alliance Inc  the largest U.S. drugstore chain  threatened to terminate its relationship with Theranos Inc unless the blood-testing company quickly fixes the problems found by federal inspectors at its laboratory in California  the Wall Street Journal reported.",
        "date": "02112016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-Walgreens threatens to pull out of Theranos partnership - WSJ "
    },
    {
        "content": "Feb 10 Walgreens Boots Alliance Inc  the largest U.S. drugstore chain  threatened to terminate its relationship with Theranos Inc unless the blood-testing company quickly fixes the problems found by federal inspectors at its laboratory in California  the Wall Street Journal reported.",
        "date": "02112016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens threatens to pull out of Theranos partnership - WSJ "
    },
    {
        "content": "Jan 7 Drugstore operator Walgreens Boots Alliance Inc  which has offered to buy smaller rival Rite Aid Corp  reported lower-than-expected quarterly net sales.",
        "date": "01072016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Drugstore operator Walgreens quarterly sales miss estimates "
    },
    {
        "content": "Jan 7 Walgreens Boots Alliance Inc  which has offered to buy smaller rival Rite Aid Corp  reported lower-than-expected quarterly sales as it cut back on promotions and offered fewer holiday decoration items.",
        "date": "01072016",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-Drugstore operator Walgreens quarterly sales miss estimates "
    },
    {
        "content": "Dec 15 Canadian drugmaker Valeant Pharmaceuticals International Inc  said it signed a deal to distribute its skin and eye products at a discount in more than 8 000 Walgreens Boots Alliance Inc  retail pharmacy locations.",
        "date": "12152015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Valeant signs distribution deal with Walgreens  offers price cuts "
    },
    {
        "content": "Rite Aid Corp  which has agreed to be bought by larger rival Walgreens Boots Alliance Inc  reported same-store sales below analysts estimates hurt by the introduction of more low-margin generic drugs.",
        "date": "12172015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Rite Aid same-store sales miss estimates hurt by new generic drugs "
    },
    {
        "content": "Dec 17 Rite Aid Corp  which has agreed to be bought by larger rival Walgreens Boots Alliance Inc   reported same-store sales below analysts estimates hurt by the introduction of more low-margin generic drugs.",
        "date": "12172015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-Rite Aid same-store sales miss estimates hurt by new generic drugs "
    },
    {
        "content": "Dec 17 Drugstore operator Rite Aid Corp  which has agreed to be bought by larger rival Walgreens Boots Alliance Inc  reported a 43 percent drop in quarterly profit  hurt by expenses related to its acquisition of pharmacy benefit manager EnvisionRx.",
        "date": "12172015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Rite Aid profit drops 43 pct  hurt by EnvisionRx expenses "
    },
    {
        "content": "Department store operator Kohl's Corp  appointed Walgreens Boots Alliance Inc  Chief Marketing Officer Sona Chawla to the newly created position of chief operating officer.",
        "date": "11172015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Kohl's appoints Walgreens marketing head COO "
    },
    {
        "content": "Nov 17 Department store operator Kohl's Corp  appointed Walgreens Boots Alliance Inc Chief Marketing Officer Sona Chawla to the newly created position of chief operating officer.",
        "date": "11172015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "CORRECTED-UPDATE 1-Kohl's appoints Walgreens marketing head COO "
    },
    {
        "content": "Nov 17 Department store operator Kohl's Corp  named Walgreens Boots Alliance Inc Chief Marketing Officer Sona Chawla to the newly created position of chief operating officer.",
        "date": "11172015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Kohl's names Walgreens marketing head as COO "
    },
    {
        "content": "Drugstore chain Walgreens Boots Alliance Inc is willing to divest up to 1 000 stores to win regulatory approval for its acquisition of Rite Aid Corp  the Associated Press reported.",
        "date": "11032015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens may sell up to 1 000 stores for Rite Aid regulatory nod: AP "
    },
    {
        "content": "Nov 2 Drugstore chain Walgreens Boots Alliance Inc is willing to divest up to 1 000 stores to win regulatory approval for its acquisition of Rite Aid Corp   the Associated Press reported.",
        "date": "11032015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens may sell up to 1 000 stores for Rite Aid regulatory nod - AP "
    },
    {
        "content": "Two influential U.S. senators called for close scrutiny of Walgreens Boots Alliance Inc's  plan to buy Rite Aid Corp  for $9.4 billion  a deal that would unite two of the three biggest U.S. drugstore chains. | Video ",
        "date": "10292015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Senators call for scrutiny of Walgreens-Rite Aid deal "
    },
    {
        "content": "Two influential U.S. senators called for close scrutiny of Walgreens Boots Alliance Inc's plan to buy Rite Aid Corp for $9.4 billion  a deal that would unite two of the three biggest U.S. drugstore chains.",
        "date": "10282015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Senators call for scrutiny of Walgreens-Rite Aid deal "
    },
    {
        "content": "Drugstore chain Walgreens Boots Alliance Inc  said on Tuesday it would acquire smaller peer Rite Aid Corp  for $9.4 billion to widen its footprint in the United States and negotiate for lower drug costs.",
        "date": "10272015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens says will buy smaller drugstore rival Rite-Aid "
    },
    {
        "content": "Oct 27 Drugstore chain Walgreens Boots Alliance Inc said on Tuesday it would acquire smaller peer Rite Aid Corp for $9.4 billion to widen its footprint in the United States and negotiate for lower drug costs.",
        "date": "10272015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 5-Walgreens says will buy smaller drugstore rival Rite-Aid "
    },
    {
        "content": "* Walgreens  Rite Aid have overlap in northeastern U.S. - analysts   (Adds senators' comments  updates share prices)",
        "date": "10282015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 3-Senators call for scrutiny of Walgreens-Rite Aid deal "
    },
    {
        "content": "Drugstore chain Walgreens Boots Alliance Inc  said on Tuesday it would acquire smaller peer Rite Aid Corp  for $9.4 billion to widen its footprint in the United States and negotiate for lower drug costs.",
        "date": "10282015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens says will buy smaller drugstore rival Rite-Aid "
    },
    {
        "content": "Drugstore chain Walgreens Boots Alliance Inc  said on Tuesday it would acquire smaller peer Rite Aid Corp for $17.2 billion including acquired debt.",
        "date": "10272015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens Boots Alliance nears deal to buy Rite Aid - sources "
    },
    {
        "content": "Oct 28 Drugstore operator Walgreens Boots Alliance Inc  which agreed to buy smaller rival Rite Aid Corp on Tuesday  reported better-than-expected quarterly net sales  helped by higher prescription sales.",
        "date": "10282015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Drugstore operator Walgreens' quarterly sales beat estimates "
    },
    {
        "content": "U.S. stocks slipped on Tuesday on uncertainty over the U.S. rate outlook and disappointing results from Ford and other companies.",
        "date": "10272015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Wall St. slips on rate uncertainty; Apple up after the bell "
    },
    {
        "content": "Oct 27 Walgreens Boots Alliance Inc said it agreed to buy rival Rite Aid Corp in a deal valued at about $17.2 billion.",
        "date": "10272015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens Boots to buy Rite Aid in $17.2 bln deal "
    },
    {
        "content": "Oct 27 Drugstore operator Walgreens Boots Alliance Inc is in advanced talks to buy smaller rival Rite Aid Corp  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "10272015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "REFILE-Walgreens Boots Alliance near deal to buy Rite Aid - WSJ "
    },
    {
        "content": "Oct 27 Drugstore chain Walgreens Boots Alliance Inc said on Tuesday it would acquire smaller peer Rite Aid Corp for $9.4 billion to widen its footprint in the United States and negotiate for lower drug costs.",
        "date": "10282015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 6-Walgreens says will buy smaller drugstore rival Rite-Aid "
    },
    {
        "content": "Walgreen Co should be held in contempt and fined for its persistent failure to remove expired price tags from store shelves  a practice that deceives consumers  causes overcharges and violates a 2014 settlement  Missouri's attorney general said.",
        "date": "09222015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreen deceives shoppers with stale price tags-Missouri AG "
    },
    {
        "content": "Walgreen Co should be held in contempt and fined for its persistent failure to remove expired price tags from store shelves  a practice that deceives consumers  causes overcharges and violates a 2014 settlement  Missouri's attorney general said.",
        "date": "09222015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreen deceives shoppers with stale price tags: Missouri AG "
    },
    {
        "content": "Medicines distributor AmerisourceBergen Corp  said it authorized a special $2.4 billion share repurchase programme to mitigate a possible dilution from the exercise of warrants issued to Walgreens Boots Alliance Inc  in 2013.",
        "date": "09212015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Drug distributor AmeriSourceBergen authorizes $2.4 billion share buyback "
    },
    {
        "content": "Sept 22 Walgreen Co should be held in contempt and fined for its persistent failure to remove expired price tags from store shelves  a practice that deceives consumers  causes overcharges and violates a 2014 settlement  Missouri's attorney general said.",
        "date": "09222015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "UPDATE 1-Walgreen deceives shoppers with stale price tags-Missouri AG "
    },
    {
        "content": "Sept 22 Walgreen Co should be held in contempt and fined for its persistent failure to remove expired price tags from store shelves  a practice that deceives consumers  causes overcharges and violates a 2014 settlement  Missouri's attorney general said.",
        "date": "09222015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreen deceives shoppers with stale tags  deserves fines -Missouri AG "
    },
    {
        "content": "Sept 21 Medicines distributor AmerisourceBergen Corp said it authorized a special $2.4 billion share repurchase program to mitigate a possible dilution from the exercise of warrants issued to Walgreens Boots Alliance Inc  in 2013.",
        "date": "09212015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Drug distributor AmeriSourceBergen authorizes $2.4 bln share buyback "
    },
    {
        "content": "July 9 Drugstore chain Walgreens Boots Alliance Inc  formed by Walgreens' takeover of Europe's Alliance Boots in December  reported a better-than-expected quarterly profit  helped by higher prescription sales and lower costs.",
        "date": "07092015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens Boots profit beats on higher prescription sales "
    },
    {
        "content": "NEW YORK  July 9 Walgreen Co has reached a $22.4 million settlement with the New York attorney general resolving claims that a unit improperly billed the government for reimbursement for a pediatric drug.",
        "date": "07102015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreen to pay $22.4 million in N.Y. Medicaid improper billing case "
    },
    {
        "content": "June 25 Drugstore operator Rite Aid Corp's  shareholders on Thursday voted to change the terms of payment for its chief executive's golden parachute  supporting a union-backed investor group over the company's board.",
        "date": "06252015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Rite Aid shareholders vote to limit CEO's golden parachute "
    },
    {
        "content": "NEW YORK  June 29 Walgreen Co will pay $2.55 million to settle charges by New York's attorney general that a pharmacy unit improperly billed Medicaid for costly drugs to treat hemophilia patients  without proof that it actually delivered the drugs to those patients.",
        "date": "06292015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreen settles Medicaid false billing case in New York "
    },
    {
        "content": "CHICAGO  April 15 Walgreens Boots Alliance Inc  will continue to freeze salary increases for senior U.S. executives as part of plans to cut costs by more than $1 billion over three years  the drugstore chain said on Wednesday.",
        "date": "04152015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens continues pay hike freeze for senior U.S. executives "
    },
    {
        "content": "Drugstore operator Walgreens Boots Alliance Inc  on Thursday reported a higher-than-expected quarterly profit and said it would widen its cost-cutting program  sending its shares higher. | Video ",
        "date": "04092015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens profit beats expectations; more cost cuts planned "
    },
    {
        "content": "April 9 Walgreens Boots Alliance Inc  reported a better-than-expected quarterly profit and said it would close about 200 stores in the United States under a cost-cutting program that would help it save $1.5 billion by the end of fiscal 2017.",
        "date": "04092015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens profit beats Street  drug chain to close 200 US stores "
    },
    {
        "content": "* NY AG test also confirms GNC's products meet FDA guidelines",
        "date": "03302015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "UPDATE 2-GNC Holdings settles herbal supplements dispute with NY Attorney General "
    },
    {
        "content": "LONDON Stefano Pessina  the billionaire investor who engineered the deal that created pharmacy giant Walgreens Boots Alliance Inc.   said he could imagine doing more deals in the United States as the healthcare system is shaken up by Obamacare.",
        "date": "03122015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "topStory",
        "symbol": "WBA",
        "title": "Walgreens Boots CEO expects to do more deals in U.S. "
    },
    {
        "content": "LONDON  March 12 Stefano Pessina  the billionaire investor who engineered the deal that created pharmacy giant Walgreens Boots Alliance Inc.  said he could imagine doing more deals in the United States as the healthcare system is shaken up by Obamacare.",
        "date": "03122015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens Boots CEO expects to do more deals in US "
    },
    {
        "content": "Walgreens Boots Alliance Inc   Wal-Mart Stores Inc   GNC Holdings Inc  and Target Corp  agreed to remove certain dietary supplements off their shelves in New York after receiving a threat of legal action from the state's attorney general  the New York Times reported.",
        "date": "02122015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Four retailers pull some dietary aids off shelves after probe: NYT "
    },
    {
        "content": "Feb 12 Walgreens Boots Alliance Inc  Wal-Mart Stores Inc  GNC Holdings Inc and Target Corp agreed to remove certain dietary supplements off their shelves in New York after receiving a threat of legal action from the state's attorney general  the New York Times reported.",
        "date": "02122015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Four retailers pull some dietary aids off shelves after probe -NYT "
    },
    {
        "content": "Jan 6 Walgreen Co  the largest U.S. pharmacy chain  reported a better-than-expected jump in December comparable store sales  helped by the month containing one more Wednesday and one fewer Sunday than a year ago and higher sales of flu medicine.",
        "date": "01062015",
        "name": "Walgreens Boots Alliance Inc",
        "news_type": "normal",
        "symbol": "WBA",
        "title": "Walgreens December same-store sales beat estimates "
    }
]