[
    {
        "content": "SYDNEY  Nov 15 Westpac Banking Corp's New Zealand unit has breached capital requirements  New Zealand's central bank said on Wednesday  ordering the lender to keep higher capital levels than other banks until it fixes the issues.",
        "date": "11152017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Westpac's NZ unit in breach of capital requirements - central bank "
    },
    {
        "content": "* RBNZ has informed Westpac NZ of its decision following review of WNZL's compliance with aspects of its advanced internal ratings",
        "date": "11152017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "BRIEF-Westpac updates on RBNZ raising Westpac NZ's minimum regulatory capital ratios "
    },
    {
        "content": "* David Stephen has been appointed to role of Chief Risk Officer for Westpac Group",
        "date": "11122017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking Corp says Alexandra Holcomb​ retires as chief risk officer "
    },
    {
        "content": "SYDNEY  Nov 15 Westpac Banking Corp's New Zealand unit has breached capital requirements  New Zealand's central bank said on Wednesday.",
        "date": "11152017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Westpac's NZ unit breached capital requirements  - NZ central bank "
    },
    {
        "content": "* Westpac annual cash profit A$8.06 bln vs A$8.12 bln street view",
        "date": "11062017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "RPT-UPDATE 3-Australia bank Westpac's profit growth disappoints  margins under pressure "
    },
    {
        "content": "* Westpac annual cash profit A$8.06 bln vs A$8.12 bln street view",
        "date": "11062017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "UPDATE 3-Australia bank Westpac's profit growth disappoints  margins under pressure "
    },
    {
        "content": "Westpac Banking Corp  on Friday said it had agreed to sell its Hastings fund management business to a London-based asset manager  in the latest move by a big Australian bank to offload a capital intensive division.",
        "date": "11032017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac agrees on Hastings fund management sale to UK firm "
    },
    {
        "content": "* Details of the deal not disclosed (Adds share movement  background)",
        "date": "11032017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "UPDATE 1-Westpac agrees on Hastings fund management sale to UK firm "
    },
    {
        "content": "Nov 3 Westpac Banking Corp on Friday said it had agreed to sell its Hastings fund management business to London-based asset manager Northill Capital.",
        "date": "11032017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Westpac to sell Hastings fund management business to UK firm "
    },
    {
        "content": "* ‍Westpac and Northill Capital enter into an agreement regarding sale of Hastings​",
        "date": "11032017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking Corp and Northill Capital enter agreement for sale of Hastings​ "
    },
    {
        "content": "MELBOURNE  Nov 1 Australia's No. 2 lender  Westpac Banking Corp  defended its bank bill trading in court on Wednesday  saying it was crucial to funding the group and managing large amounts of cash it held following the global financial crisis.",
        "date": "11012017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia's Westpac defends heavy bank bill buying in court "
    },
    {
        "content": "SYDNEY  Oct 30 Australia's Westpac Banking Corp said on Monday it plans to defend itself in a lawsuit brought by the nation's corporate regulator accusing it of rigging a key interest rate - unlike two rivals who have agreed to settle similar cases.",
        "date": "10302017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac says will defend itself in regulator rate-rigging lawsuit "
    },
    {
        "content": "MELBOURNE  Oct 31 The Australian corporate regulator accused Westpac Banking Corp of playing a leading role in the widespread manipulation of an important financial trading rate as it took the country's No. 2 lender to court on Tuesday.",
        "date": "10312017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac was a lead actor in rates rigging  regulator tells court "
    },
    {
        "content": "Australia's Westpac Banking Corp  said on Thursday it will pay refunds to about 200 000 customers who should have received cash benefits  as the country's lenders seek to ease concerns about their governance after a series of scandals.",
        "date": "10192017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia's Westpac to refund 200 000 customers for missed benefits "
    },
    {
        "content": "Oct 19 Australia's Westpac Banking Corp said on Thursday it will pay refunds to about 200 000 customers who should have received cash benefits  as the country's lenders seek to ease concerns about their governance after a series of scandals.",
        "date": "10192017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "UPDATE 1-Australia's Westpac to refund 200 000 customers for missed benefits "
    },
    {
        "content": "* Would provide refunds to some customers holding 'packaged' accounts ​",
        "date": "10192017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking to refund some package customers "
    },
    {
        "content": "Oct 19 Australia's Westpac Banking Corp said on Thursday it will provide refunds to about 200 000 customers holding \"packaged\" accounts  or accounts with additional benefits  and book an after-tax charge of A$45 million ($35.33 million) in fiscal 2017.",
        "date": "10192017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac to refund 200 000 customers holding 'packaged' accounts "
    },
    {
        "content": "* ‍Negotiated 3 year A$50 million unsecured facility with Bank Of Tokyo-Mitsubishi  UFJ (BTMU)​",
        "date": "10122017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Restaurant Brands New Zealand renewed lending facility with Westpac ​ "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  September 25 (Fitch) Fitch Ratings has revised the 'AA-' rating of one Westpac Banking Corporation (AA-/Stable) issue - with ISIN number XS0531214038 - to assign an 'emr' suffix in order to reflect embedded market risk in determination of its coupon amount. This follows the discovery of an error in the application of criteria with respect to the issue. In addition  Fitch has withdrawn the ratings of two issues that have been cal",
        "date": "09262017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Adds 'emr' to One Westpac Issue Rating; Withdraws Two Others "
    },
    {
        "content": "* Westpac Banking Corp - files for potential mixed shelf; size not disclosed - SEC filing‍​ Source text: (http://bit.ly/2xQxNlx) Further company coverage:",
        "date": "09072017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking Corp files for potential mixed shelf size - SEC filing‍​ "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  September 04 (Fitch) This announcement replaces the version published on 29 August 2017 to include the RMBS Lenders' Mortgage Insurance Rating Criteria that was omitted. Fitch Ratings has affirmed Westpac Banking Corporation's (WBC  AA-/Stable/F1+) AUD27.7 billion of outstanding mortgage covered bonds at 'AAA'. The Outlook is Stable. KEY RATING DRIVERS The rating is based on WBC's Long-Term Issuer Default Rating (IDR) of 'AA-'  ",
        "date": "09042017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Correction: Fitch Affirms Westpac's Mortgage Covered Bonds at 'AAA'/Stable "
    },
    {
        "content": "* Final terms: EUR750m 5.5yr at MS+25  EUR750m 10yr at MS+35. Allocs and pricing to follow. (12:49pm)",
        "date": "08292017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac sized at EUR750m each "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  August 29 (Fitch) Fitch Ratings has affirmed Westpac Banking Corporation's (WBC  AA-/Stable/F1+) AUD27.7 billion of outstanding mortgage covered bonds at 'AAA'. The Outlook is Stable. KEY RATING DRIVERS The rating is based on WBC's Long-Term Issuer Default Rating (IDR) of 'AA-'  an IDR uplift of zero notches  a payment continuity uplift (PCU) of six notches and the asset percentage (AP) of 91.0% used in the programme's asset cov",
        "date": "08292017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Fitch Affirms Westpac's Mortgage Covered Bonds at 'AAA'/Stable "
    },
    {
        "content": "* Redeemed all of its Westpac subordinated notes (wsn) Source text for Eikon: Further company coverage:",
        "date": "08232017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking redeemed all of its Westpac subordinated notes "
    },
    {
        "content": "* Appointment of Nerida Caesar to Westpac board effective from 1 September 2017",
        "date": "08212017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking Corp appoints Nerida Caesar as independent non-executive director "
    },
    {
        "content": "Aug 21 Australia's Westpac Banking Corp said on Monday its stressed assets edged lower during the third quarter helped by a fall in impaired assets.",
        "date": "08202017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia's Westpac Q3 stressed loans dip "
    },
    {
        "content": "* Westpac cutting new interest-only loans (Recasts with repossession data  comparisons  quotes)",
        "date": "08212017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "UPDATE 2-Australia's Westpac under-mined by housing repossessions "
    },
    {
        "content": "* Westpac's common equity tier 1 (CET1) capital ratio was 10% at 30 June 2017.",
        "date": "08202017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking says CET1 capital ratio was 10 pct at 30 June 2017 "
    },
    {
        "content": "* Confirms discussions with charter hall regarding proposed sale of hastings management proprietary ltd have ceased‍​ Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking ends discussions with Charter Hall regarding proposed sale of Hastings Management "
    },
    {
        "content": "* Accredited Bancorp Corporate Finance Limited as an NZX sponsor and NZX distribution and underwriting sponsor Source text for Eikon: Further company coverage:",
        "date": "08162017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-NZX Ltd says Bancorp Corporate Finance accredited as NZX Sponsor "
    },
    {
        "content": "* Co secured an equity investment from Westpac at $0.81 per share  representing a 14.1 percent premium",
        "date": "08062017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Zipmoney Ltd says Westpac invests $40 mln in co "
    },
    {
        "content": "* Analysts see Hastings worth between A$250 mln and A$600 mln",
        "date": "07242017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Australia's Westpac in talks with Charter Hall for Hastings funds unit sale "
    },
    {
        "content": "SYDNEY  July 24 Westpac Banking Corp on Monday said it has entered exclusive talks with Charter Hall Group for the sale of its Hastings Funds Management unit.",
        "date": "07232017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac in talks with Charter Hall for Hastings sale "
    },
    {
        "content": "* Westpac and Charter Hall commence exclusive discussions for proposed sale of hastings",
        "date": "07232017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "BRIEF-Westpac and Charter Hall commence discussions for proposed sale of Hastings "
    },
    {
        "content": "* Westpac is well positioned to meet this new benchmark having proactively taken steps to boost its CET1 capital ratio Source text for Eikon: Further company coverage:",
        "date": "07182017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking Corp comments on APRA's announcement on unquestionably strong "
    },
    {
        "content": "* ANZ  Westpac  Scentre and co complete \"successful\" blockchain trial for bank guarantees​ Source text for Eikon: Further company coverage: [ANZ.AX IBM.N SCG.AX WBC.AX]",
        "date": "07112017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-IBM says ANZ  Westpac  Scentre and co complete blockchain trial for bank guarantees​ "
    },
    {
        "content": "* Westpac Banking Corporation has increased its personal loan facility from $30 million to $40 million",
        "date": "06292017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-FSA Group says Westpac Banking Corporation increased personal loan facility "
    },
    {
        "content": "* Increased and extended existing financing facility with Westpac Bank",
        "date": "06072017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Prime Financial increases financing facility with Westpac Bank "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  May 30 (Fitch) Fitch Ratings has assigned Westpac Banking Corporation's (WBC  AA-/Stable/F1+) Series 2017-C3 AUD1.6 billion and 2017-C4 AUD400 million mortgage covered bonds ratings of 'AAA'. The Outlook is Stable. This brings the total outstanding issuance of covered bonds under the programme to AUD26.85 billion. Series 2017-C3 is a floating-rate bond while Series 2017-C4 is fixed-rate. Both the bonds are due in August 2022 and",
        "date": "05312017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Rates Westpac's AUD2bn Covered Bonds 'AAA'; Outlook Stable "
    },
    {
        "content": "* updated market on new major bank budget deficit repair levy ('levy') announced in 2017 federal budget",
        "date": "05212017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking Corp comments on impact of new major bank tax on co "
    },
    {
        "content": "* Westpac completes bookbuild of 60 million shares in BT Investment Management Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking completes bookbuild of 60 mln shares in BT Investment Management "
    },
    {
        "content": "* Completes bookbuild of 60 million shares in BT Investment Management Limited",
        "date": "05242017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "BRIEF-Westpac completes bookbuild of 60 mln shares in BT Investment Management "
    },
    {
        "content": "* Sale comes ahead of new capital requirements  tax (Recasts  adds Westpac comment)",
        "date": "05242017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "UPDATE 1-Australia's Westpac to sell 29 pct stake in BT Investment Management "
    },
    {
        "content": "* announces BT Investment Management (BTIM) institutional offer",
        "date": "05242017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking says institutional offer of 60 mln shares in BT Investment Management "
    },
    {
        "content": "SYDNEY  May 24 Australia's No 2 bank  Westpac Banking Corp  on Wednesday said it planned to exit its investment in funds manager BT Investment Management (BTIM) as its stake in the listed company was no longer viewed as a core asset.",
        "date": "05242017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac to sell stake in funds manager BT Investment Management "
    },
    {
        "content": "* Refinanced group's secured debt facility with Westpac Banking Corporation",
        "date": "05192017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Helloworld Travel updates on debt facility with Westpac Banking Corporation "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  May 17 (Fitch) Fitch Ratings has assigned Westpac Banking Corporation's (WBC  AA-/Stable/F1+) Series 2017-C1 EUR1 billion and 2017-C2 EUR500 million fixed-rate mortgage covered bonds ratings of 'AAA'. The Outlook is Stable. This brings the total outstanding issuance of covered bonds under the programme to AUD24.85 billion. Series 2017-C1 is due in May 2024  while Series 2017-C2 is due in May 2032. Both the bonds benefit from a 1",
        "date": "05182017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Rates Westpac's EUR1.5bn Covered Bonds 'AAA'; Outlook Stable "
    },
    {
        "content": "* Industry also faces increased compliance and capital costs (Recasts  adds CEO and analyst comments)",
        "date": "05082017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 2-Westpac logs record first-half profit but headwinds abound "
    },
    {
        "content": "* HY reported net interest margin decreased 4 basis points to 2.05%",
        "date": "05072017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking Corp H1 cash earnings up 3 percent "
    },
    {
        "content": "May 8 Australia's No.2 lender Westpac Banking Corp said first-half cash profit rose 3 percent benefiting from improved credit quality and robust performance in markets business.",
        "date": "05072017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac H1 cash profit climbs 3 pct "
    },
    {
        "content": "* Liabilities subject to levy will include items such as corporate bonds  commercial paper  certificates of deposit  tier 2 capital instruments",
        "date": "05102017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking Corp responds to budget announcements by the Australian government "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  April 28 (Fitch) Fitch Ratings has affirmed Westpac Banking Corporation's (WBC  AA-/Stable/F1+) AUD22.6 billion of outstanding mortgage covered bonds at 'AAA'. The Outlook is Stable. The affirmation follows the top-up of the cover pool by AUD14.3 billion of mortgages  which takes the total balance of the pool to AUD32.6 billion. KEY RATING DRIVERS The rating is based on WBC's Long-Term Issuer Default Rating (IDR) of 'AA-'  an ID",
        "date": "04282017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Affirms Westpac's Mortgage Covered Bonds at 'AAA' After Pool Top-Up "
    },
    {
        "content": "* Westpac enters into an enforceable undertaking with ASIC-WBC.AX",
        "date": "03152017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking enters into enforceable undertaking with ASIC "
    },
    {
        "content": "SYDNEY  March 17 Australia's Westpac Banking Corp said on Friday it will raise mortgage rates across a range of products including for owner occupiers  a day after rival National Australia Bank made a similar move.",
        "date": "03172017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Australia's Westpac Banking raises rates for home buyers "
    },
    {
        "content": "SYDNEY  March 17 Australia's Westpac Banking Corp said on Friday it will raise mortgage rates across a range of products including for owner occupiers  a day after rival National Australia Bank made a similar move.",
        "date": "03172017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac Banking raises rates for home buyers "
    },
    {
        "content": "SYDNEY  Feb 21 Westpac Banking Corp said on Tuesday its level of stressed assets fell slightly in the three months to Dec. 31 after a rise in dairy  oil and metals prices boosted the quality of its portfolio.",
        "date": "02202017",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Australia's Westpac reports 1Q fall in stressed assets "
    },
    {
        "content": "SYDNEY  Feb 21 Westpac Banking Corp said on Tuesday its level of stressed assets fell slightly in the three months to Dec. 31 after a rise in dairy  oil and metals prices boosted the quality of its portfolio.",
        "date": "02202017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac reports 1Q fall in stressed assets "
    },
    {
        "content": "* Westpac's common equity tier 1 (CET1) capital ratio was 9.26% at 31 December 2016  down 22 basis points from 30 September 2016",
        "date": "02202017",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking says CET 1 capital ratio 9.26 pct at 31 Dec "
    },
    {
        "content": "SYDNEY  Nov 15 Australia's Westpac Banking Corp  on Tuesday said it would reduce its Asian lending footprint as a result of challenging market conditions and slowing corporate activity that have placed downward pressure on returns.",
        "date": "11152016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia's Westpac shrinks Asian footprint "
    },
    {
        "content": "* New return on equity target of 13-14 pct   (Recasts  updates with fresh CEO and analyst comments)",
        "date": "11072016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 3-Australia's Westpac flags lower returns after flat profit "
    },
    {
        "content": "* Nzx regulation - at request of company  it has placed a trading halt on westpac banking corporation ordinary shares  Source text for Eikon:  Further company coverage:",
        "date": "11062016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-NZX Regulation says trading halt placed on Westpac Banking Corp "
    },
    {
        "content": "* \"It is difficult to predict the timing and full impact of brexit on westpac and the broader global financial services industry\"  Source text for Eikon:  Further company coverage:",
        "date": "11062016",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking Corp updates on Brexit outlook "
    },
    {
        "content": "SYDNEY  Nov 7 Westpac met expectations with a flat annual cash profit and lowered its return on equity target amid an increasingly challenging environment of lower interest rates and higher funding costs.",
        "date": "11062016",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac reports flat annual profit  lowers return target "
    },
    {
        "content": "* Issue of tier 2 subordinated instruments will not have a material impact on Westpac's financial position",
        "date": "10072016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac Banking will issue tier 2 subordinated instruments on Oct 7 "
    },
    {
        "content": "WELLINGTON  Sept 21 Australia's Westpac Banking Corp  and ANZ Bank  will close 26 mainly rural branches around New Zealand by mid-November  the companies said on Wednesday  as customers shift to online banking.",
        "date": "09212016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac  ANZ shutting multiple New Zealand branches due to online banking shift "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  September 14 (Fitch) Fitch Ratings has affirmed Westpac Banking  Corporation's (WBC  AA-/Stable/F1+) AUD27.2bn of outstanding mortgage covered  bonds at 'AAA'. The Outlook is Stable.  KEY RATING DRIVERS The rating is based on WBC's Long-Term Issuer Default Rating (IDR) of 'AA-'  an  unchanged Discontinuity Cap (D-Cap) of 4 notches and the asset percentage (AP)  of 89% used in the programme's asset coverage test  which Fitch reli",
        "date": "09152016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Affirms Westpac's Mortgage Covered Bonds at 'AAA'/Stable "
    },
    {
        "content": "* Shares down 3.4 pct to one-month lows   (Adds analyst comment  updates shares)",
        "date": "08112016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Australia's Westpac Q3 stressed loans rise  shares skid "
    },
    {
        "content": "SYDNEY  Aug 11 Australia's No.3 lender Westpac Banking Corp said on Thursday its level of stressed assets edged up in the three-months to June as a mining downturn led to higher corporate as well as consumer defaults.",
        "date": "08112016",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac sees higher defaults in third quarter "
    },
    {
        "content": "HONG KONG  June 15 The structured commodity finance division of Australia's Westpac bank expects revenues to grow by a third this financial year as new products gain momentum  but business is likely to level out next year as the global economy falters.",
        "date": "06152016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac commodity finance division expects revenue growth this year "
    },
    {
        "content": "ZURICH  May 26 Swiss bank UBS has recruited former Westpac Chief Executive Gail Kelly as a senior global adviser to its top management  according to a memo seen by Reuters.",
        "date": "05262016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "MOVES-UBS appoints ex-Westpac CEO Kelly as senior adviser -memo "
    },
    {
        "content": "SINGAPORE  May 25 (IFR) - Westpac Banking Corporation  has priced a A$2.3 billion (US$1.7 billion) offering of five-year dual-tranche senior unsecured medium-term notes  including its debut climate bond.",
        "date": "05252016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac dual-tranche deal includes first climate bonds "
    },
    {
        "content": "SYDNEY  May 9 Two of Australia's biggest banks on Monday said they are investigating suspected fraud involving false declarations by a number of home loan borrowers who rely on foreign income.",
        "date": "05092016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac  ANZ investigating suspected home loan fraud "
    },
    {
        "content": "SYDNEY  May 6 Westpac Banking Corp  Australia's No.3 lender  will launch a new money transfer service in June  according to a letter seen by Reuters  more than a year after it forced several remitters out of business by closing their bank accounts.",
        "date": "05062016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac targets transfer business after closing remitter accounts "
    },
    {
        "content": "MELBOURNE  May 2 Australian and New Zealand shares fell on Monday  hurt by the big banks after a rise in bad debts marred no.3 lender Westpac Banking Corp's  half-year results  but gains in Telstra and miners helped trim the market's losses.",
        "date": "05022016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia  NZ shares slip after Westpac profit miss "
    },
    {
        "content": "MELBOURNE  May 2 Australian shares are poised to fall on Monday after Chinese manufacturing data for April cast doubt over the strength of a pick-up in the economy and no.3 lender Westpac Banking Corp reported weaker-than-expected half year earnings.     Local share price index futures fell 0.1 percent ahead of the Chinese data and Westpac's results to 5 225.0. The benchmark rose 0.5 percent last Friday.     New Zealand's benchmark S&P/NZX 50 index slipped 0.2 percent to 6 804.76 in ",
        "date": "05012016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia shares set to slip  Westpac profit misses forecasts "
    },
    {
        "content": "* Westpac shares hit nearly 3-week lows on Monday   (Updates with fresh CEO comments  shares)",
        "date": "05022016",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "UPDATE 3-Australia's Westpac H1 bad debts hit 6-yr high; shares slump "
    },
    {
        "content": "SYDNEY  May 2 Australia's No.3 lender Westpac Banking Corp on Monday reported a 3 percent rise in first-half cash profit  lagging forecasts as higher debt impairment charges hurt growth while a significant increase in capital pinched on shareholder returns.",
        "date": "05012016",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac H1 cash profit up 3 pct  lags forecast "
    },
    {
        "content": "SYDNEY Australia's securities regulator said on Tuesday it has started legal action against Westpac Banking Corp for allegedly fixing the bank bill swap reference rate (BBSW)  an allegation the bank said it rejects.",
        "date": "04052016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australian regulator starts legal action against Westpac over alleged rate-fixing "
    },
    {
        "content": "* Westpac is second Australian bank to be targeted   (Adds detail from court filings)",
        "date": "04052016",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "UPDATE 2-Australian regulator starts legal action against Westpac over alleged rate-fixing "
    },
    {
        "content": "SYDNEY  April 5 The Australian Securities and Investments Commission (ASIC) said on Tuesday it has started legal action against Westpac Banking Corp for allegedly fixing the bank bill swap reference rate (BBSW).",
        "date": "04052016",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australian securities regulator starts legal action against Westpac over alleged rate-fixing "
    },
    {
        "content": "* Exec says expects \"reasonably strong\" credit growth in business banking going forward",
        "date": "03232016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "BRIEF-Westpac exec says seeing some stress in consumer loans "
    },
    {
        "content": "SYDNEY  March 2 Westpac Banking Corp  Australia's No.3 lender  on Wednesday said it was no longer in discussions for a potential sale of its Hastings Funds Management unit.",
        "date": "03022016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia's Westpac no longer in discussions for a potential Hastings sale "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  February 25 (Fitch) Fitch Ratings has assigned Westpac Banking  Corporation's (WBC  AA-/Stable/F1+) Series 2016-C2 USD1.35bn mortgage covered  bonds a rating of 'AAA'. The Outlook is Stable. This brings the total  outstanding issuance to AUD27.2bn. The fixed-rate bond is due in February 2021   and benefits from a 12-month extendable maturity. KEY RATING DRIVERS The rating is based on WBC's Long-Term Issuer Default Rating (IDR) o",
        "date": "02262016",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Rates WBC's Series 2016-C2 USD1.35bn Covered Bonds 'AAA'; Outlook Stable "
    },
    {
        "content": "SYDNEY  Nov 17 (IFR) - Westpac (Aa2/AA-/AA-) has opened books on an offering of senior unsecured SEC-registered global bonds that is due to price later today during New York trading hours. Citigroup  JP Morgan and Morgan Stanley are joint bookrunners for the transaction.",
        "date": "11172015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac hires for dual-tranche US dollar bond "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  November 10 (Fitch) Fitch Ratings has assigned Westpac Banking  Corporation's (WBC  AA-/Stable/F1+) Series 2015-C7 USD1bn mortgage covered bonds  a rating of 'AAA'. The Outlook is Stable. This brings the total outstanding  issuance to AUD27.4bn. The fixed-rate bond is due in November 2020  and benefits  from a 12-month extendable maturity. KEY RATING DRIVERS The rating is based on WBC's Long-Term Issuer Default Rating (IDR) of '",
        "date": "11102015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Rates WBC's Series 2015-C7 USD1bn Covered Bonds 'AAA'; Outlook Stable "
    },
    {
        "content": "SYDNEY  Nov 2 Westpac Banking Corp  Australia's No.3 lender by assets  on Monday posted a 3 percent rise in annual cash profit to a record A$7.8 billion helped by growth in mortgages.",
        "date": "11012015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Australia's Westpac cash profit rise 3 pct to a record "
    },
    {
        "content": "SYDNEY  Nov 2 Westpac Banking Corp  Australia's No.3 lender by assets  on Monday posted a 3 percent rise in annual cash profit to a record A$7.8 billion helped by growth in mortgages.",
        "date": "11012015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac cash profit rise 3 pct to a record "
    },
    {
        "content": "* Golden era is over - EY   (Adds analyst comment  shares  changes dateline)",
        "date": "11022015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 2-Australian banks in record profit but outlook downbeat "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  October 13 (Fitch) Fitch Ratings says the Westpac Banking Corporation's  (Westpac  AA-/ Stable) announcement today of a fully underwritten capital  raising in addition to an expected strong full-year net profit  is viewed as a  credit-positive  supporting its current ratings.  We believe that Westpac's capital raising initiatives have largely addressed the  bank's capital shortfall arising from the increased average advanced mor",
        "date": "10142015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch: Westpac's Capital Raising Supports its High Ratings "
    },
    {
        "content": "SYDNEY Westpac Banking Corp  Australia's No. 2 lender by market value  on Wednesday said it will raise A$3.5 billion ($2.54 billion) to meet new stricter capital rules while pushing home loan rates higher by 20 basis points.",
        "date": "10132015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia's Westpac unveils $2.5 billion rights issue  raises home loan rates "
    },
    {
        "content": "* FY cash profit up 3 pct to record A$7.8 bln  meets f'casts   (Adds CEO comment  bank ROEs)",
        "date": "10142015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "UPDATE 3-Australia's Westpac unveils $2.5 bln rights issue  lifts mortgage rates "
    },
    {
        "content": "* Westpac shares on trading halt; down 8 pct YTD   (Recasts; adds analyst comment  industry context)",
        "date": "10132015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "UPDATE 2-Australia's Westpac unveils $2.5 bln rights issue  raises home loan rates "
    },
    {
        "content": "SYDNEY  Oct 14 Westpac Banking Corp  Australia's No. 2 lender by market value  on Wednesday said it will raise A$3.5 billion ($2.54 billion) in a fully underwritten rights issue to boost new stricter capital rules.",
        "date": "10132015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac unveils $2.5 bln rights issue "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  September 18 (Fitch) Fitch Ratings has affirmed Westpac Banking  Corporation's (WBC  AA-/Stable/F1+) AUD25.96bn of outstanding mortgage covered  bonds at 'AAA'. The Outlook is Stable. KEY RATING DRIVERS The rating is based on WBC's Long-Term Issuer Default Rating (IDR) of 'AA-'  an  unchanged Discontinuity Cap (D-Cap) of 3; and the asset percentage (AP) of 89.0%  used in the programme's asset coverage test  which is lower than F",
        "date": "09182015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Affirms Westpac Banking Corporation's Mortgage Covered Bonds 'AAA'/Stable "
    },
    {
        "content": "SYDNEY  Sept 7 Westpac Banking Corp  Australia's No. 3 lender by assets  on Monday said it will increase annual investment spending by 20 percent as it looks to focus on customer service and improving efficiency.",
        "date": "09062015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Australia's Westpac to raise annual investment  cut costs "
    },
    {
        "content": "SYDNEY  Sept 7 Westpac Banking Corp  Australia's No. 3 lender by assets  on Monday said it will increase annual investment spending by 20 percent as it looks to focus on customer service and improving efficiency.",
        "date": "09062015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac to raise annual investment by 20 percent "
    },
    {
        "content": "SYDNEY  Aug 17 Westpac Banking Corp  Australia's No. 3 lender by assets  on Monday said stressed loan levels eased 3 percent in the third quarter to A$9.85 billion ($7.3 billion) while 90-day delinquencies in Australian mortgages ticked up 2 basis points.",
        "date": "08162015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac's stressed assets fall 3 pct in Q3  Tier-1 ratio rises "
    },
    {
        "content": "SYDNEY  Aug 5 Westpac Banking Corp  Australia's No 2 lender by market value  said on Wednesday it had increased the size of its perpetual hybrid offering to A$1.25 billion ($918 million) from its initial aim of A$750 million.",
        "date": "08052015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia's Westpac to raise A$1.25 bln hybrid to expand capital buffer "
    },
    {
        "content": "SYDNEY  July 24 Westpac Banking Corp is expected to announce on Monday an issue of perpetual hybrid securities worth around A$750 million ($547 million)  two sources involved in the offer said  making it the first major Australian lender to raise buffer capital after stricter prudential rules were imposed.",
        "date": "07242015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac seen expanding capital buffer with A$750 mln hybrid "
    },
    {
        "content": "SYDNEY  July 24 (IFR) - A good test for the appetite of Australian retail investors for offerings of Additional Tier 1 subordinated bonds from major banks should come next Monday  when Westpac is expected to launch an indicative A$750 million perpetual hybrid on the Australian Securities Exchange.",
        "date": "07242015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Westpac prepares to test appetite for Australian AT1 paper "
    },
    {
        "content": "SYDNEY  June 16 Westpac Banking Corp  Australia's No.2 lender by market value  on Tuesday said it plans to cut part of its stake in its wealth management arm  helping it raise up to A$700 million ($544 million) in an effort to boost its capital ratios.",
        "date": "06162015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac to sell stake in wealth management arm to raise $544 mln "
    },
    {
        "content": "* Creates two new divisions - consumer and commercial and business",
        "date": "06102015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 2-Australia's Westpac splits profitable retail and business division "
    },
    {
        "content": "SYDNEY  June 10 Westpac Banking Corp  Australia's No 2 lender by market value  on Wednesday said it is splitting its most profitable retail and business banking division and the manager in charge of the combined structure would leave the bank.",
        "date": "06102015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia's Westpac splits most profitable retail and business division "
    },
    {
        "content": "HONG KONG  May 22 A recent entrant in Asia's commodities markets  Australia's Westpac Banking Corp  is ramping up to take advantage of a commodities \"supercycle\" that it says has at least another 30 years to run.",
        "date": "05242015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "RPT-UPDATE 1-Westpac eyes China  India for commodities trade growth - executive "
    },
    {
        "content": "HONG KONG  May 22 A recent entrant in Asia's commodities markets  Australia's Westpac Banking Corp  is ramping up to take advantage of a commodities \"supercycle\" that it says has at least another 30 years to run.",
        "date": "05222015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Westpac eyes China  India for commodities trade growth - executive "
    },
    {
        "content": "HONG KONG A recent entrant in Asia's commodities markets  Australia's Westpac Banking Corp is ramping up to take advantage of a commodities \"supercycle\" that it says has at least another 30 years to run.",
        "date": "05212015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac eyes China  India for commodities trade growth: executive "
    },
    {
        "content": "HONG KONG  May 21 A recent entrant in Asia's commodities markets  Australia's Westpac Banking Corp  is ramping up to take advantage of a commodities \"supercycle\" that it says has at least another 30 years to run.",
        "date": "05212015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Westpac eyes China  India for commodities trade growth - executive "
    },
    {
        "content": "SYDNEY  May 12 (IFR) - Genworth Mortgage Insurance Australia  has mandated CBA and Nomura to arrange an Australian and Asian roadshow during the week of May 18 for a potential capital markets transaction.",
        "date": "05122015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Genworth hires CBA and Nomura for investor meetings "
    },
    {
        "content": "* Impaired assets down 16 bps to 0.35 pct of gross loans   (Adds details on dividends  more earnings metrics  CEO comment)",
        "date": "05032015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Australia's Westpac H1 cash profit flat  lags forecasts "
    },
    {
        "content": "SYDNEY  May 4 Australian shares are set to open higher on Monday  shored up by the miners; however gains will be capped as Westpac Banking Corp reported a weaker-than-expected half-year profit in a bad omen for all the big banks reporting this week.          Local share price index futures settled 0.6 percent higher at 5 833.0  an 18.6-point premium to the underlying S&P/ASX 200 index close. The benchmark rose 0.4 percent last Friday.  New Zealand's benchmark NZX 50 index fell 0.4 pe",
        "date": "05032015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australian shares face pressure after Westpac profit disappoints "
    },
    {
        "content": "* To raise A$2 bln through dividend reinvestment plan   (Adds analysts' comments  shares)",
        "date": "05042015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 2-Australia's Westpac H1 earnings disappoint  shares drop "
    },
    {
        "content": "* Other sectors lifted by rate cut hopes   (Adds analysis  quotes  stocks on the move)",
        "date": "05042015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Australia shares give up gains on Westpac earnings disappointment "
    },
    {
        "content": "SYDNEY  Feb 17 Genworth Mortgage Insurance Australia Ltd said Westpac Banking Corp  the country's second-biggest lender  has cancelled a sales agreement after a review of its riskier loans  a move that will hit the insurer's 2016 earnings.",
        "date": "02172015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Australia's Genworth says Westpac scraps mortgage insurance deal  sees profit hit "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  February 05 (Fitch) Fitch Ratings has assigned a rating of 'A+' to  Westpac Banking Corporation's (Westpac  AA-/Stable) CNY1.25bn Basel-3 compliant  Tier-2 instrument  due to be issued on 9 February 2015.  The fixed rate notes are direct  unsecured and subordinated. Its final maturity  is 9 February 2025  although an earlier redemption in February 2020 and each  interest payment date thereafter is possible  subject to prior writ",
        "date": "02062015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Rates Westpac's CNY1.25bn Sub Debt "
    },
    {
        "content": "SYDNEY  Feb 4 Two of Australia's big four banks lowered their floating mortgage rates on Wednesday  a day after the Reserve Bank of Australia cut its cash rate by a quarter point.",
        "date": "02042015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "UPDATE 1-Westpac joins Commonwealth Bank in cutting home loan rates "
    },
    {
        "content": "SINGAPORE  Jan 30 (IFR) - Westpac Banking Corporation  (Aa2/AA-/AA-) followed quickly in the footsteps of Australian peer ANZ to sell Tier 2 securities in renminbi to raise Rmb1.25bn (US$200m).",
        "date": "01302015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac follows ANZ with Tier 2 Dim Sum "
    },
    {
        "content": "HONG KONG/SHANGHAI Lender BOC Hong Kong Holdings Ltd  is considering a sale of subsidiary Nanyang Commercial Bank (NCB) that could fetch about $6 billion  in a bid to stop cannibalising the China business of its parent  people familiar with the matter said.",
        "date": "01292015",
        "name": "Westpac Banking Corporation",
        "news_type": "normal",
        "symbol": "WBK",
        "title": "Exclusive: BOC Hong Kong considering sale of $6 billion bank unit - sources "
    },
    {
        "content": "SYDNEY  Jan 29 Westpac Banking Corp said on Thursday it had agreed to sell its banking operations in five Pacific Island nations to the Bank of South Pacific Ltd (BSP) for A$125 million to concentrate on its largest markets in the region.",
        "date": "01282015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac sells operations in five Pacific islands  retains Fiji and PNG "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  January 15 (Fitch) Fitch Ratings has assigned Westpac Banking  Corporation's (WBC  AA-/Stable/F1+) Series 2015-C1 EUR1.25bn mortgage covered  bonds a rating of 'AAA'. The Outlook is Stable. This brings the total  outstanding issuance to AUD23bn. The fixed-rate bond is due in January 2022 and  benefits from a 12-month extendable maturity. KEY RATING DRIVERS The rating is based on WBC's Long-Term Issuer Default Rating (IDR) of 'AA",
        "date": "01152015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Fitch Rates Westpac's Series 2015-C1 EUR1.25bn Covered Bonds AAA "
    },
    {
        "content": "SYDNEY  Jan 14 (IFR) - Westpac is poised to reopen the Australian domestic bond market with an offering of a benchmark five-year medium-term note  due to price later today or tomorrow.",
        "date": "01142015",
        "name": "Westpac Banking Corporation",
        "news_type": "topStory",
        "symbol": "WBK",
        "title": "Westpac to reopen Australian domestic bond market "
    }
]