[
    {
        "content": "* Western Digital announces prepayment of €874 mln of Euro term B loans",
        "date": "11172017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital announces prepayment of €874 mln of Euro term B loans "
    },
    {
        "content": "* Western Digital announces authorization to resume potential share repurchases Source text for Eikon: Further company coverage:",
        "date": "11092017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital to resume potential share repurchases "
    },
    {
        "content": "* Western Digital announces successful repricing of $2.963 billion of USD term B loans Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital announces successful repricing of $2.963 billion of USD term B loans "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.50per share Source text for Eikon: Further company coverage:",
        "date": "11022017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital sets quarterly cash dividend of $0.50per share "
    },
    {
        "content": "Western Digital Corp said on Thursday it rejected demands from Toshiba Corp that it drop a set of legal rights that Western Digital believes would allow the company to block Toshiba's $18 billion sale of its memory chip unit to SK Hynix as part of negotiations over a joint chip investment between Toshiba and Western Digital.",
        "date": "10272017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba disputes Western Digital CEO claims on investment talks "
    },
    {
        "content": "Oct 26 Western Digital Corp said on Thursday it rejected demands from Toshiba Corp that it drop a set of legal rights that Western Digital believes would allow the company to block Toshiba's $18 billion sale of its memory chip unit to SK Hynix as part of negotiations over a joint chip investment between Toshiba and Western Digital.",
        "date": "10272017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba disputes Western Digital CEO claims on investment talks "
    },
    {
        "content": "Data-storage device maker Western Digital Corp on Thursday forecast current-quarter revenue below analysts' estimates  and said it would not agree to partner Toshiba's terms to participate in a new chip production unit.",
        "date": "10262017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital forecasts quarterly revenue below estimates "
    },
    {
        "content": "Oct 26 Data-storage device maker Western Digital Corp on Thursday forecast current-quarter revenue below analysts' estimates  and said it would not agree to partner Toshiba's terms to participate in a new chip production unit.",
        "date": "10262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Western Digital forecasts quarterly revenue below estimates "
    },
    {
        "content": "Oct 26 Western Digital Corp on Thursday refused demands from Toshiba Corp that it drop a set of legal rights it believes would allow the company to block Toshiba's $18 billion sale to SK Hynix as part of negotiations over a joint chip investment between Toshiba and Western Digital.",
        "date": "10262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital will not drop merger objections over Toshiba investment -CEO "
    },
    {
        "content": "* Western Digital announces financial results for first fiscal quarter 2018",
        "date": "10262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital reports Q1 earnings $2.23/shr "
    },
    {
        "content": "Oct 26 Data-storage device maker Western Digital Corp reported a 9.9 percent jump in quarterly revenue on strong demand for its memory chips from smartphone makers and datacenter operators.",
        "date": "10262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital quarterly revenue rises 9.9 pct "
    },
    {
        "content": "YOKKAICHI  Japan Toshiba Corp said it is discussing joint investment in a new chip production line with Western Digital Corp - its estranged business partner after the Japanese firm chose a different suitor to buy its $18 billion semiconductor business.",
        "date": "10132017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba discussing joint investment in chips with Western Digital "
    },
    {
        "content": "* Auditor gave mixed review to Toshiba's earnings (Adds analyst comment  chip investment)",
        "date": "10112017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba off Tokyo bourse's special watchlist  but ISS critical of accounting "
    },
    {
        "content": "* Toshiba  Western Digital in legal dispute over chip unit sale",
        "date": "10132017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Toshiba discussing joint investment in chips with Western Digital "
    },
    {
        "content": "YOKKAICHI  Japan  Oct 13 Toshiba Corp is discussing joint investment for a new memory product line at its Yokkaichi plant with Western Digital Corp's Sandisk  the head of the company's chip unit said on Friday.",
        "date": "10132017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba discussing joint investment in chips with Western Digital's Sandisk "
    },
    {
        "content": "* Western Digital comments on SanDisk’s intellectual property  consent rights  SanDisk-Toshiba joint ventures",
        "date": "10102017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital comments on SanDisk intellectual property  SanDisk-Toshiba JVs "
    },
    {
        "content": "TOKYO U.S. private equity firm Bain Capital LP on Thursday said it aims to list Toshiba Corp's  chip unit on the Tokyo Stock Exchange within three years  to cash in its investment after leading an $18 billion acquisition of the business. | Video ",
        "date": "10052017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Bain Capital aims to list Toshiba chip unit in three years "
    },
    {
        "content": "* Aims to settle Western Digital disputes at an early stage (Adds further Bain comments)",
        "date": "10052017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Bain Capital aims to list Toshiba chip unit in 3 years "
    },
    {
        "content": "TOKYO Western Digital Corp said on Tuesday it will seek an injunction to block the sale of Toshiba Corp's prized semiconductor business to a rival group  upping the ante in an  acrimonious battle with its chip venture partner.",
        "date": "09272017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital to seek injunction to block Toshiba's $18 bln chip unit sale "
    },
    {
        "content": "TOKYO Western Digital Corp  said on Tuesday it will seek an injunction to block the sale of Toshiba Corp's  prized semiconductor business to a rival group  upping the ante in an  acrimonious battle with its chip venture partner. | Video ",
        "date": "09262017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital to seek injunction to block Toshiba's $18 billion chip unit sale "
    },
    {
        "content": "* Toshiba has picked rival Bain-led group as winner of auction",
        "date": "09262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital to seek injunction to block Toshiba's $18 bln chip unit sale "
    },
    {
        "content": "TOKYO  Sept 26 Western Digital Corp said on Tuesday it will seek an injunction to block the sale of Toshiba Corp's prized semiconductor business to a rival group  upping the ante in an  acrimonious battle with its chip venture partner.",
        "date": "09262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital to seek injunction to block Toshiba's $18 bln chip unit sale "
    },
    {
        "content": "* Western digital’s SanDisk subsidiaries initiate new arbitration proceedings against Toshiba in the ICC international court of arbitration",
        "date": "09202017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital’s SanDisk units initiate new arbitration proceedings against Toshiba "
    },
    {
        "content": "TOKYO Toshiba Corp  is shifting back toward selling its prized semiconductor unit to a group backed by joint venture partner Western Digital Corp   people familiar with the deal said.",
        "date": "09192017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Exclusive: Toshiba flips back towards Western Digital group for chip unit sale - sources "
    },
    {
        "content": "TOKYO  Sept 15 Bain Capital confirmed it brought in several strategic partners to bolster its bid for Toshiba Corp's memory chip business  after the Japanese company agreed to accelerate talks with a group led by the U.S. private equity firm.",
        "date": "09152017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Bain says would honour Western Digital contract in Toshiba chip venture "
    },
    {
        "content": "Western Digital Corp  filed its latest legal action against joint-venture chip partner Toshiba Corp  for moving to invest in a new flash memory production line without its help  the U.S. company said on Wednesday.",
        "date": "09212017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital takes legal step to stop Toshiba memory investment "
    },
    {
        "content": "* Western Digital wouldn't agree to terms on future stake- source (Recasts and writes through with details)",
        "date": "09202017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba selects Bain group as buyer of its memory chip business -sources "
    },
    {
        "content": "* Toshiba issues statement regarding request for arbitration filed by Western Digital's Sandisk concerning investment in Toshiba's fab 6​",
        "date": "09212017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba \"disappointed\" by Western Digital's initiation of additional arbitration "
    },
    {
        "content": "* Yen weakens vs dollar after Fed signals it might hike this year",
        "date": "09212017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Nikkei probes more than 2-year highs as yen eases  Apple suppliers fall "
    },
    {
        "content": "TOKYO  Sept 21 Japan's Toshiba Corp is expected to formalise the sale of its prized memory chip unit on Thursday to a group led by U.S. private equity firm Bain Capital  even as jilted suitor and joint venture partner Western Digital took fresh legal action.",
        "date": "09212017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba prepares to formalise chips sale  even as rejected suitor steps up legal action "
    },
    {
        "content": "Sept 20 Western Digital Corp filed its latest legal action against joint-venture chip partner Toshiba Corp for moving to invest in a new flash memory production line without its help  the U.S. company said on Wednesday.",
        "date": "09212017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Western Digital takes legal step to stop Toshiba memory investment "
    },
    {
        "content": "TOKYO Apple Inc  has sought to stop Western Digital Corp  from taking control of Toshiba Corp's  chip business by threatening not to buy its products in the future  people with knowledge of the deal said.",
        "date": "09082017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Apple moves to ward Western Digital off control of Toshiba chips: sources "
    },
    {
        "content": "* Toshiba comments on Western Digital’s statement regarding NAND flash-memory collaboration ‍​",
        "date": "09142017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba comments on Western Digital’s statement regarding NAND flash-memory collaboration ‍​ "
    },
    {
        "content": "TOKYO Toshiba Corp  has signed a memorandum to step up talks to sell its memory chip business to a group led by private equity firm Bain Capital and chipmaker SK Hynix Inc   the Nikkei newspaper said on Wednesday.",
        "date": "09132017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba to step up chip talks with Bain  Western Digital still in running: Nikkei "
    },
    {
        "content": "Sept 20 Western Digital Corp filed its latest legal action against joint-venture chip partner Toshiba Corp for moving to invest in a new flash memory production line without its help  the U.S. company said on Wednesday.",
        "date": "09212017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "CORRECTED-UPDATE 1-Western Digital takes legal step to stop Toshiba memory investment "
    },
    {
        "content": "TOKYO Toshiba Corp  now favors a group led by Bain Capital LP and SK Hynix Inc  to buy its prized semiconductor business  as it failed to bridge key gaps with its business partner and rival bidder Western Digital Corp   two people briefed on the matter said on Tuesday.",
        "date": "09122017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Exclusive: Toshiba favors Bain group for chip sale; Western Digital talks stall - sources "
    },
    {
        "content": "Sept 12 Toshiba Corp has decided to sell its memory chip unit to a group led by Western Digital Corp for about 2 trillion yen ($18.29 billion)  Japan's Nikkan Kogyo newspaper said  without citing sources.",
        "date": "09112017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital-led group wins bid for Toshiba chip unit - Nikkan Kogyo "
    },
    {
        "content": "* Toshiba seeking deal on chip unit sale by Wednesday (Recasts with Apple threat to stop buying chips)",
        "date": "09082017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Apple moves to ward Western Digital off control of Toshiba chips -sources "
    },
    {
        "content": "TOKYO Toshiba Corp  said its business partner Western Digital Corp  had been \"persistently\" overstating its rights over a memory chip unit that the Japanese firm is looking to offload  showing the two remain at loggerheads over the $18 billion sale.",
        "date": "09142017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba says Western Digital overstating rights over chip business "
    },
    {
        "content": "* Toshiba says fully committed to completing sale by March 2018",
        "date": "09142017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Toshiba says Western Digital overstating rights over chip business "
    },
    {
        "content": "TOKYO  Sept 13 Toshiba Corp has signed a memorandum to step up talks to sell its memory chip business to a group led by private equity firm Bain Capital and chipmaker SK Hynix Inc  the Nikkei newspaper said on Wednesday.",
        "date": "09132017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba to step up chip talks with Bain  Western Digital still in running -Nikkei "
    },
    {
        "content": "Tokyo Toshiba Corp now favours a group led by Bain Capital LP and SK Hynix Inc to buy its prized semiconductor business  as it failed to bridge key gaps with its business partner and rival bidder Western Digital Corp  two people briefed on the matter said on Tuesday.",
        "date": "09122017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba still in talks over chip unit sale one day before deadline -sources "
    },
    {
        "content": "TOKYO Western Digital Corp  is in talks to gain voting rights of just under 16 percent in Toshiba Corp's  memory chip unit on the assumption that it will be listed in the future  Kyodo news agency reported on Thursday.",
        "date": "09072017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital in talks for stake in Toshiba chip unit after an IPO: Kyodo "
    },
    {
        "content": "TOKYO  Sept 8 A group including Western Digital is seeking around 50 billion yen ($464 million) from Apple Inc to help finance a bid for Toshiba Corp's memory chip unit  Kyodo news agency reported on Friday.",
        "date": "09082017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital seeks Y50 bln from Apple to help finance Toshiba chip bid -Kyodo "
    },
    {
        "content": "TOKYO  Sept 14 Toshiba Corp said business partner Western Digital Corp overstated its rights over a chip business unit that the Japanese conglomerate was trying to sell  showing the two sides remained at loggerheads over the $18 billion auction.",
        "date": "09142017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba says Western Digital overstates its rights over chip business "
    },
    {
        "content": "* Toshiba still in discussions with various parties -sources (Recasts with new sourcing; adds INCJ meeting  external director comment  context)",
        "date": "09122017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba still in talks over chip unit sale one day before deadline -sources "
    },
    {
        "content": "* Western Digital seeking about 16 pct of voting rights -Kyodo",
        "date": "09072017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital in talks for stake in Toshiba chip unit after an IPO -Kyodo "
    },
    {
        "content": "* Toshiba comments on Western Digital's statement regarding NAND flash-memory collaboration",
        "date": "09142017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba comments on Western Digital's statement regarding NAND flash-memory collaboration "
    },
    {
        "content": "* Bain bid about $18 bln  trumps Western Digital offer -source",
        "date": "08302017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "UPDATE 3-Bain adds Apple for last-minute $18 bln Toshiba chip unit bid -sources "
    },
    {
        "content": "* ‍Elastifile - has closed a $16 million funding round  led by Western Digital Capital​ Source text for Eikon: Further company coverage:",
        "date": "09062017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-‍Elastifile - closed a $16 mln funding round  led by Western Digital Capital​ "
    },
    {
        "content": "TOKYO Western Digital Corp has offered to drop out of a group bidding for Toshiba's coveted flash memory chip business to take a stronger position in their joint venture instead  two sources familiar with the matter said on Tuesday.",
        "date": "09052017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Exclusive: Western Digital offers to exit Toshiba chip bid for better JV terms "
    },
    {
        "content": "* Nintendo Partners with Western Digital® to create licensed nintendo switch Sandisk® memory cards",
        "date": "09012017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Nintendo Partners with Western Digital® to create licensed switch sandisk memory cards "
    },
    {
        "content": "TOKYO Toshiba Corp will continue negotiating with three potential buyers  including a group led by Western Digital Corp   on the sale of its memory chip unit  Jiji reported Thursday.",
        "date": "08312017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba to continue talks with bidders for chip unit: Jiji "
    },
    {
        "content": "TOKYO  Sept 7 Western Digital Corp is in talks to gain voting rights of just under 16 percent in Toshiba Corp's memory chip unit on the assumption that it will be listed in the future  Kyodo news agency reported on Thursday.",
        "date": "09072017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital in talks for stake in Toshiba chip unit after an IPO -Kyodo "
    },
    {
        "content": "Sept 6 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "09062017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "TOKYO  Sept 5 Western Digital Corp has offered to drop out of a bid for Toshiba Corp's lucrative semiconductor business in return for a stronger position in the two companies' chip joint venture  two sources said on Tuesday.",
        "date": "09052017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital offers to exit Toshiba chip bid for better JV terms-sources "
    },
    {
        "content": "TOKYO Western Digital Corp's  CEO apologized to his counterpart at Toshiba Corp  for strained ties after the U.S. firm sued to keep their chip joint venture from being sold to rival bidders  according to an Aug. 11 letter.",
        "date": "09012017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital CEO apologized to Toshiba for friction over chip unit sale "
    },
    {
        "content": "TOKYO  Aug 31 Toshiba Corp will continue negotiating with three potential buyers  including a group led by Western Digital Corp   on the sale of its memory chip unit  Jiji reported Thursday.",
        "date": "08312017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba to continue talks with bidders for chip unit - Jiji "
    },
    {
        "content": "TOKYO Toshiba Corp's  board  under pressure to clinch a deal for its prized memory chip unit soon  met on Wednesday to review a revised bid proposed by Western Digital Corp  but no agreement was reached  people familiar with matter said. | Video ",
        "date": "09062017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba board reaches no verdict on new Western Digital chip proposal: sources "
    },
    {
        "content": "* Board hopes to vote on new Western Digital plan next week-source",
        "date": "09062017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba board reaches no verdict on new Western Digital chip proposal -sources "
    },
    {
        "content": "* To address concerns Apple may have about a deal between them",
        "date": "09012017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital CEO apologised to Toshiba for friction over chip unit sale "
    },
    {
        "content": "TOKYO  Sept 1 The head of Western Digital Corp apologised to Toshiba Corp's CEO for strained ties after it sued the Japanese company to keep their memory chip joint venture from being sold to rival bidders  according to a letter dated Aug. 11.",
        "date": "09012017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital CEO apologises to Toshiba for friction over chip unit sale "
    },
    {
        "content": "* Western Digital enters into agreement to acquire Tegile Systems to accelerate enterprise data center systems strategy  broaden product portfolio and expand customer footprint",
        "date": "08292017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital to buy Tegile Systems "
    },
    {
        "content": "TOKYO A consortium led by Western Digital Corp  is close to an agreement to buy Toshiba Corp's  $17.4 billion chip business  with the U.S. firm's CEO in Tokyo to finalize the long and contentious talks  a person familiar with the matter said.",
        "date": "08282017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital group finalizing $17 billion deal for Toshiba chip unit: source "
    },
    {
        "content": "TOKYO Western Digital Corp   part of a group offering to buy Toshiba Corp's  memory chip unit  is not seeking a management role in the business  people familiar with the matter told Reuters on Friday.",
        "date": "08252017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital won't seek management role in Toshiba chip business: sources "
    },
    {
        "content": "TOKYO  Aug 29 Toshiba Corp may not seal a $17.5 billion deal to sell its memory chip unit by a self-imposed Aug. 31 deadline due to disagreements over details of an offer by the bidders  people familiar with the matter said late on Tuesday.",
        "date": "08292017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Toshiba may not finalise chip unit sale by Aug. 31 deadline -sources "
    },
    {
        "content": "* Western Digital has made key concessions to secure deal -sources (Recasts and adds details of the negotiations)",
        "date": "08282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Western Digital group finalising $17 bln deal for Toshiba chip unit -source "
    },
    {
        "content": "TOKYO  Aug 28 Western Digital Corp's chief executive is in Tokyo to finalise an agreement to buy Toshiba Corp's memory chip business  ending months of dispute over the auction  a person familiar with the matter told Reuters on Monday.",
        "date": "08282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital CEO in Japan to finalise Toshiba chip deal -source "
    },
    {
        "content": "* Toshiba board to vote Aug 31 if agreement reached -sources (Adds details on negotiations)",
        "date": "08252017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital won't seek management role in Toshiba chip business -sources "
    },
    {
        "content": "TOKYO A consortium that includes Western Digital  is offering 1.9 trillion yen ($17.4 billion) for Toshiba Corp's  memory chip business  which the Japanese conglomerate is trying to sell to cover losses from its U.S. nuclear business  sources said on Thursday. | Video ",
        "date": "08242017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital group to offer $17.4 billion for Toshiba chip unit: sources "
    },
    {
        "content": "TOKYO  Aug 25 Western Digital Corp  part of a group offering to buy Toshiba Corp's memory chip unit  is not seeking a management role in the business  people familiar with the matter said.",
        "date": "08252017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital won't seek management role in Toshiba chip business -sources "
    },
    {
        "content": "* Toshiba wants to reach deal this month  close by end-March (Adds details on offer)",
        "date": "08242017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital group to offer $17.4 bln for Toshiba chip unit -sources "
    },
    {
        "content": "TOKYO Japan's Toshiba Corp is prioritizing negotiations with Western Digital to sell its memory chip business after talks stalled with a previously preferred bidder  sources familiar with the matter said on Wednesday.",
        "date": "08232017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba prioritizes talks with Western Digital on chip business sale: sources "
    },
    {
        "content": "TOKYO  Aug 24 A consortium that includes Western Digital is offering 1.9 trillion yen ($17.4 billion) for Toshiba Corp's memory chip business  which the Japanese conglomerate is trying to sell to cover losses from its U.S. nuclear business  sources said on Thursday.",
        "date": "08242017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital group to offer Y1.9 trln for Toshiba's chip unit -sources "
    },
    {
        "content": "* Western Digital would tie up with KKR  state funds -sources",
        "date": "08232017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba prioritises talks with Western Digital on chip business sale -sources "
    },
    {
        "content": "* Chiefs of Toshiba and Western Digital will meet face to face as soon as this month  it was learned Monday - Nikkei‍​ Source text: (http://s.nikkei.com/2whbtDn) Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "08212017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba  Western Digital chiefs will meet face to face as soon as this month - Nikkei‍​ "
    },
    {
        "content": "TOKYO  Aug 23 Japan's Toshiba Corp is prioritising talks with Western Digital to sell its memory chip business  as negotiations with a previously preferred bidder have stalled  the Nikkei business daily reported on Wednesday.",
        "date": "08222017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba prioritises talks with Western Digital on chips business -Nikkei "
    },
    {
        "content": "* Toshiba has begun negotiations with Western Digital in hopes of reaching agreement this month to sell its flash memory arm - Nikkei Source text (http://s.nikkei.com/2vVyuek) Further company coverage:",
        "date": "08222017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba begun negotiations with Western Digital in hopes of reaching agreement this month to sell its flash memory arm - Nikkei "
    },
    {
        "content": "TOKYO  Aug 3 Toshiba Corp said on Thursday it would go ahead with the capital investment to build a memory chip production line without joint venture partner Western Digital Corp. The Japanese company said it has increased the initial amount of capital investment in the Fab 6 production line to 195 billion yen ($1.76 billion)  up by 15 billion yen from its original estimate  because it is now going it alone.",
        "date": "08032017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba to invest in chip line without JV partner Western Digital "
    },
    {
        "content": "* New line to start producing next-gen memory chips next year",
        "date": "08032017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba to invest in chip line without JV partner Western Digital "
    },
    {
        "content": "TOKYO  Aug 3 Toshiba Corp on Thursday said it had stopped blocking Western Digital Corp from accessing databases at their memory chip joint venture (JV).",
        "date": "08032017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba stops blocking Western Digital access to chip JV databases "
    },
    {
        "content": "* Western Digital Corp on talks with Toshiba says \"will continue to work to seek a solution that is in the best interest of all parties\"- conf call",
        "date": "07272017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital Corp expects revenue for Sept qtr to be about $5.1 bln - conf call "
    },
    {
        "content": "* Western digital announces financial results for fourth fiscal quarter and fiscal year 2017",
        "date": "07272017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital Q4 earnings per share $0.93 "
    },
    {
        "content": "TOKYO Toshiba Corp's  board will meet on Wednesday to consider offers for its chip unit from Western Digital  and Taiwan's Foxconn in addition to a bid from a consortium that was previously favorite  a source familiar with the matter said.    Toshiba is scrambling to sell its flash memory unit to cover losses from its bankrupt U.S. nuclear business Westinghouse.",
        "date": "07252017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba board to meet Wednesday  weigh offers for chip unit: source "
    },
    {
        "content": "* Western Digital comments on superior court of California's order",
        "date": "07282017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital comments on superior court of California's order "
    },
    {
        "content": "* Toshiba also weighing offers from Western Digital  Foxconn -source (Adds details on auction  bidders)",
        "date": "07252017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Toshiba board to meet Wednesday  weigh offers for chip unit - source "
    },
    {
        "content": "July 28 Toshiba Corp has agreed to give Western Digital Corp two weeks' notice before closing any sale of a memory chip unit that would involve transferring joint venture shares that Western Digital claims give it a say in the $18 billion sale of the unit.",
        "date": "07282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba to give Western Digital notice on closing memory sale "
    },
    {
        "content": "TOKYO  July 25 Toshiba Corp's board is set to meet on Wednesday to weigh three offers for its chip unit  including bids from Western Digital and Taiwan's Foxconn in addition to one by a consortium which was previously a clear favourite  a source familiar with the matter said.",
        "date": "07252017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba board to meet Wednesday  weigh offers for chip unit -source "
    },
    {
        "content": "July 28 Toshiba Corp has agreed to give Western Digital Corp two weeks' notice before closing any sale of a memory chip unit that would involve transferring joint venture shares that Western Digital claims give it a say in the $18 billion sale of the unit.",
        "date": "07282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba to give Western Digital notice on closing memory sale "
    },
    {
        "content": "* Toshiba - Co and SanDisk/Western Digital have reached agreement that removes need for further action by court on SanDisk's request for preliminary injunction",
        "date": "07282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba comments on benefits of joint stipulation with SanDisk "
    },
    {
        "content": "TOKYO Toshiba Corp  said it resumed blocking access by Western Digital Corp  to data at their memory chip joint venture  intensifying its dispute with the U.S. firm over the Japanese company's planned sale of the chip business.",
        "date": "07192017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba says it again is blocking Western Digital access to chip JV "
    },
    {
        "content": "TOKYO  July 19 Toshiba Corp said it resumed blocking access by Western Digital Corp to data at their memory chip joint venture  intensifying its dispute with the U.S. firm over the Japanese company's planned sale of the chip business.",
        "date": "07192017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Toshiba says it again is blocking Western Digital access to chip JV "
    },
    {
        "content": "TOKYO  July 19 Toshiba Corp said it resumed blocking access by Western Digital Corp to data at their memory chip joint venture  amid a feud over the Japanese company's planned auction of the chip business.",
        "date": "07192017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba says resumed blocking Western Digital access to chip JV "
    },
    {
        "content": "TOKYO Western Digital Corp's top executive is in Japan to meet government officials  aiming to resolve a dispute with Toshiba Corp over the Japanese company's planned sale of its chip business  sources familiar with the matter said on Tuesday.",
        "date": "07182017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital CEO meeting Japan officials over Toshiba: sources "
    },
    {
        "content": "TOKYO  July 18 Western Digital Corp's top executive is in Japan to meet government officials  aiming to resolve a dispute with Toshiba Corp over the Japanese company's planned sale of its chip business  sources familiar with the matter said on Tuesday.",
        "date": "07182017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital CEO meeting Japan officials over Toshiba - sources "
    },
    {
        "content": "TOKYO  July 18 Western Digital Corp's top executive is in Japan to meet government officials  aiming to resolve a dispute with Toshiba Corp over the Japanese company's planned sale of its chip business  sources familiar with the matter said on Tuesday.",
        "date": "07182017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital CEO meeting Japan officials over Toshiba row -sources "
    },
    {
        "content": "* Western Digital's SanDisk subsidiaries obtain court protection against Toshiba in preliminary injunction hearing",
        "date": "07152017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital's SanDisk subsidiaries obtain court protection against Toshiba in preliminary injunction hearing "
    },
    {
        "content": "* Toshiba could be worth Y400 per share in future -Greenlight",
        "date": "07182017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 3-Toshiba shares jump by almost a fifth after Greenlight stake  court hearing "
    },
    {
        "content": "* Toshiba updates on preliminary injunctive relief brought by Western Digital",
        "date": "07182017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba updates on preliminary injunctive relief brought by Western Digital "
    },
    {
        "content": "TOKYO  July 18 Toshiba Corp shares rose more than 8 percent on Tuesday after a U.S. judge postponed its decision in Western Digital Corp's bid to temporarily block the Japanese company from selling its flash memory business in an $18 billion deal.",
        "date": "07182017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba shares jump; no immediate injunction for Western Digital in chip sale "
    },
    {
        "content": "A U.S. judge did not reach a decision Friday in Western Digital Corp's bid to temporarily block Toshiba Corp from selling its flash memory business in an $18 billion deal but proposed requiring Toshiba to give Western Digital two weeks' notice before closing.",
        "date": "07152017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "U.S. judge postpones decision in bid to block Toshiba memory unit sale "
    },
    {
        "content": "July 14 A U.S. judge did not reach a decision Friday in Western Digital Corp's bid to temporarily block Toshiba Corp from selling its flash memory business in an $18 billion deal.",
        "date": "07142017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Judge postpones decision in bid to block Toshiba's memory unit sale "
    },
    {
        "content": "TOKYO Toshiba Corp  is in talks with Western Digital Corp  and Taiwan's Foxconn  as well as with an already preferred bidder  as it seeks to revive a stalled $18 billion sale of its chip business  banking sources said on Tuesday.",
        "date": "07122017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba in talks with Western Digital  Foxconn over chip unit sale: sources "
    },
    {
        "content": "July 14 A U.S. judge did not reach a decision Friday in Western Digital Corp's bid to temporarily block Toshiba Corp from selling its flash memory business in an $18 billion deal but proposed requiring Toshiba to give Western Digital two weeks' notice before closing.",
        "date": "07152017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-U.S. judge postpones decision in bid to block Toshiba memory unit sale "
    },
    {
        "content": "July 11 Western Digital Corp won a temporary U.S. court order on Tuesday saying that Toshiba Corp must allow Western Digital's employees to access databases and chip samples as part of a joint venture with Toshiba between the two around flash memory chip plants in Japan.",
        "date": "07112017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital gets U.S. court order to access Toshiba databases  chip samples "
    },
    {
        "content": "TOKYO Toshiba Corp has asked a U.S. court to dismiss a Western Digital Corp request for an injunction to prevent a sale of the Japanese firm's chip business  saying the court has no jurisdiction and that an injunction would cause irreparable harm.",
        "date": "07052017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba seeks dismissal of Western Digital injunction request over chip unit "
    },
    {
        "content": "July 11 Western Digital Corp won a temporary U.S. court order on Tuesday saying that Toshiba Corp must allow Western Digital's employees to access databases and chip samples as part of a joint venture with Toshiba around flash memory chip plants in Japan.",
        "date": "07112017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Western Digital gets U.S. court order to access Toshiba databases  chip samples "
    },
    {
        "content": "TOKYO  July 4 Toshiba Corp has asked a U.S. court to dismiss a Western Digital Corp request for an injunction to prevent a sale of the Japanese firm's chip business  saying the court has no jurisdiction and that an injunction would cause irreparable harm.",
        "date": "07042017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba seeks dismissal of Western Digital injunction request over chip unit "
    },
    {
        "content": "* Toshiba says filed opposition to motion for preliminary injunctive relief brought by Western Digital Source text: http://bit.ly/2tHbz6p Further company coverage:",
        "date": "07032017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba says filed opposition to Western Digital lawsuit "
    },
    {
        "content": "* Preferred bidder talks struggling over SK Hynix role - sources (Adds background on negotiations  comment from source)",
        "date": "07112017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba in talks with Western Digital  Foxconn over chip unit sale - sources "
    },
    {
        "content": "TOKYO  July 11 Toshiba Corp told its creditor banks it is in talks with Western Digital Corp and Taiwan's Foxconn over the $18 billion sale of its prized chip unit  banking sources familiar with the matter said on Tuesday.",
        "date": "07112017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba talking with Western Digital  Foxconn about chip unit sale -sources "
    },
    {
        "content": "July 10 Western Digital Corp said it matched rival bidders' offers to acquire Japanese conglomerate Toshiba Corp's flash memory unit ahead of a court hearing on Friday over whether to halt the auction process.",
        "date": "07112017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital says it matched rivals' bids for Toshiba chip unit "
    },
    {
        "content": "July 10 Western Digital Corp said it matched rival bidders' offers to acquire Japanese conglomerate Toshiba Corp's flash memory unit ahead of a court hearing on Friday over whether to halt the auction process.",
        "date": "07112017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital says it matched rivals' bids for Toshiba chip unit "
    },
    {
        "content": "* Reiterates commitment to investment in joint ventures (Adds details  context)",
        "date": "06292017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital says Toshiba's actions in chip spat harm customers "
    },
    {
        "content": "TOKYO Western Digital Corp said on Thursday that legal action and other moves taken by Toshiba Corp in their dispute  over the sale of its prized memory chip unit were harming Toshiba's stakeholders and customers.",
        "date": "06302017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital says Toshiba's actions in chip spat harm customers "
    },
    {
        "content": "CHIBA  Japan Japan's Toshiba Corp  has pushed back its timeline to clinch a sale of its prized flash memory chip unit  saying the $18 billion deal was being held up due to differences of opinion within the consortium chosen as preferred bidder. | Video ",
        "date": "06282017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba misses self-imposed deadline for chip unit sale  sues Western Digital "
    },
    {
        "content": "* Says Toshiba and Toshiba Memory Corp (TMC) filed a lawsuit against Western Digital Corp   a U.S. company  and its subsidiary Western Digital Technologies  Inc.  under the reason of violation of Unfair Competition Prevention Law  and claiming compensation of 120 billion yen",
        "date": "06282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF- Toshiba and Toshiba Memory files lawsuit against Western Digital "
    },
    {
        "content": "TOKYO Western Digital Corp  and U.S. private equity firm KKR & Co LP  have resubmitted an offer for Toshiba Corp's  flash memory chip unit  in an eleventh hour effort to prevent the conglomerate signing a deal with its preferred bidder.",
        "date": "06272017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "At last minute  Western Digital resubmits bid for Toshiba chip unit "
    },
    {
        "content": "* Western Digital updates fourth fiscal quarter outlook and reiterates guide for calendar year 2017",
        "date": "06262017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital sees Q4 non-GAAP earnings per share of $2.85 "
    },
    {
        "content": "* Talks with some members of preferred bidder group taking time",
        "date": "06282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba misses self-imposed deadline for chip unit sale  sues Western Digital "
    },
    {
        "content": "* Uncertain if Toshiba will sign pact with preferred bidder by Wed",
        "date": "06272017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-At last minute  Western Digital resubmits bid for Toshiba chip unit "
    },
    {
        "content": "* Toshiba  asked about Western Digital's latest offer  says still aims to reach final agreement with previously selected preferred bidder for chip unit Further company coverage: (Reporting by Tokyo Newsroom)",
        "date": "06272017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba says aims for deal with preferred bidder despite Western Digital's latest offer "
    },
    {
        "content": "TOKYO  June 27 Western Digital Corp said it and private equity firm KKR & Co LP had resubmitted a bid for Toshiba Corp's prized flash memory chip unit.",
        "date": "06272017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital says resubmitted bid with KKR for Toshiba's chip unit "
    },
    {
        "content": "* Western Digital updates fourth fiscal quarter outlook and reiterates guide for calendar year 2017",
        "date": "06262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital sees Q4 earnings per share $1.37 "
    },
    {
        "content": "TOKYO Japan's Toshiba Corp said on Wednesday it is filing a lawsuit against joint venture partner Western Digital Corp.",
        "date": "06282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba says suing Western Digital for $1 billion "
    },
    {
        "content": "TOKYO Toshiba Corp said it was open to talks with Western Digital Corp in their dispute over the sale of the Japanese conglomerate's prized chip unit - an apparent olive branch after it chose another suitor as preferred bidder.",
        "date": "06232017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba willing to talk with spurned Western Digital about chip unit sale "
    },
    {
        "content": "TOKYO/SEOUL  June 20 A Japanese government-led consortium has told Toshiba Corp it needs to resolve its legal dispute with Western Digital Corp before it will invest in the firm's chip unit  sources briefed on the matter said.",
        "date": "06202017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Japan govt-led group tells Toshiba to fix chip spat with Western Digital -sources "
    },
    {
        "content": "TOKYO The Japanese trade ministry is in talks with Western Digital Corp  about the U.S. firm joining a government-led consortium chosen as the preferred bidder for Toshiba Corp's   chip business  people familiar with the matter said.",
        "date": "06212017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Japan trade ministry asks Western Digital to join Japan Government-Bain consortium for Toshiba chip unit: sources "
    },
    {
        "content": "TOKYO Western Digital Corp  has told Toshiba Corp  that it will not agree to a sale of the Japanese conglomerate's prized memory chip unit to a preferred bidding consortium that includes rival chipmaker SK Hynix Inc .",
        "date": "06262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital objects to SK Hynix participation in Toshiba chip unit sale "
    },
    {
        "content": "TOKYO  June 28 Japan's Toshiba Corp said on Wednesday it is filing a lawsuit against joint venture partner Western Digital Corp.",
        "date": "06282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba says suing Western Digital for $1 bln "
    },
    {
        "content": "* Increases net loss  negative shareholder equity estimates (Recasts and writes through with CEO comments)",
        "date": "06232017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 3-Toshiba willing to talk with spurned Western Digital about chip unit sale "
    },
    {
        "content": "TOKYO  June 21 The Japanese trade ministry is in talks with Western Digital Corp about the U.S. firm joining a government-led consortium chosen as the preferred bidder for Toshiba Corp's  chip business  people familiar with the matter said.",
        "date": "06212017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Japan trade ministry asks Western Digital to join Japan Govt-Bain consortium for Toshiba chip unit -sources "
    },
    {
        "content": "* Western Digital says won't accept SK Hynix in winning consortium",
        "date": "06262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital objects to SK Hynix participation in Toshiba chip unit sale "
    },
    {
        "content": "June 28 Toshiba Corp chip business chief Yasuo Naruke:",
        "date": "06282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba chip chief: Western Digital's offer for chip unit has anti-monopoly issues  valuation not high "
    },
    {
        "content": "TOKYO  June 23 Toshiba Corp said it was open to talks with Western Digital Corp in their dispute over the sale of the Japanese conglomerate's prized chip unit - an apparent olive branch after it chose another suitor as preferred bidder.",
        "date": "06232017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba says open to talks with Western Digital over chip unit sale "
    },
    {
        "content": "TOKYO  June 26 Western Digital Corp has told Toshiba Corp that it will not agree to a sale of the Japanese conglomerate's prized memory chip unit to a preferred bidding consortium that includes rival chipmaker SK Hynix Inc.",
        "date": "06262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital won't consent to SK Hynix participation in Toshiba chip unit sale "
    },
    {
        "content": "* Western Digital interfering in chip unit sale process through arbitration request  lawsuit Source text for Eikon: Further company coverage: (Reporting by Makiko Yamazaki)",
        "date": "06282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba CEO: Western Digital interfering in chip unit sale process through arbitration request  lawsuit "
    },
    {
        "content": "* Memory Technologies  LLC  a unit of co  and Western Digital Corporation have entered into a settlement and patent license agreement",
        "date": "06162017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Pendrell Corp says unit and Western Digital Corp signed agreements "
    },
    {
        "content": "TOKYO Western Digital Corp has sought a court injunction to prevent Toshiba Corp from selling its chip business without the U.S. firm's consent - a move that threatens to throw the fiercely contested auction into disarray.",
        "date": "06152017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital seeks court injunction to block sale of Toshiba chip unit "
    },
    {
        "content": "* Seeks injunction in California court  expects ruling by mid-July",
        "date": "06152017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Western Digital seeks court injunction to block sale of Toshiba chip unit "
    },
    {
        "content": "TOKYO Western Digital Corp  expects a ruling on its request for a court injunction to stop the sale of Toshiba Corp's  chip unit by mid-July  a source familiar with the situation said on Thursday.",
        "date": "06152017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital expects ruling on injunction request by mid-July: source "
    },
    {
        "content": "TOKYO  June 15 Western Digital Corp said it has sought an injunction that would stop Japan's Toshiba Corp from selling its NAND chip business  deepening a spat between the partners.",
        "date": "06152017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital seeks injunction to block Toshiba chip business transfer "
    },
    {
        "content": "TOKYO  June 12 Western Digital Corp plans to raise its offer for Toshiba Corp's prized semiconductor unit to $18 billion or more  a person familiar with the matter said  in a last-ditch effort to clinch a deal both companies consider vital.",
        "date": "06122017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital to raise Toshiba chip offer in last-ditch bid-source "
    },
    {
        "content": "TOKYO Western Digital Corp  plans to raise its offer for Toshiba Corp's  prized semiconductor unit to $18 billion or more  a person familiar with the matter said  in a last-ditch effort to clinch a deal both companies consider vital.",
        "date": "06102017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital to raise Toshiba chip offer in last-ditch bid: source "
    },
    {
        "content": "* New offer seeks to clear antitrust concerns - source (Adds details  context)",
        "date": "06102017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Western Digital to raise Toshiba chip offer in last-ditch bid-source "
    },
    {
        "content": "TOKYO  June 10 Western Digital Corp plans to raise its offer for Toshiba Corp's prized semiconductor unit to 2 trillion yen ($18 billion) or more  a person familiar with the matter said  marking a last-ditch effort to clinch a deal that both companies consider vital.",
        "date": "06102017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital to raise Toshiba chip offer to $18 bln or more-source "
    },
    {
        "content": "* Western Digital has offered to acquire less than 20 percent of Japanese partner Toshiba's memory chip arm - Nikkei",
        "date": "06052017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital has offered to acquire less than 20% of Toshiba's memory chip arm - Nikkei "
    },
    {
        "content": "TOKYO  June 7 Toshiba Corp on Wednesday asked Western Digital Corp once again to stop challenging the Japanese conglomerate's plans to sell its chip business.",
        "date": "06072017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba asks Western Digital again to drop challenge to Toshiba's chip business sale "
    },
    {
        "content": "* Western Digital responds to Toshiba statement related to NAND flash-memory joint ventures",
        "date": "06022017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital responds to Toshiba statement related to NAND flash-memory JVs "
    },
    {
        "content": "TOKYO Toshiba Corp said on Friday it wasn't convinced by an effort by Western Digital Corp CEO Steve Milligan to win the Japanese conglomerate's backing for the U.S. tech firm's bid for Toshiba's highly prized chip unit.",
        "date": "06092017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba unconvinced by Western Digital's last-ditch chip bid "
    },
    {
        "content": "* State-backed fund in talks with Bain Capital -sources (Adds details on Western Digital's proposal)",
        "date": "06092017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 3-Toshiba unconvinced by Western Digital's last-ditch chip bid "
    },
    {
        "content": "TOKYO Toshiba Corp has moved some of the assets of its memory chip unit back to the parent company in a bid to ward off Western Digital Corp's legal claim that the Japanese conglomerate cannot sell the unit without the U.S. partner's consent.",
        "date": "05312017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba moves back some chip unit assets to ward off Western Digital's legal claim "
    },
    {
        "content": "TOKYO Western Digital said on Thursday it is still seeking arbitration in a dispute with Toshiba Corp  over the auction of its prized chip unit  arguing that a transfer of assets by the Japanese firm had not resolved what it calls a serious breach of contract.",
        "date": "06012017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba  Western Digital trade barbs in spat over chip unit auction "
    },
    {
        "content": "* Western Digital says nothing resolved  still wants arbitration",
        "date": "06012017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Toshiba  Western Digital trade barbs in spat over chip unit auction "
    },
    {
        "content": "TOKYO  June 9 Toshiba Corp said that Western Digital Corp CEO Steve Milligan met with its executives on Friday but failed to dispel concerns about the U.S. firm's proposal to buy Toshiba's prized chip unit.",
        "date": "06092017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba says Western Digital meeting didn't dispel concerns over chip proposal "
    },
    {
        "content": "* Innovation Network Corp. of Japan will enter into negotiations with Western Digital on partnering to purchase Toshiba's memory unit - Nikkei‍​ Source text:(http://s.nikkei.com/2sf2Aov) Further company coverage:",
        "date": "05292017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Innovation Network Corp. Of Japan will enter negotiations with Western Digital on partnering to buy Toshiba's memory unit - Nikkei‍​ "
    },
    {
        "content": "TOKYO Western Digital is considering fresh investment to build another flash memory chip plant in western Japan in an effort to show its commitment to the country  a source familiar with the matter said.",
        "date": "06012017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital considering new memory plant in western Japan: source "
    },
    {
        "content": "TOKYO  June 1 Western Digital is considering fresh investment to build another flash memory chip plant in western Japan in an effort to show its commitment to the country  a source familiar with the matter said.",
        "date": "06012017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital considering new memory plant in western Japan - source "
    },
    {
        "content": "* Western Digital showed its proposal to Toshiba recently -sources",
        "date": "06092017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "CORRECTED-UPDATE 1-Bain in talks with Japan fund on bid for Toshiba chip unit -sources "
    },
    {
        "content": "TOKYO Western Digital Corp  may join a consortium of Japanese government money and KKR & Co LP  to bid for Toshiba Corp's  chip unit  backing away from an earlier demand for an immediate majority stake  two sources familiar with the matter said.",
        "date": "05292017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital may join Japan-KKR group for Toshiba chip unit bid: sources "
    },
    {
        "content": "TOKYO  June 1 Japan's Nikkei share average started the month with gains on Thursday  buoyed by upbeat news of Japanese companies' growing capital expenditure as well as the dollar's ascent from overnight lows against the yen.",
        "date": "06012017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Nikkei rises on upbeat Japan capex data  dollar's rise vs yen "
    },
    {
        "content": "SAN FRANCISCO/TOKYO  June 9 Private equity firm Bain Capital is replacing rival KKR & Co LP in a Japanese government-led consortium that also includes Western Digital Corp to bid for Toshiba Corp's  chip unit  sources familiar with the matter said.",
        "date": "06092017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Bain replacing KKR in Japan govt-backed bid for Toshiba chip unit -sources "
    },
    {
        "content": "* Toshiba told Sumitomo Mitsui Banking.  Mizuho Bank  other lenders it will begin negotiating with four suitors that submitted second-round bids for Toshiba Memory - Nikkei",
        "date": "05252017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Four bidders and U.S. partner Western Digital competing to buy Toshiba's memory chip unit- Nikkei "
    },
    {
        "content": "* Western Digital OK with no immediate majority stake -sources",
        "date": "05292017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital may join Japan-KKR group for Toshiba chip unit bid -sources "
    },
    {
        "content": "TOKYO Japan's government said on Tuesday it wanted Toshiba Corp  and partner Western Digital Corp  to cooperate  expressing concern about an escalating dispute between the two that threatens to upend the sale of Toshiba's chip unit.",
        "date": "05162017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Japan urges Toshiba  Western Digital to get along as chip spat flares "
    },
    {
        "content": "* INCJ seen teaming up with another suitor for Toshiba chip unit (Recasts and adds details of the stock sale)",
        "date": "05182017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Japan fund  likely Toshiba chip unit investor  to raise $2.7 bln "
    },
    {
        "content": "TOKYO Western Digital Corp  has sought international arbitration to stop partner Toshiba Corp  from selling its chips arm without its consent  potentially derailing a much-needed capital injection for the Japanese conglomerate. | Video ",
        "date": "05162017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital takes legal action to block sale of Toshiba's chip unit "
    },
    {
        "content": "TOKYO  May 15 Western Digital Corp has sought international arbitration to stop partner Toshiba Corp from selling its chips arm without its consent  potentially derailing a much-needed capital injection for the Japanese conglomerate.",
        "date": "05142017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital seeks arbitration in row over Toshiba's $18 bln chip sale "
    },
    {
        "content": "TOKYO  May 16 Japanese Trade Minister Hiroshige Seko said on Tuesday that it was \"very important\" for Toshiba Corp and its joint venture partner Western Digital Corp to cooperate  rather than be at odds.",
        "date": "05162017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Japan trade min: 'Very important' for Toshiba  WD to communicate "
    },
    {
        "content": "TOKYO Western Digital Corp has sought international arbitration to stop partner Toshiba Corp from selling its chips arm without its consent  potentially derailing a much-needed capital injection for the Japanese conglomerate.",
        "date": "05152017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital takes legal action to block sale of Toshiba's chip unit "
    },
    {
        "content": "* Western Digital seeks to unwind JV assets transfer to chip unit",
        "date": "05152017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 3-Western Digital takes legal action to block sale of Toshiba's chip unit "
    },
    {
        "content": "May 15 Japan Chief Cabinet Secretary Yoshihide Suga said:",
        "date": "05152017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Japan's top government spokesman: want to closely watch Western Digital's move to stop Toshiba chip sale process "
    },
    {
        "content": "May 15 Toshiba Corp Chief Executive Officer Satoshi Tsunakawa:",
        "date": "05152017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba CEO: No plan to postpone May 19 deadline for 2nd round of bidding for chip unit "
    },
    {
        "content": "TOKYO Toshiba Corp  has told Western Digital Corp  not to interfere in the sale of its prized chip unit  rejecting claims it has breached a joint venture contract and threatening legal action. | Video ",
        "date": "05092017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba ups ante in chip unit sale with attack on Western Digital "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.50 per share Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western digital sets quarterly cash dividend of $0.50 per share "
    },
    {
        "content": "* Western Digital is Toshiba's partner but not a favoured bidder",
        "date": "05092017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 3-Toshiba ups ante in chip unit sale with attack on Western Digital "
    },
    {
        "content": "TOKYO  May 9 Toshiba Corp has told its memory chip partner Western Digital Corp not to interfere with the sale of the Japanese company's prized chip unit.",
        "date": "05092017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba tells Western Digital not to interfere with chip unit sale "
    },
    {
        "content": "* First AP1000 reactor to be put into operation by end-2017 (Updates with quotes  context)",
        "date": "04282017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Westinghouse says will operate normally in Asia  Europe despite Chapter 11 "
    },
    {
        "content": "* Western Digital announces financial results for third fiscal quarter 2017",
        "date": "04272017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital reports Q3 earnings per share $0.83 "
    },
    {
        "content": "* Not considering bidding for Toshiba chip unit -CFO (Adds CFO comments on existing businesses  Toshiba chip sale)",
        "date": "04262017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Canon raises annual profit outlook on Toshiba medical unit acquisition "
    },
    {
        "content": "TOKYO Western Digital Corp   the U.S. partner of Toshiba Corp  in a semiconductor venture  is in talks with Japanese government-backed investors and would consider a joint bid with them for the chip business  a senior official said on Thursday.",
        "date": "04202017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital would consider Japan partners for Toshiba chip unit bid "
    },
    {
        "content": "TOKYO  April 20 Western Digital Corp  the U.S. partner of Toshiba Corp in a semiconductor venture  is in talks with state-backed fund Innovation Network Corp of Japan (INCJ) and the Development Bank of Japan and would consider a joint bid with them for the chip business  a senior official said on Thursday.",
        "date": "04202017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital CFO: Would consider bid with INCJ  DBJ for Toshiba chip unit "
    },
    {
        "content": "TOKYO Western Digital Corp  has warned Toshiba Corp  that the Japanese firm is violating a joint venture contract in  plans to sell to its chip unit and urged that it be given exclusive negotiating rights. | Video ",
        "date": "04122017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital says Toshiba breaching contract  wants exclusive chip talks "
    },
    {
        "content": "* Western Digital: won't let Toshiba run roughshod over its rights",
        "date": "04122017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 3-Western Digital says Toshiba breaching contract  wants exclusive chip talks "
    },
    {
        "content": "TOKYO  April 12 Western Digital Corp has warned Toshiba Corp that splitting off its chip unit prior to a planned sale of the business violates their joint chip venture contract.",
        "date": "04122017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital says Toshiba chip unit sale violates joint venture contract "
    },
    {
        "content": "* Has successfully repriced eur881 million of new euro-denominated term b-2 loans at an interest rate of euribor + 2.00%",
        "date": "03232017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital has repriced EUR881 million of new euro-denominated term B-2 loans at interest rate of EURIBOR + 2.00% "
    },
    {
        "content": "* Western Digital announces successful repricing of $2.985 billion of usd term B loans",
        "date": "03142017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital announces repricing of $2.985 bln of term B loans "
    },
    {
        "content": "* Japan Trade Minister may discuss Westinghouse with US officials",
        "date": "03092017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba's Westinghouse brings in bankruptcy lawyers; disclosure deadlines loom "
    },
    {
        "content": "* Agreement also includes an additional 5-year extension option",
        "date": "03062017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Rambus signs license agreement with Western Digital "
    },
    {
        "content": "* Japan Trade Minister may discuss Westinghouse with US officials",
        "date": "03092017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "WRAPUP 1-Toshiba's Westinghouse brings in bankruptcy lawyers; disclosure deadlines loom "
    },
    {
        "content": "TOKYO  Feb 7 Toshiba Corp wants investment funds including Bain Capital to buy a stake in its flash memory business rather than industry peers such as Micron Technology Inc because doing so will speed up the planned sale  a source said.",
        "date": "02072017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Toshiba wants funds not peers to buy chip stake-source "
    },
    {
        "content": "TOKYO  Feb 7 Toshiba Corp wants investment funds including Bain Capital to buy a stake in its flash memory business rather than industry peers such as Micron Technology Inc because doing so will speed up the planned sale  a source said.",
        "date": "02072017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba wants funds not peers to buy chip stake-source "
    },
    {
        "content": "* Sanjay Mehrotra leaves Western Digital board of directors  Source text for Eikon:  Further company coverage:",
        "date": "02092017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital says Sanjay Mehrotra to leave board "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.50per share  Source text for Eikon:  Further company coverage:",
        "date": "02022017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital sets qtrly cash dividend of $0.50 per share "
    },
    {
        "content": "* Western Digital names Martin Fink Chief Technology Officer  Source text for Eikon:  Further company coverage:",
        "date": "01232017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital names Martin Fink Chief Technology Officer "
    },
    {
        "content": "* Move is part of measures to offset multi-billion dlr writedown",
        "date": "01242017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Toshiba board to approve plans to split off chip business on Friday -source "
    },
    {
        "content": "Data storage company Western Digital Corp  reported higher-than-expected revenue and profit on Wednesday  helped by demand for its products amid stabilizing PC demand and a shift by businesses to cloud storage.",
        "date": "01252017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital's profit  revenue beat estimates "
    },
    {
        "content": "Jan 25 Data storage company Western Digital Corp  reported higher-than-expected revenue and profit on Wednesday  helped by demand for its products amid stabilizing PC demand and a shift by businesses to cloud storage.",
        "date": "01252017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-Western Digital's profit  revenue beat estimates "
    },
    {
        "content": "* Western digital announces financial results for second fiscal quarter 2017",
        "date": "01252017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital Q2 adj EPS $2.30 "
    },
    {
        "content": "Jan 25 Data storage company Western Digital Corp  reported a 47 percent jump in quarterly revenue  helped by demand for its products amid stabilizing PC demand and as businesses increasingly shift to cloud storage.",
        "date": "01252017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Data storage company Western Digital's revenue jumps 47 pct "
    },
    {
        "content": "* State-backed bank considers investment in chip business -sources",
        "date": "01202017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "CORRECTED-UPDATE 3-Toshiba making preparations for sale of stake in chip business -sources "
    },
    {
        "content": "Jan 18 Toshiba Corp is considering spinning off its semiconductor business and selling a partial stake in the unit to Western Digital Corp  the Nikkei financial daily reported on Wednesday.",
        "date": "01172017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Toshiba considering spinning off semiconductor business - Nikkei "
    },
    {
        "content": "* Toshiba says considering memory biz spin-off  nothing decided",
        "date": "01182017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "UPDATE 3-Toshiba mulls chips business stake sale to Western Digital - source "
    },
    {
        "content": "* Toshiba is considering spinning off semiconductor operations and selling a partial stake to Western Digital of the U.S. - Nikkei",
        "date": "01172017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Toshiba considers spinning off semiconductor operations - Nikkei "
    },
    {
        "content": "TOKYO Toshiba Corp is in talks to sell a minority stake in its flash memory business to U.S. chips business partner Western Digital Corp in a bid to boost its capital base  a source briefed on the discussions said on Wednesday.",
        "date": "01182017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba in talks to sell chip business stake to Western Digital:  source "
    },
    {
        "content": "TOKYO  Jan 18 Toshiba Corp is in talks to sell a minority stake in its flash memory business to U.S. chips business partner Western Digital Corp in a bid to boost its capital base  a source briefed on the discussions said on Wednesday.",
        "date": "01182017",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Toshiba in talks to sell chip business stake to Western Digital - source "
    },
    {
        "content": "* Western digital corporation commences registered exchange offer for its 10.500% senior notes due 2024",
        "date": "01072017",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western digital announced commencement of an exchange offer for all of outstanding 10.500% senior notes due 2024 "
    },
    {
        "content": "* Avnet inc - to offer hgst-branded products and solutions in china   products will be available through Avnet global computing components business unit",
        "date": "11012016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Avnet expands distribution agreement with Western Digital into China to help meet growing data challenges "
    },
    {
        "content": "* Western digital announces financial results for first fiscal quarter 2017",
        "date": "10262016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital Q1 non-gaap earnings per share $1.18 "
    },
    {
        "content": "* Says CEO Stephen D. Milligan FY 2016 total compensation $10.5 million versus $11.7 million in FY 2015 - SEC filing",
        "date": "09222016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western digital reports CEO Stephen D. Milligan's compensation "
    },
    {
        "content": "* Says the company will invest 547.6 million won to set up joint venture in Japan  with a Japan-based dental service company",
        "date": "09132016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-DIO to invest 547.6 mln won to set up JV in Japan "
    },
    {
        "content": "* Company now expects Q1 EPS  on a non-GAAP basis to be in range of $1.00 to $1.05",
        "date": "09072016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital sees Q1 non-GAAP earnings per share $1.00 to $1.05 "
    },
    {
        "content": "* Western Digital announces successful repricing of $3.0 billion Term B loans and prepayment of $750 million Term B loans",
        "date": "08182016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western digital announces successful repricing and prepayment Term B loans "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 11 (Fitch) Fitch Ratings has assigned a rating of 'BBB-/RR1' to  Western Digital Corporation's (Western Digital) $3 billion seven-year Senior  Secured Term Loan B-1. The company's Long-Term Issuer Default Rating (IDR) is  currently 'BB+'  and the Rating Outlook is Stable. A full list of current  ratings follows at the end of this release. Western Digital amended the April 29  2016 Existing Loan Agreement to establish  Ne",
        "date": "08112016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Fitch Rates Western Digital's $3B Senior Secured Term Loan B-1 'BBB-/RR1' "
    },
    {
        "content": "* Western Digital announces financial results for fourth quarter and fiscal year 2016",
        "date": "07282016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital Q4 loss per share $1.34 "
    },
    {
        "content": "* Q4 non-gaap gross margin is expected to be approximately 31 percent  consistent with its earlier forecast",
        "date": "07062016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital says Mark Long will succeed Olivier Leonetti as CFO on Sept.1 "
    },
    {
        "content": "* Western Digital updates status of conversions of SanDisk convertible notes",
        "date": "06072016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital updates status of conversions of SanDisk convertible notes "
    },
    {
        "content": "* Received notice of an unsolicited mini-tender offer to purchase up to 2.5 million shares",
        "date": "06082016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital receives notice of an unsolicited mini-tender offer to purchase up to 2.5 mln shares "
    },
    {
        "content": "* Expects its q4 revenue in range of $3.35 billion to $3.45 billion",
        "date": "05262016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western digital sees Q4 revenue between $3.35-$3.45 bln "
    },
    {
        "content": "* Western Digital acquisition of SanDisk receives approval from China's Ministry Of Commerce",
        "date": "05102016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital's SanDisk acquisition gets China's Ministry Of Commerce approval "
    },
    {
        "content": "* Western Digital expects transaction to close on Thursday  May 12  2016",
        "date": "05102016",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital acquisition of Sandisk receives approval from China's Ministry Of Commerce "
    },
    {
        "content": "* Says joined three media and entertainment (m&e) industry technical organizations  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04182016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital says joined three media and entertainment industry technical organizations "
    },
    {
        "content": "NEW YORK  March 31 (IFR) - Western Digital hit a few roadblocks in the junk bond market this week  putting bankers on edge about other big M&A bonds in the works including a massive trade from Dell.",
        "date": "03312016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "After Western Digital struggles  focus turns to Dell "
    },
    {
        "content": "* Announces proposed offerings of $1.5 billion of senior secured notes and $4.1 billion of senior unsecured notes",
        "date": "03182016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Western Digital announces proposed offerings of $1.5 bln of senior secured notes and $4.1 bln of senior unsecured notes "
    },
    {
        "content": "* Sandisk stockholders approve merger with Western Digital Corporation",
        "date": "03152016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Sandisk stockholders approve merger with Western Digital "
    },
    {
        "content": "* Western digital shareholders approve issuance of common stock in connection with acquisition of Sandisk",
        "date": "03152016",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Western digital's shareholders approve stock issuance in connection with Sandisk deal "
    },
    {
        "content": "Feb 22 Alken Asset Management  one of the biggest shareholders of hard-disk drive maker Western Digital Corp  has asked the company to consider cancelling its deal to buy SanDisk Corp  citing a high purchase price.",
        "date": "02222016",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital investor Alken pushes to cancel SanDisk deal "
    },
    {
        "content": "The U.S. hard-disk maker  Western Digital Corp   said on Tuesday that China's Unisplendour Corp Ltd  had scrapped its planned $3.78 billion investment in the company  a move that in turn alters the terms of Western's deal for rival SanDisk Corp .",
        "date": "02242016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital's SanDisk deal re-priced after China deal collapses "
    },
    {
        "content": "* Indexes down: Dow 0.37 pct  S&P 0.47 pct  Nasdaq 0.49 pct   (Updates to open)",
        "date": "02232016",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "US STOCKS-Wall St drops as oil prices slide "
    },
    {
        "content": "* Western Digital to now buy SanDisk for $15.78 billion   (Adds Breakingviews link)",
        "date": "02242016",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 7-Western Digital's SanDisk deal re-priced after China deal collapses "
    },
    {
        "content": "Further company coverage:    (Reporting by Hong Kong newsroom)",
        "date": "02232016",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "BRIEF-Unisplendour scraps plan to acquire stake in Western Digital "
    },
    {
        "content": "BRUSSELS  Feb 4 The European Commission said on Thursday it had cleared Western Digital's planned acquisition of SanDisk after concluding that the takeover would not harm competition in the data storage market in Europe.",
        "date": "02042016",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "EU clears Western Digital acquisition of SanDisk "
    },
    {
        "content": "BRUSSELS  Feb 4 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02042016",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "EU mergers and takeovers (Feb 4) "
    },
    {
        "content": "* Says plans to invest $80.6 million to set up unit with Western Digital",
        "date": "11092015",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "BRIEF-Unisplendour plans unit with Western Digital "
    },
    {
        "content": "* Dow up 0.15 pct  S&P up 0.2 pct  Nasdaq down 0.05 pct   (Adds details  changes comment  updates prices)",
        "date": "10202015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "US STOCKS-Wall St little changed as earnings gain momentum "
    },
    {
        "content": "Oct 21 Hard disk drive maker Western Digital Corp said it would buy memory chip maker SanDisk Corp  in a deal valued at about $19 billion  the latest in a wave of consolidation in the chip-making industry.",
        "date": "10212015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital to buy SanDisk in $19 bln deal "
    },
    {
        "content": "Hard disk drive maker Western Digital Corp is in advanced talks to acquire memory chipmaker SanDisk Corp  people familiar with the matter said on Monday  as a frenzy of dealmaking in the semiconductor sector continued.",
        "date": "10192015",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital in advanced talks to acquire SanDisk: sources "
    },
    {
        "content": "Hard-disk drive maker Western Digital Corp  agreed to buy SanDisk Corp  in a $19 billion deal that will increase its ability to make flash memory storage chips used in smartphones and tablets. | Video ",
        "date": "10212015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital to buy SanDisk in $19 billion deal "
    },
    {
        "content": "* Deal value depends on closing of Unisplendour investment in WDC",
        "date": "10212015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 6-Western Digital to buy SanDisk in $19 bln deal "
    },
    {
        "content": "Oct 19 Hard disk drive maker Western Digital Corp is in advanced talks to acquire memory chipmaker SanDisk Corp  people familiar with the matter said on Monday  as a frenzy of dealmaking in the semiconductor sector continued.",
        "date": "10192015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Western Digital in advanced talks to acquire SanDisk -sources "
    },
    {
        "content": "Oct 21 The following bids  mergers  acquisitions and disposals were reported by 2130 GMT on Wednesday:",
        "date": "10212015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Oct 19 Memory chipmaker SanDisk Corp is in advanced talks to sell itself to hard disk drive maker Western Digital Corp  Bloomberg reported on Monday.",
        "date": "10192015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "SanDisk in advanced talks to sell itself to Western Digital-Bloomberg "
    },
    {
        "content": "NEW YORK Crude oil fell about 4 percent on Monday after a tumble in gasoline futures added pressure to a market slumping on slower growth in China and signs that Iranian oil will return to the market soon following implementation of its nuclear deal.",
        "date": "10192015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Oil down about 4 percent; gasoline drop adds to China  Iran worries "
    },
    {
        "content": "Oct 21 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "10212015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Nuclear deal to be implemented this year  Iran says   (New throughout  with market settlements; adds U.S. inventory build expectations)",
        "date": "10192015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 11-Oil down about 4 pct; gasoline drop adds to China  Iran worries "
    },
    {
        "content": "* Indexes up: Dow 0.03 pct  S&P 0.12 pct  Nasdaq 0.32 pct   (Updates to open)",
        "date": "10142015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "US STOCKS-Wall St higher as health stocks rise; banks in focus "
    },
    {
        "content": "* Futures down: Dow 15 pts  S&P 0.75 pts  Nasdaq 3 pts   (Adds details  comment  updates prices)",
        "date": "10142015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "US STOCKS-Futures little changed as investors assess bank results "
    },
    {
        "content": "Oct 14 U.S. stock index futures fell slightly on Wednesday as fresh economic data from China caused a selloff in commodities and investors awaited a raft of earnings reports.",
        "date": "10142015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "US STOCKS-Futures fall on fresh China woes; bank results in focus "
    },
    {
        "content": "WASHINGTON  Oct 6 The Pentagon's chief arms buyer on Tuesday issued a reminder that the U.S. Defense Department remains watchful on the security of electronic components used in weapons  when asked about a $3.78 billion Chinese plan to invest in U.S. data storage company Western Digital Corp.",
        "date": "10072015",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Pentagon says remains vigilant on security of electronics supply chain "
    },
    {
        "content": "SINGAPORE/TAIPEI  Oct 1 A billion-dollar Chinese plan to invest in Western Digital Corp is designed to plug the U.S. data storage firm into a network of influential China tech players carefully constructed  by Tsinghua University  the alma mater of President Xi Jinping.",
        "date": "10012015",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Tsinghua deal to connect Western Digital to powerful China tech set "
    },
    {
        "content": "China's state-backed Tsinghua Holdings Co Ltd [TSHUAA.UL] plans to buy a 15 percent stake in U.S. data storage company Western Digital Corp  a deal that could draw regulatory scrutiny amid increased national security concerns.",
        "date": "09302015",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "China's Tsinghua to buy Western Digital stake in U.S. tech push "
    },
    {
        "content": "* Western Digital shares rise 16 pct   (Adding Breakingviews link  comment on potential scrutiny)",
        "date": "09302015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 4-China's Tsinghua to buy Western Digital stake in U.S. tech push "
    },
    {
        "content": "Sept 30 U.S. data storage company Western Digital Corp said it would get a $3.78 billion equity investment from Chinese information technology company Unisplendour Corp Ltd.",
        "date": "09302015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "China's Unisplendour to invest $3.78 bln in Western Digital "
    },
    {
        "content": "ABU DHABI/SEOUL May 13 State-run Abu Dhabi National Oil Company (ADNOC) has signed a 40-year deal with GS Energy  selling the South Korean firm a 3 percent stake in an onshore oil concession to develop the United Arab Emirates' (UAE) biggest oilfields.",
        "date": "05132015",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "UPDATE 2-South Korea's GS Energy gets 3 pct stake in UAE oil concession "
    },
    {
        "content": "* To buy 3 pct stake to secure S.Korea's biggest oil field assets",
        "date": "05132015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 1-GS Energy buys stake in Abu Dhabi oil concession for $676 mln "
    },
    {
        "content": "SAN FRANCISCO  Feb 16 The U.S. National Security Agency has figured out how to hide spying software deep within hard drives made by Western Digital  Seagate  Toshiba and other top manufacturers  giving the agency the means to eavesdrop on the majority of the world's computers  according to cyber researchers and former operatives.",
        "date": "02172015",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "UPDATE 3-Russian researchers expose breakthrough U.S. spying program "
    },
    {
        "content": "SAN FRANCISCO  Feb 16 The U.S. National Security Agency has figured out how to hide spying software deep within hard drives made by Western Digital  Seagate  Toshiba and other top manufacturers  giving the agency the means to eavesdrop on the majority of the world's computers  according to cyber researchers and former operatives.",
        "date": "02162015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Russian researchers expose breakthrough U.S. spying program "
    },
    {
        "content": "SAN FRANCISCO  Feb 16 The U.S. National Security Agency has figured out how to hide spying software deep within hard drives made by Western Digital  Seagate  Toshiba and other top manufacturers  giving the agency the means to eavesdrop on the majority of the world's computers  according to cyber researchers and former operatives.",
        "date": "02162015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "UPDATE 2-Russian researchers expose breakthrough U.S. spying program "
    },
    {
        "content": "Western Digital Corp  the world's No. 1 hard-disk drive maker  reported second-quarter results slightly ahead of Wall Street expectations on strong demand for its solid-state drives from enterprise customers.",
        "date": "01282015",
        "name": "Western Digital Corporation",
        "news_type": "topStory",
        "symbol": "WDC",
        "title": "Western Digital's second-quarter results beat Street on strong enterprise growth "
    },
    {
        "content": "Jan 27 Western Digital Corp  the world's No. 1 hard-disk drive maker  reported second-quarter results slightly ahead of Wall Street expectations on strong demand for its solid-state drives from enterprise customers.",
        "date": "01282015",
        "name": "Western Digital Corporation",
        "news_type": "normal",
        "symbol": "WDC",
        "title": "Western Digital's 2nd-qtr results beat Street on strong enterprise growth "
    }
]