[
    {
        "content": "* South Korean prosecutors raid offices of Woori Bank on suspicions of wrongful hiring practices  Yonhap reports citing the prosecutor's office and Woori Bank Further company coverage: (Reporting by Joyce Lee)",
        "date": "11072017",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "BRIEF-S.Korea prosecutors raid offices of Woori Bank - Yonhap "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  May 17 (Fitch) Fitch Ratings has affirmed South Korea-based Woori Bank's Long-Term Issuer-Default Rating (IDR) at 'A-'. The Outlook is Stable. Fitch has also affirmed Woori Bank's Viability Rating at 'bbb+'. A full list of rating actions is at the end of this rating action commentary. KEY RATING DRIVERS IDRS  SENIOR DEBT  SUPPORT RATING AND SUPPORT RATING FLOOR The bank's IDRs  senior debt ratings  Support Rating and Support Rati",
        "date": "05172017",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Fitch Affirms Woori Bank at 'A-'; Outlook Stable "
    },
    {
        "content": "* Banks seen likely to refinance obsolete Basel II securities mostly onshore",
        "date": "05152017",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Woori raises capital offshore  but few Korean issues expected "
    },
    {
        "content": "* Says Korea Deposit Insurance Corporation cuts stake in the co by selling 13.5 million shares of the co",
        "date": "02032017",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "BRIEF-Korea Deposit Insurance cuts stake in Woori Bank to 21.4 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  November 15 (Fitch) Fitch Ratings says there is no immediate rating  impact on Woori Bank (Woori  A-/Stable/bbb+) following Korea Deposit Insurance  Corporation's (KDIC) sale of a 30% stake in Woori. Fitch has not factored the  government's ownership into the ratings of Woori  which was bailed-out during  the Asian Financial Crisis in 1998. Instead  Woori's state-support driven  Long-Term Issuer Default Rating (IDR) remains at it",
        "date": "11152016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Fitch: Woori Bank's Ratings Unaffected by Government's Divestment "
    },
    {
        "content": "* Says its unit Korea Investment & Securities Co Ltd will buy 27.0 million shares of Woori Bank  for synergy improvement",
        "date": "11142016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "BRIEF-Korea Investment Holdings unit Korea Investment & Securities to buy 4 pct stake in Woori Bank "
    },
    {
        "content": "SEOUL  Nov 13 South Korea said on Sunday it picked seven domestic financial institutions to buy a combined 29.7 percent stake in Woori Bank  recovering 2.4 trillion won ($2.06 billion) of taxpayer money spent bailing out the bank nearly two decades ago.",
        "date": "11132016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "S.Korea recoups $2.1 bln by selling 30 pct of Woori Bank "
    },
    {
        "content": "HONG KONG  Sept 19 (IFR) - South Korea's Woori Bank  has named banks to manage a US dollar Additional Tier 1 offering.",
        "date": "09192016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Woori names banks for US dollar AT1 bonds "
    },
    {
        "content": "SEOUL  Sept 23 Eighteen parties have submitted letters of intent to buy minority stakes in Woori Bank   South Korea's fourth-largest bank by assets  the bank's controlling shareholder said on Friday  without naming the parties.",
        "date": "09232016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Eighteen parties show interest in buying Woori Bank stakes -KDIC "
    },
    {
        "content": "SEOUL  Sept 2 South Korea's Hanwha Life Insurance said on Friday it is considering buying a stake in Woori Bank  adding that nothing has been decided.",
        "date": "09022016",
        "name": "Woori Bank",
        "news_type": "normal",
        "symbol": "WF",
        "title": "Hanwha Life Insurance considers Woori Bank stake "
    },
    {
        "content": "SEOUL  Aug 22 South Korea will attempt to sell a 30 percent stake in Woori Bank by the end of this year in a move that could recoup nearly $2 billion of taxpayer money spent bailing out the bank nearly two decades ago  having tried and failed to sell a majority stake four times since 2010.",
        "date": "08222016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "S.Korea aims to sell 30 pct stake in Woori Bank by end-2016 "
    },
    {
        "content": "SEOUL/HANOI  June 21 South Korea's Woori Bank  expects to establish a Vietnam unit this month or in July  a bank official said on Tuesday  as part of the lender's plans to expand its network in the expanding market of Southeast Asia.",
        "date": "06212016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "S.Korea's Woori Bank to form Vietnam unit by July "
    },
    {
        "content": "SEOUL  June 22 China's Anbang Insurance Group has expressed interest in buying about a 10 percent stake in South Korea's Woori Bank  a person with direct knowledge of the matter said on Wednesday.",
        "date": "06222016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "China's Anbang Insurance interested in S.Korea Woori Bank stake-source "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  May 19 (Fitch) Fitch Ratings has today affirmed South Korea-based Woori  Bank's Long-Term Issuer Default Rating (IDR) at 'A-'. The Outlook is Stable.  Fitch has also affirmed Woori Bank's Viability Rating (VR) at 'bbb+'. A full  list of rating actions is at the end of this rating action commentary. KEY RATING DRIVERS  IDRS  NATIONAL RATINGS  SENIOR DEBT  SUPPORT RATING AND SUPPORT RATING FLOOR The bank's IDRs  National and senior",
        "date": "05192016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Fitch Affirms Woori Bank at 'A-'/Stable "
    },
    {
        "content": "SEOUL  April 27 Negative interest rates adopted by a number of central banks in Europe and in Japan are expected to have only a limited impact in shoring up economic growth  a research paper from South Korea's central bank said on Wednesday.",
        "date": "04272016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Negative interest rates to have limited impact on economic growth - BOK paper "
    },
    {
        "content": "SEOUL  April 12 South Korea's central bank has selected KEB Hana Bank and Woori Bank to handle clearing and settlement services for a yuan-won market that will be launched by end-June in Shanghai  it said on Tuesday.",
        "date": "04122016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "BOK selects KEB Hana Bank and Woori Bank for yuan-won mkt clearing services "
    },
    {
        "content": "South Korea's Woori Bank has reached a settlement in principle to resolve claims that a Citigroup Inc unit induced it to buy $25 million in risky securities that plunged in value during the financial crisis.",
        "date": "03282016",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Woori Bank nears settlement with Citi over subprime losses "
    },
    {
        "content": "SEOUL  July 21 South Korea  which has failed in four attempts to sell its controlling stake in Woori Bank   the country's second-largest lender  said on Tuesday it plans to sell around 30-40 percent in several blocks ranging from 4 percent to 10 percent each.",
        "date": "07212015",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "S.Korea aims to sell 30-40 pct of Woori Bank in several blocks "
    },
    {
        "content": "HONG KONG  June 8 (IFR) - Woori Bank completed South Korea's first US dollar offering of Basel III-compliant Additional Tier 1 capital last week at the tightest yield on record in the dollar market.  The A1/A-/A- rated lender priced US$500m of 30 non-call five-year notes at 5.0%  tighter than similar securities from Double A rated European banks.",
        "date": "06082015",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Woori Bank drives hard bargain in debut AT1 capital deal "
    },
    {
        "content": "HONG KONG  June 2 (IFR) - Woori Bank  rated A1/A-/A-  has announced terms for its inaugural offering of Additional Tier 1 bonds  expected to come as early as tomorrow after a series of investor calls.",
        "date": "06022015",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Woori Bank's AT1 bond offering expected as early as Wednesday "
    },
    {
        "content": "HONG KONG  June 3 (IFR) - South Korean lender Woori Bank  is marketing its first US dollar issue of Additional Tier 1 capital securities at a yield of around 5%.",
        "date": "06032015",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Woori Bank marketing AT1 dollar bonds at 5% yield "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL/SINGAPORE  May 29 (Fitch) Fitch Ratings has affirmed Korea-based Woori  Bank's Long-Term Foreign-Currency Issuer Default Rating (IDR) at 'A-'. The  Outlook is Stable. Simultaneously  Fitch has upgraded Woori Bank's Viability  Rating (VR) to 'bbb+' from 'bbb'. A full list of rating actions is at the end of  this rating action commentary. The upgrade of Woori Bank's VR mainly reflects Fitch's view about rating  relativities among Ko",
        "date": "05292015",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Fitch Affirms Woori Bank at 'A-'/Stable; Upgrades VR to 'bbb+' "
    },
    {
        "content": "HONG KONG  May 28 (IFR) - Woori Bank has appointed Bank of America Merrill Lynch  Barclays  Citigroup  Commerzbank and Nomura as active joint bookrunners for a US dollar Additional Tier 1 offering.",
        "date": "05282015",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Woori Bank picks banks for AT1 dollar offering "
    },
    {
        "content": "* Standard Bank signs business cooperation agreement with Woori Bank  Further company coverage:",
        "date": "04232015",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "BRIEF-Standard Bank signs business cooperation agreement with Woori Bank "
    },
    {
        "content": "Lead Manager(s)         Barclays  Commerzbank  Deutsche Bank  HSBC  Nomura &",
        "date": "01142015",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "New Issue- Woori Bank prices $350 mln 2020 bond "
    },
    {
        "content": "HONG KONG  Jan 15 (IFR) - Woori Bank priced a US$350m 5.5-year bond yesterday  though the slower-than-expected pace of orders raised concerns that investors might be sticking to the sidelines until volatile market conditions improve.",
        "date": "01152015",
        "name": "Woori Bank",
        "news_type": "topStory",
        "symbol": "WF",
        "title": "Woori Bank prices despite slow orders "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  January 13 (Fitch) Fitch Ratings has rated Korea-based Woori Bank's  (Woori  A-/Stable) proposed issue of long-term senior unsecured notes at  'A-(EXP)'.  The size of the notes has yet to be finalised  but Fitch does not expect it to  be large enough to significantly alter the commercial bank's overall funding  profile. The tenor is 5.5 years.  The notes will be issued under Woori's existing USD7bn global medium-term note  (GMTN)",
        "date": "01142015",
        "name": "Woori Bank",
        "news_type": "normal",
        "symbol": "WF",
        "title": "Fitch Assigns Woori Bank's Senior Unsecured USD Notes 'A-(EXP)' "
    },
    {
        "content": "HONG KONG  Jan 14 (IFR) - Woori Bank began marketing a US dollar-denominated 5.5-year Reg S bond to yield around 150bp over US Treasuries.",
        "date": "01142015",
        "name": "Woori Bank",
        "news_type": "normal",
        "symbol": "WF",
        "title": "Woori Bank opens books for dollar bond "
    }
]