[
    {
        "content": "* Sees FY 2017 earnings per share $13.60 to $13.90 from continuing operations",
        "date": "10232017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool reports Q3 non-GAAP EPS of $3.83 from continuing operations "
    },
    {
        "content": "WASHINGTON Whirlpool and GE Appliances asked a U.S. trade panel on Thursday to recommend 50 percent import duties on large residential washing machines to ensure that rivals LG and Samsung follow through on plans to shift washer production to the United States.",
        "date": "10192017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool seeks 50 percent duties on LG  Samsung washers in U.S. trade case "
    },
    {
        "content": "Whirlpool Corp  said on Tuesday it would continue to supply several of its products to Sears Holdings Corp  and discontinue only the supply of brands including Maytag fridges  KitchenAid products and Jenn-Air appliances.",
        "date": "10242017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool to stop selling big-name brands at Sears "
    },
    {
        "content": "WASHINGTON  Oct 19 Whirlpool and GE Appliances asked a U.S. trade panel on Thursday to recommend 50 percent import duties on large residential washing machines to ensure that rivals LG and Samsung follow through on plans to shift washer production to the United States.",
        "date": "10192017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool seeks 50 pct duties on LG  Samsung washers in U.S. trade case "
    },
    {
        "content": "Oct 24 Whirlpool Corp said on Tuesday it would continue to supply several of its products to Sears Holdings Corp and discontinue only the supply of brands including Maytag fridges  KitchenAid products and Jenn-Air appliances.",
        "date": "10242017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "CORRECTED-Whirlpool to stop selling big-name brands at Sears "
    },
    {
        "content": "* Sets quarterly dividend of $1.10per share Source text for Eikon: Further company coverage:",
        "date": "10162017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool sets quarterly dividend of $1.10/share "
    },
    {
        "content": "* Whirlpool issues statement on ‍positive U.S. ITC vote in washing machine case​ Source text for Eikon: Further company coverage:",
        "date": "10052017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool issues statement on ‍positive U.S. ITC vote in washing machine case​ "
    },
    {
        "content": "Clyde  Ohio  Oct 4In the middle of Whirlpool Corp's bustling washer factory in northern Ohio there is an empty patch of concrete floor - a reminder of a $60 million expansion plan the appliance maker says fell victim to unfair foreign competition.",
        "date": "10042017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool's washer war is balancing act for Trump "
    },
    {
        "content": "* Whirlpool - ‍On Sept 27  co exercised commitment increase & term extension rights under third amended & restated long-term credit agreement with lenders​",
        "date": "09292017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool exercises commitment increase and term extension rights under third amended "
    },
    {
        "content": "PARIS U.S. kitchen products group Whirlpool  has reached a deal with a local businessman to save jobs at its Amiens site in northern France  which had featured at the forefront of this year's presidential election campaign.",
        "date": "09122017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool reaches deal to save jobs at emblematic French factory "
    },
    {
        "content": "WASHINGTON  Sept 7 Appliance giant Whirlpool Corp on Thursday called on the U.S. International Trade Commission to impose \"global safeguard\" restrictions on imported washing machines to stop its South Korean rivals Samsung and LG from flooding the American market with cheap machines.",
        "date": "09072017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool's washer battle with Samsung  LG heats up at trade hearing "
    },
    {
        "content": "WASHINGTON  Sept 7 Appliance giant Whirlpool Corp on Thursday called on the U.S. International Trade Commission to impose \"global safeguard\" restrictions on imported washing machines to stop its South Korean rivals Samsung and LG from flooding the American market with cheap machines.",
        "date": "09072017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 1-Whirlpool's washer battle with Samsung  LG heats up at trade hearing "
    },
    {
        "content": "* Whirlpool Corp- on Aug 14  determined in connection with his position as CEO  Marc Bitzer will receive an annual base salary of $1.25 million  -SEC filing",
        "date": "08182017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool says CEO Marc Bitzer to receive annual base salary of $1.25 mln "
    },
    {
        "content": "Aug 14 A federal appeals court reduced by $2 million the legal fees that Sears Holdings Corp and Whirlpool Corp must pay to settle a class action lawsuit over defective washing machines. The reason: the case was not that complicated.",
        "date": "08142017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Sears  Whirlpool win fee reduction in washer lawsuit "
    },
    {
        "content": "* Says \"the company will continue on the Manufacturing Jobs Initiative\" Further company coverage:",
        "date": "08142017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool comments on Manufacturing Jobs Initiative "
    },
    {
        "content": "Capital Brands LLC  the company that makes Magic Bullet blenders  on Friday won a federal appeals court ruling invalidating a patent owned by Whirlpool Corp.",
        "date": "08042017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Magic Bullet maker knocks out Whirlpool blender patent "
    },
    {
        "content": "* Whirlpool Corporation reports second-quarter 2017 results and increases share repurchase authorization to $2.35 billion",
        "date": "07262017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool reports Q2 results and raises share repurchase authorization to $2.35 bln "
    },
    {
        "content": "Home appliance maker Whirlpool is a bargain at $192 a share and could jump as much as 35 percent to $260 a share in the next year  according to a fund manager who owns the company's shares  Barron's reported.",
        "date": "07162017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool could gain 35 percent in the next year: Barron's "
    },
    {
        "content": "LONDON  June 23 Whirlpool on Friday said it was working with British authorities investigating a deadly blaze in a London tower block after police said one of its Hotpoint fridge freezers sparked the fire.",
        "date": "06232017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool says working with Britain after Hotpoint fridge freezer sparked London blaze "
    },
    {
        "content": "DETROIT Whirlpool Corp   the world's largest maker of home appliances  said on Tuesday that Jeff Fettig will step down on Oct. 1 after 13 years as chief executive and will be replaced by the firm's current chief operating officer  Marc Bitzer.",
        "date": "06202017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool CEO Fettig to step down  COO Bitzer named as successor "
    },
    {
        "content": "DETROIT  June 20 Whirlpool Corp  the world's largest maker of home appliances  said on Tuesday that Jeff Fettig will step down on Oct. 1 after 13 years as chief executive and will be replaced by the firm's current chief operating officer  Marc Bitzer.",
        "date": "06202017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 1-Whirlpool CEO Fettig to step down  COO Bitzer named as successor "
    },
    {
        "content": "DETROIT  June 20 Whirlpool Corp  the world's largest maker of home appliances  said on Tuesday that Jeff Fettig will step down as chief executive on Oct. 1 and will be replaced by the firm's chief operating officer  Marc Bitzer.",
        "date": "06202017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool CEO Fettig to step down "
    },
    {
        "content": "* Whirlpool Corporation's Jeff Fettig to step down as CEO; remains chairman of the board",
        "date": "06202017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool Corp's Jeff Fettig to step down as CEO "
    },
    {
        "content": "* Pultegroup Inc - ‍has renewed a four-year exclusive agreement with Whirlpool Corporation.​",
        "date": "05312017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Pultegroup renews four-year agreement with Whirlpool ​ "
    },
    {
        "content": "* Whirlpool Corp says  filing a safeguard petition with U.S. International Trade Commission",
        "date": "05312017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool says filing safeguard petition with U.S. International Trade Commission "
    },
    {
        "content": "* Whirlpool corporation opens new emea headquarters in milan Source text for Eikon: Further company coverage:",
        "date": "05112017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool says opens new EMEA headquarters in Milan "
    },
    {
        "content": "A federal judge in Chicago on Tuesday refused to let consumers pursue class-action claims that Whirlpool Corp made defective wall ovens because they could not identify a common defect.",
        "date": "05092017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool oven buyers cannot pursue class action  use expert's testimony "
    },
    {
        "content": "* Whirlpool Corporation announces planned acquisition of Yummly",
        "date": "05022017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool to buy Yummly  terms undisclosed "
    },
    {
        "content": "* Whirlpool Corporation reports first-quarter 2017 results and revises full-year guidance",
        "date": "04242017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool Corp Q1 GAAP earnings per share $2.01 "
    },
    {
        "content": "* Whirlpool Corporation increases quarterly dividend by 10 pct",
        "date": "04182017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool Corporation increases quarterly dividend by 10 pct "
    },
    {
        "content": "* Jury returns verdict in favor of Whirlpool Corporation in water filter patent infringement suit",
        "date": "03102017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Jury returns verdict in favor of whirlpool corp in water filter patent infringement suit "
    },
    {
        "content": "* Says CEO Jeff M. Fettig 2016 total compensation was $16.15 million versus $13.53 million in 2015 - sec filing",
        "date": "03022017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool Corp says CEO Jeff M. Fettig 2016 total compensation was $16.15 mln "
    },
    {
        "content": "* Phoenix Investors acquire Whirlpool Corporation property in Cleveland  Tenn.",
        "date": "02222017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Phoenix Investors acquire Whirlpool Corp property in Cleveland  Tenn "
    },
    {
        "content": "* Sets quarterly dividend of $1.00 per share  Source text for Eikon:  Further company coverage:",
        "date": "02212017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool sets quarterly dividend of $1.00 per share "
    },
    {
        "content": "* Greg Creed joins Whirlpool corp board of directors  Source text for Eikon:  Further company coverage:",
        "date": "02202017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Greg Creed joins Whirlpool Corp board of directors "
    },
    {
        "content": "* Soros Fund Management takes share stake in facebook inc of 353 686 shares",
        "date": "02142017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Soros Fund Management takes in Facebook  ups in T Mobile and Alphabet "
    },
    {
        "content": "* Whirlpool Corp - expects corrective action affecting the dryers developed by Indesit to have future cash expenditures in 2017 of $69 million - SEC filing",
        "date": "02132017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool says expects corrective action affecting the dryers developed by Indesit to have future cash expenditures of $69 mln in 2017 - SEC filing "
    },
    {
        "content": "BEIJING  Feb 4 Chinese industry called on Saturday for talks with the United States to seek an end to anti-dumping duties imposed on its exports of large washing machines  state news agency Xinhua reported.",
        "date": "02042017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Chinese industry wants \"win-win\" end to U.S. anti-dumping duties on washing machines "
    },
    {
        "content": "Jan 24 Whirlpool Corp said on Tuesday it would restructure its Europe  Middle East and Africa dryer manufacturing operations  and cut about 500 jobs in the region.",
        "date": "01242017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool to cut 500 EMEA jobs in dryer manufacturing unit "
    },
    {
        "content": "Whirlpool Corp   the world's largest maker of home appliances  reported lower-than-expected fourth-quarter earnings on Thursday  hurt by a decline in sales in the United Kingdom following the vote in June to leave the European Union.",
        "date": "01262017",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool profit misses expectations as Brexit hits sales "
    },
    {
        "content": "Jan 26 Whirlpool Corp  the world's largest maker of home appliances  reported lower-than-expected fourth-quarter earnings on Thursday  hurt by a decline in sales in the United Kingdom following the vote in June to leave the European Union.",
        "date": "01262017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 2-Whirlpool profit misses expectations as Brexit hits sales "
    },
    {
        "content": "* Whirlpool Corp says  expects full-year 2017 industry unit shipments in brazil to be flat",
        "date": "01262017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool Corp Q4 GAAP earnings per share $2.36 "
    },
    {
        "content": "Jan 26 Whirlpool Corp  the world's largest maker of home appliances  said its fourth-quarter profit remained unchanged as acquisition costs offset higher sales from North America  its largest market.",
        "date": "01262017",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool posts flat quarterly profit  hurt by acquisition costs "
    },
    {
        "content": "* Whirlpool Corporation announces 3-year agreement with Century Communities  Source text for Eikon:  Further company coverage:",
        "date": "11282016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool announces 3-year agreement with Century Communities "
    },
    {
        "content": "CHICAGO Whirlpool Corp  reported a lower-than-expected quarterly profit on Tuesday and gave a disappointing outlook  citing soft demand  tough competition in the U.S. market and the post-Brexit weakness of the British pound  and its shares fell 12 percent.",
        "date": "10252016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool profit and outlook miss estimates; stock falls "
    },
    {
        "content": "* Indexes down: Dow 0.3 pct  S&P 0.38 pct  Nasdaq 0.5 pct   (Updates to market close  adds comment)",
        "date": "10252016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "US STOCKS-Wall St slips on earnings; Apple results due "
    },
    {
        "content": "* Indexes down: Dow 0.25 pct  S&P 0.35 pct  Nasdaq 0.53 pct   (New throughout)",
        "date": "10252016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "US STOCKS-Wall St slips on earnings; Procter jumps "
    },
    {
        "content": "CHICAGO  Oct 25 Whirlpool Corp reported a lower-than-expected quarterly profit on Tuesday and gave a disappointing outlook  citing soft demand  tough competition in the U.S. market and the post-Brexit weakness of the British pound  and its shares fell 12 percent.",
        "date": "10252016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 4-Whirlpool profit and outlook miss estimates; stock falls "
    },
    {
        "content": "Oct 25 Whirlpool Corp reported a lower-than-expected quarterly profit on Tuesday and gave a disappointing outlook  citing U.S. consumers' wariness about making big purchases ahead of the  presidential election  and its shares fell nearly 12 percent.",
        "date": "10252016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "CORRECTED-UPDATE 3-Whirlpool profit  outlook miss estimates "
    },
    {
        "content": "Oct 25 Whirlpool Corp reported a lower-than-expected quarterly profit on Tuesday as the strong U.S. dollar hit overseas revenue  and the company lowered its full-year earnings forecast  citing soft U.S. and British markets and the weak British pound.",
        "date": "10252016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "CORRECTED-UPDATE 2-Whirlpool profit misses estimates; cuts 2016 outlook "
    },
    {
        "content": "Oct 25 Whirlpool Corp reported a higher quarterly net profit on Tuesday as revenue took a hit from a strong U.S. dollar.",
        "date": "10252016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool Q3 profit rises  but hurt by strong U.S. dollar "
    },
    {
        "content": "* Q3 earnings per share view $3.86 -- Thomson Reuters I/B/E/S",
        "date": "10252016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool Q3 non-GAAP EPS $3.66 from continuing operations "
    },
    {
        "content": "* Sets quarterly dividend of $1.00 per share  Source text for Eikon:  Further company coverage:",
        "date": "10182016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool sets quarterly dividend of $1.00 per share "
    },
    {
        "content": "Whirlpool Corp   the world's largest maker of home appliances  is recalling 15 200 Whirlpool brand microwaves due to a fire hazard  the U.S. Consumer Product Safety Commission said on Thursday.",
        "date": "08252016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool to recall 15 200 microwaves due to fire hazard issue: CPSC "
    },
    {
        "content": "Aug 25 Whirlpool Corp  the world's largest maker of home appliances  is recalling 15 200 Whirlpool brand microwaves due to a fire hazard  the U.S. Consumer Product Safety Commission said on Thursday.",
        "date": "08252016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool to recall 15 200 microwaves due to fire hazard issue - CPSC "
    },
    {
        "content": "* Internal arcing during use can ignite an internal plastic component  posing a fire hazard",
        "date": "08252016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-U.S. CPSC says Whirlpool recalls microwaves due to fire hazard "
    },
    {
        "content": "* Board of directors of Whirlpool corporation declared a quarterly dividend of $1.00 per share on company's common stock  Source text for Eikon:  Further company coverage:",
        "date": "08162016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool Corp declares qtrly dividend of $1.00 per share on company's common stock "
    },
    {
        "content": "* General Larry Spencer joins Whirlpool Corporation board of directors",
        "date": "08152016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-General Larry Spencer joins Whirlpool board of directors "
    },
    {
        "content": "Whirlpool Corp's  biggest challenge in the last year has been managing rapid change and currency volatility in global markets such as turmoil after Britain's vote to leave the European Union  Chief Executive Officer Jeff Fettig said in an interview on Friday.",
        "date": "07232016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool's biggest challenge is rapid changes in global markets: CEO "
    },
    {
        "content": "* Whirlpool Corp - Anticipate restructuring charges of approximately $200 million for fiscal year 2016",
        "date": "07222016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool expects restructuring charges of about $200 mln for fiscal 2016 "
    },
    {
        "content": "Whirlpool Corp  posted a higher-than-expected net profit on Friday  as revenue growth and cost reduction initiatives offset the unfavorable foreign exchange rate in North America  its largest market  the company said.",
        "date": "07222016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool reports higher second-quarter profit "
    },
    {
        "content": "July 22 Whirlpool Corp posted a higher-than-expected net profit on Friday  as revenue growth and cost reduction initiatives offset the unfavorable foreign exchange rate in North America  its largest market  the company said.",
        "date": "07222016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "CORRECTED-Whirlpool reports higher second-quarter profit "
    },
    {
        "content": "July 22 Whirlpool Corp posted a higher-than-expected quarterly net profit on Friday as revenue growth and cost reduction efforts offset the unfavorable foreign exchange rate in North America  its largest market  the company said.",
        "date": "07222016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 1-Whirlpool reports higher-than-expected quarterly profit "
    },
    {
        "content": "WASHINGTON The U.S. Commerce Department said in a statement on Wednesday it had determined that large home washing machines from China had been dumped in the United States.",
        "date": "07212016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Commerce Dept says large washing machines from China dumped in the U.S. "
    },
    {
        "content": "* Whirlpool says unit Whirlpool China entered agreement to return land use rights for land now occupied by two Whirlpool China plants in Hefei  China",
        "date": "07052016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool says unit Whirlpool China entered agreement to return land use rights in Hefei  China "
    },
    {
        "content": "* FY2016 earnings per share view $14.75 -- Thomson Reuters I/B/E/S",
        "date": "06282016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool says plans to execute a previously-announced price increase in Q3 "
    },
    {
        "content": "* Venturelli will remain in his current capacity until august 1  2016",
        "date": "06222016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool says CFO Larry Venturelli to retire; Jim Peters named successor "
    },
    {
        "content": "SAO PAULO  June 8 Whirlpool Corp will soon open its first Argentine factory in 14 years  with plans for two more production lines within five years  the company's chief Latin America executive said on Wednesday  saying conditions there were better than in his native Brazil.",
        "date": "06082016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "CORRECTED (OFFICIAL)-UPDATE 1-Whirlpool readies new Argentina plant  plans two more lines "
    },
    {
        "content": "SAO PAULO  June 8 Whirlpool Corp will open a factory making cooking appliances in Argentina by September and plans to open two new production lines in the country  focused on laundry and refrigeration  over the next five years  the company's chief executive for Latin America said Wednesday.",
        "date": "06082016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "CORRECTED (OFFICIAL)-Whirlpool close to opening new Argentina plant  two more lines coming "
    },
    {
        "content": "* Says prior to Irobot  Cerda was general manager and vice president of sales and marketing at Whirlpool Corporation",
        "date": "05312016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Irobot names Christian Cerda Chief Operating Officer "
    },
    {
        "content": "* Whirlpool Corporation amps up commitment to clean energy with newest Ohio wind farm",
        "date": "05242016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool plans to build wind turbines to help power its Marion and Ottawa plants in Ohio "
    },
    {
        "content": "* Entered into a third amended and restated long-term credit agreement",
        "date": "05172016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool says amended long-term credit facility provides borrowing capacity of $2.5 bln "
    },
    {
        "content": "Whirlpool Corp reported lower-than-expected first-quarter earnings on Tuesday as cost and capacity reductions were offset by soft demand in emerging markets and unfavorable currency exchange rates  the company said.",
        "date": "04262016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool posts unexpectedly low first-quarter earnings on soft emerging market demand "
    },
    {
        "content": "April 26 Whirlpool Corp reported lower-than-expected first-quarter earnings on Tuesday as cost and capacity reductions were offset by soft demand in emerging markets and unfavorable currency exchange rates  the company said.",
        "date": "04262016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 4-Whirlpool posts unexpectedly low Q1 earnings on soft emerging market demand "
    },
    {
        "content": "* CEO says Q1 on track to regain lost North American market share  expects Q2 to show a year over year improvement led by laundry category",
        "date": "04262016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-Russian market is extremely volatile-Whirlpool COO "
    },
    {
        "content": "April 26 Whirlpool Corp. posted a lower than expected quarterly net profit on Tuesday  as cost and capacity reductions were offset by soft demand in emerging markets and unfavorable currency exchange  the company said.",
        "date": "04262016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool posts lower than expected first quarter profit "
    },
    {
        "content": "* Whirlpool Corporation announces $1 billion share repurchase program and increases quarterly dividend by 11%",
        "date": "04182016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool Corp announces $1 bln share repurchase program "
    },
    {
        "content": "Whirlpool Corp  reported a better-than-expected quarterly profit and said consumer demand is likely to remain resilient in North America  its biggest market  this year.",
        "date": "01292016",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool sees North America driving growth in 2016 "
    },
    {
        "content": "* Shares rise as much as 5.3 pct   (Adds details from conference call  shares)",
        "date": "01292016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 3-Whirlpool sees North America driving growth in 2016 "
    },
    {
        "content": "Jan 29 Whirlpool Corp said its quarterly profit more than doubled  helped by cost- and capacity-reduction actions and acquisitions.",
        "date": "01292016",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool quarterly profit more than doubles "
    },
    {
        "content": "WASHINGTON Whirlpool Corp asked the U.S. government on Wednesday to impose duties on washers made by Samsung Electronics and LG Electronics in China  alleging that they are being sold in the United States at prices below production costs.",
        "date": "12172015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool seeks duties on Samsung  LG washers made in China "
    },
    {
        "content": "WASHINGTON Whirlpool Corp asked the U.S. government on Wednesday to impose duties on washers made by Samsung Electronics and LG Electronics in China  alleging that they are being sold in the United States at prices below production costs.",
        "date": "12162015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool seeks duties on Samsung  LG washers made in China "
    },
    {
        "content": "WASHINGTON  Dec 16 Whirlpool Corp asked the U.S. government on Wednesday to impose duties on washers made by Samsung Electronics and LG Electronics in China  alleging that they are being sold in the United States at prices below production costs.",
        "date": "12162015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 1-Whirlpool seeks duties on Samsung  LG washers made in China "
    },
    {
        "content": "WASHINGTON  Dec 16 Whirlpool Corp filed a complaint with the U.S. International Trade Commission on Wednesday against what it said were cheap imports of washing machines from China  which could end in duties on goods made by companies including Samsung Electronics and LG Electronics.",
        "date": "12162015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool seeks import duties on washing machines from China "
    },
    {
        "content": "Whirlpool is headed to a federal appeals court in Ohio to try to thwart a bid to overturn its class-action trial victory against a class of Ohio consumers who said its front-loading washers had a defect that made them prone to develop a smelly mold.",
        "date": "11302015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Case to Watch: Whirlpool to defend 'moldy washer' bellwether verdict "
    },
    {
        "content": "Shares of Whirlpool Corp  tumbled on Friday on concerns about price cuts by rival appliance makers and the strong dollar's impact on foreign revenue.",
        "date": "10232015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool shares slide on pricing  forex concerns "
    },
    {
        "content": "Oct 23 Shares of Whirlpool Corp tumbled on Friday on concerns about price cuts by rival appliance makers and the strong dollar's impact on foreign revenue.",
        "date": "10232015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 4-Whirlpool shares slide on pricing  forex concerns "
    },
    {
        "content": "* Transcom selected by Whirlpool to provide multilingual customer care services across 19 european countries  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "10232015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-Transcom selected by Whirlpool to provide multilingual customer care services "
    },
    {
        "content": "Sept 11 Whirlpool Corp said it was withdrawing its proposal to buy Britain's AGA Rangemaster Group Plc  whose shareholders approved a $201 million takeover offer by U.S. cooking equipment maker Middleby Corp on Tuesday.",
        "date": "09112015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool to withdraw offer for Britain's AGA Rangemaster "
    },
    {
        "content": "LONDON Whirlpool Corp   the world's biggest home appliance company  is set to battle Middleby  for Britain's Aga Rangemaster   the maker of range cookers synonymous with affluent British middle-class country life.",
        "date": "09012015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Aga saga sizzles as Whirlpool weighs rival bid "
    },
    {
        "content": "LONDON  Sept 1 Whirlpool Corp  the world's biggest home appliance company  is set to battle Middleby for Britain's Aga Rangemaster  the maker of range cookers synonymous with affluent British middle-class country life.",
        "date": "09012015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 1-Aga saga sizzles as Whirlpool weighs rival bid "
    },
    {
        "content": "* Whirlpool confirms has made an approach regarding a possible offer for aga rangemaster  Source text for Eikon:  Further company coverage:",
        "date": "09012015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-Whirlpool confirms approached AGA Rangemaster regarding possible offer "
    },
    {
        "content": "* Received an approach regarding a possible cash offer for company from Whirlpool Corporation",
        "date": "09012015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "BRIEF-Aga receives offer from Whirlpool  still recommends Middleby "
    },
    {
        "content": "WASHINGTON  Aug 4 New orders for U.S. factory goods rebounded strongly in June on robust demand for transportation equipment and other goods  a hopeful sign for the struggling manufacturing sector.",
        "date": "08042015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "WRAPUP 2-U.S. factory orders rebound on strong demand for aircraft "
    },
    {
        "content": "Whirlpool Corp   the world's largest maker of home appliances  on Wednesday reported a surprise increase in second-quarter earnings  helped by strength in Europe and Asia  and it backed its full-year forecast  sending its shares higher.",
        "date": "07222015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool reassures investors by backing full-year forecast "
    },
    {
        "content": "July 22 Whirlpool Corp  the world's largest maker of home appliances  on Wednesday reported a surprise increase in second-quarter earnings  helped by strength in Europe and Asia  and it backed its full-year forecast  sending its shares higher.",
        "date": "07222015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 2-Whirlpool reassures investors by backing full-year forecast "
    },
    {
        "content": "July 22 Whirlpool Corp posted a lower quarterly net profit on Wednesday due to a strong U.S. dollar and weak sales in Brazil.",
        "date": "07222015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "CORRECTED-UPDATE 1-Whirlpool quarterly profit slips on strong U.S. dollar "
    },
    {
        "content": "July 22 Whirlpool Corp posted a slightly lower quarterly net profit on Wednesday due to a strong U.S. dollar and weak sales in Brazil.",
        "date": "07222015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "CORRECTED-Whirlpool quarterly profit slips on strong U.S. dollar "
    },
    {
        "content": "* Says contests U.S. Department of Justice's opposition to acquisition of GE appliances",
        "date": "07012015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "BRIEF-Electrolux: Contests DOJ opposition to acquisition of GE appliances "
    },
    {
        "content": "ROME A plan by the world's largest home-appliance maker Whirlpool to cut almost 2 000 jobs in Italy is \"disgraceful\"  the Italian industry minister said on Wednesday  after the white goods group increased a redundancy target.",
        "date": "05202015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Italy calls Whirlpool's redundancy plans 'disgraceful' "
    },
    {
        "content": "ROME  May 20 A plan by the world's largest home-appliance maker Whirlpool to cut almost 2 000 jobs in Italy is \"disgraceful\"  the Italian industry minister said on Wednesday  after the white goods group increased a redundancy target.",
        "date": "05202015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Italy calls Whirlpool's redundancy plans \"disgraceful\" "
    },
    {
        "content": "SAO PAULO  May 19 Whirlpool Corp and Anheuser-Busch InBev on Tuesday started selling a countertop appliance that makes soda  juice and coffee with single-serve capsules  marking the start of a joint venture worth more than $70 million.",
        "date": "05192015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool and AB InBev team up on hot-and-cold drink machine "
    },
    {
        "content": "WASHINGTON  May 4 New orders for U.S. factory goods recorded their biggest increase in eight months in March  boosted by demand for transportation equipment  but the underlying trend remained weak against the backdrop of a strong dollar.",
        "date": "05042015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "WRAPUP 2-U.S. factory orders rebound solidly  but trend still soft "
    },
    {
        "content": "CHICAGO Whirlpool Corp  posted a higher quarterly net income on Tuesday but lowered its profit forecast and sales outlook for 2015  predicting a significant drop in Latin American sales owing largely to Brazil's stagnating economy.",
        "date": "04282015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Strong dollar  Brazil to dent Whirlpool 2015 results "
    },
    {
        "content": "CHICAGO  April 28 Whirlpool Corp a rise in quarterly net profit on Tuesday  with cost reductions and recent acquisitions offsetting the impact of the strong U.S. dollar and falling demand in Brazil.",
        "date": "04282015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool quarterly profit boosted by cost cuts and acquisitions "
    },
    {
        "content": "MILAN  April 20 Whirlpool and trade unions will meet next Monday over plans by the U.S. white goods group to shut some of its factories in Italy and lay off workers  Italy said on Monday.",
        "date": "04202015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Italy calls for meeting over Whirlpool redundancy plans "
    },
    {
        "content": "Thomson Reuters April 20  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04202015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "ROME U.S. white goods group Whirlpool  announced on Thursday it would invest 500 million euros ($535.25 million) over four years in Italy as part of a restructuring plan that would see 1 350 redundancies.",
        "date": "04162015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool plans 500 million euro Italy investment  1 350 job cuts "
    },
    {
        "content": "* Redundancies kept at \"lowest possible level\"   (Adds background  details)",
        "date": "04162015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 1-Whirlpool plans 500 mln euro Italy investment  1 350 job cuts "
    },
    {
        "content": "Thomson Reuters April 16  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04162015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "ROME  April 16 The Italian government expressed strong opposition on Thursday to plans by Whirlpool to cut jobs as part of its integration of the operations of local whitegoods maker Indesit in southern Italy.",
        "date": "04162015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Italy protests Whirlpool job cut plans "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 05 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Whirlpool Corporation's (NYSE: WHR) proposed offering of Euro 500 million  aggregate amount of senior unsecured notes. The new offering will be equal in  right of payment with all other senior unsecured debt. Whirlpool intends to use  the proceeds from the notes offering for the repayment of a portion of its  commercial paper (CP) borrowings.  INDESIT AND HEFEI ACQ",
        "date": "03052015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Fitch Rates Whirlpool's Proposed Euro 500MM Sr. Unsecured Notes Offering 'BBB'; Outlook Stable "
    },
    {
        "content": "Underlying govt bond    Over the midswaps equivalent to 74 bps",
        "date": "03052015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "New Issue-Whirlpool prices 500 mln euro 2020 bond "
    },
    {
        "content": "CHICAGO If the U.S. dollar stays at current levels  Whirlpool Corp's  revenue could take a hit of up $1 billion in 2015  but the world's largest appliance maker expects to protect its profits  Chief Executive Officer Jeff Fettig told Reuters on Wednesday.",
        "date": "02042015",
        "name": "Whirlpool Corporation",
        "news_type": "topStory",
        "symbol": "WHR",
        "title": "Whirlpool could take $1 billion revenue hit from strong dollar: CEO "
    },
    {
        "content": "CHICAGO Whirlpool Corp  on Wednesday said 2015 would be another solid year for U.S. sales of its washers  stoves and refrigerators because of the housing market's recovery and low oil prices  and its shares rose 6 percent.",
        "date": "02042015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool expects robust U.S. growth  but dollar to drag "
    },
    {
        "content": "CHICAGO  Feb 4 Whirlpool Corp on Wednesday said 2015 would be another solid year for U.S. sales of its washers  stoves and refrigerators because of the housing market's recovery and low oil prices  and its shares rose 6 percent.",
        "date": "02042015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "UPDATE 2-Whirlpool expects robust U.S. growth  but dollar to drag "
    },
    {
        "content": "CHICAGO  Feb 4 Whirlpool Corp on Wednesday posted a lower quarterly profit  hurt by costs from two recent acquisitions.",
        "date": "02042015",
        "name": "Whirlpool Corporation",
        "news_type": "normal",
        "symbol": "WHR",
        "title": "Whirlpool profit drops due to acquisition costs "
    }
]