[
    {
        "content": "* ‍Update on a non-wholly-owned subsidiary Wins Finance Holdings Inc.​",
        "date": "10232017",
        "name": "Wins Finance Holdings Inc",
        "news_type": "topStory",
        "symbol": "WINS",
        "title": "BRIEF-Freeman Fintech ‍updates on unit's listing on the NASDAQ "
    },
    {
        "content": "* On October 19  co received letter from staff of listing qualifications department of Nasdaq Stock Market LLC​",
        "date": "10202017",
        "name": "Wins Finance Holdings Inc",
        "news_type": "topStory",
        "symbol": "WINS",
        "title": "BRIEF-Wins Finance Holdings announces Nasdaq's withdrawal of delisting determination letter "
    },
    {
        "content": "* Wins finance holdings inc. Reports unaudited and unreviewed fiscal second quarter 2017 financial results",
        "date": "06282017",
        "name": "Wins Finance Holdings Inc",
        "news_type": "topStory",
        "symbol": "WINS",
        "title": "BRIEF-Wins Finance qtrly non-gaap earnings per share $0.28 "
    },
    {
        "content": "* Wins Finance Holdings Inc. reports unaudited fiscal first quarter 2017 financial results",
        "date": "01062017",
        "name": "Wins Finance Holdings Inc",
        "news_type": "topStory",
        "symbol": "WINS",
        "title": "BRIEF-Wins Finance Holdings reports unaudited fiscal Q1 2017 financial results "
    },
    {
        "content": "* Says Amy He resigned as chief financial officer of the company",
        "date": "08252016",
        "name": "Wins Finance Holdings Inc",
        "news_type": "topStory",
        "symbol": "WINS",
        "title": "BRIEF-Wins Finance Holdings' Amy He resigns as CFO "
    },
    {
        "content": "* Cosmic Expert Ltd reports 8.08 pct stake in Wins Finance Holdings as of July 6 - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07282016",
        "name": "Wins Finance Holdings Inc",
        "news_type": "topStory",
        "symbol": "WINS",
        "title": "BRIEF-Cosmic Expert reports 8.08 pct stake in Wins Finance Holdings "
    },
    {
        "content": "* Wins finance expands further into the leasing in new energy vehicle sector in china  entering into a sale-leaseback arrangement valued at rmb200 million (us$30.42 million)",
        "date": "06142016",
        "name": "Wins Finance Holdings Inc",
        "news_type": "topStory",
        "symbol": "WINS",
        "title": "BRIEF-Wins Finance Holdings enters into sale-leaseback arrangement valued at rmb200 million (US$30.42 mln) "
    }
]