[
    {
        "content": "* Says ‍completion of acquisition of Cooper Software  Inc. On October 24  2017​ Source text - http://bit.ly/2yQAzKg Further company coverage:",
        "date": "10252017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro ‍completes acquisition of Cooper Software "
    },
    {
        "content": "* Banking  financial services and insurance revenue up 8.2 pct",
        "date": "10172017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "UPDATE 2-India's Wipro Q2 profit beats estimates "
    },
    {
        "content": "* Expect Dec quarter revenues from IT services business to be in the range of $2 014 million to $2 054 million",
        "date": "10172017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro sees Dec-qtr revenues from IT services to be in range of $2.01 bln to $2.05 bln "
    },
    {
        "content": "* Sept quarter consol net profit 21.92 billion rupees versus 20.67 billion rupees last year",
        "date": "10172017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-India's Wipro Sept-qtr consol profit up about 6 pct "
    },
    {
        "content": "Oct 17 Wipro Ltd  India's third-largest software services exporter  posted a six percent rise in second-quarter profit on Tuesday  helped by an uptick in its banking and financial services segment.",
        "date": "10172017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro Q2 profit rises 6 pct "
    },
    {
        "content": "* Says Wipro to host several business-critical enterprise applications on Azure​ Source text: [Microsoft today announced that Wipro Limited (NYSE: WIT  BSE: 507685  NSE: WIPRO)  a leading global information technology  consulting and business process services company has migrated its IT Infrastructure to Microsoft Cloud and is hosting a majority of its business-critical enterprise applications on Azure] Further company coverage:",
        "date": "10122017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Microsoft says Wipro to host several business-critical enterprise applications on Azure​ "
    },
    {
        "content": "* Wipro Digital to acquire Cooper; Cooper to be part of Designit  Wipro Digital’s strategic design arm‍​",
        "date": "10052017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Digital to buy Cooper "
    },
    {
        "content": "* Says selected as Dow Jones Sustainability World Index (DJSI) member for 8th consecutive year",
        "date": "09272017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro says selected as Dow Jones Sustainability World Index (DJSI) member "
    },
    {
        "content": "* Says partnered with CloudGenix Inc to offer open and managed SD-WAN services Source text: (http://bit.ly/2fwaqt6) Further company coverage:",
        "date": "09262017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro  CloudGenix partner to offer open and managed SD-WAN services "
    },
    {
        "content": "* Wipro and Hewlett Packard Enterprise to deliver enterprise hybrid cloud solution based on HPE proliant for Microsoft azure stack",
        "date": "09152017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro & Hewlett Packard Enterprise to deliver enterprise hybrid cloud solution "
    },
    {
        "content": "* Says ‍wipro launches automation services for SAP​ Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro launches automation services for SAP​ "
    },
    {
        "content": "* Joins Hyperledger to catalyze collaboration on enterprise-grade blockchain solutions",
        "date": "09132017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro & Hyperledger to collaborate on enterprise-grade blockchain solutions "
    },
    {
        "content": "* Gets shareholders' nod for buyback of shares Source text: (http://bit.ly/2xwmJd3) Further company coverage:",
        "date": "08302017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Ltd gets shareholders' nod for share buyback "
    },
    {
        "content": "* Wipro Ltd - ‍Has won a five-year it infrastructure and applications managed services engagement with Grameenphone Source text for Eikon: Further company coverage:",
        "date": "08162017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro wins managed services engagement with Grameenphone "
    },
    {
        "content": "* Says Wipro develops big data analytics-as-a-service platform on Microsoft Azure Source text - http://bit.ly/2ufmbWK Further company coverage:",
        "date": "08072017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro develops big data analytics-as-a-service platform on Microsoft Azure "
    },
    {
        "content": "* Says Wipro partners with and invests in Tricentis to deliver end-to-end hyper automation across quality lifecycle Source text for Eikon: Further company coverage:",
        "date": "08022017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro partners with and invests in Tricentis "
    },
    {
        "content": "* Says Wipro launches silicon valley innovation center in Mountain View  California",
        "date": "08012017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro launches silicon valley innovation center in Mountain View  California "
    },
    {
        "content": "* Seeks members' nod for share buyback Source text - http://bit.ly/2w65jT9 Further company coverage:",
        "date": "07282017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro seeks members' nod for share buyback "
    },
    {
        "content": "* Says Wipro and Hewlett Packard Enterprise partner to offer consumption-based IT infrastructure solutions",
        "date": "07252017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro  Hewlett Packard Enterprise partner to offer consumption-based IT infra solutions "
    },
    {
        "content": "July 21 Indian shares rose on Friday  with Reliance Industries Ltd climbing as much as 3.9 percent to a more than 9-1/2-year high after posting strong quarterly results and announcing a low-cost  4G-enabled phone.",
        "date": "07212017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "Indian shares rise; Reliance Ind hits 9-1/2-yr high on Jio  results "
    },
    {
        "content": "BENGALURU/MUMBAI Wipro Ltd   India's third-largest software services exporter  announced an up to 110 billion rupee ($1.71 billion) share buyback on Thursday  overshadowing a tepid revenue forecast that fell short of market expectations.",
        "date": "07202017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "India's Wipro announces up to $1.7 billion share buyback as second-quarter forecast disappoints "
    },
    {
        "content": "July 17 Indian shares touched record high levels on Monday with IT stocks such as Infosys and Wipro Ltd leading the gains  while firm Asian markets on strong economic growth in China boosted investor sentiment.",
        "date": "07172017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "Indian shares hit fresh highs; IT stocks lead "
    },
    {
        "content": "BENGALURU/MUMBAI  July 20 Wipro Ltd  India's third-largest software services exporter  announced an up to 110 billion rupee ($1.71 billion) share buyback on Thursday  overshadowing a tepid revenue forecast that fell short of market expectations.",
        "date": "07202017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "UPDATE 2-India's Wipro announces up to $1.7 bln share buyback as Q2 forecast disappoints "
    },
    {
        "content": "* Says to consider a proposal for buyback of equity shares of company on July 20  2017 Source text for Eikon: Further company coverage:",
        "date": "07142017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro to consider proposal for buyback of equity shares on July 20 "
    },
    {
        "content": "* Exec says regulatory uncertainties in healthcare market part of second quarter guidance‍​",
        "date": "07202017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro exec says regulatory uncertainties in healthcare market part of Q2 guidance‍​ "
    },
    {
        "content": "* Gets members' nod for reappointment of Azim Premji as exec chairman and MD Source text: (http://bit.ly/2tK1DVe) Further company coverage:",
        "date": "07202017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro gets members' nod for re-appointment of Azim Premji as exec chairman and MD "
    },
    {
        "content": "July 20 Wipro Ltd  India's third-largest software services exporter  posted a 1.2 percent rise in first-quarter consolidated profit helped by higher revenue from banking  financial services and insurance segment.",
        "date": "07202017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro beats Q1 consolidated profit estimates "
    },
    {
        "content": "* Seeks members' nod for reappointment of William Arthur Owens as independent director",
        "date": "07132017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro seeks members' nod for reappointment of Azim H Premji as exec chairman  MD "
    },
    {
        "content": "* Expect Sept quarter revenues from IT services to be in the range of $1 962 million to $2 001 million",
        "date": "07202017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro sees Sept-qtr revenues from IT services to be in range of $1.96 bln-$2 bln "
    },
    {
        "content": "* Says approved a buyback proposal for purchase by company of up to 343.75 million shares",
        "date": "07202017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro approves buyback proposal worth upto 110 bln rupees "
    },
    {
        "content": "* Consensus forecast for June quarter consol profit was 20.29 billion rupees",
        "date": "07202017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-India's Wipro June-qtr consol profit rises about 1.2 pct "
    },
    {
        "content": "July 20 Indian shares fell on Thursday  dragged down by IT stocks such as Infosys Ltd  while investors await quarterly results from Wipro Ltd and Reliance Industries Ltd due later in the day.",
        "date": "07202017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "Indian shares end lower; Infosys biggest drag "
    },
    {
        "content": "* Says Wipro and Ramot at Tel Aviv University partner for joint research in emerging technologies",
        "date": "07052017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro partners with Ramot at TAU for joint research in emerging technologies "
    },
    {
        "content": "* Hewlett packard enterprise- co wipro limited announced new global go-to-market agreement to provide joint customers with on-premises it infrastructure Source text for Eikon: Further company coverage:",
        "date": "06292017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Hewlett Packard Enterprise  Wipro to deliver consumption based IT for customers "
    },
    {
        "content": "MUMBAI  June 28 Wipro Ltd  India's third-largest software services exporter  said on Wednesday that more than half its workforce in the United States consists of locals after it hired more than 1 600 people in the last six months.",
        "date": "06282017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "Indian IT firm Wipro touts U.S. jobs amid visa uncertainty "
    },
    {
        "content": "* Says Wipro collaborates with Red Hat for cloud application factory powered by Red Hat openshift container platform Source text for Eikon: Further company coverage:",
        "date": "06222017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro collaborates with Red Hat for cloud application factory "
    },
    {
        "content": "* Says Wipro wins IT applications managed services engagement with Finnish company - Valmet Source text for Eikon: Further company coverage:",
        "date": "06142017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro gets IT applications managed services engagement with Finnish co Valmet "
    },
    {
        "content": "* Says raises stake in Drivestream Inc to 26.1 percent Source text for Eikon: Further company coverage:",
        "date": "06132017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro raises stake in Drivestream Inc to 26.1 pct "
    },
    {
        "content": "June 12 Indian software exporter Wipro Ltd said on Monday the payable date for its American Depository Receipts (ADR) bonus issue is yet to be determined.",
        "date": "06122017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "India's Wipro says date for ADR bonus issue not decided "
    },
    {
        "content": "* Says in view of market activity in company's stock on June 12  New York Stock Exchange has contacted Wipro in accordance with its usual practice",
        "date": "06122017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro issues clarification on ex-date for ADR stock dividend "
    },
    {
        "content": "* Gets members' nod for raising authorised share capital to 11.27 billion rupees Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro gets members' nod to issue bonus shares "
    },
    {
        "content": "* Clarifies on an article \"Wipro promoters at early stage of evaluating sale of part or whole business: source\"",
        "date": "06052017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro denies news report on founders looking to sell part or all of company "
    },
    {
        "content": "* Announces a partnership with Wipro Limited to deliver it testing services to one of Australia's  financial institutions",
        "date": "05082017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-CPT Global says partnership with Wipro Ltd "
    },
    {
        "content": "* Seeks members' nod for increase in authorised share capital to 11.27 billion rupees Source text: http://bit.ly/2qCm8TD Further company coverage:",
        "date": "05042017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro seeks members' nod for increase in authorised share capital to 11.27 bln rupees "
    },
    {
        "content": "MUMBAI/BENGALURU Wipro Ltd   India's third-biggest software services exporter  said cancellations of healthcare projects and weak retail spending in its key U.S. market would hit revenue growth.",
        "date": "04252017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "India's Wipro growth forecast hit by healthcare  weak retail "
    },
    {
        "content": "* CEO says healthcare  retail clients weighing on growth (Adds CEO comment  details)",
        "date": "04252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "UPDATE 2-India's Wipro growth forecast hit by healthcare  weak retail "
    },
    {
        "content": "* Exec says co had project cancellations in the healthcare business  impact of which  will be seen in Q1",
        "date": "04252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro does not see immediate impact from Australia 457 visa axing "
    },
    {
        "content": "* Says expect revenues from IT services business to be in range of $1 915 million to $1 955 million for quarter ending June 30  2017",
        "date": "04252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro says board to consider share buyback proposal around July "
    },
    {
        "content": "* Says in Q1FY18  expect to have more than 50 percent of employees in U.S. to be local",
        "date": "04252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro expects more than 50 pct of employees in U.S. to be local in Q1FY18 "
    },
    {
        "content": "* March quarter consol revenue from operations 140.62 billion rupees",
        "date": "04252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro March qtr consol profit up marginally "
    },
    {
        "content": "MUMBAI  April 25 Wipro Ltd  India's third-biggest software services exporter  reported a 0.43 percent rise in quarterly profit.",
        "date": "04252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro quarterly profit rises marginally  beats estimates "
    },
    {
        "content": "* Wipro Ltd says acquisition of Infoserver s.a. has been completed on April 10  2017",
        "date": "04112017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro completes acquisition of Infoserver "
    },
    {
        "content": "* Center to serve as hub to support automotive engineering and it requirements of OEMs and tier-1 suppliers based in North America  Source text: http://bit.ly/2lZXQV8 Further company coverage:",
        "date": "03152017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Ltd opens automotive engineering center in Detroit "
    },
    {
        "content": "* Says the Wipro HOLMES Cloud BOT is designed to hasten cloud assessment projects for enterprises  Source text: http://bit.ly/2mF48GJ Further company coverage:",
        "date": "03142017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Ltd launches the HOLMES Cloud BOT "
    },
    {
        "content": "* Says Wipro to develop next-generation Enterprise Master Patient Index (EMPI) solution for NHS Scotland",
        "date": "03142017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Ltd gets contract from NHS Scotland to build Enterprise Master Patient Index solution "
    },
    {
        "content": "SAN FRANCISCO  March 6 Technology services company shares dipped on Monday after the Trump administration announced it would temporarily suspend expedited applications for H-1B visas widely used by foreign tech workers.",
        "date": "03062017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "IT services firm stocks dip after govt suspends fast tech visas "
    },
    {
        "content": "* Terminates with immediate effect strategic alliance agreement with Wipro Limited signed in July 2014  Source text for Eikon:  Further company coverage:   (Gdynia Newsroom)",
        "date": "02282017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Medicalgorithmics terminates strategic alliance agreement with Wipro Limited "
    },
    {
        "content": "* Says Wipro offers IoT-based solution from Hewlett Packard Enterprise to power wind parks and wind turbine manufacturers",
        "date": "02282017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Ltd to provide IoT-based solution for wind parks  wind turbine makers "
    },
    {
        "content": "* Says Wipro Limited has completed the sale of its Ecoenergy Division on march 1  2017.",
        "date": "03022017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro completes sale of its Ecoenergy division "
    },
    {
        "content": "* Says Wipro builds industry-focused big data analytics-as-a-service platform on IBM Bluemix  Source text - (http://bit.ly/2l3J4J5) Further company coverage:",
        "date": "02142017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro builds big data analytics-as-a-service platform on IBM Bluemix "
    },
    {
        "content": "* Approves acquisition of wipro’s ecoenergy business unit by Chubb Alba Control Systems Limited   Further company coverage:",
        "date": "02082017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-CCI approves acquisition of Wipro’s ecoenergy business unit by Chubb Alba Control Systems "
    },
    {
        "content": "* Says Wipro partners with and invests in Tradeshift to increase digitalization and automation across source-to-pay processes  Source text: http://bit.ly/2kiRxdc Further company coverage:",
        "date": "01302017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro partners with Tradeshift "
    },
    {
        "content": "* Says Wipro and PATH announce partnership to improve health in developing countries  Source text: http://bit.ly/2jm8Dr9 Further company coverage:",
        "date": "01302017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro and PATH partner to improve health in developing countries "
    },
    {
        "content": "* Announces retirement of TK Kurien  Source text: http://bit.ly/2kmKDEo Further company coverage:",
        "date": "01242017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Ltd executive vice chairman TK Kurien retires "
    },
    {
        "content": "MUMBAI/BENGALURU  Jan 25 Wipro  India's third-largest software services exporter  forecast muted revenue growth for its third quarter as clients in its biggest market  the United States  await clarity on business policies under the Donald Trump administration.",
        "date": "01252017",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "UPDATE 2-India's Wipro expects muted growth amid growing protectionism "
    },
    {
        "content": "* Wipro Ltd exec says volatility in oil prices has created uncertainty in the E&U business",
        "date": "01252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro exec says volatility in oil prices created uncertainty in E&U business "
    },
    {
        "content": "MUMBAI Wipro Ltd  forecast muted revenue growth for the quarter ending March 31  as India's outsourcing industry braces for a protectionist regime in the United States  its largest market.",
        "date": "01252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro sees muted revenue growth amid growing protectionism "
    },
    {
        "content": "* Says to acquire Infoserver  a specialized it services provider for banking  financial services & insurance sector in Brazil  Source text: (http://bit.ly/2k2zN5Y) Further company coverage:",
        "date": "01252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro to acquire Brazil-based Infoserver "
    },
    {
        "content": "* Wipro Ltd CEO says expect an uptick in the CHANGE investments - statement",
        "date": "01252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro CEO says co expects uptick in CHANGE investments - statement "
    },
    {
        "content": "MUMBAI  Jan 25 Wipro Ltd  India's third-largest software services exporter  reported a 5.6 percent fell in third-quarter consolidated net profit as employee costs and technical fees rose.",
        "date": "01252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro Q3 net profit down 5.6 pct on higher costs "
    },
    {
        "content": "* Wipro Ltd Dec quarter consol net profit 21.10 billion rupees",
        "date": "01252017",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Dec qtr consol profit down about 5.7 pct "
    },
    {
        "content": "* Wipro says company has granted 5 000 restricted stock units  Source text: http://bit.ly/2fuzZYz Further company coverage:",
        "date": "11242016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro grants 5 000 restricted stock units "
    },
    {
        "content": "* Wipro Ltd says ASG Tech and co partner to offer enterprise data intelligence solution",
        "date": "11152016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro and ASG Tech partner to offer enterprise data intelligence solution "
    },
    {
        "content": "* Says Wipro launches open banking API platform  Source text: http://bit.ly/2eEFbsG Further company coverage:    (Bengaluru newsroom)",
        "date": "11072016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-India's Wipro launches open banking API platform "
    },
    {
        "content": "* Says appointment of Gilles Grang as the regional head of operations in France  Source text: http://bit.ly/2fkyXvh  Further company coverage:    (Bengaluru newsroom)",
        "date": "11032016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Ltd appoints Gilles Grang as regional head of ops in France "
    },
    {
        "content": "BENGALURU/MUMBAI Indian software company Wipro Ltd  gave a gloomy revenue growth outlook for the current quarter  citing global political uncertainties and seasonal issues such as furloughs and a reduction in working days.",
        "date": "10212016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "India's Wipro sees U.S. election  Brexit slowing third quarter revenue growth "
    },
    {
        "content": "* Wipro cautiously optimistic about next two/three quarters   (Adds details  CEO comments)",
        "date": "10212016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "UPDATE 2-India's Wipro sees U.S. election  Brexit slowing Q3 revenue growth "
    },
    {
        "content": "* Exec says sees resurgence of spend in oil and gas only next year",
        "date": "10212016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro exec says co sees resurgence of spend in oil & gas only next year "
    },
    {
        "content": "* Wipro Ltd says expect revenues from IT services business to be in the range of $ 1 916 million to $ 1 955 million for the quarter ending December 31  2016",
        "date": "10212016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro sees Dec-qtr revenues from IT services to be $1 916-$1 955 mln "
    },
    {
        "content": "MUMBAI Wipro Ltd   India's third-biggest software services exporter  said on Thursday it had agreed to buy U.S.-based cloud services company Appirio for $500 million.",
        "date": "10202016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "India's Wipro to buy U.S. cloud services company Appirio for $500 million "
    },
    {
        "content": "MUMBAI  Oct 21 India's third-biggest software services exporter  Wipro Ltd  reported a 7.6 percent fall in second-quarter profit on higher employee costs  even though it beat analysts' expectations.",
        "date": "10212016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro posts 7.6 pct Q2 profit fall as employee costs rise "
    },
    {
        "content": "MUMBAI  Oct 20 Wipro Ltd  India's third-biggest software services exporter  said on Thursday it had agreed to buy U.S.-based cloud services company Appirio for $500 million.",
        "date": "10202016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro to buy US cloud services company Appirio for $500 mln "
    },
    {
        "content": "* Says Wipro to acquire Appirio  a global cloud services company",
        "date": "10202016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-India's Wipro to acquire cloud services company Appirio "
    },
    {
        "content": "* Consensus forecast for sept quarter consol net profit was 19.72 billion rupees",
        "date": "10212016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro Sept-qtr consol profit down about 8 pct "
    },
    {
        "content": "* Basu moves into his new role at Myntra from Wipro  where he was the Chief Finance & Operating Officer for Wipro's Digital & Consulting Business  Source text: Myntra  a Flipkart Group company  announces the appointment of Dipanjan Basu as the CFO. A seasoned leader with expertise in a multitude of Finance and Business functions  Dipanjan brings over 15 years of experience to the fore.  He moves into his new role at Myntra from Wipro  where he was the Chief Finance & Operating Officer for Wipro'",
        "date": "09292016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Myntra appoints Dipanjan Basu as CFO "
    },
    {
        "content": "* Says Wipro joins Oracle cloud managed service provider program  Source text - (http://bit.ly/2cEgafz) Further company coverage:",
        "date": "09202016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro joins Oracle cloud managed service provider program "
    },
    {
        "content": "* Says co and Witbe enter into global partnership to offer end-to-end test automation and services monitoring deployment solutions  Source text - (http://bit.ly/2d7MryO) Further company coverage:",
        "date": "09202016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "BRIEF-Wipro and Witbe enter partnership "
    },
    {
        "content": "* Wipro and Witbe announce the establishment of a global strategic partnership to deploy offers for tests  validation and monitoring  Source text: http://bit.ly/2cZoo4X Further company coverage:    (Gdynia Newsroom:)",
        "date": "09162016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wipro and Witbe announce global strategic partnership "
    },
    {
        "content": "* Facing headwinds in India  Middle East businesses - CEO   (Adds executive comments  result details)",
        "date": "07192016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "UPDATE 1-India's Wipro sees low growth in Q2  cautions on Brexit "
    },
    {
        "content": "NEW DELHI  July 19 India's third-biggest software services exporter Wipro Ltd on Tuesday posted a 6 percent fall in its net profit for the fiscal first quarter  missing analyst estimates.",
        "date": "07192016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro Q1 net profit down 6 pct  misses estimates "
    },
    {
        "content": "* Says watching potential impact on mobility of labour  currency and change in financial system post Brexit - statement  Further company coverage:    (Reporting By Himank Sharma in MUMBAI)",
        "date": "06242016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-India's Wipro says watching potential impact of Brexit "
    },
    {
        "content": "* IT services margins fall 10 bps to 20.1 pct   (Recasts to add long-term outlook  CEO comments)",
        "date": "04202016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "UPDATE 2-Wipro plans big bets on digital services to double revenue "
    },
    {
        "content": "MUMBAI  April 20 Wipro Ltd  India's third-largest software services exporter  posted a 1.6 percent fall in net profit for its  fourth-fiscal quarter  missing analysts' expectations.",
        "date": "04202016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro Q4 net profit misses estimates; board approves buyback "
    },
    {
        "content": "BENGALURU Wipro Ltd  India's third-largest software services exporter  posted a 2 percent rise in quarterly net profit on Monday  in line with street estimates  as it added 39 new customers during the quarter.",
        "date": "01182016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "Wipro meets forecasts with 2 percent profit rise but margins hit "
    },
    {
        "content": "* Chennai flooding dents operating margin in the Dec qtr   (Adds details  forecast  stock price; changes dateline)",
        "date": "01182016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "UPDATE 1-India's Wipro meets forecasts with 2 pct profit rise but margins hit "
    },
    {
        "content": "MUMBAI  Jan 18 Wipro Ltd  India's third-largest software services exporter  reported third-quarter profit in line with analysts' estimates.",
        "date": "01182016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro Q3 profit up 2 pct  meets estimates "
    },
    {
        "content": "MUMBAI Wipro Ltd  has named Abidali Neemuchwala as its new chief executive  as India's third-largest software services exporter looks to regain market share from larger local outsourcing competitors.",
        "date": "01042016",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "Wipro names Neemuchwala new chief executive "
    },
    {
        "content": "* Neemuchwala succeeds TK Kurien who will become vice chairman",
        "date": "01042016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "UPDATE 1-India's Wipro names Neemuchwala new chief executive "
    },
    {
        "content": "MUMBAI  Jan 4 Wipro Ltd  India's third-largest software services exporter  on Monday named Abidali Neemuchwala  who joined the company nine months ago  the new chief executive with effect from Feb. 1.",
        "date": "01042016",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro names Neemuchwala new chief executive "
    },
    {
        "content": "MUMBAI Wipro  India's third-largest software services exporter  warned investors on Wednesday that heavy flooding in Chennai would hit revenues and operating margins for the quarter ending on Dec. 31.",
        "date": "12162015",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "Wipro flags flood hit to Q3 earnings "
    },
    {
        "content": "BENGALURU/MUMBAI Wipro Ltd  India's third-biggest software services exporter  reported a 7.2 percent rise in quarterly profits on Wednesday but forecast a tepid quarter ahead due to fewer working days for its Western clients and smaller deals.",
        "date": "10212015",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "Wipro posts bigger Q2 profit  sees muted Q3 "
    },
    {
        "content": "BENGALURU/MUMBAI  Oct 21 Wipro Ltd  India's third-biggest software services exporter  reported a 7.2 percent rise in quarterly profits on Wednesday but forecast a tepid quarter ahead due to fewer working days for its Western clients and smaller deals.",
        "date": "10212015",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "UPDATE 1-India's Wipro posts bigger Q2 profit  sees muted Q3 "
    },
    {
        "content": "BENGALURU/MUMBAI  Oct 21 Wipro Ltd  India's third-biggest software services exporter  reported a 7.2 percent rise in quarterly profit that just beat market estimates  helped by better IT spending by global clients and a rise in high margin digital projects.",
        "date": "10212015",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro posts bigger Q2 profit "
    },
    {
        "content": "* Its unit signs 5-year contract with Wipro Ltd for development and maintenance of telecommunication infrastructure of T-Mobile Polska",
        "date": "07302015",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-Wind Mobile unit signs deal for maintenance of T-Mobile Polska infrastructure "
    },
    {
        "content": "MUMBAI/ BENGALURU Wipro Ltd   India's third-biggest software services exporter  expects less volatile global oil prices to revive spending on IT outsourcing by its energy and utility clients.",
        "date": "07232015",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "Wipro sees stronger quarters ahead on calmer oil prices "
    },
    {
        "content": "* Sees sales at IT services business rising up to 3.9 pct   (Adds details on energy business  CEO comments)",
        "date": "07232015",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "UPDATE 1-Wipro sees stronger quarters ahead on calmer oil prices "
    },
    {
        "content": "MUMBAI/ BENGALURU  July 23 Higher IT spending by global clients helped Indian software company Wipro to post quarterly profit broadly in line with forecasts  the company said on Thursday.",
        "date": "07232015",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "Wipro quarterly profit lifted by higher global IT spending "
    },
    {
        "content": "BENGALURU Wipro Ltd   India's third-biggest software services exporter  has appointed the son of billionaire founder Azim Premji to its board  in a long awaited promotion that moves the chairman's heir apparent closer to the top spot.",
        "date": "04212015",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "India's Wipro promotes Premji heir apparent to board "
    },
    {
        "content": "* Gives tepid forecast for IT services sales in June qtr   (Adds analyst  CEO comments  details)",
        "date": "04212015",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "UPDATE 2-India's Wipro promotes Premji heir apparent to board "
    },
    {
        "content": "BENGALURU  April 21 Wipro Ltd  India's third-biggest software services exporter  reported a 2 percent rise in quarterly profit on Tuesday  beating estimates thanks to a rise in its Western clients' technology spending.",
        "date": "04212015",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "India's Wipro Q4 profit ticks up 2 pct; beats forecasts "
    },
    {
        "content": "* GK Software and Wipro partner for implementing SAP store management applications by GK  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "04092015",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "BRIEF-GK Software and Wipro partner for implementing SAP store management applications by GK "
    },
    {
        "content": "MUMBAI  March 25 India's third-largest IT services exporter Wipro is setting up a \"commando force\" unit next month that will target clients seeking to speed up automation and do more business online  an executive told Reuters.",
        "date": "03252015",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "India's Wipro seeks bigger digital market share with \"commando\" unit "
    },
    {
        "content": "MUMBAI  Jan 19 India's NSE index rose for a third consecutive session on Monday to mark its highest level in nearly 1-1/2 months as Wipro surged on strong earnings while lenders gained on continued optimism the central bank's surprise rate cut last week would revive credit growth.",
        "date": "01192015",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "CORRECTED-India's NSE index ends near 1-1/2-month high "
    },
    {
        "content": "* Sees IT services sales rising by up to 3.4 pct in March qtr",
        "date": "01162015",
        "name": "Wipro Limited",
        "news_type": "topStory",
        "symbol": "WIT",
        "title": "UPDATE 1-India's Wipro expects western sales boost  oil prices a worry "
    },
    {
        "content": "Jan 16 India's third-biggest software services company Wipro reported a near-9 percent rise in third-quarter profit on Friday  slightly ahead of analysts' forecasts  helped by a rise in clients' technology spending.",
        "date": "01162015",
        "name": "Wipro Limited",
        "news_type": "normal",
        "symbol": "WIT",
        "title": "Wipro quarterly profit beats estimates  names new CFO "
    }
]