[
    {
        "content": "* Williams Companies Inc - ‍qtrly loss earnings per share $0.04​",
        "date": "11012017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams reports ‍qtrly loss earnings per share $0.04​ "
    },
    {
        "content": "* Williams appoints John D. Chandler as senior vice president and chief financial officer",
        "date": "08282017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams appoints John Chandler as senior VP  CFO "
    },
    {
        "content": "HOUSTON  Aug 25 U.S. pipeline operator Williams Companies on Friday said its Transco natural gas transmission system has experienced losses from offshore producers of about 280 million cubic feet per day due to Hurricane Harvey.",
        "date": "08252017",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Transco pipeline reports losses  Williams evacuates offshore personnel "
    },
    {
        "content": "* Qtrly adjusted income from continuing operations per share $0.13",
        "date": "08022017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Q2 earnings per share $0.10 "
    },
    {
        "content": "* Williams Partners expands pipeline capacity to deliver natural gas to serve growing Florida power generation market",
        "date": "07112017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Partners expands pipeline capacity to serve Florida power generation market "
    },
    {
        "content": "* Williams announces Stephen W. Bergstrom elected chairman of its board of directors",
        "date": "05192017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams reports Stephen Bergstrom elected chairman of board "
    },
    {
        "content": "* Williams' board of directors has approved a regular dividend of $0.30 per share",
        "date": "05182017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams' board approves regular dividend of $0.30/share "
    },
    {
        "content": "NEW YORK Williams Companies Inc  does not expect further acquisitions or asset sales in the near term after divesting its olefins plant in Louisiana to focus on its natural gas business  its chief executive told Reuters on Wednesday.",
        "date": "05112017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Williams Cos CEO says asset sales done for now after year of dealmaking "
    },
    {
        "content": "NEW YORK  May 10 Williams Companies Inc does not expect further acquisitions or asset sales in the near term after divesting its olefins plant in Louisiana to focus on its natural gas business  its chief executive told Reuters on Wednesday.",
        "date": "05102017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Williams Cos CEO says asset sales done for now after year of dealmaking "
    },
    {
        "content": "* Williams companies inc qtrly adjusted income from continuing operations per share $0.14",
        "date": "05032017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Q1 earnings per share $0.45 "
    },
    {
        "content": "* CEO Alan Armstrong's 2016 total compensation was $10.2 million versus $7 million in 2015 - SEC filing Source text: (http://bit.ly/2nSnisy) Further company coverage:",
        "date": "04072017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Companies says CEO Alan Armstrong's 2016 total compensation was $10.2 million "
    },
    {
        "content": "* Williams Companies -Entered into arrangement with executive officers with regard to employment  involuntarily termination on or prior to Dec 31  2018",
        "date": "02242017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Companies changes terms of employment involuntarily termination "
    },
    {
        "content": "* Williams Companies Inc - intent to increase its regular quarterly dividend to $0.30 per share effective with quarterly dividend to be paid in march 2017",
        "date": "02152017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams reports qtrly adjusted earnings per share $0.17 "
    },
    {
        "content": "* Williams Companies Inc says has commenced an underwritten public offering of 65 million shares of Williams common stock",
        "date": "01092017",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Companies says has commenced underwritten public offering of 65 mln shares of williams common stock "
    },
    {
        "content": "* Williams Companies Inc - 2016 annual meeting to be held Nov. 23  2016  Source text for Eikon:  Further company coverage:",
        "date": "10192016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams announces 2017 annual meeting date "
    },
    {
        "content": "* Announces three directors volunteered to not stand for re-election at upcoming 2016 annual meeting  Source text for Eikon:  Further company coverage:",
        "date": "10062016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Co says three directors volunteered to not stand for re-election annual meeting "
    },
    {
        "content": "* Peter Ragauss  former CFO of Baker Hughes and current board director at Apache Corp  appointed to Williams Board",
        "date": "09262016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams details next step in board refreshment plan "
    },
    {
        "content": "Canada's Enbridge Inc said on Tuesday it would buy Spectra Energy Corp of Houston in an all-stock deal valued at about $28 billion (C$37 billion) to create the largest North American energy infrastructure company.",
        "date": "09062016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Enbridge buying Spectra in $28 bln deal "
    },
    {
        "content": "* Withdrawn its indication of interest in Williams Companies Inc  Source text for Eikon:  Further company coverage:",
        "date": "09082016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Enterprise withdraws indication of interest in Williams "
    },
    {
        "content": "* Williams announces organizational realignment to advance natural gas-focused strategy and drive value",
        "date": "09072016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams to consolidate from 5 to 3 operating areas by early 2017 "
    },
    {
        "content": "Canada's Enbridge Inc said on Tuesday it would buy Spectra Energy Corp of Houston in an all-stock deal valued at about $28 billion (C$37 billion) to create the largest North American energy infrastructure company. | Video ",
        "date": "09072016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Enbridge buying Spectra in $28 billion deal "
    },
    {
        "content": "* Williams appoints three new independent directors;  Stephen Bergstrom  Scott Sheffield and William Spence appointed",
        "date": "08292016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams appoints three new independent directors "
    },
    {
        "content": "* Williams agrees to purchase 6.975 million common units from Williams Partners in private placement",
        "date": "08262016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams agrees to purchase 6.975 mln common units from Williams Partners in Private Placement "
    },
    {
        "content": "* \"Intends to appoint three new  independent directors to its board of directors prior to company's 2016 annual meeting\"",
        "date": "08222016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams comments on Corvex plan to nominate directors "
    },
    {
        "content": "Enterprise Products Partners LP  approached Williams Companies Inc  earlier this summer about combining their   businesses  two of the largest U.S. oil and gas pipeline operations  people familiar with the matter said.",
        "date": "08182016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Enterprise Products approached Williams over acquisition: sources "
    },
    {
        "content": "Aug 18 Enterprise Products Partners LP  approached Williams Companies Inc earlier this summer about combining their   businesses  two of the largest U.S. oil and gas pipeline operations  people familiar with the matter said.",
        "date": "08182016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "UPDATE 4-Enterprise Products approached Williams over acquisition -sources "
    },
    {
        "content": "Aug 18 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "08182016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON U.S. antitrust enforcers said on Thursday that they have formally closed their probe into the now-scrapped merger of Energy Transfer Equity  LP  and the Williams Companies .",
        "date": "08182016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "FTC closes probe into scrapped merger of Williams  ETE "
    },
    {
        "content": "* Williams to appoint three new independent directors to its board",
        "date": "08152016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams to appoint three new independent directors to board "
    },
    {
        "content": "WASHINGTON  Aug 18 U.S. antitrust enforcers said on Thursday that they have formally closed their probe into the now-scrapped merger of Energy Transfer Equity  LP and the Williams Companies.",
        "date": "08182016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "U.S. FTC closes probe into scrapped merger of Williams  ETE "
    },
    {
        "content": "* Moody's - Downgrades Williams Companies To Ba2; Affirms Williams Partners' At Baa3",
        "date": "08022016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Moody's downgrades Williams Companies to Ba2 "
    },
    {
        "content": "* Co and Williams Partners announced today they have agreed to sell companies' Canadian businesses to Inter Pipeline Ltd.",
        "date": "08082016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Co  Williams Partners to sell Canadian businesses for C$1.35 bln "
    },
    {
        "content": "* Settlement agreement dated February 25  2014  with Corvex Management Lp  Keith Meister was terminated effective June 30  2016",
        "date": "07052016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Companies announces termination of settlement agreement "
    },
    {
        "content": "* Williams chairman Frank T. Macinnis steps down for personal reasons; announces additional board resignations",
        "date": "07012016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Companies says Frank MacInnis steps down as Chairman "
    },
    {
        "content": "* Williams comments on ETE's decision to terminate merger agreement",
        "date": "06292016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams comments on ETE's decision to terminate merger agreement "
    },
    {
        "content": "* ETE's counsel Latham & Watkins unable to deliver required tax opinion prior to June 28  2016  outside date in merger agreement",
        "date": "06292016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "BRIEF-Energy Transfer Equity announces termination of merger agreement with Williams Companies "
    },
    {
        "content": "* Energy Transfer Equity announces Chancery Court decision in litigation with the Williams Companies",
        "date": "06252016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Energy Transfer Equity announces Chancery Court decision in litigation with the Williams Companies "
    },
    {
        "content": "* Williams stockholders approve merger transaction with ETE  and Williams launches appeal of merger ruling in Delaware Supreme Court",
        "date": "06272016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Companies stockholders approve merger transaction with ETE "
    },
    {
        "content": "* Announces preliminary results of elections made by stockholders for merger consideration in connection with ETE's acquisition",
        "date": "06272016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "BRIEF-Williams announces preliminary stockholder merger consideration election results "
    },
    {
        "content": "* Agreed to file an amended disclosure to its proxy statement in connection with merger agreement with Energy Transfer Equity  L.P",
        "date": "06172016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams to file amended disclosure to proxy statement "
    },
    {
        "content": "* Remains committed to holding stockholder vote on June 27  2016 and closing deal with energy transfer equity \"as soon as possible\"",
        "date": "06082016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams sets regular quarterly dividend of $0.64 per share "
    },
    {
        "content": "* Filed its affirmative defenses and counterclaim in lawsuit brought by Williams Companies Inc.",
        "date": "05262016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-ETE files counterclaim saying Williams breached deal pact "
    },
    {
        "content": "* SEC declares registration statement on form s-4 \"effective\" in proposed acquisition of WILLIAMS by ETE",
        "date": "05252016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams companies says has scheduled special meeting of stockholders for co stockholders to vote on transaction with ETE "
    },
    {
        "content": "May 15 Energy Transfer Equity LP on Sunday accused its buyout target Williams Companies Inc  of filing a third lawsuit against it in an attempt to gain leverage in any future deal talks between the two pipeline companies.",
        "date": "05162016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "UPDATE 1-ETE says Williams filed lawsuit to gain leverage in deal talks "
    },
    {
        "content": "Energy Transfer Equity LP  said on Sunday that a lawsuit filed by Williams Companies Inc  to prevent ETE from terminating its once-coveted deal for Williams will lead to a delay in the buyout.",
        "date": "05162016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "ETE says Williams latest lawsuit will cause delay in completing deal "
    },
    {
        "content": "May 15 Energy Transfer Equity LP said on Sunday that a lawsuit filed by Williams Companies Inc to prevent ETE from terminating its once-coveted deal for Williams will lead to a delay in the buyout.",
        "date": "05152016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "ETE says Williams latest lawsuit will cause delay in completing deal "
    },
    {
        "content": "May 13 Williams Companies Inc said it has filed a lawsuit against Energy Transfer Equity LP to prevent it from terminating its once-coveted deal for Williams.",
        "date": "05142016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Williams files suit to prevent Energy Transfer from terminating deal "
    },
    {
        "content": "* Williams files lawsuit seeking to prevent ETE from avoiding its obligations under merger agreement",
        "date": "05142016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "BRIEF-Williams files lawsuit seeking to prevent ETE from avoiding its obligations under merger agreement "
    },
    {
        "content": "Energy Transfer Equity LP  and Williams Companies Inc  agreed on Tuesday to change an administrative requirement for their $20 billion-deal to give U.S. regulators additional time to complete their review of the tie-up.",
        "date": "05032016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "ETE  Williams give SEC more time to review their deal "
    },
    {
        "content": "* Co and Williams agreed to eliminate standalone requirement for energy transfer to mail form of election",
        "date": "05032016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "BRIEF-Energy Transfer Equity  Williams Companies enter amendment no. 1 to merger agreement "
    },
    {
        "content": "Energy Transfer Equity LP  is taking steps that may enable it to renegotiate its $20 billion cash-and-stock acquisition of Williams Companies Inc   according to people familiar with the matter.",
        "date": "05032016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Exclusive: Energy Transfer in effort to renegotiate deal with Williams - sources "
    },
    {
        "content": "Williams Companies Inc  sued Energy Transfer Equity LP  and its Chief Executive Kelcy Warren on Wednesday  claiming they violated the U.S. pipeline companies' merger agreement by making a private preferred share offering to ETE's top investors.",
        "date": "04062016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Williams sues ETE and CEO Warren over share offering "
    },
    {
        "content": "April 6 Williams Companies Inc sued Energy Transfer Equity LP and its Chief Executive Kelcy Warren on Wednesday  claiming they violated the U.S. pipeline companies' merger agreement by making a private preferred share offering to ETE's top investors.",
        "date": "04062016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "UPDATE 3-Williams sues ETE and CEO Warren over share offering "
    },
    {
        "content": "April 6 Williams Companies Inc has sued Energy Transfer Equity LP to block a private preferred share offering disclosed last month  saying it was a breach of their merger agreement.",
        "date": "04062016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Williams sues Energy Transfer over preferred share offering "
    },
    {
        "content": "NEW YORK Energy Transfer Equity   which is in the process of buying rival pipeline company Williams Companies Inc   said it carried out a private offering of convertible shares to some of its investors in order to help pay for the deal.",
        "date": "03102016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "ETE makes private offering to help pay for Williams deal "
    },
    {
        "content": "NEW YORK  March 9 Energy Transfer Equity   which is in the process of buying rival pipeline company Williams Companies Inc  said it carried out a private offering of convertible shares to some of its investors in order to help pay for the deal.",
        "date": "03092016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "ETE makes private offering to help pay for Williams deal "
    },
    {
        "content": "Pipeline giant Energy Transfer Equity Lp  is likely to take its proposed buyout of Williams Companies Inc  to a shareholder vote  CNBC reported  citing sources.",
        "date": "02262016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Energy Transfer to take Williams deal to shareholder vote: CNBC "
    },
    {
        "content": "Feb 26 Pipeline giant Energy Transfer Equity Lp  is likely to take its proposed buyout of Williams Companies Inc to a shareholder vote  CNBC reported  citing sources.",
        "date": "02262016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "CORRECTED-UPDATE 1-Energy Transfer to take Williams deal to shareholder vote-CNBC "
    },
    {
        "content": "Feb 26 Pipeline giant Energy Transfer Equity Lp  is likely to take its proposed buyout of Williams Companies Inc to a shareholder vote  CNBC reported  citing sources.",
        "date": "02262016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "CORRECTED-Energy Transfer likely to take Williams deal to shareholder vote-CNBC "
    },
    {
        "content": "* Sets 2016 capex of $1.3 bln-$1.8 bln  down 57 pct from 2015",
        "date": "02242016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "UPDATE 3-Chesapeake aims to cut debt  spending amid oil slump "
    },
    {
        "content": "HOUSTON  Feb 25 Southwestern Energy Co  said on Thursday it and Williams Companies Inc have negotiated lower rates to gather  transport and process natural gas it produces in West Virginia in exchange for some new business for the pipeline operator.",
        "date": "02252016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Southwestern gets lower pipeline  gathering rates with Williams "
    },
    {
        "content": "NEW YORK Shares of Williams Companies  fell sharply in afternoon trading on Thursday following a New York Times report that Energy Transfer may be searching for a way to pull out of its deal with the company.",
        "date": "02252016",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Williams Cos shares drop after NY Times report on deal problems "
    },
    {
        "content": "Jan 25 Pipeline operator Williams Partners LP   a master limited partnership of Williams Companies Inc   cut its 2016 capital budget by about $1 billion  or by almost a third  to $2 billion.",
        "date": "01252016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Williams Partners cuts 2016 capex by about $1 bln "
    },
    {
        "content": "* Williams Companies reports first quarter 2016 financial results",
        "date": "05042016",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "BRIEF-Williams Companies Inc Q1 adjusted EPS $0.03 "
    },
    {
        "content": "Pipeline giant Energy Transfer Equity LP  will buy rival Williams Cos Inc  in a deal valued around $33 billion  nearly a third less than the same offer Williams had rejected in June for being too small.",
        "date": "09282015",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Energy Transfer to buy Williams for $33 billion after long quest "
    },
    {
        "content": "Williams Companies'  board of directors is preparing to meet as early as this week to consider a sale to oil and gas pipeline peer Energy Transfer Equity LP  after the latter revised its offer  according to people familiar with the matter.",
        "date": "09232015",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Exclusive: Williams to consider revised Energy Transfer offer - sources "
    },
    {
        "content": "Sept 11 Spectra Energy Corp has exited the auction process for rival pipeline company The Williams Companies Inc  raising the possibility that Energy Transfer Equity LP could succeed in buying the company  people familiar with the discussions said.",
        "date": "09112015",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Spectra exits Williams Cos' auction  ETE remains -sources "
    },
    {
        "content": "Spectra Energy Corp   an oil and natural gas pipeline company  is bidding for the whole of Williams Companies Inc   even though its market capitalization is about half that of Williams  people familiar with the matter said.",
        "date": "08142015",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Exclusive: Spectra bidding for the entirety of Williams Cos - sources  "
    },
    {
        "content": "Energy Transfer Equity LP  has progressed to the second round of bidding for Williams Companies   according to people familiar with the matter  a key milestone in the pipeline company's efforts to clinch a friendly deal with its peer.",
        "date": "08052015",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Exclusive: Energy Transfer advances in auction for Williams - sources "
    },
    {
        "content": "Pipeline company Energy Transfer Equity LP  said it was open to take part in Williams Companies Inc's  strategic review despite having a takeover offer rebuffed  but only if the process was \"fair\" and not designed to disadvantage Energy Transfer.",
        "date": "07082015",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "ETE open to bid for Williams via 'fair' options review process "
    },
    {
        "content": "July 8 Pipeline company Energy Transfer Equity LP said it was open to take part in Williams Companies Inc's strategic review despite having a takeover offer rebuffed  but only if the process was \"fair\" and not designed to disadvantage Energy Transfer.",
        "date": "07082015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "UPDATE 1-ETE open to bid for Williams via \"fair\" options review process "
    },
    {
        "content": "July 8 Pipeline company Energy Transfer Equity LP said it planned to proceed with its proposal to buy rival Williams Companies Inc despite being rebuffed  indicating it may go hostile with the offer.",
        "date": "07082015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "ETE says to proceed with Williams offer despite rejection "
    },
    {
        "content": "NEW YORK/LONDON  June 29 Mergers and acquisitions (M&A) worldwide in the second quarter of 2015 almost matched the record set in the second quarter of 2007  according to preliminary Thomson Reuters data  as big companies turned to deals to boost their market share.",
        "date": "06292015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "DEALS-Second-quarter M&A close to record amid mega deals "
    },
    {
        "content": "HOUSTON  June 23 Williams Companies Inc  has spurned Energy Transfer Equity's $48 billion takeover offer for now but a tie-up would give the company a dominant position in the fastest-growing natural gas market in the United States: the Northeast's Marcellus Shale.",
        "date": "06232015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Williams deal would hasten Energy Transfer's Marcellus dominance "
    },
    {
        "content": "HOUSTON  June 22 Energy Transfer Equity's  unsolicited $48 billion offer for Williams Companies Inc  through a corporate structure with tax advantages may be the U.S. pipeline company's best option as potential bids from rivals are complicated by possible antitrust issues and the deal's rich price  investors and analysts said on Monday.",
        "date": "06222015",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Energy Transfer offer may be Williams' best option -analysts "
    },
    {
        "content": " ",
        "date": "06212015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Williams Co exploring strategic options after unsolicited offer "
    },
    {
        "content": "June 22 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "06222015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Energy Transfer Equity LP confirmed it had made a $48 billion unsolicited bid for natural gas pipeline company Williams Companies Inc  hours after Williams rejected the offer as significantly too low.",
        "date": "06222015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "ETE confirms $48 billion bid for reluctant Williams Co "
    },
    {
        "content": "June 22 Energy Transfer Equity LP  confirmed it had made a $48 billion unsolicited bid for natural gas pipeline company Williams Companies Inc  hours after Williams rejected the offer as significantly too low.",
        "date": "06222015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "UPDATE 1-ETE confirms $48 bln bid for reluctant Williams Co "
    },
    {
        "content": "June 22 Energy Transfer Equity LP  a portfolio company that owns energy assets  said it has made an all-equity offer of $53.1 billion  including debt  to merge with Williams Companies Inc.",
        "date": "06222015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "Energy Transfer Equity confirms bid for Williams Co "
    },
    {
        "content": "June 21 Natural gas pipeline company Williams Companies Inc said on Sunday it is exploring strategic options after it received an unsolicited takeover proposal for $64 per share or $48 billion.",
        "date": "06222015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "UPDATE 2-Williams Co rejects $48 bln unsolicited offer "
    },
    {
        "content": "June 22 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "06222015",
        "name": "Williams Companies Inc (The)",
        "news_type": "normal",
        "symbol": "WMB",
        "title": "PRESS DIGEST- Financial Times - June 22 "
    },
    {
        "content": "Pipeline giant Williams Cos is scrapping its master limited partnership unit by buying Williams Partners LP for about $13.8 billion  the latest in a series of deals in the pipeline industry aimed at simplifying corporate structures.",
        "date": "05132015",
        "name": "Williams Companies Inc (The)",
        "news_type": "topStory",
        "symbol": "WMB",
        "title": "Pipeline giant Williams Cos scraps MLP unit in $13.8 billion deal "
    }
]