[
    {
        "content": "* Williams Partners responds to temporary administrative stay of Atlantic Sunrise FERC authorization",
        "date": "11072017",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-Williams Partners responds to Atlantic Sunrise FERC authorization stay "
    },
    {
        "content": "* Williams Partners executes agreements with Southwestern Energy to expand gas gathering  processing and liquids handling services in the Northeast Source text for Eikon: Further company coverage:",
        "date": "10122017",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-Williams Partners executes agreements with Southwestern Energy "
    },
    {
        "content": "* No major damage identified at Williams Partners’ facilities following Hurricane Harvey",
        "date": "09062017",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-No major damage identified at Williams Partners’ facilities after Hurricane Harvey "
    },
    {
        "content": "* Williams Partners receives key pennsylvania DEP and U.S. Army corps of engineers permits for Atlantic sunrise project; receives FERC approval to place portion of project into service on Sept. 1",
        "date": "08312017",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-Williams Partners receives key pennsylvania DEP and U.S. Army corps of engineers permits for Atlantic Sunrise project "
    },
    {
        "content": "* Williams Partners joins with Southern Company and expands Pipeline Capacity to serve growing Georgia Natural Gas markets Source text for Eikon: Further company coverage:",
        "date": "08012017",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-Williams Partners joins with Southern Company and expands Pipeline Capacity to serve growing Georgia Natural Gas markets "
    },
    {
        "content": "* Williams agrees to purchase 6.975 million common units from Williams Partners in private placement",
        "date": "08262016",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-Williams agrees to purchase 6.975 mln common units from Williams Partners in Private Placement "
    },
    {
        "content": "* Chesapeake Energy Corporation agrees to exit Barnett shale  asset to be acquired and operated by first reserve  announces renegotiation of mid-contingent gas gathering agreement and provides preliminary 2017 guidance",
        "date": "08102016",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-Chesapeake provides preliminary guidance  agrees to exit Barnett shale "
    },
    {
        "content": "* Co and Williams Partners announced today they have agreed to sell companies' Canadian businesses to Inter Pipeline Ltd.",
        "date": "08082016",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-Williams Co  Williams Partners to sell Canadian businesses for C$1.35 bln "
    },
    {
        "content": "NEW YORK  Aug 1 Pipeline company Williams Cos Inc on Monday laid out plans to move forward as a standalone company and invest $1.7 billion in its master limited partnership  Williams Partners  in the wake of the breakup of its more than $20 billion takeover by Energy Transfer Equity LP.",
        "date": "08012016",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "UPDATE 1-Williams Cos plans to go it alone after ETE deal collapse "
    },
    {
        "content": "* Williams reports strong second quarter 2016 financial results  provides financial update and announces actions to strengthen credit profile and fund fee-based growth portfolio at Williams partners",
        "date": "08012016",
        "name": "Williams Partners LP",
        "news_type": "normal",
        "symbol": "WPZ",
        "title": "BRIEF-Williams qtrly adjusted earnings per share $ 0.19 "
    },
    {
        "content": "NEW YORK  Aug 1 Pipeline company Williams Cos Inc on Monday laid out plans to move forward as a standalone company and invest $1.7 billion in its master limited partnership  Williams Partners  in the wake of the breakup of its more than $20 billion takeover by rival Energy Transfer Equity LP in June.",
        "date": "08012016",
        "name": "Williams Partners LP",
        "news_type": "normal",
        "symbol": "WPZ",
        "title": "Williams plans to go forward on its own after ETE deal collapse "
    },
    {
        "content": "* Williams partners announces open season for Transco Northeast Supply Enhancement project",
        "date": "05162016",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-Williams Partners says open season for Transco Northeast Supply Enhancement project "
    },
    {
        "content": "* Williams Partners reports first quarter 2016 financial results",
        "date": "05042016",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "BRIEF-Williams Partners made additional cost cutting decisions at end of Q1 "
    },
    {
        "content": "Jan 25 Pipeline operator Williams Partners LP   a master limited partnership of Williams Companies Inc   cut its 2016 capital budget by about $1 billion  or by almost a third  to $2 billion.",
        "date": "01252016",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "Williams Partners cuts 2016 capex by about $1 bln "
    },
    {
        "content": "HOUSTON  Nov 6 North American pipeline companies are at a crossroads. Once the darlings of investors  their growth prospects have been undercut by a 50 percent slide in oil prices and tough environmental reviews that have delayed projects.",
        "date": "11062015",
        "name": "Williams Partners LP",
        "news_type": "normal",
        "symbol": "WPZ",
        "title": "Keystone snub adds to gloomy prospects for pipeline companies "
    },
    {
        "content": "HOUSTON  June 23 Williams Companies Inc  has spurned Energy Transfer Equity's $48 billion takeover offer for now but a tie-up would give the company a dominant position in the fastest-growing natural gas market in the United States: the Northeast's Marcellus Shale.",
        "date": "06232015",
        "name": "Williams Partners LP",
        "news_type": "normal",
        "symbol": "WPZ",
        "title": "Williams deal would hasten Energy Transfer's Marcellus dominance "
    },
    {
        "content": "* Williams Cos offers 1.115 shares for a Williams Partners share",
        "date": "05132015",
        "name": "Williams Partners LP",
        "news_type": "topStory",
        "symbol": "WPZ",
        "title": "UPDATE 2-Pipeline giant Williams Cos scraps MLP unit in $13.8 bln deal "
    },
    {
        "content": "May 13 Pipeline operator Williams Cos  said it would buy affiliate Williams Partners LP for about $13.8 billion in stock to simplify its corporate structure.",
        "date": "05132015",
        "name": "Williams Partners LP",
        "news_type": "normal",
        "symbol": "WPZ",
        "title": "Williams Cos to buy affiliate Williams Partners for $13.8 bln "
    }
]