[
    {
        "content": "* W. R. BERKLEY CORPORATION DECLARES SPECIAL DIVIDEND AND REGULAR QUARTERLY DIVIDEND",
        "date": "11132017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. BERKLEY CORPORATION DECLARES SPECIAL DIVIDEND "
    },
    {
        "content": "* Q3 earnings per share view $0.29 -- Thomson Reuters I/B/E/S",
        "date": "10242017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Corp reports Q3 earnings per share $1.26 "
    },
    {
        "content": "* W. R. Berkley Corporation announces preliminary estimate of catastrophe losses",
        "date": "10042017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley - Estimated catastrophe losses expected to be less than $110 mln "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 25 (Fitch) Fitch Ratings has affirmed all ratings for W. R. Berkley Corporation (Berkley) and its related property/casualty operating subsidiaries. These ratings include Berkley's 'BBB+' senior debt rating and 'A+' (Strong) Insurer Financial Strength (IFS) ratings. A complete list of rating actions follows at the end of this release. The Rating Outlook is Stable. KEY RATING DRIVERS Fitch's rating affirmation reflects Ber",
        "date": "08252017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "Fitch Affirms W. R. Berkley's Ratings; Outlook Stable "
    },
    {
        "content": "* W. R. Berkley Corporation declares dividend and increases share repurchase authorization",
        "date": "08092017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley declares dividend  increases share repurchase authorization "
    },
    {
        "content": "* Q2 earnings per share view $0.76 -- Thomson Reuters I/B/E/S",
        "date": "07252017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley reports Q2 earnings per share $0.85 "
    },
    {
        "content": "* W. R. Berkley Corporation announces sale of real estate investment",
        "date": "07062017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Corporation announces sale of real estate investment "
    },
    {
        "content": "* W. R. Berkley corporation forms Berkley International Fianzas México S.A. and Berkley International Seguros México S.A.",
        "date": "06122017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley forms Berkley International Fianzas México and Berkley International Seguros México "
    },
    {
        "content": "* Formation of two independent operating units  Berkley Entertainment & Sports and Berkley Environmental",
        "date": "06072017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley announces formantion of two independent operating units "
    },
    {
        "content": "* Q1 earnings per share view $0.88 -- Thomson Reuters I/B/E/S",
        "date": "04242017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley reports Q1 earnings per share $0.96 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 13 (Fitch) Fitch Ratings has affirmed and removed from Negative  Watch the ratings of W.R. Berkley Corporation (Berkley) including its 'A-'  Issuer Default Rating (IDR)  senior and subordinated debt. Berkley's  property/casualty operating subsidiaries' Insurer Financial Strength (IFS)  ratings have been also been affirmed. The Rating Outlook is Stable. A complete  list of rating actions follows at the end of this release",
        "date": "03132017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "Fitch Affirms W.R. Berkley's Ratings; Stable Outlook "
    },
    {
        "content": "* Q4 earnings per share view $0.78 -- Thomson Reuters I/B/E/S",
        "date": "01312017",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Q4 earnings per share $1.20 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 15 (Fitch) Fitch Ratings has maintained its Negative Watch on  W.R. Berkley Corporation's (Berkley) ratings  including the 'A-' Issuer Default  Rating (IDR)  and senior and subordinated debt. The Negative Watch will be  readdressed in the next six months. Berkley's property/casualty operating  subsidiaries' Insurer Financial Strength (IFS) ratings have been affirmed with a  Stable Outlook. A complete list of rating act",
        "date": "11152016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "Fitch Maintains Negative Watch on W.R. Berkley's Ratings; Affirms IFS Ratings; Outlook Stable "
    },
    {
        "content": "* W. R. Berkley Corporation declares special dividend and regular quarterly dividend",
        "date": "11042016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Corporation declares special dividend of 50 cents "
    },
    {
        "content": "* Q3 earnings per share view $0.85 -- Thomson Reuters I/B/E/S",
        "date": "10252016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W.R. Berkley Q3 earnings per share $1.72 "
    },
    {
        "content": "* Formation of Berkley Transactional As A Division Of Berkley Professional Liability Underwriters  Source text for Eikon:  Further company coverage:",
        "date": "09062016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Corporation Forms Berkley Transactional "
    },
    {
        "content": "* W. R. Berkley corporation names Richard M. Lowery senior vice president and chief information officer  Source text for Eikon:  Further company coverage:",
        "date": "08312016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley names Richard Lowery senior vice president "
    },
    {
        "content": "* Qtrly net premiums earned $1.56 billion versus $1.49 billion",
        "date": "07252016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Q2 earnings per share $0.85 "
    },
    {
        "content": "* W. R. Berkley Corp announces sale of wholly-owned investment",
        "date": "07182016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley announces sale of Aero Precision  other related businesses "
    },
    {
        "content": "* W. R. Berkley Corp names Jared Abbey as senior vice president  Source text for Eikon:  Further company coverage:",
        "date": "06162016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Corp names Jared Abbey as senior vice president "
    },
    {
        "content": "* W. R. Berkley Corporation names David Dunn president and chief executive officer of Carolina Casualty  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06152016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Corp names David Dunn CEO of Carolina Casualty "
    },
    {
        "content": "* To increase cash dividend to an annual rate of 52 cents per share  representing an 8% increase",
        "date": "05252016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley increases cash dividend to an annual rate of 52 cents/share "
    },
    {
        "content": "* Says Richard M. Baio has been named senior vice president and Chief Financial Officer",
        "date": "05252016",
        "name": "WR Berkley Corporation",
        "news_type": "normal",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley - Richard M. Baio named CFO "
    },
    {
        "content": "* W. R. Berkley corporation announces pricing of $290 million of 5.75% subordinated debentures due 2056  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05182016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley corporation prices of $290 mln of 5.75% subordinated debentures due 2056 "
    },
    {
        "content": "* Announced formation of Berkley Insurance Asia;  Shasi Gangadharan named CEO  Aaron Yip named COO of Berkley Insurance Asia  Source text for Eikon:  Further company coverage:",
        "date": "05112016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley announces formation of Berkley Insurance Asia "
    },
    {
        "content": "* Q1 earnings per share view $0.85 -- Thomson Reuters I/B/E/S",
        "date": "04262016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Corp reports Q1 earnings per share $0.93 "
    },
    {
        "content": "* W. R. Berkley corporation announces first quarter 2016 catastrophe losses",
        "date": "04212016",
        "name": "WR Berkley Corporation",
        "news_type": "topStory",
        "symbol": "WRB",
        "title": "BRIEF-W. R. Berkley Corporation says losses from catastrophes in Q1 of 2016 were $15.6 mln "
    }
]