[
    {
        "content": "* Wintrust Financial Corporation reports record third quarter 2017 net income  an increase of 24% over prior year  and year-to-date 2017 net income of $188.9 million  an increase of 24% over prior year",
        "date": "10182017",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial Corp reports Q3 earnings per share $1.12 "
    },
    {
        "content": "* Wintrust Financial Corporation reports record second quarter 2017 net income  an increase of 30% over prior year  and year-to-date 2017 net income of $123.3 million  an increase of 24% over prior year",
        "date": "07182017",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial's Q2 earnings per share $1.11 "
    },
    {
        "content": "* Wintrust Financial Corp says on June 16  co entered into fourth amendment to credit agreement dated as of December 15  2014 - SEC filing",
        "date": "06212017",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial enters into fourth amendment to credit agreement "
    },
    {
        "content": "* Wintrust financial corporation reports record first quarter 2017 net income  an increase of 19% over prior year",
        "date": "04192017",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust financial Q1 earnings per share $1 "
    },
    {
        "content": "* Wintrust Mortgage announces the acquisition of mortgage banking assets of American Homestead Mortgage  expanding its presence in Montana",
        "date": "02152017",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Mortgage says acquired mortgage banking assets of American Homestead Mortgage "
    },
    {
        "content": "* Wintrust Financial Corp - Increases size of board of directors from twelve directors to thirteen directors  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial increases size of board of directors from twelve to thirteen "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 23 (Fitch) Fitch Ratings has affirmed Wintrust Financial  Corp.'s ratings at 'BBB/F2'. The Rating Outlook remains Stable. A full list of  rating actions follows at the end of this rating action commentary. The rating action follows a periodic review of the midtier regional banking  group  which includes BankUnited Inc. (BKU)  BOK Financial Corp. (BOKF)  Cathay  General Bancorp (CATY)  East West Bancorp (EWBC)  First Rep",
        "date": "01232017",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "Fitch Affirms Wintrust Financial Corp.'s Ratings at 'BBB'; Rating Outlook Stable "
    },
    {
        "content": "* Wintrust Financial Corporation reports record fourth quarter 2016 net income  an increase of 54% over prior year  and record full-year 2016 net income of $206.9 million  an increase of 32% over prior year",
        "date": "01182017",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial Q4 earnings per share $0.94 "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.12 per share  Source text for Eikon:  Further company coverage:",
        "date": "10272016",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial sets qtrly cash dividend of $0.12 per shr "
    },
    {
        "content": "* Wintrust Financial Corporation reports record third quarter 2016 net income  an increase of 38% over prior year  and year-to-date 2016 net income of $152.3 million  an increase of 26% over prior year",
        "date": "10172016",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial Q3 earnings per share $0.92 "
    },
    {
        "content": "* Wintrust Financial Corporation hires chief diversity officer",
        "date": "08262016",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial hires Melissa Donaldson as chief diversity officer "
    },
    {
        "content": "* Says acquisition of first community financial corporation is expected to be completed by late q3 or early q4 of 2016",
        "date": "07192016",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial Q2 earnings per share $0.90 "
    },
    {
        "content": "* Subject to possible adjustment  aggregate purchase price will be approximately $30.3 million",
        "date": "07062016",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial to buy First Community Financial Corporation for $30.3 mln "
    },
    {
        "content": "* To acquire approximately $581 million in performing loans and related relationships from an affiliate of GE Capital franchise finance",
        "date": "06272016",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial to buy some loans from GE Capital Franchise Finance "
    },
    {
        "content": "June 27 General Electric Co said on Monday it would sell a bulk of GE Capital's U.S. restaurant franchise financing assets to three banks in separate deals.",
        "date": "06272016",
        "name": "Wintrust Financial Corporation",
        "news_type": "normal",
        "symbol": "WTFC",
        "title": "GE Capital to sell bulk of U.S. restaurant franchise financing assets "
    },
    {
        "content": "* Wintrust Financial Corporation announces offering of common stock",
        "date": "06082016",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial Corp announces public offering of 3 mln shares "
    },
    {
        "content": "* Wintrust financial corporation reports record first quarter 2016 net income  an increase of 26% over prior year",
        "date": "04182016",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial Q1 earnings per share $0.90 "
    },
    {
        "content": "* Wintrust financial corporation announces the closing of the acquisition of Generations Bancorp  Inc.  Source text for Eikon:  Further company coverage:",
        "date": "03312016",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "BRIEF-Wintrust Financial Corp closes acquisition of Generations Bancorp "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 26 (Fitch) Fitch Ratings has assigned a 'B+' rating to Wintrust  Financial Corp.'s (WTFC) $125 million series D non-cumulative perpetual  preferred stock issuance. Dividends will be payable at a fixed rate of 6.50% per annum from the original  issue date to  but excluding  July 15   2025 and thereafter at a floating rate  of three-month LIBOR plus a spread of 4.06% per annum. The proceeds will be used  for general corporat",
        "date": "06262015",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "Fitch Rates Wintrust's Ser D Non-Cumulative Perpetual Pfd Stock 'B+' "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 23 (Fitch) Fitch Ratings expects to assign a 'B+' rating to  Wintrust Financial Corp.'s (WTFC) $125 million Series D non-cumulative perpetual  preferred stock issuance.  Dividends will be payable at a fixed rate of 6.50% per annum from the original  issue date to  but excluding  July 15   2025 and thereafter at a floating rate  of three-month LIBOR plus a spread of 4.06% per annum. The proceeds will be used  for general c",
        "date": "06232015",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "Fitch Expects to Rate Wintrust's Ser D Non-Cumulative Perpetual Pfd Stock 'B+' "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 30 (Fitch) Fitch Ratings has affirmed Wintrust Financial  Corp.'s (WTFC) ratings at 'BBB/F2'. The Rating Outlook remains Stable. A full  list of rating actions is provided at the end of this rating action commentary. The rating action follows a periodic review of the mid-tier regional banking  group  which includes BOK Financial Corp. (BOKF)  Cathay General Bancorp (CATY)   East West Bancorp  Inc. (EWBC)  First Horizon ",
        "date": "01302015",
        "name": "Wintrust Financial Corporation",
        "news_type": "topStory",
        "symbol": "WTFC",
        "title": "Fitch Affirms Wintrust Financial at 'BBB/F2' Following Mid-Tier Regional Peer Review; Outlook Stable "
    }
]