[
    {
        "content": "* Mastercard and Western Union team up on transfers to U.S. debit cards Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Mastercard and Western Union team up on transfers to U.S. debit cards "
    },
    {
        "content": "* Says restored Western Union Money Transfer services to multiple agent locations in parts of Puerto Rico​ Source text for Eikon: Further company coverage:",
        "date": "10062017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union restores money transfer services in Puerto Rico "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 16 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to The Western Union Company's $250 million senior unsecured floating rate notes due 2019. The proceeds will be used for general corporate purposes. Fitch currently rates Western Union's $100 million additional 3.6% senior unsecured notes due 2022 'BBB+'. The additional 2022 notes are being issued under the same terms as the $400 million 3.6% senior unsecured notes du",
        "date": "08162017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Fitch Rates Western Union's Sr. Unsecured Offering 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Western Union Co files pricing term sheet related to $250 million floating rate notes due 2019",
        "date": "08152017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union Co files pricing term sheet related to $250 million floating rate notes due 2019 "
    },
    {
        "content": "* Western Union and Pay-O-Matic renew agreement with 7-year extension",
        "date": "08142017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union and Pay-O-Matic renew agreement with 7-year extension "
    },
    {
        "content": "* Western Union Co - launch of new wu.com transactional web site in kuwait Source text for Eikon: Further company coverage:",
        "date": "08072017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union launches new transactional website in Kuwait "
    },
    {
        "content": "* Q2 earnings per share view $0.41 -- Thomson Reuters I/B/E/S",
        "date": "08032017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union Q2 earnings per share $0.35 "
    },
    {
        "content": "* Western Union Co says an agreement with BP Australia; agreement with BP advances digitalisation of international money transfer in Australia Source text for Eikon: Further company coverage:",
        "date": "07242017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union announces agreement with BP Australia "
    },
    {
        "content": "* Says signs contract with Weizmann Forex to offer Western Union money transfer services in India Source text for Eikon: Further company coverage: (Reporting By Georgina Prodhan)",
        "date": "06222017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Wirecard says signs contract with weizmann forex to offer western union money transfer services in india "
    },
    {
        "content": "* Western Union announces $0.175 quarterly dividend Source text for Eikon: Further company coverage:",
        "date": "05112017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union announces $0.175 quarterly dividend "
    },
    {
        "content": "A federal judge in West Palm Beach  Florida has dismissed a racketeering claim against Western Union’s Speedpay  a payment processor accused of collecting millions of dollars of improper fees from Florida customers using the service to pay bills.",
        "date": "03282017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Judge dismisses RICO claims against Western Union's Speedpay "
    },
    {
        "content": "* CEO Hikmet Ersek's FY 2016 total compensation was $9.3 million versus $8.6 million in FY 2015 Source text: [http://bit.ly/2nwXLpr] Further company coverage:",
        "date": "03292017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union CEO Hikmet Ersek's FY 2016 total compensation was $9.3 mln "
    },
    {
        "content": "* Western Union Co - new $1.2 billion share repurchase program announced",
        "date": "02092017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union Q4 earnings per share $0.47 excluding items "
    },
    {
        "content": "Jan 26 Ant Financial Services Group  the payment affiliate of Chinese e-commerce firm Alibaba Group Holding Ltd   said it would buy U.S. money-transfer company MoneyGram International Inc in a deal valued at about $880 million.",
        "date": "01262017",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 2-Alibaba affiliate Ant Financial to buy MoneyGram "
    },
    {
        "content": "WASHINGTON Western Union Co  the world's biggest money-transfer company  agreed to pay $586 million and admitted to turning a blind eye as criminals used its service for money laundering and fraud  U.S. authorities said on Thursday.",
        "date": "01192017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union admits to aiding wire fraud  to pay $586 mln "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 20 (Fitch) The Western Union Company's ratings are not affected  by the joint agency settlement reached with the U.S. Department of Justice (DOJ)  and the Federal Trade Commission (FTC)  according to Fitch Ratings. The  agreements relate to activities that primarily occurred over the 2004 to 2012  timeframe.  Western Union  as part of the resolution  will enter into a deferred prosecution  agreement with the DoJ and a c",
        "date": "01202017",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Fitch: Western Union's 'BBB+' IDR Unaffected by Agreements with DoJ and FTC "
    },
    {
        "content": "WASHINGTON  Jan 19 Western Union Co  the world's biggest money-transfer company  agreed to pay $586 million and admitted to turning a blind eye as criminals used its service for money laundering and fraud  U.S. authorities said on Thursday.",
        "date": "01192017",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 3-Western Union admits to aiding wire fraud  to pay $586 mln "
    },
    {
        "content": "WASHINGTON  Jan 19 Western Union agreed to pay $586 million to settle allegations that it failed to prevent criminals from using its service for money laundering and fraud  the U.S. Department of Justice said in a statement on Thursday.   (Reporting by Joel Schectman and Diane Bartz; editing by Grant McCool)",
        "date": "01192017",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union settles U.S. money laundering allegations for $586 mln "
    },
    {
        "content": "WASHINGTON Western Union Co   the world's biggest money-transfer company  agreed to pay $586 million and admitted to turning a blind eye as criminals used its service for money laundering and fraud  U.S. authorities said on Thursday.",
        "date": "01202017",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union admits to aiding wire fraud  to pay $586 million "
    },
    {
        "content": "* Press release - Western Union reaches agreements to resolve u.s. Investigations",
        "date": "01192017",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "BRIEF-Western Union says reaches agreements to resolve U.S. investigations "
    },
    {
        "content": "LONDON  Jan 11 The share of Britain's biggest banks in the market supplying UK companies' daily foreign currency needs fell for a second year running in 2016 as firms made more use of new trading platforms and brokers  an industry report showed on Wednesday.",
        "date": "01112017",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UK banks' share of corporate currency business dips "
    },
    {
        "content": "MEXICO CITY  Oct 6 Mexico's Femsa said on Thursday its convenience store chain Oxxo had signed a deal with U.S. payments company Western Union   that will allow customers to receive international money transfers in its stores in Mexico.",
        "date": "10062016",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Femsa's Oxxo signs Western Union remittances deal "
    },
    {
        "content": "* Files for potential debt shelf; size undisclosed - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "10032016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union files for potential debt shelf size undisclosed "
    },
    {
        "content": "* Western Union appoints Bill Chandler as senior vice president and chief communications officer  Source text for Eikon:  Further company coverage:",
        "date": "09132016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union appoints Bill Chandler as senior vice president "
    },
    {
        "content": "* Q2 earnings per share view $0.40 -- Thomson Reuters I/B/E/S",
        "date": "08032016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union reports second quarter results "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 28 (Fitch) Fitch Ratings has affirmed the Long-Term Issuer Default  Rating (IDR) and senior unsecured debt ratings of The Western Union Company  (Western Union) at 'BBB+' and the Short-Term IDR at 'F2'. The Rating Outlook is  Stable. See the full list of ratings at the end of this release. KEY RATING DRIVERS Strong Competitive Position: Fitch believes Western Union operates from a strong  competitive position  particularly",
        "date": "07282016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Fitch Affirms Western Union's IDR at 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Consumers can purchase money orders and pay their bills at Rite Aid locations nationwide",
        "date": "07122016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union renews 20-year relationship with Rite Aid "
    },
    {
        "content": "* Launched mobile and online money transfers to Cuba via Western Union app and wu.com in U.S.  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06072016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union launches mobile  online money transfers to Cuba "
    },
    {
        "content": "MEXICO CITY  May 24 For two decades  Noe Sanchez sent money from California to his father in Mexico City through storefront outlets of traditional remittance firms such as Western Union.",
        "date": "05242016",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Financial tech startups compete for overlooked U.S. immigrant market "
    },
    {
        "content": "MEXICO CITY  May 24 For two decades  Noe Sanchez sent money from California to his father in Mexico City through storefront outlets of traditional remittance firms such as Western Union.",
        "date": "05242016",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "RPT-Financial tech startups compete for overlooked U.S. immigrant market "
    },
    {
        "content": "* Q1 earnings per share view $0.38 -- Thomson Reuters I/B/E/S",
        "date": "05032016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union reports Q1 earnings per share $0.37 "
    },
    {
        "content": "* On april 11 entered into a term loan agreement providing for an unsecured term loan facility in an aggregate amount of $575 million",
        "date": "04132016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "BRIEF-Western Union enters into term loan agreement "
    },
    {
        "content": "Western Union Co  said on Monday it would expand in Cuba  at a time when U.S. President Barack Obama started a historic Cuba tour as the two countries attempt to rebuild their bilateral relationship.",
        "date": "03212016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union says to expand in Cuba "
    },
    {
        "content": "March 21 Western Union Co said on Monday it would expand in Cuba  at a time when U.S. President Barack Obama started a historic Cuba tour as the two countries attempt to rebuild their bilateral relationship.",
        "date": "03212016",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 1-Western Union says to expand in Cuba "
    },
    {
        "content": "BRUSSELS  Feb 23 - U.S. money transfer services provider Western Union has been questioned by antitrust regulators over its activities in Europe  focusing on whether agreements with its agents are anti-competitive.",
        "date": "02232016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "UPDATE 2-Western Union quizzed by EU on money transfer activities "
    },
    {
        "content": "BRUSSELS  Feb 23 - U.S. money transfer services provider Western Union has been questioned by antitrust regulators over its activities in Europe  the company said on Tuesday.",
        "date": "02232016",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union quizzed by EU on money transfer activities "
    },
    {
        "content": "SYDNEY Australia's OzForex Group Ltd  said it has terminated talks to be acquired by Western Union  after the U.S. money wiring giant failed to submit a binding proposal  sending its shares tumbling nearly 40 percent to an all-time low.",
        "date": "02082016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "OzForex says talks to be acquired by Western Union fail  shares slump "
    },
    {
        "content": "SYDNEY  Feb 8 Australian shares ended flat on Monday  reversing early losses helped by late buying in resources and materials stocks  although weakness in financials weighed on the index.",
        "date": "02082016",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Australia shares end flat on late buying in resources "
    },
    {
        "content": "ASHGABAT  Feb 1 Turkmenistan  hit hard by the slump in the price of energy and commodities  has limited the amount of money its citizens can send abroad through the popular Western Union money transfer service  transfer clerks said.",
        "date": "02012016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Turkmenistan limits money transfers abroad "
    },
    {
        "content": "* Talks end after Western Union fails to submit binding offer",
        "date": "02082016",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 1-OzForex says talks to be acquired by Western Union fail  shares slump "
    },
    {
        "content": "SYDNEY  Feb 8 Australian shares fell on Monday  extending losses into a second session  as a weaker Wall Street weighed on market sentiment.",
        "date": "02082016",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Australia shares edge lower on Wall Street weakness "
    },
    {
        "content": "SYDNEY  Feb 8 Australia's OzForex Group Ltd  said it has terminated talks to be acquired by Western Union after the U.S. money wiring giant failed to submit a binding proposal despite months of due diligence.",
        "date": "02082016",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "OzForex say talks to be acquired by Western Union have failed  shares slump "
    },
    {
        "content": "CAIRO  Jan 12 Money transfers from Egypt to China via Western Union have been curbed in recent weeks to stop importers bypassing capital controls in place at Egyptian banks to manage a dollar shortage  banking and Western Union sources in Egypt said.",
        "date": "01122016",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union transfers from Egypt to China curbed amid dollar shortage -sources "
    },
    {
        "content": "SYDNEY Australian online money transfer company OzForex Group Ltd  said it will grant exclusive due diligence to larger U.S. rival Western Union Co  following its indicative takeover offer worth up to A$888 million ($644 million).",
        "date": "11252015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Australia's OzForex grants Western Union due diligence after $644 million approach "
    },
    {
        "content": "SYDNEY  Nov 26 Australian online money transfer company OzForex Group Ltd said it will grant exclusive due diligence to larger U.S. rival Western Union Co  following its indicative takeover offer worth up to A$888 million ($644 million).",
        "date": "11252015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Australia's OzForex grants Western Union due diligence after $644 mln approach "
    },
    {
        "content": "SYDNEY U.S. money wiring giant Western Union Co  said it made an informal offer to buy Australian online rival OzForex Group Ltd  for A$888 million ($632 million)  aiming to boost its access to one of the world's biggest cash transfer markets.",
        "date": "11192015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union makes $630 million proposal for smaller Australian online rival "
    },
    {
        "content": "SYDNEY  Nov 19 Australian currency exchange provider OzForex Group Ltd said U.S. money transfer giant Western Union Co made an informal takeover approach worth up to A$888 million ($631.10 million).",
        "date": "11182015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Australia's OzForex says Western Union made takeover approach "
    },
    {
        "content": "SYDNEY  Nov 19 U.S. money wiring giant Western Union Co said it made an informal offer to buy Australian online rival OzForex Group Ltd for A$888 million ($632 million)  aiming to boost its access to one of the world's biggest cash transfer markets.",
        "date": "11192015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 2-Western Union makes $630 mln proposal for smaller Australian online rival "
    },
    {
        "content": "Western Union Co  reported a better-than-expected quarterly profit  boosted by its online business  and the world's largest money-transfer company raised its full-year earnings forecast.",
        "date": "07302015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union profit beats estimates as online business shines "
    },
    {
        "content": "ACCRA Western Union Co plans to invest more in its compliance and monitoring systems in a renewed effort to combat fraud and money laundering  a senior executive said on Tuesday.",
        "date": "07282015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union to boost anti-money laundering efforts: exec "
    },
    {
        "content": "* Pricing equation stable-CFO   (Adds CEO  CFO comments  details)",
        "date": "07302015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 2-Western Union profit beats estimates as online business shines "
    },
    {
        "content": "ACCRA  July 28 Western Union Co plans to invest more in its compliance and monitoring systems in a renewed effort to combat fraud and money laundering  a senior executive said on Tuesday.",
        "date": "07282015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union to boost anti-money laundering efforts - exec "
    },
    {
        "content": "July 30 Western Union Co reported a 2.3 percent fall in quarterly profit as it earned lower fees from its money-transfer services.",
        "date": "07302015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union profit falls 2.3 pct "
    },
    {
        "content": "July 27 Western Union Co said on Monday it had restarted its money transfer service in Greece  allowing customers there to receive funds from overseas at some locations.",
        "date": "07272015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union restarts money transfer service in Greece "
    },
    {
        "content": "Paymap Inc  a unit of Western Union Co  agreed to pay $38.4 million to settle U.S. regulatory charges that it deceived consumers into signing up for a program advertised as a way to help them pay off their mortgages faster and save on interest payments.",
        "date": "07282015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union's Paymap to pay $38.4 mln over mortgage ads "
    },
    {
        "content": "Paymap Inc  a unit of Western Union Co  agreed to pay $38.4 million to settle U.S. regulatory charges that it deceived consumers into signing up for a program advertised as a way to help them pay off their mortgages faster and save on interest payments.",
        "date": "07282015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union's Paymap to pay $38.4 million over mortgage ads "
    },
    {
        "content": "July 28 Paymap Inc  a unit of Western Union Co   agreed to pay $38.4 million to settle U.S. regulatory charges that it deceived consumers into signing up for a program advertised as a way to help them pay off their mortgages faster and save on interest payments.",
        "date": "07282015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 1-Western Union's Paymap to pay $38.4 mln over mortgage ads "
    },
    {
        "content": "July 7 Western Union Co said it restarted its money transfer service in Greece  allowing customers in the country to receive funds from overseas.",
        "date": "07072015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union restarts money transfer service in Greece "
    },
    {
        "content": "July 7 Western Union Co said it restarted money transfer service in Greece  allowing customers in the country to receive funds from overseas.",
        "date": "07072015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 1-Western Union restarts money transfer service in Greece "
    },
    {
        "content": "LONDON  June 29 Western Union  the world's largest money transfer company  said it was closed for business in Greece on Monday and would remain closed for at least the rest of the week.",
        "date": "06292015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union to close in Greece for rest of week "
    },
    {
        "content": "Thomson Reuters May 15  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05152015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "May 6 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "05062015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Western Union Co   the world's largest money transfer company  said on Wednesday that it is not in talks to buy smaller rival MoneyGram International Inc .",
        "date": "05062015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union says it is not in talks to buy rival MoneyGram "
    },
    {
        "content": "Western Union Co   the world's largest money transfer company  is in early-stage talks to acquire smaller rival MoneyGram International Inc   Bloomberg reported  citing  people with knowledge of the matter.",
        "date": "05052015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union in talks to buy smaller rival MoneyGram: Bloomberg "
    },
    {
        "content": "May 5 Western Union Co  the world's largest money transfer company  is in early-stage talks to acquire smaller rival MoneyGram International Inc  Bloomberg reported  citing  people with knowledge of the matter.",
        "date": "05052015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 1-Western Union in talks to buy smaller rival MoneyGram-Bloomberg "
    },
    {
        "content": "Western Union Co  said it expects pricing for its money transfer services to be at the company's \"historical low single digit range\" as it grapples with rising competition.",
        "date": "04302015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union expects pricing at 'low single-digit range' "
    },
    {
        "content": "* Revenue from digital business rises 17 pct   (Adds details from conference call  CFO comment)",
        "date": "04302015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 2-Western Union expects pricing at \"low single-digit range\" "
    },
    {
        "content": "April 30 Western Union Co reported a 2 percent fall in quarterly revenue as it earned lower fees from its money-transfer services.",
        "date": "04302015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union's revenue falls as it earns lower fees "
    },
    {
        "content": "LONDON  Feb 18 British online money transfer business TransferWise launched its U.S. operation on Tuesday  the first step of an international expansion that will use $58 million in new backing to compete with the likes of Western Union and MoneyGram.",
        "date": "02182015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "TransferWise launches U.S. money transfer service  eyes more markets "
    },
    {
        "content": "Western Union Co  said it would cut prices for money transfers within the United States to help fend off fierce competition and would buy back up to $1.2 billion of shares.",
        "date": "02102015",
        "name": "Western Union Company (The)",
        "news_type": "topStory",
        "symbol": "WU",
        "title": "Western Union to cut prices for money transfers within U.S. "
    },
    {
        "content": "* Forecasts 2015 profit above analysts' estimates   (Adds details from conference call  CFO and analyst comments  background; updates shares)",
        "date": "02102015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "UPDATE 2-Western Union to cut prices for money transfers within U.S. "
    },
    {
        "content": "Feb 10 Western Union Co  the world's largest money-transfer company  reported a 28 percent rise in quarterly profit  helped by cost cuts and a lower tax bill.",
        "date": "02102015",
        "name": "Western Union Company (The)",
        "news_type": "normal",
        "symbol": "WU",
        "title": "Western Union's profit rises 28 pct "
    }
]