[
    {
        "content": "* Q3 earnings per share view $1.41 -- Thomson Reuters I/B/E/S",
        "date": "10262017",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn Resorts Q3 adjusted earnings per share $1.52 "
    },
    {
        "content": "NEW YORK  Aug 19 A year after disrupting the U.S. stock market with a new approach to handling trades  upstart stock exchange operator IEX Group is planning to nab listings from rivals by charging simpler  cheaper fees  Sara Furber  IEX's head of listings  said in a recent interview.",
        "date": "08192017",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "IEX plans to nab listings from rivals with cheaper  simpler fees "
    },
    {
        "content": "NEW YORK  May 31 IEX Group  operator of the newest U.S. stock exchange  plans to list its first company in October as it tries to break into a business dominated by the New York Stock Exchange and Nasdaq Inc  according to a trading alert sent out on Wednesday.",
        "date": "05312017",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "IEX to begin listing U.S. company shares in October "
    },
    {
        "content": "* Wynn Resorts announces pricing of private offering of $900 million aggregate principal amount of Wynn Las Vegas 5.25% senior notes due 2027",
        "date": "05042017",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn Resorts prices $900 mln debt private offering "
    },
    {
        "content": "* Wynn resorts announces private offering of $900 million aggregate principal amount of Wynn Las Vegas senior notes due 2027",
        "date": "05042017",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn resorts announces private offering of $900 million aggregate principal amount "
    },
    {
        "content": "* Wynn Resorts Ltd - CEO Stephen A. Wynn's 2016 total compensation was $28.2 million versus $20.7 million in 2015 - SEC filing  Source text for Eikon: (http://bit.ly/2nmKgY3) Further company coverage:",
        "date": "03102017",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn Resorts Ltd's CEO Stephen A. Wynn's 2016 total compensation $28.2 mln "
    },
    {
        "content": "* Wynn Resorts announces Craig S. Billings as chief financial officer",
        "date": "02232017",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn Resorts announces Craig Billings as CFO "
    },
    {
        "content": "* Wynn resorts  limited reports fourth quarter and year end 2016 results",
        "date": "01262017",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-WYNN resorts reports Q4 adj EPS $0.50 "
    },
    {
        "content": "In April 2015  a sworn statement submitted in a Nevada lawsuit between rival casino moguls Steve Wynn and Japan's Kazuo Okada contained an unusual assertion. Its author said Wynn's head of security had asked to meet him in Japan and then persuaded him to travel to the United States to talk to federal agents pursuing a different matter: a criminal bribery probe into Okada.",
        "date": "01112017",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "In fight between casino moguls  a spotlight on the FBI "
    },
    {
        "content": "* Files for potential mixed shelf  size not disclosed - SEC filing  Source text - (http://bit.ly/2fx1CP9) Further company coverage:",
        "date": "11082016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn resorts files for potential mixed shelf "
    },
    {
        "content": "* Net revenues were $1.11 billion for Q3 of 2016  an increase of 11.4%",
        "date": "11022016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn Resorts Q3 GAAP loss per share $0.17 "
    },
    {
        "content": "* Wynn Resorts - Wynn Macau Ltd  Leighton Contractors (Asia) Ltd agreed to settle claims under guaranteed maximum price construction contract - SEC filing",
        "date": "10312016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn Resorts says Wynn Macau  Leighton Contractors agree to settle claims "
    },
    {
        "content": "* Leighton Contractors (Asia) has agreed a settlement with its client Wynn Resorts in relation to Wynn Palace Macau Project",
        "date": "10302016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Leighton Contractors agrees to a settlement with Wynn Resorts "
    },
    {
        "content": "* Wynn Resorts appoints Jay L. Johnson to the board of directors",
        "date": "08232016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn Resorts appoints Jay L. Johnson to its board "
    },
    {
        "content": "MACAU Wynn Macau  the Macau unit owned by Las Vegas-based Wynn Resorts expects to have 50-60 VIP gaming tables when it opens its newest resort next week  its chief executive said on Wednesday.",
        "date": "08172016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "Wynn Macau expects to have up to 60 VIP tables at new resort "
    },
    {
        "content": "* Wynn resorts says its unit wynn resorts (macau) got notification from gaming inspection and coordination bureau of macau that wynn palace was approved to commence operations on aug 22  Source text for Eikon:  Further company coverage:",
        "date": "08152016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn Resorts says Wynn Palace was approved to commence operations on Aug 22 "
    },
    {
        "content": "HONG KONG  July 29 Casino operator Wynn Macau Ltd  a unit of U.S. tycoon Steve Wynn's Wynn Resorts   slid as much as 7 percent on Friday after it said it received only half of the new gaming table permits expected for its new $4.2 billion Macau casino.",
        "date": "07292016",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "Wynn Macau shares slide on low table allocation for new casino "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 24 (Fitch) Fitch Ratings has affirmed the Issuer Default Ratings  (IDRs) of Wynn Resorts  Ltd (WYNN) and all of its subsidiaries rated by Fitch at  'BB'. The Rating Outlook is Stable. The subsidiaries affirmed include Wynn Las  Vegas  LLC (Wynn Las Vegas)  Wynn America  LLC (Wynn America)  Wynn Macau  Ltd  (Wynn Macau) and Wynn Resorts (Macau)  S.A. Fitch links all of the IDRs within  the WYNN corporate structure. The full",
        "date": "05242016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "Fitch Affirms Wynn Resorts' IDR at 'BB'; Stable Outlook "
    },
    {
        "content": "* Filed in Nevada Clark County court motion to compel further deposition of former Nevada governor and Wynn Resorts director Robert Miller  Source text for Eikon:  Further company coverage:",
        "date": "04202016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Elaine Wynn files motion for further deposition of Robert Miller "
    },
    {
        "content": "* Steve Wynn issues statement  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04052016",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "BRIEF-Steve Wynn issues statement "
    },
    {
        "content": "Elaine Wynn  former wife of Wynn Resorts Ltd  founder Steve Wynn  sued him on Monday to get control over her nearly 10 percent stake  worth close to $900 million  in the casino company.",
        "date": "03282016",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "Elaine Wynn sues for control of her Wynn Resorts stock "
    },
    {
        "content": "March 28 Elaine Wynn  former wife of Wynn Resorts Ltd founder Steve Wynn  sued him on Monday to get control over her nearly 10 percent stake  worth close to $900 million  in the casino company.",
        "date": "03282016",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "UPDATE 1-Elaine Wynn sues for control of her Wynn Resorts stock "
    },
    {
        "content": "March 28 Wynn Resorts Ltd Chief Executive Steve Wynn's ex-wife Elaine Wynn has sued the billionaire casino mogul  accusing him of preventing her from exercising her rights as the company's stockholder and orchestrating her ouster from its board.",
        "date": "03282016",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "Wynn Resorts CEO's ex-wife sues for control of her shares in company "
    },
    {
        "content": "* Statement from Wynn Resorts in response to Elaine Wynn's recent filing",
        "date": "03282016",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "BRIEF-Wynn Resorts statement in response to Elaine Wynn's recent filing "
    },
    {
        "content": "* Wynn Resorts CEO Steve Wynn refutes Elaine Wynn's recent filing of complaint to gain control of wynn stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03282016",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "BRIEF-Steve Wynn refutes Elaine Wynn's recent filing "
    },
    {
        "content": "Nov 16 Soros Fund Management  which manages the investments of billionaire George Soros and his family  took new stakes in video streaming company Netflix Inc and casino operator Wynn Resorts Ltd during the third quarter.",
        "date": "11162015",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "UPDATE 1-Soros checks into Netflix  bids Herbalife adieu "
    },
    {
        "content": "Nov 16 Soros Fund Management  which manages the investments of billionaire George Soros and his family  took new stakes in video streaming company Netflix Inc and casino operator Wynn Resorts Ltd during the third quarter.",
        "date": "11162015",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "Soros checks into Netflix  bids Herbalife adieu "
    },
    {
        "content": "Oct 16 Big fish Chinese gamblers afraid of a corruption crackdown and poorly paid Wal-Mart workers in the United States might seem to have little in common.",
        "date": "10172015",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "RPT-COLUMN-Wynn Resorts  Wal-Mart: One coin in the world  economy "
    },
    {
        "content": "Oct 16 Big fish Chinese gamblers afraid of a corruption crackdown and poorly paid Walmart workers in the United States might seem to have little in common.",
        "date": "10162015",
        "name": "Wynn Resorts Limited",
        "news_type": "normal",
        "symbol": "WYNN",
        "title": "Wynn Resorts  WalMart: One coin in the world  economy "
    },
    {
        "content": "Jan 20 Casino operator Wynn Resorts Ltd  has slashed Chief Executive Steve Wynn's salary to $2.5 million per year from $4 million  a regulatory filing showed.",
        "date": "01202015",
        "name": "Wynn Resorts Limited",
        "news_type": "topStory",
        "symbol": "WYNN",
        "title": "Casino operator Wynn Resorts slashes CEO Steve Wynn's salary "
    }
]