[
    {
        "content": "LONDON  Nov 15 Hedge funds bought reinsurance stocks in the third quarter after prices tumbled on widespread losses after multiple hurricanes in North America  filings showed on Wednesday.",
        "date": "11152017",
        "name": "XL Group Ltd",
        "news_type": "normal",
        "symbol": "XL",
        "title": "Hedge funds bet on reinsurance recovery "
    },
    {
        "content": "* Xl Group Ltd files ‍​for potential mixed shelf offering; size not disclosed Source text: (http://bit.ly/2znm55T) Further company coverage:",
        "date": "10312017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-Xl Group Ltd files ‍​for potential mixed shelf offering "
    },
    {
        "content": "* XL Group Ltd announces appointment of James E. Nevels to board of directors Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group appoints of James Nevels to board of directors "
    },
    {
        "content": "* Q3 earnings per share view $-3.91 -- Thomson Reuters I/B/E/S",
        "date": "10242017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group reports Q3 loss per share $4.06 "
    },
    {
        "content": "* Xl group announces preliminary loss estimates related to third quarter 2017 natural catastrophes",
        "date": "10112017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group ‍says preliminary estimate of losses relating to hurricanes about $1.33 bln "
    },
    {
        "content": "Insurer XL Group Ltd  said on Tuesday it would move its European Union insurance company from Britain to Ireland in 2018 after Britons voted to leave the bloc last year.",
        "date": "09192017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "Insurer XL Group to move EU unit to Ireland from Britain "
    },
    {
        "content": "Sept 19 Insurer XL Group Ltd said on Tuesday it would move its European Union insurance company from Britain to Ireland in 2018 after Britons voted to leave the bloc last year.",
        "date": "09192017",
        "name": "XL Group Ltd",
        "news_type": "normal",
        "symbol": "XL",
        "title": "UPDATE 1-Insurer XL Group to move EU unit to Ireland from Britain "
    },
    {
        "content": "* Says plans to move its principal EU insurance company  XL Insurance Company SE from UK to Ireland in 2018 in response to Brexit",
        "date": "09192017",
        "name": "XL Group Ltd",
        "news_type": "normal",
        "symbol": "XL",
        "title": "BRIEF-XL Group to move XL Insurance Company SE to Ireland "
    },
    {
        "content": "* XL Group Ltd receives full internal model approval from the Bermuda Monetary Authority",
        "date": "09122017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group receives internal model approval from the Bermuda Monetary Authority "
    },
    {
        "content": "* Jazz Pharmaceuticals and XL-protein GmbH enter into a license agreement on PASylation technology to develop long-acting asparaginase product candidates",
        "date": "07262017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-Jazz Pharmaceuticals and XL-protein GmbH enter into license agreement "
    },
    {
        "content": "* Xl group - total of $420.3 million aggregate liquidation preference or principal amount of securities validly tendered and not validly withdrawn in tender offers Source text for Eikon: Further company coverage:",
        "date": "07072017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XLIT announces results of its tender offers "
    },
    {
        "content": "* Xlit ltd. Announces waiver of financing condition for its previously announced tender offers; also announces amendment of price determination date for 2045 notes offer",
        "date": "06262017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-Xlit Ltd announces waiver of financing condition for its previously announced tender offers "
    },
    {
        "content": "* XL Group Ltd - priced a public offering of eur 500 000 000 aggregate principal amount of fixed to floating rate subordinated notes due 2047",
        "date": "06222017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group announces pricing of EUR subordinated notes "
    },
    {
        "content": "* Xl Group Ltd announces tender offers for up to $550 million aggregate maximum repurchase amount of certain outstanding securities of Xlit Ltd. and Catlin Insurance Company Ltd.",
        "date": "06072017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-Xl Group reports tender offers for up to $550 mln "
    },
    {
        "content": "* XL Catlin - has extended its global property insurance capacity by 25 percent to USD 500 million Source text for Eikon: Further company coverage:",
        "date": "06072017",
        "name": "XL Group Ltd",
        "news_type": "normal",
        "symbol": "XL",
        "title": "BRIEF-XL Catlin says extended its global property insurance capacity by 25 pct "
    },
    {
        "content": "* Announces retirement of Stephen Catlin as executive deputy chairman",
        "date": "04042017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group announces retirement of Stephen Catlin as executive deputy chairman "
    },
    {
        "content": "* Xl Group Ltd - CEO Michael Mcgavick's total compensation for 2016 was $12.7 million versus $12.7 million in 2015",
        "date": "04052017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-Xl Group Ltd's CEO's total compensation for 2016 was $12.7 mln "
    },
    {
        "content": "* XL Group Ltd says estimates pre-tax impact of rate change on co's carried reserves for relevant lines of business is about $75 million to be recognized in Q1 of 2017  Source text for Eikon: Further company coverage:",
        "date": "03012017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group Ltd announces estimated Ogden Rate change impact "
    },
    {
        "content": "* XL Group Ltd announces retirement of Peter Porrino as Chief Financial Officer; Stephen Robb  group controller  appointed as successor",
        "date": "02222017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group Ltd announces retirement of Peter Porrino as CFO "
    },
    {
        "content": "* XL Group Ltd announces $1 billion share buyback program and increase in quarterly dividend from $0.20 per common share to $0.22 per common share; also announces preference ordinary share dividends  Source text for Eikon:  Further company coverage:",
        "date": "02172017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group Ltd announces $1 bln share buyback program  increases quarterly dividend "
    },
    {
        "content": "* P&C combined ratio of 94.8% for quarter compared to 92.3% in prior year quarter",
        "date": "02012017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-Xl Group announces Q4 and full year 2016 results "
    },
    {
        "content": "* XL Catlin obtains final approval to establish an onshore reinsurance branch in India",
        "date": "01232017",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Catlin obtains final approval to establish an onshore reinsurance branch in India "
    },
    {
        "content": "* Says  fully diluted tangible book value per common share of $34.22 at Sept. 30  2016",
        "date": "10262016",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "BRIEF-XL Group Ltd says oper EPS $0.44 "
    },
    {
        "content": "NEW YORK Shares of insurer and reinsurer XL Group  could rise over 25 percent in the next year or so  partly since share repurchases will support the company's stock price  U.S. weekly investment publication Barron's said in its Dec. 14 edition.",
        "date": "12142015",
        "name": "XL Group Ltd",
        "news_type": "topStory",
        "symbol": "XL",
        "title": "XL Group shares could rise more than 25 percent in next year: Barron's "
    }
]