[
    {
        "content": "* EFI and Xerox announce next-generation fiery server for Xerox iGen 5 press Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-EFI and Xerox announce next-generation fiery server for Xerox iGen 5 press "
    },
    {
        "content": "Printer and copier maker Xerox Corp  reported higher-than-expected quarterly profit and revenue on Thursday  boosted by new product rollouts and cost cuts.",
        "date": "10262017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox profit  sales top estimates on cost cuts "
    },
    {
        "content": "Oct 26 Printer and copier maker Xerox Corp reported higher-than-expected quarterly profit and revenue on Thursday  boosted by new product rollouts and cost cuts.",
        "date": "10262017",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 1-Xerox profit  sales top estimates on cost cuts "
    },
    {
        "content": "* Xerox Corp - qtrly GAAP EPS from continuing operations of 67 cents ‍​",
        "date": "10262017",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox Corp Q3 adjusted EPS 89 cents‍​‍​ "
    },
    {
        "content": "Oct 26 Xerox Corp reported a 5 percent drop in quarterly revenue on Thursday  hurt by continued declines in the traditional paper printing and copying market.",
        "date": "10262017",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox's quarterly revenue dips 5 percent "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.25 per share Source text for Eikon: Further company coverage:",
        "date": "10172017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox sets quarterly cash dividend of $0.25 per share "
    },
    {
        "content": "SAN FRANCISCO  Sept 29 Uber Technologies Inc co-founder Travis Kalanick on Friday said that he had appointed two new board members  challenging Uber shareholders who have asked a court to stop the former chief executive from naming directors.",
        "date": "09302017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Uber's Kalanick says he appoints former Xerox  Merrill bosses to board "
    },
    {
        "content": "* Xerox Corp files for prospectus supplement related to potential senior notes offering; size not disclosed - SEC Filing‍​ Source text (http://bit.ly/2j54jNa) Further company coverage:",
        "date": "09072017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox Corp files for prospectus supplement related to potential senior notes offering  size not disclosed "
    },
    {
        "content": "* Xerox Corp files for exchange up to $300 million aggregate principal amount of outstanding 4.070% senior notes due 2022 - sec filing",
        "date": "08222017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox files for exchange up to $300 mln of outstanding senior notes "
    },
    {
        "content": "* Files for potential mixed shelf; size not disclosed - SEC filing‍​ Source text for Eikon: (http://bit.ly/2uBzsbN) Further company coverage:",
        "date": "08082017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox files for potential mixed shelf  size undisclosed "
    },
    {
        "content": "* Q2 earnings per share view $0.80 -- Thomson Reuters I/B/E/S",
        "date": "08012017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox reports Q2 adjusted earnings per share $0.87 "
    },
    {
        "content": "FRANKFURT VEON named former Xerox chief Ursula Burns as its chairwoman on Monday  as the telecoms operator undertakes corporate governance reforms and a makeover as a global online services company.",
        "date": "07242017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "VEON names former Xerox CEO Ursula Burns as chairwoman "
    },
    {
        "content": "FRANKFURT  July 24 VEON named former Xerox chief Ursula Burns as its chairwoman on Monday  as the telecoms operator undertakes corporate governance reforms and a makeover as a global online services company.",
        "date": "07242017",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 1-VEON names former Xerox CEO Ursula Burns as chairwoman "
    },
    {
        "content": "FRANKFURT  July 24 Global telecoms operator VEON has elected former Xerox Corp chief Ursula Burns as its chairman  the company said on Monday  part of corporate governance reforms that are designed to showcase its makeover as an online services player.",
        "date": "07242017",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "VEON board elects former Xerox CEO Ursula Burns as chairman "
    },
    {
        "content": "* Naver Corp - co  Xerox Corporation announced an agreement for Naver to acquire Xerox Research Centre Europe in Grenoble  France Source text for Eikon: Further company coverage:",
        "date": "06262017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Naver to buy Xerox Research Centre Europe "
    },
    {
        "content": "* Xerox’s global imaging systems acquires MT Business Technologies; expands presence in Ohio",
        "date": "05152017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox’s Global Imaging Systems acquires Mt Business Technologies "
    },
    {
        "content": "* CEO Ursula Burns' FY 2016 total compensation was $14.1 million versus $10.6 million in FY 2015 - sec filing Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox CEO Ursula Burns' FY 2016 total compensation was $14.1 mln "
    },
    {
        "content": "* Xerox announces expiration of offers to exchange outstanding notes",
        "date": "03282017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox announces expiration of offers to exchange outstanding notes "
    },
    {
        "content": "* Xerox Corp - CEO Ursula Burns' 2016 total compensation was $14.1  million versus $10.6 million in 2015 - sec filing",
        "date": "03242017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox Corp - CEO Ursula Burns' 2016 total compensation was $14.1 mln vs $10.6 mln in 2015 "
    },
    {
        "content": "* Xerox announces initial settlement of offers to exchange outstanding notes",
        "date": "03172017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox announces initial settlement of offers to exchange outstanding notes "
    },
    {
        "content": "* Xerox announces pricing terms of offers to exchange outstanding notes",
        "date": "03142017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox announces pricing terms of offers to exchange outstanding notes "
    },
    {
        "content": "NEW YORK Armed with a hefty dividend  Xerox Corp  shares look cheap even as they have shot up this year following the company's spin-off of its business processing business  according to an article in Barron's.",
        "date": "03052017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox shares look cheap even with stock's 2017 jump: Barron's "
    },
    {
        "content": "NEW YORK  March 5 Armed with a hefty dividend  Xerox Corp shares look cheap even as they have shot up this year following the company's spin-off of its business processing business  according to an article in Barron's.",
        "date": "03052017",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "REFILE-Xerox shares look cheap even with stock's 2017 jump - Barron's "
    },
    {
        "content": "* Says Xerox is targeting to exchange $300 million or more of existing debt for new debt",
        "date": "03012017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox announces offers to exchange outstanding notes "
    },
    {
        "content": "* Xerox-Worldwide employment which represents xerox post-separation  was about 37 600 as of dec 31  2016 and down by 2 400 from dec 31  2015-sec filing  Source text for Eikon:  Further company coverage:",
        "date": "02272017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox says worldwide employment which represents xerox post-separation  was about 37 600 as of Dec 31 "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.0625 per share  Source text for Eikon:  Further company coverage:",
        "date": "02242017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox sets quarterly cash dividend of $0.0625 per share "
    },
    {
        "content": "Feb 23 Activist investment fund Engaged Capital LLC on Thursday nominated five members for election to Rent-A-Center Inc's board  stepping up its efforts to push the furniture retailer to sell itself.",
        "date": "02232017",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 1-Engaged Capital seeks Rent-A-Center board change in push for company's sale "
    },
    {
        "content": "* Xerox and EFI partner to give customers best in class digital front ends",
        "date": "02022017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox and EFI partner to give customers best in class digital front ends "
    },
    {
        "content": "* Sees FY 2017 GAAP earnings per share $0.44 to $0.52 from continuing operations",
        "date": "01312017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox reports Q4 adjusted EPS of $0.25 "
    },
    {
        "content": "* Darwin A. Deason reports 6.08 percent passive stake in Xerox Corp as of December 31  2016 - SEC filing  Source text: (http://bit.ly/2kLX48W) Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "01302017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Darwin A. Deason reports 6.08 pct passive stake in Xerox Corp - SEC filing "
    },
    {
        "content": "* Xerox Corp - chief executive officer  Jeff Jacobson  joined Xerox's board of directors  effective January 26  2017.",
        "date": "01272017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox adds two new directors to board "
    },
    {
        "content": "* Has signed an agreement with Xerox corporation to partner in bulk piezoelectric (piezo) inkjet printheads.  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "01112017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xaar signs partnership deal with Xerox "
    },
    {
        "content": "* Xerox Corp - on June 12 Fujifilm released redacted japanese language version of independent investigation committee’s report",
        "date": "06142017",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox says Fujifilm releases redacted Japanese language version of independent investigation committee's report "
    },
    {
        "content": "* Xerox Corporation completes one-for-four reverse stock split Source text for Eikon: Further company coverage:",
        "date": "06142017",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox Corporation completes one-for-four reverse stock split "
    },
    {
        "content": "* Xerox corp - expects to complete separation on december 31  2016",
        "date": "11082016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox board approves terms of separation "
    },
    {
        "content": "* Xerox Corp - for Q4  management of Conduent expects revenue declines will be consistent with what it has experienced in prior fiscal quarter",
        "date": "11072016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox Corp says Conduent has no immediate plans to pay common dividends or repurchase shares after close of spin-off "
    },
    {
        "content": "Oct 31 Xerox Corp said on Friday it had settled with one of its biggest shareholders who had sued earlier to block a plan for spinning off its document outsourcing business into a new publicly traded company.",
        "date": "10312016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox settles with large investor over spin-off "
    },
    {
        "content": "Xerox Corp's  quarterly revenue fell nearly 3 percent  the seventh straight quarter of decline  as sales of its printers and copiers continued to fall.",
        "date": "10282016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox's quarterly revenue falls nearly 3 percent "
    },
    {
        "content": "Oct 28 Xerox Corp's quarterly revenue fell nearly 3 percent  the seventh straight quarter of decline  as sales of its printers and copiers continued to fall.",
        "date": "10282016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox's quarterly revenue falls nearly 3 pct "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.0775per share  Source text for Eikon:  Further company coverage:",
        "date": "10192016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox sets quarterly cash dividend of $0.0775 per share "
    },
    {
        "content": "Xerox Corp has been hit with a securities fraud lawsuit accusing it of concealing delays and cost overruns in a unit that focuses on helping states manage Medicaid payments.",
        "date": "10262016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Shareholder lawsuit accuses Xerox of hiding services setbacks "
    },
    {
        "content": "* U.S. Department of Agriculture has awarded Xerox a 10-year  $110 million contract for managed print services across all USDA agencies  Source text for Eikon:  Further company coverage:",
        "date": "10112016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-U.S. Dept of Agriculture awards Xerox $110 mln contract "
    },
    {
        "content": "Oct 13 One of Xerox Corp's largest shareholders sued the copier maker to block its plan for spinning off its document outsourcing business into a new publicly traded company.",
        "date": "10132016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox sued by large investor over plan to split company "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 11 (Fitch) Fitch Ratings expects to resolve the Watch Negative  and affirm Xerox Corporation's (Xerox) ratings  including the Long- and  Short-Term Issuer Default Ratings (IDR)  at 'BBB-/F3' upon its separation of  Conduent Incorporated (Conduent). Fitch expects the Rating Outlook will be  Negative.  Fitch's expected affirmation follows an Amendment to  Conduent's Registration  Statement on Form 10  which discloses Cond",
        "date": "10112016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Fitch Expects to Affirm Xerox at 'BBB-' Upon Separation; Outlook Negative "
    },
    {
        "content": "* Darwin Deason  Xerox's largest individual shareholder  sues to block split of company - CNBC  citing Dow Jones",
        "date": "10132016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox's largest individual shareholder sues to block split of company - CNBC  citing DJ "
    },
    {
        "content": "* Names Brian Webb-Walsh CFO of Conduent Incorporated  its post-separation business processing services company",
        "date": "09082016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox names Brian Webb-Walsh CFO of Conduent Inc "
    },
    {
        "content": "* Carl Icahn raises shared share stake in Xerox Corp by 7.2 percent to 99.03 million shares - SEC filing",
        "date": "08152016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Carl Icahn takes shared share stake in Allergan  raises in Xerox and AIG "
    },
    {
        "content": "* Says it anticipates financial market volatility related to brexit will likely continue into the future",
        "date": "08042016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox says Brexit did not have a material impact for period ended June 30 "
    },
    {
        "content": "Printer and copier maker Xerox Corp reported a higher-than-expected quarterly profit as restructuring efforts ahead of its planned split into two companies helped cut costs.",
        "date": "07292016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox profit beats estimates as cost cuts begin to pay off "
    },
    {
        "content": "* Revenue falls for 6th straight qtr   (Adds details  forecast  shares)",
        "date": "07292016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 2-Xerox profit beats estimates as cost cuts begin to pay off "
    },
    {
        "content": "July 29 Xerox Corp's quarterly revenue fell 4.4 percent  the sixth straight quarter of decline  as sales of its printers and copiers slid further and a strong dollar ate into revenue from markets outside the United States.",
        "date": "07292016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox's quarterly revenue falls 4.4 pct "
    },
    {
        "content": "* During q2  xerox reported progress on its planned separation into two independent  publicly traded companies",
        "date": "07292016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox Q2 adjusted earnings per share $0.30 "
    },
    {
        "content": "* Also declared a quarterly cash dividend of $20 per share on Xerox series a convertible perpetual preferred stock  Source text for Eikon:  Further company coverage:",
        "date": "07202016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox sets quarterly cash dividend of $0.0775/shr "
    },
    {
        "content": "Xerox Corp  privately rejected a bid to merge its document business with financial printing firm RR Donnelley & Sons Co   the Wall Street Journal reported Thursday.",
        "date": "07152016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox rejects RR Donnelley merger proposal: WSJ "
    },
    {
        "content": "* Xerox is said in talks to merge copy business with RR Donnelly - CNBC citing a report",
        "date": "07112016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox is said in talks to merge copy business with RR Donnelly- CNBC citing a report "
    },
    {
        "content": "Xerox Corp   which is on track to split into two companies by the end of the year  has been in talks to acquire financial printing firm RR Donnelley & Sons Co   according to two people familiar with the matter.",
        "date": "07122016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox in talks to buy financial printer RR Donnelley: sources "
    },
    {
        "content": "July 14 Xerox Corp privately rejected a bid to merge its document business with financial printing firm RR Donnelley & Sons Co  the Wall Street Journal reported Thursday.",
        "date": "07152016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox rejects RR Donnelley merger proposal - WSJ "
    },
    {
        "content": "* Xerox rejects proposed merger deal with RR Donnelly- CNBC  citing DJ    (Bengaluru Newsroom)",
        "date": "07152016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox rejects proposed merger deal with RR Donnelly - CNBC  citing DJ "
    },
    {
        "content": "* PARC says received funding from Defense Advanced Research Projects Agency under its Icarus program  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07112016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox's PARC receives funding from DARPA under its Icarus program "
    },
    {
        "content": "July 11 Xerox Corp  which is on track to split into two companies by the end of the year  has been in talks to acquire financial printing firm RR Donnelley & Sons Co   according to two people familiar with the matter.",
        "date": "07122016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 1-Xerox in talks to buy financial printer RR Donnelley - sources "
    },
    {
        "content": "July 11 Xerox Corp  which is on track to split into two companies by the end of the year  has been in talks to acquire financial printing firm RR Donnelley & Sons Co   according to two people familiar with the matter.",
        "date": "07122016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "REFILE-Xerox in talks to buy financial printer RR Donnelley - sources "
    },
    {
        "content": "* Xerox files Form 10 registration statement in connection with its planned separation of Conduent Inc  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06302016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox files Form 10 registration statement in connection with planned separation of Conduent Inc "
    },
    {
        "content": "* Carl Icahn posts 9.78 pct stake in Xerox Corp as of June 27 vs 9.18 pct stake as of Jan 28  - SEC Filing  Source text for Eikon: (http://1.usa.gov/2933Oge) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06272016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Carl Icahn posts 9.78 pct stake in Xerox Corp as of June 27 - SEC Filing "
    },
    {
        "content": "* Jonathan Christodoro has been appointed to Xerox board of directors",
        "date": "06272016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox names managing director of Icahn Capital LP to board "
    },
    {
        "content": "June 23 Xerox Corp said Jeff Jacobson  the president of its technology unit  would take over as chief executive after the company splits its business process outsourcing unit into a separate  publicly listed entity.",
        "date": "06232016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Jeff Jacobson to take over as Xerox Corp CEO after split "
    },
    {
        "content": "* Jeff Jacobson to become CEO of Xerox Corporation following completion of separation",
        "date": "06232016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Jeff Jacobson to become CEO of Xerox Corp following completion of separation "
    },
    {
        "content": "* Xerox to name Jeff Jacobson CEO after split - CNBC  citing DJ",
        "date": "06232016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox to name Jeff Jacobson CEO after split - CNBC  citing DJ "
    },
    {
        "content": "* Announced names of new companies that will be created following completion of its separation into two publicly traded companies",
        "date": "06162016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox Corp announces names of new companies following split "
    },
    {
        "content": "June 14 Xerox Corp said on Tuesday Ashok Vemuri will become the chief executive of its business process outsourcing unit after the company splits into two publicly traded entities.",
        "date": "06142016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox names Ashok Vemuri as CEO of post-split BPO business "
    },
    {
        "content": "* Xerox names Ashok Vemuri as CEO of post-separation business process outsourcing company",
        "date": "06142016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox names Ashok Vemuri CEO of BPO company post split "
    },
    {
        "content": "* Company declares quarterly cash dividend of 7.75 cents per share",
        "date": "05202016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox corp declares quarterly cash dividend of 7.75 cents per share "
    },
    {
        "content": "* Names Ursula Burns chairman of post -separation of Document Technology Company",
        "date": "05202016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox's Ursula Burns to be chairman of Document Technology's board post-separation "
    },
    {
        "content": "* Xerox Corp'BBB-/A-3' ratings remain on creditwatch negative pending business separation  Source text (http://bit.ly/1Qz6gVT) Further company coverage:",
        "date": "04262016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-S&P says Xerox corp'BBB-/A-3' ratings remain on creditwatch negative pending business separation "
    },
    {
        "content": "Xerox Corp  reported a 4.2 percent fall in quarterly revenue  hurt by lower sales of printers and copiers  and said it expects to incur about $100 million in restructuring costs in the second quarter.",
        "date": "04252016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox's revenue falls on lower printer sales "
    },
    {
        "content": "April 25 Xerox Corp reported a 4.2 percent fall in quarterly revenue  hurt by lower sales of printers and copiers  and said it expects to incur about $100 million in restructuring costs in the second quarter.",
        "date": "04252016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 5-Xerox's revenue falls on lower printer sales "
    },
    {
        "content": "* CEO On Separation - \"targeting to fill the top roles by midyear  \"  - conf call",
        "date": "04252016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Xerox Corp CEO says targeting to fill the top roles by midyear - CONF CALL "
    },
    {
        "content": "* Xerox reports first-quarter 2016 earnings and provides update on strategic transformation and separation",
        "date": "04252016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "REFILE-BRIEF-Xerox reports Q1 adjusted EPS $0.22 "
    },
    {
        "content": "April 25 Printer and copier maker Xerox Corp  reported a 4.2 percent fall in its quarterly revenue  hurt by a strong dollar.",
        "date": "04252016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Printer maker Xerox's revenue falls 4.2 pct "
    },
    {
        "content": "* CEO Ursula Burns' FY 2015 total compensation $10.6 million versus $22.2 million in FY 2014 - SEC filing",
        "date": "04042016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Xerox CEO's 2015 compensation was $10.6 mln  including $8 mln stock awards "
    },
    {
        "content": "Paul  Weiss  Rifkind  Wharton & Garrison LLP said on Sunday it had hired Scott Barshay  one of rival U.S. law firm Cravath  Swaine & Moore LLP's most prolific dealmakers  as its global head of mergers and acquisitions.",
        "date": "04042016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Law firm Paul Weiss hires Cravath M&A rainmaker Barshay "
    },
    {
        "content": "April 3 Paul  Weiss  Rifkind  Wharton & Garrison LLP said on Sunday it had hired Scott Barshay  one of rival U.S. law firm Cravath  Swaine & Moore LLP's most prolific dealmakers  as its global head of mergers and acquisitions.",
        "date": "04042016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "CORRECTED-MOVES-Law firm Paul Weiss hires Cravath M&A rainmaker Barshay "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 11 (Fitch) Fitch Ratings has assigned a 'BBB-' rating to Xerox  Corporation's (Xerox) $1 billion senior unsecured term loan. Pro forma for the  term loan  Fitch rates $10.4 billion of total debt including the undrawn $2  billion revolving credit facility (RCF). Fitch's ratings on Xerox  including the  Long-Term Issuer Default Rating (IDR) of 'BBB-'  remain on Rating Watch Negative  pending clarification on the ultimate co",
        "date": "03112016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Fitch Rates Xerox's $1B Unsecured Term Loan 'BBB-' "
    },
    {
        "content": "Feb 2 Financial advisory and asset manager Lazard Ltd's results on Tuesday easily beat lowered Wall Street estimates in a quarter battered by volatile market conditions.",
        "date": "02022016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 3-Lazard profit beats estimates in difficult quarter "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 04 (Fitch) The cost of credit protection for Xerox  Corporation continues to rise as steadily widening credit default swap (CDS)  spreads will attest  according to Fitch Solutions in its latest CDS Case Study  Snapshot. Five-year CDS spreads on Xerox widened 31% over the past week and are 244% wider  compared to levels seen at this time one year ago.  Credit protection on Xerox's  debt is now pricing in 'BB' territory",
        "date": "02042016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Fitch Solutions: Xerox CDS Reach Widest Level in Four Years "
    },
    {
        "content": "Xerox Corp  will split into two companies  one holding its legacy printer operations and the other its business process outsourcing unit  it said on Friday  in a bid to be more nimble after years of trying to integrate the businesses. | Video ",
        "date": "01292016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox to split into two companies  Icahn to get board seats on one "
    },
    {
        "content": "Jan 29 Xerox Corp will split into two companies  one holding its legacy printer operations and the other its business process outsourcing unit  it said on Friday  in a bid to be more nimble after years of trying to integrate the businesses.",
        "date": "01292016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 3-Xerox to split into two companies  Icahn to get board seats on one "
    },
    {
        "content": "Jan 29 Xerox Corp said it would split into two companies  one holding its legacy hardware operations and the other its business process outsourcing unit.",
        "date": "01292016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Printer maker Xerox to split into two "
    },
    {
        "content": "Xerox Corp will split into two companies and give activist investor Carl Icahn three seats on the board of one of the companies  the Wall Street Journal reported.",
        "date": "01292016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox to split in two; give Icahn three board seats: WSJ "
    },
    {
        "content": "Jan 28 Xerox Corp will split into two companies and give activist investor Carl Icahn three seats on the board of one of the companies  the Wall Street Journal reported.",
        "date": "01282016",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "UPDATE 1-Xerox to split in two; give Icahn 3 board seats - WSJ "
    },
    {
        "content": "Jan 28 Xerox Corp will split into two companies and give billionaire activist investor Carl Icahn three board seats on one of the companies  the Wall Street journal reported.",
        "date": "01282016",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox Corp to split in two; give Icahn 3 board seats - WSJ "
    },
    {
        "content": "Activist investor Carl Icahn disclosed a stake in Xerox Corp  and called the printer and copier maker's shares \"undervalued \" sending the stock up 7.6 percent in extended trade.",
        "date": "11242015",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Icahn takes stake in Xerox  calls shares 'undervalued' "
    },
    {
        "content": "Nov 23 Activist investor Carl Icahn disclosed a stake in Xerox Corp and called the printer and copier maker's shares \"undervalued \" sending the stock up 7.6 percent in extended trade.",
        "date": "11242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 3-Icahn takes stake in Xerox  calls shares 'undervalued' "
    },
    {
        "content": "Activist investor Carl Icahn disclosed a stake in Xerox Corp   and called the printer and copier maker's shares \"undervalued\"  sending its shares up 7.6 percent in extended trade.",
        "date": "11232015",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Icahn takes stake in Xerox  calls shares 'undervalued' "
    },
    {
        "content": "Nov 23 Activist investor Carl Icahn disclosed a stake in Xerox Corp  and called the printer and copier maker's shares \"undervalued\"  sending its shares up 7.6 percent in extended trade.",
        "date": "11232015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 2-Icahn takes stake in Xerox  calls shares \"undervalued\" "
    },
    {
        "content": "Nov 23 Activist investor Carl Icahn said he had taken a a 7.13 percent stake in Xerox Corp  best known for its printers and copiers.",
        "date": "11232015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "CORRECTED-Icahn takes 7.13 pct stake in Xerox "
    },
    {
        "content": "Xerox Corp   best known for its printers and copiers  said it would review its businesses and capital allocation options  but was not currently considering a sale of the company.",
        "date": "10262015",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox to review operations  not considering sale of company "
    },
    {
        "content": "* Shares fall 3 pct   (Adds analyst comment  details; updates shares)",
        "date": "10262015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 3-Xerox to review operations  not considering sale of company "
    },
    {
        "content": "Oct 26 Xerox Corp reported a 9.6 percent fall in quarterly revenue  hurt by lower printer sales and a strong dollar  and said it would review its operations.",
        "date": "10262015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "REFILE-Xerox revenue falls 9.6 pct; says to review operations "
    },
    {
        "content": "LONDON  Oct 5 Diageo has hired Kathryn Mikells from Xerox as its new chief financial officer  it said on Monday  as the world's largest spirits company navigates its way through a downturn.",
        "date": "10052015",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox CFO Mikells moves to Diageo "
    },
    {
        "content": "* Mikells joins from Xerox Corporation  where she is currently CFO  a position she has held since May 2013  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom + 91 80 6749 1136)",
        "date": "10052015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "BRIEF-Diageo names Xerox's Kathryn Mikells as CFO "
    },
    {
        "content": "Xerox Corp  barely managed to eke out a profit in the second quarter after the printer and copier maker took a charge related to a revamp of its business that provides administrative and care-management services to government healthcare programs.",
        "date": "07242015",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Restructuring charges mostly wipe out Xerox's second-quarter profit "
    },
    {
        "content": "July 24 Xerox Corp barely managed to eke out a profit in the second quarter after the printer and copier maker took a charge related to a revamp of its business that provides administrative and care-management services to government healthcare programs.",
        "date": "07242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 2-Restructuring charges mostly wipe out Xerox's 2nd-qtr profit "
    },
    {
        "content": "July 24 Xerox Corp's second-quarter profit was nearly wiped out by a restructuring charge related to a revamp of its government healthcare business.",
        "date": "07242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Restructuring charge hits Xerox second-quarter profit "
    },
    {
        "content": "Xerox Corp said it would revamp its healthcare IT business and record a related impairment charge of about $145 million in the second quarter.",
        "date": "07172015",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox to revamp healthcare business  book charge "
    },
    {
        "content": "July 17 Xerox Corp said it would revamp its healthcare IT business and record a related impairment charge of about $145 million in the second quarter.",
        "date": "07172015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 1-Xerox to revamp healthcare business  book charge "
    },
    {
        "content": "July 17 Xerox Corp said it would revamp its healthcare IT business and record a related impairment charge of about $145 mln in the second quarter.",
        "date": "07172015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "CORRECTED-Xerox to revamp healthcare business  records charge "
    },
    {
        "content": "* Indexes ends up: Dow 0.12 pct  S&P 0.23 pct  Nasdaq 0.71 pct   (Updates to close)",
        "date": "04242015",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "US STOCKS-Tech triumvirate propels Nasdaq  S&P to record highs "
    },
    {
        "content": "Xerox Corp cut its full-year profit forecast  blaming a strong dollar  and the company reported lower-than-expected quarterly revenue as its printer sales fell and costs rose.",
        "date": "04242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox cuts 2015 profit forecast due to strong dollar "
    },
    {
        "content": "* Cuts adj. profit forecast to 95 cents-$1.01/shr from $1-$1.06",
        "date": "04242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 3- Xerox cuts 2015 profit forecast due to strong dollar "
    },
    {
        "content": "* Amazon shares touch life high after revenue beats estimates",
        "date": "04242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "US STOCKS-Nasdaq hits 15-year high  propelled by tech triumvirate "
    },
    {
        "content": "* Amazon shares touch life high after revenue beats estimates",
        "date": "04242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "US STOCKS-Nasdaq hits 15-year high  propelled by Amazon  Microsoft "
    },
    {
        "content": "* Amazon shares touch life high after revenue beats estimates",
        "date": "04242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "US STOCKS-Wall St opens up  Nasdaq set to extend record "
    },
    {
        "content": "* Comcast shares up after it calls off Time Warner Cable merger",
        "date": "04242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "US STOCKS-Wall St to open up on tech earnings  Nasdaq to extend record "
    },
    {
        "content": "April 24 Xerox Corp  best known as a maker of printers and copiers  reported a 6 percent fall in quarterly revenue  hurt by lower printer sales and a stronger dollar.",
        "date": "04242015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox revenue dips as printer sales fall "
    },
    {
        "content": "Xerox Corp   which has been shifting its focus to IT services from making printers and copiers  cut its profit forecast for 2015 for the second time after reporting its sixth-consecutive drop in quarterly revenue.",
        "date": "01302015",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "Xerox cuts profit forecast again as revenue slide continues "
    },
    {
        "content": "Jan 30 Xerox Corp  which has been shifting its focus to IT services from making printers and copiers  cut its profit forecast for 2015 for the second time after reporting its sixth-consecutive drop in quarterly revenue.",
        "date": "01302015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "UPDATE 2-Xerox cuts profit forecast again as revenue slide continues "
    },
    {
        "content": "Jan 30 Xerox Corp  best known as a maker of printers and copiers  reported a 3.5 percent fall in quarterly revenue as printer sales declined.",
        "date": "01302015",
        "name": "Xerox Corporation",
        "news_type": "normal",
        "symbol": "XRX",
        "title": "Xerox revenue falls as printer sales decline "
    },
    {
        "content": "* As a core element of the agreement  Xerox has licensed Thinfilm's proprietary technology to manufacture Thinfilm Memory labels",
        "date": "01212015",
        "name": "Xerox Corporation",
        "news_type": "topStory",
        "symbol": "XRX",
        "title": "BRIEF-Thinfilm announces partnership with Xerox for mass production of Thinfilm Memory Labels "
    }
]