[
    {
        "content": "BARCELONA Russian internet group Yandex is targeting a 50 percent share of the mobile search market in Russia after Google was forced to open up Android to rival search engines  CFO Greg Abovsky said on Thursday.",
        "date": "11162017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "Yandex aims for 50 percent mobile search share in Russia: CFO "
    },
    {
        "content": "BARCELONA  Nov 16 Russian internet group Yandex is targeting a 50 percent share of the mobile search market in Russia after Google was forced to open up Android to rival search engines  CFO Greg Abovsky said on Thursday.",
        "date": "11162017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "Yandex aims for 50 pct mobile search share in Russia - CFO "
    },
    {
        "content": "MOSCOW  Oct 24 Russia's biggest search engine Yandex said on Tuesday its adjusted net profit fell by 37 percent in the third quarter of 2017 to 2.4 billion roubles ($41.75 million)  year-on-year.",
        "date": "10242017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "Russia's Yandex Q3 adjusted net profit down 37 pct to 2.4 bln rbls  y/y "
    },
    {
        "content": "* Q3 revenue RUB 23.4 billion versus I/B/E/S view RUB 23.45 billion",
        "date": "10242017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "BRIEF-Yandex announces third quarter 2017 financial results "
    },
    {
        "content": "MOSCOW  Aug 9 Russia's biggest search engine Yandex said on Wednesday it would set up an e-commerce joint venture with Russia's biggest bank Sberbank on the Yandex.Market platform.",
        "date": "08092017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "Russia's Yandex sets up e-commerce venture with Sberbank "
    },
    {
        "content": "* Yandex and Sberbank join forces to boost ecommerce development",
        "date": "08092017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "BRIEF-Russia's Yandex says Sberbank to invest about $500 mln into Yandex.market "
    },
    {
        "content": "* Qtrly adjusted net income of RUB 4.0 billion ($67.5 million)  up 2% compared with Q2 2016",
        "date": "07282017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "BRIEF-Yandex Q2 net income RUB 3.5 billion "
    },
    {
        "content": "* Says Didi  SoftBank to lead fundraising with $2 bln investment",
        "date": "07242017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "UPDATE 3-Ride-hailing firm Grab to get $2.5 bln as firms pump funds into SE Asia startups "
    },
    {
        "content": "July 28 Russia's largest internet group Yandex said on Friday:",
        "date": "07282017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "BRIEF-Russia's Yandex Q2 net income up 69 pct y/y "
    },
    {
        "content": "FRANKFURT/MOSCOW Uber and Yandex  the \"Google of Russia\"  have agreed to combine their Russian ride-sharing businesses  with Yandex the leading partner in a deal that extends to five nearby markets. | Video ",
        "date": "07132017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "Uber and Yandex to combine ride-hailing in Russia and beyond "
    },
    {
        "content": "* Yandex shares jump 20 pct; Yandex.Taxi half group value (Updates shares; Yandex.Taxi now half of parent's value)",
        "date": "07132017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "UPDATE 3-Uber and Yandex to combine ride-hailing in Russia and beyond "
    },
    {
        "content": "* Yandex and Uber to combine their ridesharing businesses in russia and neighboring countries",
        "date": "07132017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "BRIEF-Yandex and Uber to combine their ridesharing businesses in Russia and neighboring countries "
    },
    {
        "content": "MOSCOW  June 1 Russia's top search site Yandex has decided to close its offices in the Ukrainian cities of Kiev and Odessa  the company said on Thursday.",
        "date": "06012017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "UPDATE 1-Russia's Yandex to close offices in Ukraine's Odessa and Kiev "
    },
    {
        "content": "MOSCOW  June 1 Russia's top search site Yandex has decided to close its offices in the Ukrainian cities of Kiev and Odessa  RIA news agency cited the company as saying on Thursday.",
        "date": "06012017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "Russia's Yandex to close offices in Ukraine's Odessa and Kiev -RIA "
    },
    {
        "content": "KIEV/MOSCOW Ukraine's State Security Service (SBU) raided the Kiev and Odessa offices of Russia's top search site Yandex on Monday  accusing the company of illegally collecting Ukrainian users' data and sending it to Russian security agencies.",
        "date": "05292017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "Investigators search Ukrainian offices of Russia's Yandex "
    },
    {
        "content": "KIEV/MOSCOW May 29 Ukraine's State Security Service (SBU) raided the Kiev and Odessa offices of Russia's top search site Yandex on Monday  accusing the company of illegally collecting Ukrainian users' data and sending it to Russian security agencies.",
        "date": "05292017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "UPDATE 1-Investigators search Ukrainian offices of Russia's Yandex "
    },
    {
        "content": "MOSCOW  May 16 Russia's top search site Yandex said on Tuesday it did not expect Ukraine sanctions to have a material negative impact on its consolidated results.",
        "date": "05162017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "Russia's Yandex sees no negative impact from Ukraine sanctions "
    },
    {
        "content": "KIEV  May 16 Ukraine has imposed sanctions on Russia's largest internet group Yandex and other popular web businesses including the operator of social media sites Vkontakte and Odnoklassniki  the president's office said on Tuesday.",
        "date": "05162017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "Ukraine slaps sanctions on Russia's Yandex  other web businesses "
    },
    {
        "content": "MOSCOW Russia's largest internet group Yandex  on Thursday raised its sales outlook for the year after settling a dispute with Google  over product distribution on the U.S. company's Android operating system.",
        "date": "04272017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "Yandex raises revenue forecast  talks up dividend prospect "
    },
    {
        "content": "MOSCOW  April 27 Russia's largest internet group Yandex on Thursday raised its sales outlook for the year after settling a dispute with Google over product distribution on the U.S. company's Android operating system.",
        "date": "04272017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "UPDATE 1-Yandex raises revenue forecast  talks up dividend prospect "
    },
    {
        "content": "MOSCOW  April 27 Russia's largest internet group Yandex on Thursday raised its sales outlook for the year after settling a dispute with Google over product distribution on the U.S. company's Android operating system.",
        "date": "04272017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "CORRECTED-Russia's Yandex ups revenue forecast after Google settlement "
    },
    {
        "content": "* Qtrly revenues of RUB 20.7 billion ($366.3 million)  up 25% compared with Q1 2016",
        "date": "04272017",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "BRIEF-Yandex Q1 2017 revenues of RUB 20.7 bln  up 25 pct compared with Q1 2016 "
    },
    {
        "content": "MOSCOW  April 17 Alphabet Inc's Google will open up its popular Android mobile operating system to rival search engines in Russia as part of a deal to settle a two-year dispute with Russian competition authorities.",
        "date": "04172017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "UPDATE 2-Google to open up Android to rivals in out-of-court deal with Russia "
    },
    {
        "content": "* Expects consolidated revenue to grow in the range of 16 percent to 19 percent in the full year 2017 vs. 2016.",
        "date": "02162017",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "BRIEF-Russia's Yandex sees 2017 revenue rising 16-19 pct "
    },
    {
        "content": "* Yandex says launch of its global partnership program for android handset manufacturers and telecom operators",
        "date": "10122016",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "BRIEF-Yandex launches global partnership program for android handset manufacturers  telecom operators "
    },
    {
        "content": "* Yandex has terminated the framework agreement entered into on Feb. 19  2016  with Krasnaya Roza 1875 Limited  a Cypriot company  pursuant to which Yandex was to become the sole owner of the company which holds title to the office complex  Red Rose  in central Moscow that houses Yandex's Russian headquarters.",
        "date": "09082016",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "BRIEF-Yandex terminates agreement to buy its Moscow headquarters "
    },
    {
        "content": "MOSCOW  July 28 Russia's biggest Internet search company  Yandex  on Thursday upgraded its full-year revenue growth outlook for the second time this year.",
        "date": "07282016",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "Russia's Yandex again lifts full-year revenue outlook "
    },
    {
        "content": "* Q1 adjusted net income of rub 3.2 billion ($46.9 million)  up 41% compared with q1 2015",
        "date": "04282016",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "BRIEF-Yandex announces Q1 financial results "
    },
    {
        "content": "* Q1 net profit falls 50 percent year-on-year to 1.1 billion roubles ($17 million) mainly due to a foreign exchange loss;",
        "date": "04282016",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "BRIEF-Russia's Yandex says Q1 net profit down 50 pct on forex loss "
    },
    {
        "content": "* Yandex announces passing of Alfred Fenaughty  Director and Chairman",
        "date": "03282016",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "BRIEF-Yandex announces passing of Alfred Fenaughty  Chairman "
    },
    {
        "content": "* Q4 2015 net income totalled 2.9 billion roubles ($37.5 million)  down 62 percent compared with Q4 2014;",
        "date": "02162016",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "BRIEF-Russia's Yandex expects 12-18 pct revenue growth in 2016 "
    },
    {
        "content": "MOSCOW  Nov 17 Google will contest in court a ruling by Russia's antitrust agency that it broke competition law by abusing its dominant position with its Android mobile platform  the U.S. technology company said on Tuesday.",
        "date": "11172015",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "UPDATE 1-Google to contest Russia's antitrust ruling on Android "
    },
    {
        "content": "MOSCOW  Nov 13 Russia's biggest search site Yandex said on Friday it had asked the European Commission to investigate Google's practices in relation to its Android mobile operating system in the European Union.",
        "date": "11132015",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "Russia's Yandex says complained to EU over Google's Android "
    },
    {
        "content": "MOSCOW  Nov 13 Russia's biggest search site Yandex said on Friday it had asked the European Commission to investigate Google's practices in relation to its Android mobile operating system in the European Union.",
        "date": "11132015",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "UPDATE 1-Russia's Yandex says complained to EU over Google's Android "
    },
    {
        "content": "MOSCOW Russia's anti-monopoly agency said on Monday Google Inc  was abusing its market position in the country and would face penalties  in a case launched by local competitor Yandex  .",
        "date": "09142015",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "Russian watchdog says Google violating competition law "
    },
    {
        "content": "MOSCOW  Sept 14 Russia's anti-monopoly agency said on Monday Google Inc was abusing its market position in the country and would face penalties  in a case launched by local competitor Yandex .",
        "date": "09142015",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "UPDATE 2-Russian watchdog says Google violating competition law "
    },
    {
        "content": "* According to the agreement revenue will be gained by number of searches performed on www.fbyandex.com.tr",
        "date": "08182015",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "BRIEF-Fenerbahce signs advertising agreement with Yandex "
    },
    {
        "content": "MOSCOW  July 30 Russia's biggest search site  Yandex   said on Thursday its second quarter net profit fell 82 percent to 0.4 billion roubles ($6.74 million)  year-on-year.",
        "date": "07302015",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "Russia's Yandex says Q2 net profit down 82 pct  y/y "
    },
    {
        "content": "MOSCOW  April 28 Russia's biggest Internet search engine Yandex  said on Tuesday its first-quarter net profit fell 21 percent year-on-year to 2.1 billion roubles ($40.5 million) due to an increase in personnel and rent expenses.",
        "date": "04282015",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "UPDATE 1-Russia's Yandex Q1 profit falls  sees sales growth slowing "
    },
    {
        "content": "MOSCOW  April 28 Russia's biggest search site Yandex  said on Tuesday its first-quarter net profit fell 21 percent  year-on-year  to 2.1 billion roubles ($40.5 million) due to an increase in personnel and rent expenses.",
        "date": "04282015",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "Russia's Yandex says Q1 profit falls  sees sales growth slowing "
    },
    {
        "content": "NEW YORK  April 21 The European Union's antitrust probe into Google sparked a big rally in Russian search engine Yandex NV  last week  even though the \"Russian Google\" still faces significant challenges  competitive and otherwise.",
        "date": "04212015",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "EU Google probe encourages investors in Russia competitor Yandex "
    },
    {
        "content": "* Yandex search market share falls below 60 pct   (Adds anti-trust application  Google comment)",
        "date": "02182015",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "UPDATE 2-Russia's Yandex seeks Google probe as market share falls "
    },
    {
        "content": "MOSCOW  Feb 20 Russia's competition watchdog said on Friday it had opened a case against Google Inc  over alleged violation of anti-monopoly law  following a complaint from Russia's biggest search site Yandex NV  over Google's mobile platform.",
        "date": "02202015",
        "name": "Yandex NV",
        "news_type": "topStory",
        "symbol": "YNDX",
        "title": "UPDATE 2-Russian competition watchdog opens case against Google "
    },
    {
        "content": "MOSCOW  Feb 18 Russia's biggest Internet search engine Yandex said on Wednesday it expected first-quarter revenues to grow by about 15 percent  year-on-year  after a 21 percent growth rate in the previous quarter.",
        "date": "02182015",
        "name": "Yandex NV",
        "news_type": "normal",
        "symbol": "YNDX",
        "title": "Russia's Yandex sees revenue growth slowing to 15 pct in Q1 "
    }
]