[
    {
        "content": "Nov 9 Argentina's state-run oil company YPF is \"disappointed\" by cuts to the government's natural gas production subsidies and will re-allocate investment toward crude oil production  an executive said on Thursday.",
        "date": "11092017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "UPDATE 1-Argentina's YPF to boost crude investment amid natgas subsidy cuts "
    },
    {
        "content": "BUENOS AIRES/NEW YORK Argentina's state-controlled energy company YPF plans to invest $21.5 billion in the country from 2018 to 2022 and increase oil production by 26 percent as it considers reshuffling its generation  distribution and refinery assets.",
        "date": "10252017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF to invest $21.5 billion from 2018 to 2022 "
    },
    {
        "content": "BUENOS AIRES/NEW YORK  Oct 25 Argentina's state-controlled energy company YPF plans to invest $21.5 billion in the country from 2018 to 2022 and increase oil production by 26 percent as it considers reshuffling its generation  distribution and refinery assets.",
        "date": "10252017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 2-Argentina's YPF to invest $21.5 bln from 2018 to 2022 "
    },
    {
        "content": "BUENOS AIRES The chief executive officer of YPF SA  Argentina's state-owned oil company  has resigned and a six-member executive committee will run the company  it said on Monday.",
        "date": "08282017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF CEO resigns  six-member executive committee to run firm "
    },
    {
        "content": "OSLO Norway's Statoil has signed a deal with Argentina's leading energy company YPF to jointly explore for onshore shale oil and gas resources in the Vaca Muerta formation  the company said on Friday.",
        "date": "08252017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Statoil  YPF to explore shale oil  gas in Argentina "
    },
    {
        "content": "BUENOS AIRES  Aug 28 The chief executive officer of YPF SA  Argentina's state-owned oil company  has resigned and a six-member executive committee will run the company  it said on Monday.",
        "date": "08282017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 1-Argentina's YPF CEO resigns  6-member exec committee to run firm "
    },
    {
        "content": "OSLO  Aug 25 Norway's Statoil has signed a deal with Argentina's leading energy company YPF to jointly explore for onshore shale oil and gas resources in the Vaca Muerta formation  the company said on Friday.",
        "date": "08252017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 1-Statoil  YPF to explore shale oil  gas in Argentina "
    },
    {
        "content": "OSLO  Aug 25 Norway's Statoil has signed a deal with Argentina's leading energy company YPF to jointly explore for onshore shale oil and gas resources in the Vaca Muerta formation  the company said on Friday.",
        "date": "08252017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Statoil to explore for shale oil  gas in Argentina "
    },
    {
        "content": "BUENOS AIRES Argentina’s state-run petroleum company YPF SA forecasts that its production will increase in 2018 after contracting this year  as the number of rigs operating in the country rises  the company's chairman said on Monday.",
        "date": "08072017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "YPF chairman sees turning point in Argentina oil  gas output "
    },
    {
        "content": "BUENOS AIRES  July 18 Argentina's state-run oil firm YPF SA  France's Total  Wintershall Energía SA and BP unit Pan American Energy LLC announced on Tuesday a $1.15 billion joint investment to increase shale gas production. (Reporting by Eliana Raszewski; Writing by Caroline Stauffer and Luc Cohen; Editing by Jonathan Oatis)",
        "date": "07182017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Total  BP unit  YPF announce $1.15 bln investment in Argentina "
    },
    {
        "content": "BUENOS AIRES  July 18 Argentina's state-run oil firm YPF SA  France's Total SA  Wintershall Energía SA and BP unit Pan American Energy LLC announced a $1.15 billion joint investment on Tuesday to increase shale gas production.",
        "date": "07182017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 2-Total  BP unit  YPF boost investment in Argentina's Vaca Muerta "
    },
    {
        "content": "BUENOS AIRES  July 14 Argentina's state-run oil company YPF SA is in talks with General Electric Co to sell a 49 percent stake in its electricity generation subsidiary  local newspaper Clarin reported.",
        "date": "07142017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF eyes sale of electricity subsidiary stake to GE -media "
    },
    {
        "content": "* GE and YPF secure financing for two fastpower projects in Argentina ‍​",
        "date": "07052017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "BRIEF-GE and YPF secure financing for two fastpower projects in Argentina ‍​ "
    },
    {
        "content": "MEXICO CITY Private equity group Riverstone Holdings and Miguel Galuccio  a former chief executive of Argentine state-owned oil company YPF  aim to raise $500 million in Mexico's first-ever stock market listing of a special purpose acquisition company  according to two people familiar with the plan.",
        "date": "06292017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Investors plan $500 million Mexico market listing to buy energy assets: sources "
    },
    {
        "content": "LOMA CAMPANA  Argentina Longer horizontal wells and technology improvements will help Argentine state-run oil company YPF SA lower costs at its most productive shale field  but better infrastructure is still needed in the remote Vaca Muerta play  an executive said.",
        "date": "06232017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF says technology lowering its shale costs "
    },
    {
        "content": "MEXICO CITY  June 29 Private equity group Riverstone Holdings and Miguel Galuccio  a former chief executive of Argentine state-owned oil company YPF  aim to raise $500 million in Mexico's first-ever stock market listing of a special purpose acquisition company  according to two people familiar with the plan.",
        "date": "06292017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Investors plan $500 mln Mexico market listing to buy energy assets -sources "
    },
    {
        "content": "LOMA CAMPANA  Argentina  June 23 Longer horizontal wells and technology improvements will help Argentine state-run oil company YPF SA lower costs at its most productive shale field  but better infrastructure is still needed in the remote Vaca Muerta play  an executive said.",
        "date": "06232017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 2-Argentina's YPF says technology lowering its shale costs "
    },
    {
        "content": "LOMA CAMPANA  Argentina  June 23 Breakeven prices in Argentina's Loma Campana shale field are $43 per barrel and falling while development costs are $12.90 per barrel and expected to fall to $10 per barrel by the end of 2018  an executive at state-run oil firm YPF said.",
        "date": "06232017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF says costs falling in Loma Campana shale field "
    },
    {
        "content": "BUENOS AIRES  May 9 Argentina's state-run oil firm YPF SA posted first-quarter profit of 192 million pesos ($12.47 million)  down 78 percent from 855 million pesos a year earlier  the company said on Tuesday.",
        "date": "05092017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "UPDATE 1-Argentina's YPF first-qtr profit slides 78 pct from year ago "
    },
    {
        "content": "BUENOS AIRES  May 9 Argentina's state-run oil firm YPF SA posted first-quarter profit of 192 million pesos ($12.47 million)  down 78 percent from 855 million pesos a year earlier  the company said on Tuesday.",
        "date": "05092017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF posts first-qtr profit down 78 pct from previous year "
    },
    {
        "content": "* Qtrly GAAP EPS  including Cameron integration charges of $0.05 per share  was $0.20",
        "date": "04212017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "BRIEF-Schlumberger posts qtrly GAAP EPS of $0.20 "
    },
    {
        "content": "BOSTON/BUENOS AIRES Argentina’s state-run oil company YPF SA is among the bidders for Royal Dutch Shell Plc's refinery and network of gasoline stations in Argentina  according to two people familiar with the process.",
        "date": "04102017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "YPF among bidders for Shell's Argentina refinery: sources "
    },
    {
        "content": "BUENOS AIRES  April 12 Argentina's state-run oil company YPF SA and Schlumberger AG  the world's top oil services provider  have reached a deal to invest $390 million in the Vaca Muerta shale formation  the companies said on Wednesday.",
        "date": "04122017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "UPDATE 1-Schlumberger to invest $390 mln in Argentina's Vaca Muerta "
    },
    {
        "content": "BOSTON/BUENOS AIRES  April 10 Argentina’s state-run oil company YPF SA is among the bidders for Royal Dutch Shell Plc's refinery and network of gasoline stations in Argentina  according to two people familiar with the process.",
        "date": "04102017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "YPF among bidders for Shell's Argentina refinery -sources "
    },
    {
        "content": "BUENOS AIRES  April 12 Argentina's state-run oil company YPF SA and Schlumberger AG  the world's top oil services provider  have reached a deal to invest $390 million in the Vaca Muerta shale field in Patagonia  YPF said on Wednesday.",
        "date": "04122017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF  Schlumberger reach deal to invest $390 mln in Vaca Muerta "
    },
    {
        "content": "BUENOS AIRES  March 9 Argentina's state-controlled oil firm YPF SA recorded a net profit of 1.8 billion pesos ($114.38 million) and revenue of 54.6 billion pesos ($3.52 billion) in the fourth quarter of 2016  the company said on Thursday.",
        "date": "03092017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF has $114 mln Q4 net profit  $3.5 bln revenue "
    },
    {
        "content": "HOUSTON Argentina's state-run oil company YPF has cut horizontal drilling costs by more than half and slashed the time required to complete new wells  the chairman said on Monday at the CERAWeek energy conference.",
        "date": "03072017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina slashes drilling costs  sees more efficiencies "
    },
    {
        "content": "HOUSTON  March 6 Argentina's state-run oil company YPF has cut horizontal drilling costs by more than half and slashed the time required to complete new wells  the chairman said on Monday at the CERAWeek energy conference.",
        "date": "03072017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "CERAWEEK-Argentina slashes drilling costs  sees more efficiencies "
    },
    {
        "content": "BUENOS AIRES Argentina's state-run oil company YPF SA said it reached a preliminary deal with Royal Dutch Shell Plc on Thursday to develop oil and gas assets in the Vaca Muerta shale field  involving a $300 million investment from Shell.",
        "date": "02242017",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "YPF  Shell sign deal for Vaca Muerta pilot project "
    },
    {
        "content": "BUENOS AIRES  Feb 23 Argentina's state-run oil company YPF SA said it reached a preliminary deal with Royal Dutch Shell Plc on Thursday to develop oil and gas assets in the Vaca Muerta shale field  involving a $300 million investment from Shell.",
        "date": "02242017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 2-YPF  Shell sign deal for Vaca Muerta pilot project "
    },
    {
        "content": "BUENOS AIRES  Jan 11 Argentina made a move to lower its high labor costs this week with a deal to reduce benefits for workers in the country's immense Vaca Muerta shale oil formation  but the resource may remain largely untapped until world oil prices recover further.",
        "date": "01112017",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's Vaca Muerta shale may not be developed until oil prices rise "
    },
    {
        "content": "BUENOS AIRES Some 23 000 Argentine oil and gas workers will go on a 48-hour strike beginning on Monday to protest state-owned oil company YPF SA's decision to lay off at least 1 600 workers  a union leader said on Friday.",
        "date": "12022016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentine oil and gas workers to strike over YPF layoffs "
    },
    {
        "content": "BUENOS AIRES Argentine state-controlled energy company YPF  said on Wednesday it plans to continue a pilot shale oil project with Malaysia's Petronas   announcing an additional $192.5 million joint investment.",
        "date": "11232016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF to expand shale oil drilling with Petronas "
    },
    {
        "content": "BUENOS AIRES  Nov 8 Argentina's state-controlled oil firm YPF recorded a net loss of 30.26 billion pesos ($1.97 billion) in the third quarter and revenue of 55.8 billion pesos ($3.64 billion) during the three-month period  the company said on Tuesday.   (Reporting by Buenos Aires newsroom; Editing by James Dalgleish)",
        "date": "11082016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF posts $1.97 bln Q3 net loss  $3.64 bln revenue "
    },
    {
        "content": "BUENOS AIRES  Aug 4 Argentina's state-controlled oil company YPF registered a net loss of 753 million pesos ($50.7 million) in the second quarter  it said Thursday  an abrupt reversal from the 2.3 billion peso profit it posted in the same period a year ago.",
        "date": "08042016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF posts loss of $50.7 mln in 2nd quarter "
    },
    {
        "content": "NEW YORK  June 30 (IFR) - Below is a recap of primary issuance activity in the LatAm market on Thursday:",
        "date": "06302016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "LATAM CLOSE-Two issuers raise US$3.5bn in primary market "
    },
    {
        "content": "BUENOS AIRES  June 21 Argentina's state oil company YPF said on Tuesday it was partnering with General Electric to build a $170 million generating plant in the northern province of Tucuman.",
        "date": "06212016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF partners with GE to build generating plant "
    },
    {
        "content": "BUENOS AIRES Argentina's state oil company YPF said on Monday it has named Ricardo Darre chief executive officer  as the company makes leadership changes under the new pro-business government.",
        "date": "06062016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF names ex-Total executive as new CEO "
    },
    {
        "content": "BUENOS AIRES  June 6 Argentina's state oil company YPF said on Monday it has named Ricardo Darre chief executive officer  as the company makes leadership changes under the new pro-business government.",
        "date": "06062016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 1-Argentina's YPF names ex-Total executive as new CEO "
    },
    {
        "content": "BUENOS AIRES  June 6 YPF  Argentina's state oil company  has named Ricardo Darre as chief executive officer  local media reported on Monday.",
        "date": "06062016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF names new CEO - local media "
    },
    {
        "content": "HOUSTON  May 12 Argentina aims to stop importing light crude this year and improve domestic refining operations as it moves further down the road toward energy self-sufficiency  Energy Minister Juan Jose Aranguren said on Thursday.",
        "date": "05122016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 4-Argentina aims to stop importing light crude this year -minister "
    },
    {
        "content": "LONDON  May 11 Argentina's YPF has launched a tender to buy nine liquefied natural gas (LNG) cargoes for delivery from June to August  trade sources said.",
        "date": "05112016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF tenders to buy 9 cargoes of LNG for June-Aug -trade sources "
    },
    {
        "content": "BUENOS AIRES  May 10 Argentina's state-controlled oil company YPF said on Tuesday that its first quarter net profit tumbled 59.5 percent versus a year earlier to 855 million pesos ($58.1 million).",
        "date": "05102016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF says first quarter net profit down 59.5 pct "
    },
    {
        "content": "BUENOS AIRES Argentine state explorer YPF has been fined around $500 million by an international arbitration court over contract cancellations relating to natural gas exports to Brazil in the last decade  the company said on Wednesday.",
        "date": "04272016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Arbitration court fines YPF $500 million in gas export case "
    },
    {
        "content": "BUENOS AIRES  April 27 Argentine state explorer YPF has been fined around $500 million by an international arbitration court over contract cancellations relating to natural gas exports to Brazil in the last decade  the company said on Wednesday.",
        "date": "04272016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Arbitration court fines YPF $500 mln in gas export case "
    },
    {
        "content": "HOUSTON A unit of Royal Dutch Shell and trading firm Gunvor were awarded a tender to supply Argentina with eight cargoes of high-sulfur gasoil for delivery from May 30 to June 18  traders said on Wednesday.",
        "date": "04272016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Shell  Gunvor awarded tender to supply gasoil to Argentina: traders "
    },
    {
        "content": "BUENOS AIRES  April 27 Argentine state oil company YPF a will export 200 000 barrels of oil to China in a deal spurred by a new government subsidy designed to encourage drilling in the South American country  a market source familiar with the deal said on Wednesday.",
        "date": "04272016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF to ship oil to China  spurred by subsidy-source "
    },
    {
        "content": "BUENOS AIRES  March 18 Argentina's state-controlled energy company YPF sold $1 billion worth of new five-year bonds at a yield of 8.5 percent on Friday  the company said  wrapping up its financing needs for the year.",
        "date": "03182016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "UPDATE 1-Argentina's YPF prices new 5-year bond at 8.50 pct -IFR "
    },
    {
        "content": "NEW YORK  March 18 (IFR) - Argentina oil company YPF was set to raise US$1bn through a five-year bond on Friday  wrapping up its funding needs for the year and getting in ahead of a multibillion dollar deal from the sovereign.",
        "date": "03182016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "YPF squeezes pricing on bond as order books swell "
    },
    {
        "content": "BUENOS AIRES Argentina's state energy company YPF  said on Wednesday it appealed a local court ruling ordering it to disclose details of its contract with Chevron Corp   amid allegations of secret clauses in the agreement.",
        "date": "03162016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF appeals court order to show Chevron pact details "
    },
    {
        "content": "BUENOS AIRES  March 9 The head of Argentina's state-controlled oil firm  YPF  is resigning amid a purge by the country's new president  Mauricio Macri  of top officials associated with the former leftist government.",
        "date": "03092016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "UPDATE 3-Head of Argentina's YPF resigns in government restructuring "
    },
    {
        "content": "BUENOS AIRES  March 9 (IFR) - Argentine oil company YPF has mandated banks on a US$500m bond sale  a market source told IFR on Wednesday  as the country's borrowers make their way back to the capital markets.",
        "date": "03092016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF hires banks for international bond "
    },
    {
        "content": "BUENOS AIRES  March 9 Argentina has asked the head of state-controlled oil company YPF to step down next month  the government's official news agency Telam said on Wednesday.",
        "date": "03092016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina asks boss of state-run oil company YPF to resign-report "
    },
    {
        "content": "BUENOS AIRES  March 6 Argentina's shale oil output from the vast but barely tapped Vaca Muerta formation has edged up to 50 000 barrels per day equivalent  the CEO of state-controlled energy company YPF  told the La Nacion newspaper.",
        "date": "03062016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF reports rising output from shale deposits  margins challenging "
    },
    {
        "content": "BUENOS AIRES State-run energy firm YPF said on Thursday it had signed a preliminary deal worth more than $500 million over three years with American Energy Partners LP (AEP) to explore for shale gas in Argentina's vast Vaca Muerta formation.",
        "date": "01142016",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina signs $500 million shale deal with American Energy Partners "
    },
    {
        "content": "BUENOS AIRES  Jan 14 State-run energy firm YPF  said on Thursday it had signed a preliminary deal worth more than $500 million over three years with American Energy Partners LP (AEP) to explore for shale gas in Argentina's vast Vaca Muerta formation.",
        "date": "01142016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 2-Argentina signs $500 mln shale deal with American Energy Partners "
    },
    {
        "content": "BUENOS AIRES  Jan 14 Argentina's state-run energy firm YPF said on Thursday it had signed a preliminary deal worth more than $500 million over three years with American Energy Partners to explore for shale gas in the country's vast Vaca Muerta formation.   (Reporting by Richard Lough)",
        "date": "01142016",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF announces $500 mln shale deal with American Energy Partners "
    },
    {
        "content": "BUENOS AIRES  Nov 10 Argentina's Supreme Court on Tuesday ordered the state-controlled energy firm YPF to fully disclose its contract with Chevron Corp amid allegations of secret clauses in the agreement.",
        "date": "11102015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "UPDATE 1-Argentina's Supreme Court orders YPF to disclose Chevron contract "
    },
    {
        "content": "BUENOS AIRES  Nov 10 Argentina's Supreme Court on Tuesday ordered the state-controlled energy firm YPF to fully disclose its contract with Chevron Corp amid allegations of secret clauses in the agreement.",
        "date": "11102015",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's Supreme Court orders YPF to disclose Chevron contract "
    },
    {
        "content": "BUENOS AIRES Argentina's Supreme Court on Tuesday ordered the state-controlled energy firm YPF to fully disclose its contract with Chevron Corp amid allegations of secret clauses in the agreement.",
        "date": "11112015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's Supreme Court orders YPF to disclose Chevron contract "
    },
    {
        "content": "BUENOS AIRES  Aug 18 Argentina's state-run energy firm YPF will pay about $122 million for stakes in two locally based petrochemical companies as part of its growth strategy to add value to locally produced crude oil  the company said on Tuesday.",
        "date": "08182015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF to pay $122 mln for stakes in petrochemical firms "
    },
    {
        "content": "BUENOS AIRES  Aug 6 Argentina needs $200 billion in investment to develop its vast but barely tapped shale fields  but no joint ventures were expected soon because of low oil prices and uncertainty ahead of a presidential election  state oil company YPF said on Thursday.",
        "date": "08062015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina cuts shale drilling costs but no new joint ventures expected "
    },
    {
        "content": "BUENOS AIRES  July 30 Protests that briefly disrupted production in part of Argentina's main shale oil producing region have ended and operations are back to normal  state-controlled energy firm YPF said on Thursday.",
        "date": "07302015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Protests in Argentina's shale oil region end  output normal -YPF "
    },
    {
        "content": " ",
        "date": "07152015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "UPDATE 3-Argentine shale fields to get $38 bln in investment -governor "
    },
    {
        "content": "BUENOS AIRES  May 7 Argentina raised 5.263 billion pesos ($589.7 million) from a sale of local debt on Thursday  the economy ministry said  continuing a drive to drum up cash at home  given its fiscal deficit  upcoming debt payments and difficulty accessing global credit markets.",
        "date": "05072015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "CORRECTED-UPDATE 2-Argentina raises more cash in local bond sale "
    },
    {
        "content": "BUENOS AIRES  May 7 Argentina's state energy company YPF posted better than expected first-quarter profit on Thursday but earnings were still down 24.3 percent on the year due to the global slide in oil prices.",
        "date": "05072015",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "UPDATE 2-Argentina's YPF reports higher than expected net Q1 profit "
    },
    {
        "content": "BUENOS AIRES  May 7 Argentine will reopen an outstanding bond issue and sell new sovereign debt for a combined $1.12 billion  the country's official gazette said on Thursday  after state oil company YPF placed $1.5 billion in debt last month.",
        "date": "05072015",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina says opens auction for $1.12 bln in new sovereign bonds "
    },
    {
        "content": "BUENOS AIRES  April 22 Argentine state energy company YPF wants to issue a new 10-year bond which it could price close to 8.75 percent  banking sources told Thomson Reuters publication IFR  a day after a sovereign bond auction met with strong demand.",
        "date": "04222015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "Argentina's YPF wants to issue new 10-yr bond -sources "
    },
    {
        "content": "BUENOS AIRES  April 23 Argentina's state energy company YPF said it had sold $1.5 billion of new 10-year bonds at 8.5 percent on Thursday  raising its planned issuance from $500 million on the back of strong demand.",
        "date": "04232015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "UPDATE 3-Argentina's YPF sells $1.5 bln of bonds  tripling sale "
    },
    {
        "content": "NEW YORK  April 22 (IFR) - Market focus remained firmly on upcoming Petrobras results and Argentina's latest market foray as Latin America credits drifted higher Wednesday morning.",
        "date": "04222015",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Markets drift higher as YPF makes opportunistic tap "
    },
    {
        "content": "BUENOS AIRES  April 23 Argentina's state energy company YPF has expanded its planned bond sale to $1.5 billion from $500 million  the company said on Thursday in a letter to local market regulators.",
        "date": "04232015",
        "name": "YPF Sociedad Anonima",
        "news_type": "normal",
        "symbol": "YPF",
        "title": "Argentina's YPF says expands bond sale to $1.5 bln from $500 mln "
    },
    {
        "content": "EZEIZA  Argentina  April 16 The cost of drilling in Argentina's vast but barely tapped Vaca Muerta shale formation will fall at least 10 percent by the end of 2016  state energy company YPF said on Thursday  part of an efficiency effort aimed at attracting much-needed investment.",
        "date": "04162015",
        "name": "YPF Sociedad Anonima",
        "news_type": "topStory",
        "symbol": "YPF",
        "title": "UPDATE 2-Argentina's YPF sees cost of Vaca Muerta drilling falling 10 pct "
    }
]