[
    {
        "content": "* Yum! Brands  Inc. announces authorization of up to $1.5 billion in share repurchases",
        "date": "11172017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands announces authorization of up to $1.5 bln in share repurchases "
    },
    {
        "content": "Yum Brands Inc  beat Wall Street's third-quarter profit target as KFC  Taco Bell and Pizza Hut restaurant sales topped expectations  sending shares up nearly 8 percent to a record high on Thursday.",
        "date": "11022017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum profit buoyed by strength at KFC  shares jump "
    },
    {
        "content": "Nov 2 Yum Brands Inc beat Wall Street's third-quarter profit target as KFC  Taco Bell and Pizza Hut restaurant sales topped expectations  sending shares up nearly 8 percent to a record high on Thursday.",
        "date": "11022017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 3-Yum profit buoyed by strength at KFC  shares jump "
    },
    {
        "content": "* Yum! Brands reports third-quarter GAAP operating profit growth of 61%; delivers third-quarter core operating profit growth of 11%; maintains full-year core operating profit growth guidance",
        "date": "11022017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands Q3 earnings per share $1.18 "
    },
    {
        "content": "Nov 2 Yum Brands Inc posted a better-than-expected rise in quarterly sales at established restaurants worldwide  with its Pizza Hut chain reporting a surprise rise in same-restaurant sales after five quarters of declines.",
        "date": "11022017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Pizza Hut comp sales growth boosts Yum Brand's global sales "
    },
    {
        "content": "* Yum! Brands  Inc declares quarterly dividend of $0.30 per share Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands declares qtrly dividend of $0.30 per share "
    },
    {
        "content": "* SAYS IN TALKS WITH YUM! BRANDS INC. REGARDING CONDITIONS UNDER WHICH THE COMPANY COULD OPERATE PIZZA HUT STORES IN VARIOUS MARKETS  INCLUDING LATIN AMERICA  TOGETHER WITH OTHER COLLABORATION SCHEMES BETWEEN TELEPIZZA AND PIZZA HUT‍​",
        "date": "10032017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Telepizza in talks with Yum! Brands to operate Pizza Hut stores‍​ "
    },
    {
        "content": "* Yum Brands - second-quarter eps excluding special items was $0.68‍​",
        "date": "08032017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands Q2 GAAP EPS $0.58‍​ "
    },
    {
        "content": "Aug 3 Yum Brands Inc  the owner of KFC and Taco Bell  reported a lower-than expected rise in quarterly sales at established restaurants worldwide as fewer diners ate at its Pizza Hut restaurants.",
        "date": "08032017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "CORRECTED-Yum Brands worldwide same-store sales miss estimates "
    },
    {
        "content": "SHANGHAI  July 27 Viral photos and news reports in the United States allegedly showing a mouldy ice cream maker at a U.S. outlet of McDonald's Corp have prompted swift action from the fast-food giant thousands of miles away: in China.",
        "date": "07272017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "McDonald's swift to respond in China after mouldy ice cream maker pictures go viral in U.S. "
    },
    {
        "content": "* Collins Restaurants South Pty entered into binding agreements to acquire 28 kfc restaurants from a subsidiary of Yum! Brands Inc",
        "date": "06262017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Collins Foods announces acquisition of 28 KFC restaurants from Yum! Brands Inc "
    },
    {
        "content": "* Yum Brands - units KFC holding  Pizza Hut holding  Taco Bell Of America  commenced offering of $500 million of senior notes due 2027​",
        "date": "06122017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands announces proposed notes offering "
    },
    {
        "content": "* On June 7 Pizza Hut Holdings  KFC Holding  Taco Bell Of America entered into a refinancing amendment - SEC filing",
        "date": "06082017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands says certain units entered refinancing amendment - SEC filing "
    },
    {
        "content": "* Yum Brands Inc declares quarterly dividend of $0.30 per share",
        "date": "05192017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands Inc declares quarterly dividend of $0.30/shr "
    },
    {
        "content": "* Yum! Brands announces election of Chris Connor to board Source text for Eikon: Further company coverage:",
        "date": "05192017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands announces election of Chris Connor to board "
    },
    {
        "content": "Yum Brands Inc  posted a better-than-expected quarterly profit  helped by lower taxes  vigorous sales of Taco Bell's Naked Chicken Chalupas and lower costs at KFC restaurants.",
        "date": "05032017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Taco Bell Naked Chicken Chalupas  lower taxes boost Yum's profit "
    },
    {
        "content": "May 3 Yum Brands Inc posted a better-than-expected quarterly profit  helped by lower taxes  vigorous sales of Taco Bell's Naked Chicken Chalupas and lower costs at KFC restaurants.",
        "date": "05032017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 4-Taco Bell Naked Chicken Chalupas  lower taxes boost Yum's profit "
    },
    {
        "content": "* Yum! Brands reports first-quarter GAAP operating profit growth of 39%; delivers first-quarter core operating profit growth of 9%; maintains full-year core operating profit growth guidance",
        "date": "05032017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands q1 earnings per share $0.65 excluding items "
    },
    {
        "content": "May 3 Yum Brands Inc reported a better-than-expected quarterly profit  boosted by strong demand at its Taco Bell restaurants.",
        "date": "05032017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands' quarterly profit beats estimates "
    },
    {
        "content": "ADDIS ABABA  April 25 U.S. fast-food giant Yum Brands Inc. has signed a deal with Ethiopia's Belayab Foods and Franchise PLC to open 10 Pizza Hut restaurants in the Horn of Africa country as part of an expansion on the continent.",
        "date": "04252017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum to open 10 Ethiopian Pizza Huts in African expansion "
    },
    {
        "content": "LOS ANGELES  April 7 Yum Brands Inc investors said they have withdrawn a shareholder proposal requesting that the company phase out harmful antibiotic use in its meat supply  after Yum's KFC restaurant chain made public a plan to ban the use of human antibiotics in the chicken it buys.",
        "date": "04072017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "As KFC changes policy  Yum shareholders pull proposal on cutting antibiotics "
    },
    {
        "content": "LOS ANGELES  April 6 Yum Brands Inc's U.S. KFC chain plans to curb the use of antibiotics in its chicken supply  making it the last of the big three chicken restaurants to join the fight against the rise of dangerous antibiotic-resistant bacteria known as superbugs.",
        "date": "04072017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "RPT-Yum's KFC to curb antibiotic use in the chickens it buys "
    },
    {
        "content": "* Yum! Brands  Inc. declares quarterly dividend of $0.30 per share",
        "date": "03242017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands declares quarterly dividend of $0.30 per share "
    },
    {
        "content": "* On March 21  Pizza Hut Holdings  LLC  KFC Holding Co  Taco Bell of America  LLC entered refinancing amendment to credit agreement",
        "date": "03232017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands says Pizza Hut Holdings  KFC Holding  Taco Bell Of America enters refinancing amendment to credit agreement "
    },
    {
        "content": "* Unit has entered into a binding agreement to acquire 16 KFC restaurants located in Netherlands from subsidiaries of Yum! Brands",
        "date": "03222017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Collins Foods says unit acquires 16 KFC restaurants in Netherlands "
    },
    {
        "content": "* Yum! Brands Inc completes repricing of approximately $2.0 billion term Loan B facility  Source text for Eikon:  Further company coverage:",
        "date": "03212017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands Inc completes repricing of about $2 bln term Loan B facility "
    },
    {
        "content": "* Kevin Hochman promoted to president and chief concept officer of KFC U.S.",
        "date": "03212017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Kevin Hochman promoted to chief concept officer of KFC U.S. "
    },
    {
        "content": "* YUM! approves acquisition of Pacific Island Restaurants Inc",
        "date": "03022017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Restaurant Brands New Zealand says YUM! approves Pacific Island Restaurants acquisition "
    },
    {
        "content": "* Yum Brands - Keith A. Meister  managing partner of Corvex Management Lp  has elected to step down from its board of directors  Source text for Eikon:  Further company coverage:",
        "date": "02162017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands reports changes to board of directors "
    },
    {
        "content": "* takes share stake of 3.0 million shares in Time Warner Inc - sec filing",
        "date": "02102017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Third Point cuts share stake in Facebook  dissolves share stake in Yum Brands "
    },
    {
        "content": "Yum Brands Inc  reported a better-than-expected rise in quarterly profit on Thursday  helped by refranchising efforts and strong sales at its KFC and Taco Bell restaurants.",
        "date": "02092017",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum Brands profit tops expectations as KFC  Taco Bell deliver "
    },
    {
        "content": "* Same-store sales up 3 pct at KFC  Taco Bell   (Adds CEO comments  shares)",
        "date": "02092017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 2-Yum Brands profit tops expectations as KFC  Taco Bell deliver "
    },
    {
        "content": "Feb 9 Yum Brands Inc  the owner of KFC and Taco Bell  reported a lower-than-expected rise in quarterly sales at established restaurants worldwide as fewer diners ate at its Pizza Hut chain.",
        "date": "02092017",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands same-store sales miss estimates "
    },
    {
        "content": "* Yum! Brands Inc. announces authorization of up to $2 billion in share repurchases  Source text for Eikon:  Further company coverage:",
        "date": "11172016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands announces authorization of up to $2 bln in share repurchases "
    },
    {
        "content": "Nov 4 Taco Bell Corp  a unit of Yum Brands Inc   said on Friday it would increase the number of restaurants in the United States to 8 000 and create 100 000 jobs by the end of 2022  just four days after its parent completed the spinoff of its China unit.",
        "date": "11092016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "CORRECTED-(OFFICIAL)-Yum unit Taco Bell to have 8 000 U.S. outlets by end-2022 (Nov 4) "
    },
    {
        "content": "* Yum China completes separation from Yum! Brands  lists on New York Stock Exchange  Source text for Eikon:  Further company coverage:",
        "date": "11012016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum China completes separation from Yum! Brands "
    },
    {
        "content": "* Yum! Brands completes separation of Yum China business  creating two powerful  independent  focused growth companies  Source text for Eikon:  Further company coverage:",
        "date": "11012016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands completes separation of Yum China business "
    },
    {
        "content": "* Yum Brands CEO Greg Creed on CNBC- half of the U.S. Population eats Taco Bell once a month; average person comes every 11 days",
        "date": "10122016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands CEO Creed says half of the U.S. population eats Taco Bell once a month - CNBC "
    },
    {
        "content": "* During the quarter ended September 3  2016  YUM offered a voluntary retirement program to certain U.S. employees",
        "date": "10112016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-YUM! Brands says offered voluntary retirement program to certain U.S. employees "
    },
    {
        "content": "* Yum Brands CEO Greg Creed on CNBC- Dominos did a much better job of technology  and we have to catch up",
        "date": "10122016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands CEO Greg Creed says Dominos did a much better job of technology - CNBC "
    },
    {
        "content": "* On September 8  2016  began informing certain former employees of opportunity to voluntarily elect an early payout of pension benefits",
        "date": "10112016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands expects to record Q4 charge of $30 mln-$50 mln from early payout of pension benefits "
    },
    {
        "content": "Oct 11 Yum Brands Inc  owner of Pizza Hut  KFC and Taco Bell chains  said on Tuesday it will more than double returns to shareholders by 2019 as part of a program started last year  sending its shares up as much as 3.8 percent.",
        "date": "10112016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 4-Yum Brands to return $13.5 bln to shareowners by 2019 "
    },
    {
        "content": "(Adds details on cost savings from selling restaurants to operators)     Oct 11 Yum Brands Inc  owner of Pizza Hut  KFC and Taco Bell chains  said on Tuesday it expects to return as much as $13.5 billion to shareholders by 2019 as part of a program started last year  sending shares up as much as 3.8 percent.     Yum said it will increase franchise restaurant ownership to 93 percent from the current 77 percent when its China business is spun off on Oct. 31.      The company aims to",
        "date": "10112016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 3-Yum Brands to return $13.5 bln to shareowners by 2019; more franchising "
    },
    {
        "content": "Oct 11 Yum Brands Inc  owner of Pizza Hut  KFC and Taco Bell  said it expects to return as much as $13.5 billion to shareholders by 2019 after the separation of its China unit.",
        "date": "10112016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "CORRECTED-UPDATE 1-Yum Brands to return $13.5 billion to shareholders by 2019 "
    },
    {
        "content": "Oct 11 Yum Brands Inc  owner of KFC and Pizza Hut restaurant chains  said it expects to return as much as $13.5 billion in capital to shareholders by 2019  once it completes the separation of its Yum China unit.",
        "date": "10112016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands to return $13.5 billion to shareholders by 2019 "
    },
    {
        "content": "* Yum! Brands details transformation plans to drive growth of Kfc  Pizza Hut And Taco Bell after china separation at annual investor conference today",
        "date": "10112016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands Inc expects to return $13.5 bln to shareholders between Q4 2015 and 2019 "
    },
    {
        "content": "Yum Brands Inc   owner of KFC and Pizza Hut  blamed tensions over the South China Sea for an unexpected dip in quarterly sales at its established restaurants in China. | Video ",
        "date": "10062016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum blames South China Sea protests for dip in China sales "
    },
    {
        "content": "Oct 5 Yum Brands Inc on Wednesday posted an unexpected decline in quarterly sales at established China restaurants  citing protests sparked by an international court's rejection of the country's claim to historic rights in the South China Sea.",
        "date": "10052016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "CORRECTED-UPDATE 3-Yum China's quarterly restaurant sales down ahead of spinoff "
    },
    {
        "content": "Oct 5 Yum Brands Inc  which will spin off its China restaurants on Oct. 31  on Wednesday reported an unexpected decline in sales at established restaurants in that country during the latest quarter.",
        "date": "10052016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum China's quarterly restaurant sales down ahead of spinoff "
    },
    {
        "content": " ",
        "date": "10052016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum China files to issue 10 mln shares to Yum employees "
    },
    {
        "content": "(Brief corrects to clarify that Micky Pant is expected to take on CEO role of Yum China after spin-off. The new role will replace his current position as head of Yum's China unit  from which he is expected to resign.)  Yum Brands :  Source text - http://bit.ly/2duFq76 Further company coverage: [YUM.N] ",
        "date": "09292016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum Brands: Micky Pant to lead spun-off Yum China after split "
    },
    {
        "content": "* Yum! Brands also announced an increase in company's dividend",
        "date": "09262016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands says board approves separation of Yum China "
    },
    {
        "content": "* With Alves's appointment  Yum! brands board will consist of 12 directors  11 of whom will be independent",
        "date": "09262016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands appoints Paget Alves to board "
    },
    {
        "content": "Yum China Holdings Inc  which is being spun off from KFC owner Yum Brands Inc   filed with regulators on Wednesday to issue 10 million common shares to certain participants in Yum incentive plans.",
        "date": "09222016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum China files to issue 10 million shares to Yum employees "
    },
    {
        "content": "Sept 21 Yum China Holdings Inc  which is being spun off from KFC owner Yum Brands Inc  filed with regulators on Wednesday to issue 10 million common shares to certain participants in Yum Brands' incentive plans.",
        "date": "09212016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "CORRECTED-Yum China files to issue 10 mln shares to some Yum Brands employees "
    },
    {
        "content": "KUWAIT Kuwait Food Co's (Americana)  biggest shareholder said on Wednesday conditions for Gulf-based Adeptio to buy its 69 percent stake have been met  paving the way for the completion of the $2.4 billion deal.",
        "date": "09212016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Americana's main shareholder says $2.4 billion takeover deal set to go ahead "
    },
    {
        "content": "KUWAIT  Sept 21 Kuwait Food Co's (Americana)  biggest shareholder said on Wednesday conditions for Gulf-based Adeptio to buy its 69 percent stake have been met  paving the way for the completion of the $2.4 billion deal.",
        "date": "09212016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Americana's main shareholder says $2.4 bln takeover deal set to go ahead "
    },
    {
        "content": "* Also expects to name one additional independent board member in connection with spin-off",
        "date": "09152016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands names expected board of directors of Yum China "
    },
    {
        "content": "KFC and Pizza Hut owner Yum Brands Inc  said Chinese investment firm Primavera Capital and an affiliate of Alibaba Group Holding Ltd  will buy a stake in Yum China for $460 million as Yum prepares to spin off the business.",
        "date": "09022016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum to sell stake in China business ahead of spinoff "
    },
    {
        "content": "* Yum China and investors expect to enter into a shareholders agreement",
        "date": "09022016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum China and investors expect to enter into shareholders agreement "
    },
    {
        "content": "HONG KONG  Sept 2 Yum Brands Inc's China unit has secured an investment worth about $460 million from an affiliate of Alibaba Group Holding and private equity firm Primavera Capital  a person familiar with the matter told Reuters.",
        "date": "09022016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum's China unit gets $460 mln investment from Alibaba arm  Primavera - source "
    },
    {
        "content": "* Yum Brands Inc struck deal to sell stake in China operations to prominent Chinese deal maker & financial affiliate of Alibaba Group Holding - WSJ",
        "date": "09022016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands struck deal to sell stake in China operations - WSJ "
    },
    {
        "content": "* Third Point Llc cuts share stake in Yum Brands Inc by 54.5 pct to 2.5 mln shares - SEC Filing",
        "date": "08122016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Third Point Llc cuts share stake in Yum Brands "
    },
    {
        "content": "LOS ANGELES  Aug 10 Consumer groups will deliver a petition from more than 350 000 people to the KFC restaurant chain on Wednesday  calling on the Yum Brands Inc unit  to stop the routine use of antibiotics by the companies that supply its chicken.",
        "date": "08102016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "CORRECTED-UPDATE 1-Consumer groups press Yum's KFC to tighten antibiotic rules "
    },
    {
        "content": "LOS ANGELES  Aug 9 Yum Brands Inc  investors on Tuesday filed a shareholder proposal requesting that it quickly phase out harmful antibiotic use in its meat supply  taking aim at the practices of the company's KFC fried chicken chain.",
        "date": "08092016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Shareholders press Yum for stricter antibiotics policy "
    },
    {
        "content": "Aug 12 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08122016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "PRESS DIGEST- British Business - Aug 12 "
    },
    {
        "content": "CHICAGO U.S. meat processor Cargill Inc [CARG.UL] has stopped using an important antibiotic for people to prevent disease in most of its turkeys  the company said on Tuesday  the latest food maker to drop the drug over concerns about the impact on human medicine.",
        "date": "08102016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Cargill stops using human antibiotic to prevent disease in turkeys "
    },
    {
        "content": "CHICAGO  Aug 9 U.S. meat processor Cargill Inc  has stopped using an important antibiotic for people to prevent disease in most of its turkeys  the company said on Tuesday  the latest food maker to drop the drug over concerns about the impact on human medicine.",
        "date": "08102016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Cargill stops using human antibiotic to prevent disease in turkeys "
    },
    {
        "content": "* Indexes up: Dow 0.73 pct  S&P 0.53 pct  Nasdaq 0.57 pct   (Updates to close  changes byline)",
        "date": "07142016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Wall St sets another record as JPMorgan leads banks higher "
    },
    {
        "content": "LOS ANGELES Yum Brands Inc on Wednesday said its China business was gaining strength  sending shares of the KFC  Taco Bell and Pizza Hut brands owner higher as it prepared to spin off the key Chinese unit in the autumn.     Investors had worried about the fundamentals of Yum's China business  which generates more operating profit than any other unit  after it recently posted bumpy results on food safety scares and company missteps.",
        "date": "07132016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum shares rise after CEO signals China momentum "
    },
    {
        "content": "NEW YORK U.S. stocks ticked up on Wednesday  just enough for the S&P 500 and Dow industrials to set record highs  with investors expecting upbeat earnings to keep the rally going. | Video ",
        "date": "07142016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Wall Street ticks up to extend record streak "
    },
    {
        "content": "LOS ANGELES  July 13 Yum Brands Inc on Wednesday said its China business was gaining strength  sending shares of the KFC  Taco Bell and Pizza Hut brands owner higher as it prepared to spin off the key Chinese unit in the autumn.",
        "date": "07132016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 3-Yum shares rise after CEO signals China momentum "
    },
    {
        "content": "* Reports second-quarter GAAP operating profit growth of 32%; delivered core operating profit growth of 7%; raises full-year core operating profit growth guidance to at least 14%",
        "date": "07132016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands Q2 earnings per share $0.75 excluding items "
    },
    {
        "content": "LOS ANGELES  July 13 Yum Brands Inc on Wednesday reported second quarter China sales that matched Wall Street expectations  as the owner of the KFC  Taco Bell and Pizza Hut brands prepares to spin the division off around Oct. 31.",
        "date": "07132016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum China sales result matches Street view  shares up "
    },
    {
        "content": "* Yum! Brands  Inc announces closing of new senior secured credit facilities and notes offering  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06162016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands Inc closes new senior secured credit facilities and notes offering "
    },
    {
        "content": "* Aggregate principal amount of notes to be issued in offering was decreased from previously announced $2.3 billion to $2.1 billion",
        "date": "06022016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands says announces pricing of notes offering "
    },
    {
        "content": "* Soroban Capital Partners LP reports 5.1 percent passive stake in Yum Brands Inc as of May 25  2016 - SEC filing  Source text for Eikon: [ID:(http://1.usa.gov/1UCV93m )] Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06062016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Soroban Capital reports 5.1 pct passive stake in Yum Brands as of May 25  2016 - SEC filing "
    },
    {
        "content": "* New debt is intended to fund return of capital to shareholders  repay borrowings under company's existing revolving credit facility",
        "date": "05182016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! brands to offer $4.6 billion in new debt "
    },
    {
        "content": "A consortium that includes sovereign wealth fund China Investment Corp (CIC) and U.S. buyout firm KKR & Co  has ended discussions to buy a stake in Yum Brands Inc's  China unit  according to people familiar with the matter.",
        "date": "05202016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Exclusive: CIC ends talks with Yum Brands over China business - sources "
    },
    {
        "content": "* Yum shares have jumped 9.7 pct this year   (Adds China performance  comment  Temasek consumer deals)",
        "date": "05192016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "UPDATE 1-Temasek  CIC-KKR advance to 2nd round of Yum China stake sale -sources "
    },
    {
        "content": "* Yum! Brands Inc says  planned separation of its china business is on track to be completed by end of 2016",
        "date": "05202016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands says authorization of up to $4.2 bln in share repurchases "
    },
    {
        "content": "May 19 The following bids  mergers  acquisitions and disposals were reported by 1340 GMT on Thursday:",
        "date": "05192016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Special purpose subsidiary of taco bell to issue  sell $800 million of issuer's series 2016-1 3.832% fixed rate senior secured notes  class a-2-i",
        "date": "05052016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands prices $2.3 billion securitized financing facility "
    },
    {
        "content": "* Global payments renews multi-year agreement to support yum! brands in canada and is recognized as upgc supplier of the year  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05032016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Global Payments renews multi-year agreement to support Yum Brands in Canada "
    },
    {
        "content": "* Yum! Brands Inc announces new securitization financing facility",
        "date": "04212016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum! Brands Inc announces new securitization financing facility "
    },
    {
        "content": "* Says in connection with his appointment  new CFO Gibbs will get additional stock appreciation rights grant for economic value of $500 000",
        "date": "04272016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-Yum Brands says CFO Gibbs will get additional stock appreciation rights grant of $500 000 "
    },
    {
        "content": "Yum Brands Inc's China sales accelerated faster than Wall Street expected in the first quarter  helped by Chinese New Year KFC chicken bucket promotions  marking an auspicious start to a year in which the company plans to spin off its China unit.",
        "date": "04202016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum sales jump in China in first quarter  boosted by KFC "
    },
    {
        "content": "* Yum! Brands promotes David Gibbs to president and chief financial officer",
        "date": "04272016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-YUM! Brands promotes David Gibbs to president  CFO "
    },
    {
        "content": "April 20 Yum Brands Inc's China sales accelerated faster than Wall Street expected in the first quarter  helped by Chinese New Year KFC chicken bucket promotions  marking an auspicious start to a year in which the company plans to spin off its China unit.",
        "date": "04202016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 3-Yum sales jump in China in first quarter  boosted by KFC "
    },
    {
        "content": "April 20 Yum Brands Inc's sales at established restaurants in China accelerated in the first quarter as the restaurant company pursues a spinoff of that business  its top profit-driver  this year.",
        "date": "04202016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum sales at China restaurants rise 6 percent "
    },
    {
        "content": "HONG KONG/SINGAPORE  April 20 A group of investors comprising sovereign wealth fund China Investment Corp (CIC)  KKR & Co and Baring Private Equity Asia is in talks to buy a controlling stake in Yum Brands Inc's  China unit  people familiar with the matter said.",
        "date": "04202016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "REFILE-China's CIC  KKR consortium in talks to buy control of Yum China unit -sources "
    },
    {
        "content": "China Investment Corp [CIC.UL]  China's state-owned sovereign wealth fund  is backing a group of investors who have expressed interest in buying a majority stake in Yum Brands Inc's  China unit  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04192016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "China sovereign fund to seek majority control of Yum unit: Bloomberg "
    },
    {
        "content": "April 18 China Investment Corp  China's state-owned sovereign wealth fund  is backing a group of investors who have expressed interest in buying a majority stake in Yum Brands Inc's China unit  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04192016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "China sovereign fund to seek majority control of Yum unit-Bloomberg "
    },
    {
        "content": "* China sovereign fund to seek control of $8 bln Yum unit - Bloomberg",
        "date": "04192016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "BRIEF-China sovereign fund to seek control of $8 bln Yum unit - Bloomberg "
    },
    {
        "content": "* CEO Greg Creed 2015 total compensation of $7.5 million versus $5 million in 2014 - SEC filing",
        "date": "04082016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "BRIEF-YUM Brands says CEO Greg Creed's 2015 compensation was $7.5 mln vs $5 mln in 2014 "
    },
    {
        "content": " ",
        "date": "03242016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "UPDATE 4-Yum in talks with KKR  Hopu  to sell stake in China unit-sources "
    },
    {
        "content": "Yum Brands Inc  is in talks with private equity company KKR & Co LP  and others about a possible sale of a nearly 20 percent stake in its China business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "03232016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum in talks with KKR  others to sell stake in China unit: WSJ "
    },
    {
        "content": "SINGAPORE/HONG KONG  March 24 Private equity firm Hopu Investments is among the investors that Yum Brands Inc  is in talks to sell a minority stake in its China unit to  sources familiar with the matter told Reuters.",
        "date": "03242016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Hopu  KKR among investors in talks to buy stake in Yum's China unit -sources "
    },
    {
        "content": "March 23 Yum Brands Inc  the owner of the KFC and Pizza Hut chains  is in talks with private equity company KKR & Co LP and others about a possible sale of a 19.9 percent stake in its China business  CNBC reported  citing Dow Jones.",
        "date": "03232016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum in talks with KKR to sell stake in China unit-CNBC citing DJ "
    },
    {
        "content": "March 15 Yum Brands Inc  the owner of the KFC and Pizza Hut chains  said it will open its first Taco Bell restaurant in China by the end of 2016.",
        "date": "03152016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands to open its first Taco Bell outlet in China this year "
    },
    {
        "content": "March 10 Yum Brands Inc owned Taco Bell upped the ante in the breakfast wars  launching a nationwide $1 breakfast menu in a bid to compete with other fast-food chains that are cashing in on the trend.",
        "date": "03102016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Taco Bell launches $1 breakfast menu "
    },
    {
        "content": "BANGKOK  March 9 Thailand's Minor International Pcl plans to invest 40 billion baht ($1.13 billion) over the next five years in a major  expansion of its hotel and fast-food chain businesses at home and overseas  a senior executive said on Wednesday.",
        "date": "03092016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Thai Minor International to invest more than $1 bln in hotels  fast food over 5 yrs "
    },
    {
        "content": "SHANGHAI  March 7 Small-scale brewers from Brooklyn to Beijing are tapping growing demand from cosmopolitan Chinese consumers for high-end beers  a trend which could also help global brewing giants finally unlock frothier profits in the world's largest beer market.",
        "date": "03072016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-China's taste for craft offers fizz for global brewers "
    },
    {
        "content": "Yum Brands Inc  reported an unexpected drop in fourth-quarter revenue as both its KFC and Pizza Hut restaurant outlets struggled to grow  hurt in part by the strong dollar.",
        "date": "02042016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum posts unexpected fall in revenue as KFC  Pizza Hut struggle "
    },
    {
        "content": "Feb 3 Yum Brands Inc reported an unexpected drop in fourth-quarter revenue as both its KFC and Pizza Hut restaurant outlets struggled to grow  hurt in part by the strong dollar.",
        "date": "02042016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 3-Yum posts unexpected fall in revenue as KFC  Pizza Hut struggle "
    },
    {
        "content": "SHANGHAI Yum Brands Inc   the home of KFC and Pizza Hut  is falling behind rival McDonald's Corp  as the pair battle to revive flagging sales in China - a headache for Yum as it looks to spin off operations in its biggest market. | Video ",
        "date": "02052016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Beefed up: McDonald's edging out KFC  Pizza Hut in China revival battle "
    },
    {
        "content": "* Headache for Yum with China unit spin-off due this year   (Adds Yum comment paragraph 13  TV link)",
        "date": "02052016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Beefed up: McDonald's edging out KFC  Pizza Hut in China revival battle "
    },
    {
        "content": "Feb 3 KFC owner Yum Brands Inc  which is spinning off its China business  reported worldwide system sales rose in the fourth quarter  helped by strong sales in China.",
        "date": "02032016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "CORRECTED-Yum Brands sales at established China restaurants up more than expected "
    },
    {
        "content": "SHANGHAI A Shanghai court has fined three local tech firms for helping spread rumours about Yum Brands Inc's KFC fast food chain that included doctored photos of deformed chickens and allegations the birds had six wings and eight legs.",
        "date": "02032016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "KFC wins China payout over mutant chicken rumors "
    },
    {
        "content": "SHANGHAI  Feb 3 A Shanghai court has fined three local tech firms for helping spread rumours about Yum Brands Inc's KFC fast food chain that included doctored photos of deformed chickens and allegations the birds had six wings and eight legs.",
        "date": "02032016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "KFC wins China payout over mutant chicken rumours "
    },
    {
        "content": "Yum Brands Inc   which is spinning off its China business  said December same-store sales increased 1 percent in the country  helped by a 5 percent rise at KFC.",
        "date": "01122016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum says China same-store sales rise 1 percent in December "
    },
    {
        "content": "Jan 12 Yum Brands Inc  which is spinning off its China business  said December same-store sales increased 1 percent in the country  helped by a 5 percent rise at KFC.",
        "date": "01122016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Yum says China same-store sales rise 1 pct in December "
    },
    {
        "content": "Jan 12 Yum Brands Inc estimated a 1 percent growth in December same-store sales in its China division  in its final monthly sales release before the business is spun off.",
        "date": "01122016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands says China same-store sales rose slightly in December "
    },
    {
        "content": "Yum Brands Inc   the owner of Pizza Hut and KFC restaurant chains  said executive chairman and former CEO David Novak plans to retire in May.",
        "date": "01052016",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum Brands' Chairman David Novak to retire in May "
    },
    {
        "content": "Jan 5 Yum Brands Inc  the owner of Pizza Hut and KFC restaurant chains  said executive chairman and former CEO David Novak plans to retire in May.",
        "date": "01052016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Yum Brands' Chairman David Novak to retire in May "
    },
    {
        "content": "Jan 5 Yum Brands Inc  the owner of Pizza Hut and KFC restaurant chains  said executive chairman and former CEO David Novak plans to retire in May.",
        "date": "01052016",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "CORRECTED-Yum Brands' Chairman David Novak to retire in May "
    },
    {
        "content": "Yum Brands Inc  said it would return up to $6.2 billion to shareholders before separating its China business and listing it on the New York Stock Exchange  and possibly in Hong Kong.",
        "date": "12102015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum to return $6.2 billion to shareholders before China separation "
    },
    {
        "content": "Dec 10 Yum Brands Inc's same-restaurant sales in China fell about 3 percent in November.",
        "date": "12102015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum China restaurant sales fall 3 pct in November "
    },
    {
        "content": "DALLAS KFC is expected to open its first restaurant in Tibet next year  as parent Yum Brands Inc looks to expand in the Chinese market and shake off a series of food scares and marketing blunders that have severely dented its sales in the country.",
        "date": "12092015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Tibet to get first KFC next year  amid China expansion "
    },
    {
        "content": "LOS ANGELES  Dec 7 Yum Brands Inc Chief Financial Officer Patrick Grismer will resign effective Feb. 19  the parent of the KFC  Taco Bell and Pizza Hut restaurant brands said on Monday.",
        "date": "12072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum CFO to leave in February  amid China spinoff "
    },
    {
        "content": "DALLAS  Dec 9 KFC is expected to open its first restaurant in Tibet next year  as parent Yum Brands Inc  looks to expand in the Chinese market and shake off a series of food scares and marketing blunders that have severely dented its sales in the country.",
        "date": "12092015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Tibet to get first KFC next year  amid China expansion "
    },
    {
        "content": "DALLAS  Dec 9 KFC is expected to open its first restaurant in Tibet next year  as parent Yum Brands Inc  looks to expand in the Chinese market and shake off a series of food scares and marketing blunders that have severely dented its sales in the country.",
        "date": "12092015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Tibet to get first KFC next year "
    },
    {
        "content": "Dunkin' Donuts  owned by Dunkin' Brands Group Inc   said it will switch to using cage-free eggs in the United States by 2025  becoming the latest restaurant company to announce plans to move away from eggs sourced from cage-confined chickens.",
        "date": "12072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Dunkin' Donuts says will switch to cage-free eggs by 2025 "
    },
    {
        "content": "Yum Brands Inc  which is spinning off its dominant China business  said October sales at established restaurants in the country rose 5 percent and backed its same-store sales forecast for the fourth quarter.",
        "date": "11132015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum's October same-restaurant sales in China rise 5 percent "
    },
    {
        "content": "Nov 12 Yum Brands Inc  which is spinning off its dominant China business  said October sales at established restaurants in the country rose 5 percent and backed its same-store sales forecast for the fourth quarter.",
        "date": "11122015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "UPDATE 1-Yum's October same-restaurant sales in China rise 5 pct "
    },
    {
        "content": "Yum Brands Inc  which is spinning off its dominant China business  said on Thursday October sales at established restaurants in the country rose 5 percent  driven by KFC.",
        "date": "11122015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum's October same-restaurant sales in China rise 5 percent "
    },
    {
        "content": "Nov 12 Yum Brands Inc  which is spinning off its dominant China business  said on Thursday October sales at established restaurants in the country rose 5 percent  driven by KFC.",
        "date": "11122015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum's October same-restaurant sales in China rise 5 pct "
    },
    {
        "content": "* Firms tend to directly manage to ensure food safety  quality",
        "date": "10232015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Eyeing China growth  Yum faces immature franchise market "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 21 (Fitch) Yum! Brands Inc.'s (YUM) announced separation of  its China operation into an independent publicly traded company has sent its  credit default swap (CDS) spreads spiking to their widest levels ever  according  to Fitch Solutions in its latest CDS Case Study Snapshot.   Five-year CDS on Yum! have continued to gap out  98% wider in just the past  week  to price at all-time wide levels.  Additionally  CDS are c",
        "date": "10212015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Fitch Solutions: Yum's CDS at All Time Widest Level On Spinoff Plans "
    },
    {
        "content": "Oct 21 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "10212015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "PRESS DIGEST- New York Times business news - Oct 21 "
    },
    {
        "content": "MOSCOW  Oct 16 U.S. fast-food giant Yum Brands Inc said on Friday it planned to keep up the pace of expansion of its KFC chain in Russia  seeing an opportunity in a crisis that is leading consumers to seek cheaper treats over fine meals.",
        "date": "10162015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands to keep up Russia expansion as consumers shun fine dining "
    },
    {
        "content": "LOS ANGELES  Oct 20 Yum Brands Inc's  move to spin off its China business will allow investors to choose how much risk they are willing to stomach in the fast-food company's future.",
        "date": "10202015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum's China spin-off puts new spotlight on risk "
    },
    {
        "content": "Yum Brands Inc  said on Thursday it had appointed activist investor Keith Meister to its board  bolstering speculation that the company may spin off its China business and sending shares up almost 2 percent to $70.55 in extended trade.",
        "date": "10152015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum Brands activist investor joins board; shares rise "
    },
    {
        "content": "* New entity to be franchisee of Yum Brands in mainland China",
        "date": "10202015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "RPT-UPDATE 5-Yum Brands to separate China unit amid activist pressure "
    },
    {
        "content": "KFC owner Yum Brands Inc  said it plans to spin off its dominant China business  which has been besieged by food scandals and marketing missteps  amid pressure from an activist shareholder who recently joined its board of directors. | Video ",
        "date": "10202015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands to separate China unit amid activist pressure "
    },
    {
        "content": "Oct 15 Yum Brands Inc said on Thursday it had appointed activist investor Keith Meister to its board  bolstering speculation that the company may spin off its China business and sending shares up almost 2 percent to $70.55 in extended trade.",
        "date": "10152015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 2-Yum Brands activist investor joins board; shares rise "
    },
    {
        "content": "Oct 20 The following bids  mergers  acquisitions and disposals were reported by 1600 GMT on Tuesday:",
        "date": "10202015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Oct 20 Yum Brands Inc said it intended to separate its China and U.S. businesses into two independent  publicly traded companies.",
        "date": "10202015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands plans to separate into 2 publicly traded companies "
    },
    {
        "content": "Oct 20 Yum Brands Inc is preparing to separate its Chinese and U.S. businesses in a major restructuring of the fast-food group  Bloomberg reported.",
        "date": "10202015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands prepares to separate China business - Bloomberg "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 08 (Fitch) Souring market sentiment on Yum Brands of late has  sent credit default sap (CDS) spreads to their widest level since 2009   according to Fitch Solutions in its latest CDS Case Study Snapshot. Five-year CDS on Yum Brands Inc. have widened out 20% over the past month to  price at the widest levels observed since 2009. The CDS Implied Rating for Yum  has been dropping steadily over the past year  from 'A' to '",
        "date": "10082015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Fitch Solutions: Yum Brands CDS at Widest Levels in Six Years "
    },
    {
        "content": "MUMBAI  Oct 7 Aggressive expansion by foreign rivals is eating into sales at Yum Brands Inc in India  and there is little letup in sight for its KFC and Pizza Hut restaurants that are struggling to keep pace.",
        "date": "10072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Fast food rivals expand  hitting Yum sales in India "
    },
    {
        "content": "MUMBAI  Oct 7 Aggressive expansion by foreign rivals is eating into sales at Yum Brands Inc in India  and there is little letup in sight for its KFC and Pizza Hut restaurants that are struggling to keep pace.",
        "date": "10072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "RPT-UPDATE 1-Fast food rivals expand  hitting Yum sales in India "
    },
    {
        "content": "Yum Brands Inc  cut its full-year profit forecast on Tuesday  citing a slower-than-expected recovery in its key market of China and the drag from a strong U.S. dollar  sending its shares down 17 percent.",
        "date": "10062015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum shares tumble after warning on China  currency moves "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  Earnings season can't come soon enough for investors  who are dealing with slowed economic growth and fecklessness of the Federal Reserve. Next week's slate has just a trickle of quarterly results  and as investors prep for the reporting period the",
        "date": "10022015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "What to Watch in the Week Ahead and on Monday  Oct 5 "
    },
    {
        "content": "LOS ANGELES Yum Brands Inc's  disappointing results from restaurants in China including KFC and Pizza Hut add pressure on Chief Executive Greg Creed to make swift changes to the business that is its main driver of sales and profit  analysts said on Wednesday. | Video ",
        "date": "10072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum's China missteps amplify calls for spinoff  other change "
    },
    {
        "content": "Oct 6 Yum Brands Inc cut its full-year profit forecast on Tuesday  citing a slower-than-expected recovery in its key market of China and the drag from a strong U.S. dollar  sending its shares down 17 percent.",
        "date": "10062015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 3-Yum shares tumble after warning on China  currency moves "
    },
    {
        "content": "LOS ANGELES  Oct 7 Yum Brands Inc's  disappointing results from restaurants in China including KFC and Pizza Hut add pressure on Chief Executive Greg Creed to make swift changes to the business that is its main driver of sales and profit  analysts said on Wednesday.",
        "date": "10072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 2-Yum's China missteps amplify calls for spinoff  other change "
    },
    {
        "content": "Oct 6 Yum Brands Inc on Tuesday said sales at established restaurants in China rose far less than expected for the third quarter  sending shares down nearly 17 percent in extended trading.",
        "date": "10062015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum China Q3 restaurant sales up far less than expected  shares tumble "
    },
    {
        "content": "* Indexes close up: Dow 0.73 pct  S&P 0.8 pct  Nasdaq 0.9 pct   (Updates to close)",
        "date": "10072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-S&P 500 reaches three-week high as health stocks rally "
    },
    {
        "content": "* Indexes up: Dow 0.29 pct  S&P 0.37 pct  Nasdaq 0.41 pct   (Updates to afternoon)",
        "date": "10072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Wall St rises as health care rebounds "
    },
    {
        "content": "* Food apps changing consumer landscape   (Adds graphic link)",
        "date": "10072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Fast food rivals expand  hitting Yum sales in India "
    },
    {
        "content": "* Indexes up: Dow 0.79 pct  S&P 0.69 pct  Nasdaq 0.49 pct   (Updates to open)",
        "date": "10072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Wall St opens higher as oil prices continue rise "
    },
    {
        "content": "Sept 15 Yum Brands Inc's <YUM.N > Taco Bell chain next week will debut a new restaurant concept that dumps the drive-thru and brings on the booze as it seeks to appeal to hip  young city dwellers and fend off popular rival Chipotle Mexican Grill Inc.",
        "date": "09152015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Taco Bell joins fast-food booze bandwagon with new U.S. eateries "
    },
    {
        "content": "Aug 18 Yum Brands Inc announced on Tuesday new leadership for its China division as investor activists lobby for the owner of the KFC and Pizza Hut brands to spin off that business  which is its biggest driver of revenue and profit.",
        "date": "08182015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "UPDATE 2-Yum China gets new leadership as activists push for spinoff "
    },
    {
        "content": "Aug 18 Yum Brands Inc on Tuesday announced new leadership for its China business as investor activists lobby for the owner of the KFC and Pizza Hut brands to spin off that business  which is its biggest driver of revenue and profit.",
        "date": "08182015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "CORRECTED-UPDATE 1-Yum China gets new leadership amid activist push for spin off "
    },
    {
        "content": "Aug 18 Yum Brands Inc  the owner of the Pizza Hut and KFC restaurant chains  said company veteran Micky Pant would replace Sam Su as chief executive of its China division.",
        "date": "08182015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands appoints Micky Pant as CEO of China division "
    },
    {
        "content": "SHANGHAI  Aug 6 On birthdays and for special treats  Lu Yuanli would take her son to their local KFC for his favourite meal  fried chicken wings  but the Chinese mother hasn't been back since a safety scare battered KFC-parent Yum Brands Inc and rival McDonald's Corp last year.",
        "date": "08052015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Food scares strip McDonald's  KFC of treat status in China "
    },
    {
        "content": "July 15 KFC and Pizza Hut owner Yum Brands Inc  stuck to its profit growth target for the year despite a slower-than-expected recovery in its Chinese business  which was hit by allegations of a supplier using expired meat last year.",
        "date": "07152015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum sticks to growth forecast despite slow China recovery "
    },
    {
        "content": "* China same-store sales fall 10 pct   (Adds comment by company executive  background)",
        "date": "07142015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "UPDATE 2-Yum Brands sales fall for 4th straight qtr as China woes continue "
    },
    {
        "content": "July 14 Yum Brands Inc  the owner of the Pizza Hut and Taco Bell restaurant chains  reported its fourth straight quarter of falling sales  as it struggles to recover from a food scandal in China  a market where the company makes most of its profit.",
        "date": "07142015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands sales fall for fourth straight quarter "
    },
    {
        "content": "MUMBAI  June 26 The Indian unit of fast food chain KFC  owned by Yum Brands Inc  on Friday challenged the results of a test showing the presence of bacteria linked to food poisoning in a sample of its fried chicken  dismissing them as \"false allegations\".",
        "date": "06262015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "KFC challenges Indian report on bacteria found in fried chicken "
    },
    {
        "content": "June 2 Nestle USA said on Tuesday it would remove artificial flavors and reduce salt by 10 percent in its frozen pizza and snack products by the end of this year.",
        "date": "06022015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Nestle USA to remove artificial flavors  cut salt in some foods "
    },
    {
        "content": "June 1 Yum Brands Inc's KFC unit in China said on Monday it has sued three companies it claims are using a popular messaging service to spread false rumors about the fried-chicken chain  including allegations that its chickens have six wings and eight legs.",
        "date": "06012015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "KFC China sues three companies amid eight-legged chicken rumors "
    },
    {
        "content": "May 15 U.S. shares ended little changed on Friday  with the S&P 500 edging up to a record high for a second straight session after a ream of weak economic data.",
        "date": "05152015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "US STOCKS-S&P ekes out second record close after lackluster data "
    },
    {
        "content": "May 15 U.S. shares dipped on Friday and the S&P 500 eased off a recent record high as a ream of weak data stirred concerns about the economy's health.",
        "date": "05152015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "REFILE-US STOCKS-Wall St dips  S&P off peak  on lackluster data "
    },
    {
        "content": "* Indexes down: Dow 0.07 pct  S&P 0.1 pct  Nasdaq 0.2 pct   (Updates to early afternoon)",
        "date": "05152015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Wall St slips after weak economic data "
    },
    {
        "content": "The likelihood is growing that Yum Brands Inc  will spin off its China business  J.P. Morgan said in a client note  upgrading the company's shares to \"overweight\" from \"neutral\".",
        "date": "05152015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum China spinoff becoming more probable: J.P. Morgan "
    },
    {
        "content": "LAS VEGAS Billionaire investor Daniel Loeb said on Wednesday that he sees room for restaurant chain company Yum! Brands  to potentially split off its China business  but said he is not pushing for that now.",
        "date": "05062015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Third Point's Loeb not pushing for Yum to split off China business "
    },
    {
        "content": "LAS VEGAS  May 6 Billionaire investor Daniel Loeb said on Wednesday that he sees room for restaurant chain company Yum! Brands to potentially split off its China business  but said he is not pushing for that now.",
        "date": "05062015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Third Point's Loeb not pushing for Yum to split off China business "
    },
    {
        "content": "LAS VEGAS  May 6 Billionaire investor Daniel Loeb said on Wednesday that he sees room for restaurant chain company Yum! Brands to potentially split off its China business but said he is not pushing for that now.",
        "date": "05062015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Third Point's Loeb not pushing for Yum! to split off China business "
    },
    {
        "content": "NEW YORK Billionaire hedge fund manager David Einhorn  who often moves a stock simply by speaking its name  on Monday kicked off the year's most prominent investment conference by laying out a case against oil frackers  arguing these companies drill \"lots and lots of holes\" and burn through plenty of cash.",
        "date": "05042015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Greenlight's Einhorn slams oil frackers at Sohn conference "
    },
    {
        "content": "NEW YORK  May 4 Billionaire hedge fund manager David Einhorn kicked off the 20th annual Sohn Investment Conference in New York on Monday by laying out his case against oil frackers  arguing that these companies drill \"lots and lots of holes\" and burn through plenty of cash.",
        "date": "05042015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Greenlight's Einhorn slams oil frackers  Meister touts Yum at Sohn "
    },
    {
        "content": "SHANGHAI U.S. food firm OSI Group LLC [OSIGP.UL] has cut 340 jobs at its embattled Shanghai plant  which supplied McDonald's Corp and Yum Brands Inc  bringing the facility close to shutdown  the firm said in a statement on its website on Monday.",
        "date": "04302015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "OSI cuts 340 workers from embattled Shanghai plant  shutdown looms "
    },
    {
        "content": "BOSTON Billionaire investor Daniel Loeb said on Friday his hedge fund has taken a new position in Yum! Brands   sending the fast-food restaurant company's stock up nearly 7 percent.",
        "date": "05012015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Third Point takes stake in Yum! Brands  stock climbs "
    },
    {
        "content": "SHANGHAI  April 30 Beijing authorities have fined U.S.-based J.R. Simplot's China processing unit  which supplies frozen french fries to McDonald's Corp  3.92 million yuan ($632 370) for water pollution  state media and Simplot said.",
        "date": "04302015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-McDonald's fries supplier fined in China for water pollution "
    },
    {
        "content": "* Indexes up: Dow 0.5 pct  S&P 0.5 pct  Nasdaq 0.5 pct   (Changes comment  updates prices)",
        "date": "05012015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Nasdaq snaps four-day losing streak as health stocks rebound "
    },
    {
        "content": "SHANGHAI  Sept 22 U.S. food firm OSI Group LLC  has cut 340 jobs at its embattled Shanghai plant  which supplied McDonald's Corp and Yum Brands Inc   bringing the facility close to shutdown  the firm said in a statement on its website on Monday.",
        "date": "04302015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "CORRECTED-OSI cuts 340 workers from embattled Shanghai plant  shutdown looms "
    },
    {
        "content": "SHANGHAI  April 29 A Chinese joint venture of U.S.-based J.R. Simplot  which supplies frozen french fries to McDonald's Corp  was fined 3.92 million yuan ($632 370) on Wednesday by the Beijing city government for water pollution  the official Xinhua news agency reported.",
        "date": "04302015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "CORRECTED-JV of McDonald's fries supplier fined in China for water pollution - Xinhua "
    },
    {
        "content": "BOSTON  May 1 Hedge fund Third Point told investors Friday it has taken new positions in Yum! Brands  and Devon Energy and thinks U.S. stocks remain attractive because economic data should improve and a near-term rate hike seems unlikely.",
        "date": "05012015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Third Point takes stakes in Yum! Brands  Devon Energy "
    },
    {
        "content": "* Indexes up: Dow 0.7 pct  S&P 0.6 pct  Nasdaq 0.8 pct   (Updates to open)",
        "date": "05012015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Wall St opens higher as tech  health stocks rebound "
    },
    {
        "content": "BOSTON  May 1 Hedge fund Third Point on Friday told investors that it has taken new positions in fast-food restaurant company Yum! Brands and Devon Energy and thinks U.S. stocks are still attractive because economic data should improve and a near term rate hike seems unlikely.",
        "date": "05012015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Third Point takes stakes in Yum!  Devon-letter "
    },
    {
        "content": "* Indexes close up: Dow 0.49 pct  S&P 0.51 pct  Nasdaq 0.42 pct",
        "date": "04222015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Stocks end stronger as investors look beyond mixed earnings "
    },
    {
        "content": "Yum Brands Inc  owner of KFC and Pizza Hut chains  on Tuesday said business in its biggest market China is recovering from a meat scare at one of its minor suppliers and the division would finish the year strong.",
        "date": "04212015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum CEO says China business mending  sees strong year-end finish "
    },
    {
        "content": "April 22 U.S. stocks rose in afternoon trading on Wednesday as Visa's potential expansion into China and talk of a turnaround at McDonald's helped investors see the bright side of mixed quarterly earnings.",
        "date": "04222015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "CORRECTED-US STOCKS-Stocks gain as investors eye bright side of mixed earnings "
    },
    {
        "content": "April 22 Yum Brands Inc  owner of the KFC  Taco Bell and Pizza Hut restaurant brands  on Wednesday said it expects another tough quarter before a recovery in China bolsters results in the second half.",
        "date": "04222015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum Brands sees short-term challenges before second-half recovery "
    },
    {
        "content": "April 21 Yum Brands Inc  owner of KFC and Pizza Hut chains  on Tuesday said business in its biggest market China is recovering from a meat scare at one of its minor suppliers and the division would finish the year strong.",
        "date": "04212015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 2-Yum CEO says China business mending  sees strong year-end finish "
    },
    {
        "content": "April 22 Yum Brands Inc  owner of the KFC  Taco Bell and Pizza Hut restaurant brands  on Wednesday said it expects another tough quarter before a recovery in China  its No. 1 revenue and profit driver  bolsters results in the second half.",
        "date": "04222015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Yum Brands sees short-term challenges before second-half recovery "
    },
    {
        "content": "April 21 Yum Brands Inc  owner of KFC and Pizza Hut  said on Tuesday that sales at established restaurants in its biggest market China fell less than expected for the first quarter as it works to recover from a food scandal involving a minor supplier.",
        "date": "04212015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum's China restaurant sales drop less than expected "
    },
    {
        "content": "SHANGHAI Dimmed lights and colonial-style balconies give little indication that trendy Shanghai eatery Atto Primo is part of global fast-food giant Yum Brands Inc   owner of the KFC and Pizza Hut brands. | Video ",
        "date": "04132015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "Yum's upmarket China diner seeks recipe for revival "
    },
    {
        "content": "* Dow off 0.45 pct  S&P down 0.1 pct  Nasdaq up 0.48 pct   (Updates to afternoon)",
        "date": "04212015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Wall St mixed as doubts about earnings offset biotech M&A bid "
    },
    {
        "content": "* Dow off 0.33 pct  S&P down 0.05 pct  Nasdaq up 0.47 pct   (Updates to early afternoon)",
        "date": "04212015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Wall St mixed as lackluster earnings offset biotech M&A bid "
    },
    {
        "content": "SHANGHAI  April 11 Dimmed lights and colonial-style balconies give little indication that trendy Shanghai eatery Atto Primo is part of global fast-food giant Yum Brands Inc  owner of the KFC and Pizza Hut brands.",
        "date": "04132015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "UPDATE 1-Yum's upmarket China diner seeks recipe for revival "
    },
    {
        "content": "SHANGHAI  April 11 Dimmed lights and colonial-style balconies give little indication that trendy Shanghai eatery Atto Primo is part of global fast-food giant Yum Brands Inc  owner of the KFC and Pizza Hut brands.",
        "date": "04122015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "RPT-Yum's upmarket China diner seeks recipe for revival "
    },
    {
        "content": "* Dow off 0.4 pct  S&P down 0.15 pct  Nasdaq up 0.4 pct   (Updates to midday  adds comment  updates prices)",
        "date": "04212015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Wall St mixed as earnings offset merger news "
    },
    {
        "content": "SHANGHAI  April 11 Dimmed lights and colonial-style balconies give little indication that trendy Shanghai eatery Atto Primo is part of global fast-food giant Yum Brands Inc  owner of the KFC and Pizza Hut brands.",
        "date": "04112015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "Yum's upmarket China diner seeks recipe for revival "
    },
    {
        "content": "* Dow components Verizon  DuPont and United Tech beat estimates",
        "date": "04212015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "US STOCKS-Wall St set to rise as results beat low expectations "
    },
    {
        "content": "Feb 4 Yum Brands Inc  owner of KFC and Pizza Hut   said on Wednesday that sales at established restaurants in its biggest market China fell less than feared in the fourth quarter as it fights to recover from a food scandal involving a minor supplier  and its shares jumped 2.1 percent.",
        "date": "02042015",
        "name": "Yum! Brands Inc",
        "news_type": "topStory",
        "symbol": "YUM",
        "title": "UPDATE 2-Yum's China sales fall less than expected  shares rise "
    },
    {
        "content": "SHANGHAI  Jan 7 U.S. food supplier OSI Group LLC  which came under fire in China last year over allegations it used out-of-date meat  has criticised the handling of the case by the local food regulator  a rare act in China where firms are usually careful not to openly challenge the authorities.",
        "date": "01072015",
        "name": "Yum! Brands Inc",
        "news_type": "normal",
        "symbol": "YUM",
        "title": "U.S. supplier in China food scare takes aim at Shanghai regulator "
    }
]