[
    {
        "content": "Oct 5 Yum China Holdings Inc's quarterly same-store sales beat estimates  driven by strong sales at its KFC restaurants  and the company said its CEO Micky Pant would step down.",
        "date": "10052017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "Yum China same-store sales beat  CEO to step down "
    },
    {
        "content": "Oct 5 Yum China Holdings Inc's quarterly same-store sales beat analysts' estimates as its KFC restaurants served up strong results  and the company said its Chief Executive Micky Pant would step down.",
        "date": "10052017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "UPDATE 1-Yum China same-store sales beat  CEO to step down "
    },
    {
        "content": "* Yum China reports 6% same-store sales growth and 10% system sales growth; operating profit up 11% YOY; board declares initial dividend and expands share repurchase authorization",
        "date": "10052017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China Holdings Q3 earnings per share $0.53 "
    },
    {
        "content": "* Yum china holdings compensation committee of board approved increase in jacky lo’s annual base salary from hk$ 2.6 million to hk$ 4.5 million - sec filing​ ‍​ Source text for Eikon: (http://bit.ly/2wbon56) Further company coverage:",
        "date": "08282017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China Holdings says approved increase in Jacky Lo's annual base salary‍​ "
    },
    {
        "content": "* Yum China announces appointment of Jacky Lo as Chief Financial Officer",
        "date": "08282017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China announces appointment of Jacky Lo as CFO "
    },
    {
        "content": "* Yum China board expands with more China market and operation insights",
        "date": "07182017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China board expands with more China market and operation insights "
    },
    {
        "content": "SHANGHAI/BENGALURU Yum China Holdings Inc  the operator of KFC  Pizza Hut and Taco Bell in the world's second-largest economy  posted quarterly sales slightly below estimates  dragged down by sluggish growth at Pizza Hut amid a turnaround drive.",
        "date": "07062017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "Thin crust: Pizza Hut weighs on Yum China growth "
    },
    {
        "content": "SHANGHAI/BENGALURU  July 6 Yum China Holdings Inc  the operator of KFC  Pizza Hut and Taco Bell in the world's second-largest economy  posted quarterly sales slightly below estimates  dragged down by sluggish growth at Pizza Hut amid a turnaround drive.",
        "date": "07062017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "UPDATE 2-Thin crust: Pizza Hut weighs on Yum China growth "
    },
    {
        "content": "* Yum China reports Q2 same-store sales growth of 3% and operating profit growth of 64%; loyalty members surpassed 100 million; mobile payment exceeded 40% of total company sales",
        "date": "07052017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China reports qtrly earnings per share $0.27 "
    },
    {
        "content": "July 5 Yum China Holdings Inc reported a 39 percent rise in quarterly profit on Wednesday  helped by strong sales at its KFC restaurants.",
        "date": "07052017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "Yum China's quarterly profit jumps 39 pct on strong KFC sales "
    },
    {
        "content": "May 15 Yum China Holdings Inc said it would buy a controlling stake in food delivery services firm Daojia to expand delivery services for its KFC and Pizza Hut chains in the country.",
        "date": "05152017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "Yum China to buy majority stake in delivery services firm Daojia "
    },
    {
        "content": "* Has entered into a definitive agreement to acquire a controlling interest in holding company of Daojia.com.cn",
        "date": "05152017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China to acquire controlling interest in Daojia's holding company "
    },
    {
        "content": "* Yum China Holdings Inc - restaurant margins benefited from VAT reform year ended Dec 31  2016  quarter ended February 28  2017 - SEC filing",
        "date": "04072017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China Holdings says restaurant margins benefited from VAT reform year ended Dec 31 "
    },
    {
        "content": "SHANGHAI Yum China Holdings Inc  posted a slight rise in first-quarter same-store sales  helped by a jump in takeout demand and improvement at its flagging Pizza Hut brand as the newly spun-off firm looks to revive growth in the world's second-biggest economy.",
        "date": "04062017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "Yum China posts positive first quarter on takeout sales  tax break "
    },
    {
        "content": "* Yum China achieved a strong first quarter with same-store sales growth of 1%; operating profit grew 22%; restaurant margin expanded to 23%",
        "date": "04052017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China posts Q1 earnings per share of $0.44 "
    },
    {
        "content": "* Shares up 10 pct after market close (Adds executive comments  details)",
        "date": "04062017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "UPDATE 3-Yum China posts positive Q1 on takeout sales  tax break "
    },
    {
        "content": "April 5 Yum China Holdings Inc reported a 20.7 percent rise in quarterly earnings  as margins improved.",
        "date": "04052017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "Yum China's quarterly earnings rise almost 21 pct "
    },
    {
        "content": "* Yum china holdings inc - ceo micky pant's 2016 total compensation was $10.4 million - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "03172017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China Holdings says CEO Micky Pant's 2016 total compensation was $10.4 mln "
    },
    {
        "content": " ",
        "date": "02082017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "Yum China restaurant sales flat in fourth quarter "
    },
    {
        "content": "* Yum China reports full year operating profit of $640 million  up 31% year-over-year led by margin expansion and new unit openings; board authorizes share repurchase program",
        "date": "02072017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China reports full year operating profit of $640 million  up 31% year-over-year led by margin expansion and new unit openings "
    },
    {
        "content": "LOS ANGELES  Feb 7 Yum China Holdings Inc   reporting for the first time as a standalone company  on Tuesday said its profit beat expectations for the fourth quarter despite just missing Wall Street's target for sales at established restaurants.",
        "date": "02082017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "CORRECTED-UPDATE 2-Yum China restaurant sales flat in fourth quarter "
    },
    {
        "content": "* Yum China announces appointment of Joey Wat as president and chief operating officer of Yum China and Johnson Huang as general manager of KFC  Yum China",
        "date": "02072017",
        "name": "Yum China Holdings Inc",
        "news_type": "normal",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China announces appointment of Joey Wat as president and chief operating officer of Yum China and Johnson Huang as general manager of KFC  Yum China "
    },
    {
        "content": "* Yum China launches Taco Bell brand in China  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom)",
        "date": "01092017",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "BRIEF-Yum China Holdings launches Taco Bell brand in China "
    },
    {
        "content": " (This November 25 story corrects to remove references to daojia.com to avoid confusion with a website connected to another company  58 Daojia) | Video ",
        "date": "11262016",
        "name": "Yum China Holdings Inc",
        "news_type": "topStory",
        "symbol": "YUMC",
        "title": "Exclusive: Yum China in talks to buy delivery services firm Daojia - sources "
    }
]