[
    {
        "content": "* CONFIRMS AGREEMENT TO GRANT RIGHTS FOR FIRST NATIONAL CHANNEL IN UKRAINE TO TWO SEASONS OF SISSI​",
        "date": "11022017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Mondo TV grants First National Channel in Ukraine rights to Sissi​ "
    },
    {
        "content": "* NINE-MONTH NET PROFIT ATTRIBUTABLE TO SHAREHOLDERS 9.5 MILLION DINARS VERSUS 1 MILLION DINARS YEAR AGO",
        "date": "11012017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Kuwait's National Investments 9-month profit rises "
    },
    {
        "content": "* Zions Bancorporation reports third quarter financial results",
        "date": "10232017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorp reports Q3 earnings $0.72/shr "
    },
    {
        "content": "* ZB  N.A. PPS Data   units of co entered settlement  dated September 20 with U.S. Attorney's office for Eastern District of Pennsylvania​",
        "date": "09282017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorp's units enter settlement with U.S. Attorney's office "
    },
    {
        "content": "* Zions Bancorporation reports second quarter financial results",
        "date": "07252017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorp Q2 earnings per share $0.73 "
    },
    {
        "content": "* Says Zions Bancorporation goes live on TCS BaNCS core banking software",
        "date": "07172017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Tata Consultancy Services says Zions Bancorporation goes live on TCS BaNCS core banking software "
    },
    {
        "content": "* Says total exposure to Qatar represents about 1.5 percent of co's total assets as of March 31 Source text for Eikon: Further company coverage: )",
        "date": "07032017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Kuwait's National Investments says total exposure to Qatar 1.5 pct "
    },
    {
        "content": "* Q1 net profit attributable to shareholders 4 million dinars versus 1.1 million dinars year ago",
        "date": "05092017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Kuwait's National Investments Q1 profit rises "
    },
    {
        "content": "* Zions Bancorporation reports first quarter financial results",
        "date": "04242017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorporation reports Q1 earnings per share $0.61 "
    },
    {
        "content": "* FY net loss 4 million dinars versus loss of 5.6 million dinars year ago",
        "date": "04122017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Kuwait's National Investments FY loss narrows "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 07 (Fitch) Fitch Ratings has affirmed and withdrawn the ratings for Zions Bancorp (ZION) and its principal banking subsidiary Z.B.  N.A. (ZBNA) including the companies' Issuer Default Ratings (IDRs) of 'BBB-'. The ratings were withdrawn with a Positive Outlook. As communicated on March 6  2017  the ratings are being withdrawn for commercial reasons. A full list of rating actions follows at the end of this release. KEY RAT",
        "date": "04072017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "Fitch Affirms Zions Bancorp at 'BBB-'; Ratings Withdrawn "
    },
    {
        "content": "* Says its board granted a waiver to co's code of business conduct and ethics  that had been requested by its ceo Harris Simmons",
        "date": "04042017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorp's board grants waiver to company's code of conduct requested by its CEO "
    },
    {
        "content": "RABAT  March 29 Morocco's National Investment Co (SNI) an investment holding firm controlled by the country's monarchy  reported a 34 percent increase in net profit  helped by capital gains from a merger between Lafarge Ciments and Holcim Maroc  it said in a statement on Wednesday.",
        "date": "03292017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "Morocco's SNI says 2016 profit up 34 pct - local media "
    },
    {
        "content": "NEW YORK  March 24 Little-known Thrivent Financial  a Minneapolis-based asset manager that offers financial services to Lutherans  is hoping its recent streak of outperformance will make it stand apart at a time when steep investor outflows are prompting a wave of mergers throughout the mutual fund industry.",
        "date": "03242017",
        "name": "Zions Bancorporation",
        "news_type": "normal",
        "symbol": "ZION",
        "title": "RPT-How Thrivent hopes to grow beyond its base of religious investors "
    },
    {
        "content": "NEW YORK  March 24 Little-known Thrivent Financial  a Minneapolis-based asset manager that offers financial services to Lutherans  is hoping its recent streak of outperformance will make it stand apart at a time when steep investor outflows are prompting a wave of mergers throughout the mutual fund industry.",
        "date": "03242017",
        "name": "Zions Bancorporation",
        "news_type": "normal",
        "symbol": "ZION",
        "title": "How Thrivent hopes to grow beyond its base of religious investors "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 06 (Fitch) Fitch Ratings plans to withdraw the ratings of Zions  Bancorporation and its subsidiaries on or about April 6  2017 for commercial  reasons. Fitch currently rates the entities as follows: Zions Bancorporation --Issuer Default Rating (IDR) 'BBB-'; Outlook Positive; --Short-term IDR 'F3'; --Viability Rating 'bbb-'; --Senior unsecured debt 'BBB-'; --Subordinated debt 'BB+';  --Short-term debt 'F3'; --Preferred sto",
        "date": "03062017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "Fitch Plans to Withdraw Zions Bancorporation's Ratings "
    },
    {
        "content": "* Adeptio gets Capital Markets Authority approval for mandatory acquisition of 107.1 million shares of Kuwait's Americana from minority shareholders  Source text for Eikon:  Further company coverage:",
        "date": "02232017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Kuwait's National Investments says Adeptio gets CMA nod for acquisition of 26.634 pct stake "
    },
    {
        "content": "* Americana's minority shareholders agree to sell 107.1 million shares  or 26.63 percent stake  in company to Adeptio",
        "date": "02142017",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-National Investments says Americana's minority shareholders agree to sell 107.1 mln shares in co to Adeptio "
    },
    {
        "content": "DUBAI  Nov 6 Gulf investment firm Adeptio has chosen Kuwait's National Investment Company (NIC) to manage a mandatory tender offer to remaining Kuwait Food Co  (Americana) shareholders  the advisor said in a bourse filing on Sunday.",
        "date": "11062016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "Gulf investor firm Adeptio picks Kuwait's NIC for mandatory offer "
    },
    {
        "content": "RABAT  Oct 27 Morocco's Attijariwafa Bank  said it will sell 50 percent of OGM Holding  the parent company of Morocco's biggest insurance company Wafa Assurance  to the royal holding firm National Investment Co. (SNI) ahead of buying Barclays Egypt.",
        "date": "10272016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "Attijariwafa Bank sells 50 pct of Wafa Assurance parent OGM to SNI "
    },
    {
        "content": "* Zions Bancorporation reports third quarter financial results",
        "date": "10242016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorporation reports Q3 financial results "
    },
    {
        "content": "DUBAI  Oct 5 Kuwait's National Investments Co (NIC) said on Wednesday it was appointed to execute the purchase of a majority stake in Kuwait Food Co on behalf of one of its clients.",
        "date": "10052016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "Kuwait's NIC says appointed to execute Americana deal "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 04 (Fitch) Fitch Ratings has affirmed Zions Bancorporation's  (ZION) ratings at 'BBB-/F3'. The Rating Outlook has been revised to Positive  from Stable. The Positive Outlook reflects Fitch's observation that management has begun  making notable progress in addressing the company's strategic objectives which  is expected to lead to persistently improved core earnings over the rating time  horizon. Fitch believes this pro",
        "date": "10042016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "Fitch Affirms Zions at 'BBB-/F3'; Outlook Revised to Positive "
    },
    {
        "content": "* Net interest income was $465 million for 2q16  up 3% from 1Q16 and up 10% from 2Q15",
        "date": "07262016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorp. reports Q2 earnings per share of $0.44 "
    },
    {
        "content": "* Zions Bancorp says board of directors declared a regular quarterly dividend of $0.08 per common share",
        "date": "07222016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorp board declares qtrly dividend of $0.08 per common share "
    },
    {
        "content": "* Intends to enter into a settlement with plaintiff in class action case  Reynaldo Reyes V Zions First National Bank",
        "date": "07062016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions bank to enter settlement with plaintiff in class action case "
    },
    {
        "content": "* Fed reserve does not object to Co's board-approved 2016 capital plan  as submitted to federal reserve on April 5  2016",
        "date": "06292016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorp says fed reserve does not object its board-approved 2016 capital plan "
    },
    {
        "content": "* Zions Bancorporation announces expiration and successful results of preferred stock tender offers",
        "date": "05232016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions announces results of preferred stock tender offers "
    },
    {
        "content": "* Zions Bancorporation reports first quarter financial results",
        "date": "04252016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorporation Q1 earnings per share $0.38 "
    },
    {
        "content": "* Commences tender offers to purchase up to $120 million aggregate liquidation preference of outstanding preferred stock  depositary shares  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04252016",
        "name": "Zions Bancorporation",
        "news_type": "normal",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorp commences tender offers to purchase up to $120 mln shares "
    },
    {
        "content": "RABAT  March 31 Morocco's National Investment Co. (SNI)  an investment holding firm controlled by the country's monarchy  reported a 7.7 percent fall in 2015 net profit  it said on Thursday.",
        "date": "03312016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "UPDATE 1-Moroccan royal holding firm SNI reports 7.7 pct drop in 2015 profit "
    },
    {
        "content": "RABAT  March 31 Morocco's National Investment Co. (SNI)  an investment holding firm controlled by the country's monarchy  reported a 7.7 percent fall in 2015 net profit on Thursday.",
        "date": "03312016",
        "name": "Zions Bancorporation",
        "news_type": "normal",
        "symbol": "ZION",
        "title": "Moroccan royal holding firm SNI reports 7.7 pct drop in 2015 profit "
    },
    {
        "content": "* \u007fterms of outstanding warrants to purchase common stock of zions issued in may and october of 2010 amended\u007f",
        "date": "03182016",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "BRIEF-Zions Bancorp updates warrant information "
    },
    {
        "content": "CALGARY  Alberta  Nov 6 TransCanada Corp  said on Friday it will keep pressing to build the Keystone XL oil pipeline from Canada to the United States despite the Obama administration's rejection  but skeptical investors suggested it focus on a controversial all-Canadian alternative.",
        "date": "11092015",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "CORRECTED-UPDATE 3-TransCanada says to keep pushing Keystone; investors skeptical "
    },
    {
        "content": "CALGARY  Alberta  Nov 6 TransCanada Corp  said on Friday it will keep pressing to build the Keystone XL oil pipeline from Canada to the United States despite the Obama administration's rejection  but skeptical investors suggested it focus on a controversial all-Canadian alternative.",
        "date": "11062015",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "UPDATE 3-TransCanada says to keep pushing Keystone; investors skeptical "
    },
    {
        "content": " (This November 6 story has been corrected to change name in paragraph 11 to Adam Scott from Adam Smith)",
        "date": "11092015",
        "name": "Zions Bancorporation",
        "news_type": "normal",
        "symbol": "ZION",
        "title": "TransCanada says to keep pushing Keystone; investors skeptical "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 05 (Fitch) Fitch Ratings has affirmed Zions Bancorporation's  (ZION) ratings at 'BBB-/F3'. The Rating Outlook remains Stable.  The rating action follows a periodic review of the large regional banking group   which includes BB&T Corporation (BBT)  Capital One Finance Corporation (COF)   Comerica Incorporated (CMA)  Fifth Third Bancorp (FITB)  Huntington Bancshares  Inc. (HBAN)  Keycorp (KEY)  M&T Bank Corporation (MTB) ",
        "date": "10052015",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "Fitch Affirms Zions Bancorp.'s LT IDR at 'BBB-' Following Large Regional Bank Review; Outlook Stable "
    },
    {
        "content": "RABAT  March 30 Morocco's National Investment Co.  an investment holding firm controlled by the country's monarchy  posted a 42.3 percent fall in 2014 net profit  it said on Monday  after selling stakes in the food industry to focus on other sectors such as energy.",
        "date": "03302015",
        "name": "Zions Bancorporation",
        "news_type": "topStory",
        "symbol": "ZION",
        "title": "UPDATE 1-Moroccan royal holding firm SNI's 2014 profit falls 42 pct "
    }
]