[
    {
        "content": "SHANGHAI  Oct 20 China Southern Airlines has signed a deal to buy 38 aircraft from U.S. planemaker Boeing Co with a combined price tag of $5.65 billion  the Chinese carrier said on Friday.",
        "date": "10202017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern to buy 38 Boeing jets worth $5.65 bln "
    },
    {
        "content": "* Says it signs agreement to buy 8 B777-300ER  30 B737-8 aircraft from Boeing",
        "date": "10202017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "BRIEF-China Southern Airlines signs agreement to buy aircraft from Boeing "
    },
    {
        "content": "SHANGHAI  Aug 29 China Southern Airlines on Tuesday posted a 11.6 percent fall in first-half profit  as foreign exchange gains failed to offset the impact of higher fuel prices and lower returns on international flights.",
        "date": "08292017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China Southern Airlines first-half profit falls 11.6 pct "
    },
    {
        "content": "* Profits crimped by declining passenger yields  rising fuel price",
        "date": "08302017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "UPDATE 1-Chinese airlines face storm of higher costs  falling returns "
    },
    {
        "content": "* S.Korea one of Chinese airlines' most profitable destinations",
        "date": "08272017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "Korean peninsula crisis to trim Chinese airline profits "
    },
    {
        "content": "* CAE sells equity stake in ZFTC joint venture with China Southern Airlines",
        "date": "08102017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "BRIEF-CAE sells equity stake in ZFTC Joint Venture with China Southern Airlines "
    },
    {
        "content": "* Gets order from China Southern Airlines General Aviation for integrating its organization-wide maintenance  engineering operations Source text - (http://bit.ly/2uTJAhl) Further company coverage:",
        "date": "07132017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "BRIEF-Ramco Systems gets order from China Southern Airlines General Aviation "
    },
    {
        "content": "HONG KONG China Southern Airlines   said on Monday it will raise up to 12.7 billion yuan ($1.9 billion) in a private sale of new shares to fund the purchase of aeroplanes and replenish working capital.",
        "date": "06262017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China Southern Air to raise up to $1.9 billion in share issue for aircraft purchase  capital boost "
    },
    {
        "content": "HONG KONG  June 26 China Southern Airlines said on Monday it will raise up to 12.7 billion yuan ($1.9 billion) in a private sale of new shares to fund the purchase of aeroplanes and replenish working capital.",
        "date": "06262017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern Air to raise up to $1.9 bln in share issue for aircraft purchase  capital boost "
    },
    {
        "content": "SHANGHAI  April 26 China Southern Airlines has signed a deal worth nearly $6 billion to buy 20 aircraft from European planemaker Airbus SE  the Chinese carrier said on Wednesday.",
        "date": "04262017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China Southern to buy 20 Airbus jets for close to $6 billion "
    },
    {
        "content": "MEXICO CITY  April 11 China Southern Airlines Co Ltd has flown its inaugural Guangzhou to Mexico City flight  via Vancouver  the first route operated by a domestic Chinese carrier to the Latin American nation  the Mexican government said on Tuesday.",
        "date": "04112017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern Airlines launches first flight to Mexico "
    },
    {
        "content": "SHANGHAI  March 30 China Southern Airlines Co Ltd on Thursday reported a 29.9 percent rise in 2016 net profit  below analysts' expectations  as a weaker yuan put a dent on strong domestic demand for overseas travel.",
        "date": "03302017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "CORRECTED-China Southern says full-year profits jump 30 pct  below expectations "
    },
    {
        "content": "HONG KONG/SHANGHAI China Southern Airlines Co Ltd  said on Tuesday it will sell a small stake to American Airlines Group Inc  in a $200 million deal that will give the carriers better access to the world's two largest travel markets.",
        "date": "03282017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "All aboard: American Airlines takes $200 million stake in China Southern "
    },
    {
        "content": "* Says trading in A-shares to resume on March 28 after it is in talks over a tie-up with American Airlines Group Inc",
        "date": "03272017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "BRIEF-China Southern Airlines' A-share trade to resume on March 28 "
    },
    {
        "content": "* Deal means China's big 3 airlines have foreign stakeholders",
        "date": "03282017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "UPDATE 3-All aboard: American Airlines takes $200 mln stake in China Southern "
    },
    {
        "content": "SHANGHAI China Southern Airlines is in talks over a tie-up with American Airlines that could involve the U.S. carrier taking a stake in the state-owned airline  boosting routes between the world's two largest travel markets.",
        "date": "03272017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern in talks over American Airlines tie-up "
    },
    {
        "content": "SHANGHAI  March 28 China Southern Airlines Co Ltd's Hong Kong-listed shares jumped by more than 2.5 pct in opening trade after the company said it would sell a stake to a subsidiary of American Airlines",
        "date": "03282017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern Airlines' shares jump after American Airlines buy-in "
    },
    {
        "content": "SHANGHAI  March 26 China Southern Airlines  is negotiating a potential strategic tie-up with American Airlines that could involve a share issue and other forms of business cooperation  it said on Sunday.",
        "date": "03262017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China Southern Airlines in talks over American Airlines cooperation deal "
    },
    {
        "content": "* Talks involve American Airlines taking stake in China Southern",
        "date": "03272017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "UPDATE 1-China Southern in talks over American Airlines tie-up "
    },
    {
        "content": "HONG KONG  March 27 Hong Kong shares of China Southern Airlines are set to open up 5.3 percent on Monday after the Chinese carrier said it was negotiating a potential strategic tie-up with American Airlines .",
        "date": "03272017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern Airlines set to open 5.3 pct up in HK on tie-up talks "
    },
    {
        "content": "* Air Lease Corporation announces lease placement of five new Boeing 787-9 Dreamliners with China Southern Airlines",
        "date": "02062017",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "BRIEF-Air Lease says five Boeing 787-9 Dreamliners leased to China Southern Airlines "
    },
    {
        "content": "* Boeing  China Southern Airlines finalize order for 12 787-9 Dreamliners",
        "date": "10122016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "BRIEF-Boeing  China Southern Airlines finalize order for 12 787-9 Dreamliners "
    },
    {
        "content": "SINGAPORE China Southern Airlines   the country's largest carrier by fleet size  has signed an agreement with Boeing  to buy a dozen B787-9 jets worth $3.3 billion in the latest sign of booming Chinese demand for air travel.",
        "date": "10122016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern Airlines to buy 12 Boeing jets worth about $3 billion "
    },
    {
        "content": "SINGAPORE  Oct 12 China Southern Airlines     the country's largest carrier by fleet size  has signed an agreement with Boeing to buy a dozen B787-9 jets worth $3.3 billion in the latest sign of booming Chinese demand for air travel.",
        "date": "10122016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern Airlines to buy 12 Boeing jets worth about $3 bln "
    },
    {
        "content": "* very substantial acquisition in relation to acquisition of aircraft",
        "date": "10122016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "BRIEF-China Southern Airlines enters into acquisition agreement with Boeing "
    },
    {
        "content": "BEIJING China will prosecute former senior officials of energy giant Sinopec Group and China Southern Airlines as well as a one-time top security official in Tibet for suspected graft  the prosecutor's office said on Monday.",
        "date": "09262016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China to prosecute former top executives for alleged graft "
    },
    {
        "content": "* Officials of Sinopec Group  China Southern Airlines targeted",
        "date": "09262016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "UPDATE 1-China to prosecute former top executives for alleged graft "
    },
    {
        "content": "HONG KONG China Southern Airlines  said on Wednesday its subsidiary  Xiamen Airlines  had signed an agreement to buy six airplanes from Boeing Co  worth $1.4 billion at list prices.",
        "date": "07272016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China Southern unit  Xiamen Airlines  to buy Boeing jets for $1.4 billion "
    },
    {
        "content": "HONG KONG  July 27 China Southern Airlines  said on Wednesday its subsidiary  Xiamen Airlines  had signed an agreement to buy six airplanes from Boeing Co  worth $1.4 billion at list prices.",
        "date": "07272016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern unit  Xiamen Airlines  to buy Boeing jets for $1.4 bln "
    },
    {
        "content": "* Says unit signs contract to buy six aircrafts from Boeing  for about $1.4 billion",
        "date": "07272016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "BRIEF-China Southern Airlines's unit to buy Boeing aircrafts for about $1.4 bln "
    },
    {
        "content": "* \"Immediately accretive southern air acquisition completed\"  Source text for Eikon:  Further company coverage:",
        "date": "05052016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "BRIEF-Atlas Air Worldwide completes Southern Air acquisition "
    },
    {
        "content": "BEIJING  April 26 China Southern Airlines  said on Tuesday its subsidiary Xiamen Airlines has signed a 5.5 billion yuan ($847.08 million) order with Boeing Co  for buying 10 B737 jets.",
        "date": "04262016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China Southern says unit Xiamen agrees to buy 10 Boeing jets for $847 mln "
    },
    {
        "content": "* Says unit Xiamen Airlines buys 10 B737-800 aircrafts from Boeing for about $851 million",
        "date": "04262016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "BRIEF-China Southern Airlines's unit Xiamen Airlines buys Boeing aircrafts "
    },
    {
        "content": "SHANGHAI  April 7 Two former China South Airlines  executives  including the firm's ex-chief financial officer  have pleaded guilty to accepting bribes  the official news Xinhua agency said late on Wednesday.",
        "date": "04072016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "Former China Southern execs plead guilty to accepting bribes - Xinhua "
    },
    {
        "content": "SINGAPORE  Jan 26 China Southern    the country's largest airline by fleet size  expects its net profit to have more than doubled in 2015 due to increased overseas travel by the Chinese  weak oil prices and lower forex losses as the yuan depreciated.",
        "date": "01262016",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China Southern Airlines sees 2015 profit more than doubling "
    },
    {
        "content": "BEIJING  Dec 23 China Southern Airlines Co  has signed deals worth about $2.3 billion to buy 10 aircrafts from Airbus Group SE  the carrier said on Wednesday.",
        "date": "12232015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern says to buy Airbus aircraft for $2.3 billion "
    },
    {
        "content": "BEIJING  Dec 17 China Southern Airlines  and its affiliate Xiamen Airlines have signed deals worth about $10 billion to buy Boeing Co airplanes  company statements on the Shanghai Stock Exchange's website showed on Thursday.",
        "date": "12172015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China Southern  affiliate Xiamen to buy Boeing planes for $10 billion "
    },
    {
        "content": "* Says unit Xiamen Airlines signs agreement with Boeing to buy 30 B737MAX",
        "date": "12172015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "BRIEF-China Southern  unit to acquire Boeing planes "
    },
    {
        "content": "SHANGHAI  Dec 8 Shanghai stocks posted their biggest loss in 10 days  as disappointing China trade data and slumping oil prices unnerved investors already cautious ahead of an anticipated U.S. rate hike that could trigger more capital outflows.",
        "date": "12082015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China stocks weighed down by weak trade data  oil market rout "
    },
    {
        "content": "SHANGHAI  Dec 8 China and Hong Kong stocks ended Tuesday morning sharply lower  as disappointing China trade data and slumping oil prices unnerved investors already cautious ahead of an anticipated U.S. rate hike next week that could trigger more capital outflows.",
        "date": "12082015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "China  Hong Kong stocks drop on weak China trade data  lower oil prices "
    },
    {
        "content": "BEIJING  Nov 20 China's state prosecutor said on Friday it had ordered the arrest of a former deputy general manager of China Southern Airlines Co Ltd   on suspicion of bribery.",
        "date": "11202015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "UPDATE 1-China orders arrest of former China Southern executive "
    },
    {
        "content": "BEIJING The chairman of China Southern Airlines  Si Xianmin  is being investigated for \"serious discipline violations\"  the ruling Communist Party's graft watchdog said on Wednesday.",
        "date": "11042015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China Southern Airlines chairman investigated for suspected graft: watchdog "
    },
    {
        "content": "BEIJING/HONG KONG Air China  and China Southern Airlines  dismissed a media report of a possible merger of the two state-owned carriers  which had caused their share prices to close at their upper limits in Shanghai on Thursday.",
        "date": "10222015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "Air China  China Southern dismiss report of possible merger "
    },
    {
        "content": "BEIJING/HONG KONG  Oct 22 Air China  and China Southern Airlines dismissed a media report of a possible merger of the two state-owned carriers  which had caused their share prices to close at their upper limits in Shanghai on Thursday.",
        "date": "10222015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "UPDATE 2-Air China  China Southern dismiss report of possible merger "
    },
    {
        "content": "BEIJING  Oct 22 Chinese state carrier Air China  and China Southern Airlines could be merged  a state-owned newspaper said on Thursday  as Beijing continues to consolidate its bloated state-owned conglomerates to improve competitiveness.",
        "date": "10222015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "Air China and China Southern face merger - Shanghai Securities News "
    },
    {
        "content": "SHANGHAI  June 25 China's three largest airline cargo carriers will merge to form Asia's largest freight transport company  according to a senior official at the Civil Aviation Administration of China.",
        "date": "06252015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "REFILE-China's cargo carriers merge to form Asia's largest freight company "
    },
    {
        "content": "BEIJING A former senior executive at the state-run China Southern Power Grid has been arrested for suspected bribery  the state prosecutor said on Tuesday  the latest official to fall victim to the government's battle against graft.",
        "date": "06162015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China arrests former senior energy executive after graft probe "
    },
    {
        "content": "BEIJING  June 16 A former senior executive at the state-run China Southern Power Grid has been arrested for suspected bribery  the state prosecutor said on Tuesday  the latest official to fall victim to the government's battle against graft.",
        "date": "06162015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "UPDATE 2-China arrests former senior energy executive after graft probe "
    },
    {
        "content": "BEIJING Two senior energy executives are under investigation  authorities in China said on Thursday  as a corruption crackdown on state-owned enterprises continues to fell top officials.",
        "date": "04022015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "Two Chinese energy executives under investigation "
    },
    {
        "content": "BEIJING A top executive of state-run China Southern Power Grid is under investigation for \"serious disciplinary violations\"  the graft watchdog of Guangdong province said on Monday  as the government presses home its fight against pervasive corruption.",
        "date": "03302015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "topStory",
        "symbol": "ZNH",
        "title": "China probes senior power official for graft "
    },
    {
        "content": "BEIJING  April 2 A senior executive of state-run China Southern Power Grid is under criminal investigation  legal authorities in Guangdong province said in a statement on its website on Thursday.",
        "date": "04022015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "Chinese senior power official under criminal investigation "
    },
    {
        "content": "BEIJING  March 30 A top executive of state-run China Southern Power Grid is under investigation for \"serious disciplinary violations\"  the graft watchdog of Guangdong province said on Monday  as the government presses home its fight against pervasive corruption.",
        "date": "03302015",
        "name": "China Southern Airlines Company Limited",
        "news_type": "normal",
        "symbol": "ZNH",
        "title": "UPDATE 1-China probes senior power official for graft "
    }
]