[
    {
        "content": "* Q3 earnings per share view $0.62 -- Thomson Reuters I/B/E/S",
        "date": "11022017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis Inc Q3 earnings per share $0.61 "
    },
    {
        "content": "* Immunovaccine announces achievement of milestones in collaboration with Zoetis to develop veterinary vaccines Source text for Eikon: Further company coverage:",
        "date": "08312017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Immunovaccine announces achievement of milestones in collaboration with Zoetis to develop veterinary vaccines "
    },
    {
        "content": "* Zoetis Inc - ‍agreed to sell $1.25 billion of senior notes  consisting of $750 million aggregate principal amount of 3.000% senior notes due 2027​",
        "date": "09052017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis announces pricing of $1.25 bln of senior notes "
    },
    {
        "content": "* Anatara and Zoetis to negotiate terms of an international Detach® commercial agreement Source text for Eikon: Further company coverage:",
        "date": "08212017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Anatara and Zoetis to negotiate terms of an international Detach commercial agreement "
    },
    {
        "content": "* Q2 earnings per share view $0.53 -- Thomson Reuters I/B/E/S",
        "date": "08082017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis reports Q2 earnings per share $0.50 "
    },
    {
        "content": "* High Court of Ireland has approved acquisition of Nexvet by Zoetis Inc through its unit Source text for Eikon: Further company coverage:",
        "date": "07282017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-High Court of Ireland approves acquisition of Nexvet by Zoetis Inc's unit "
    },
    {
        "content": "* Q1 earnings per share view $0.48 -- Thomson Reuters I/B/E/S",
        "date": "05042017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis Q1 adjusted earnings per share $0.53 "
    },
    {
        "content": "* Will receive $14.4 million grant from Bill & Melinda Gates foundation over next 3 years",
        "date": "05082017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis gets grant from Bill & Melinda Gates foundation to develop sustainable livestock production in sub-Saharan Africa "
    },
    {
        "content": "* Zoetis receives european commission marketing authorization for Cytopoint® (lokivetmab) Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis gets European Commission marketing authorization for Cytopoint "
    },
    {
        "content": "* Zoetis to acquire Nexvet Biopharma  an innovator in monoclonal antibody therapies for companion animals",
        "date": "04132017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis to acquire Nexvet for US$6.72 in Cash Per Share "
    },
    {
        "content": "* CEO Juan Ramón Alaix's 2016 total compensation was $9.5 million versus $8.7 million in 2015 Source text:(http://bit.ly/2nRVXcH) Further company coverage:",
        "date": "03312017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis CEO's 2016 total compensation was $9.5 million "
    },
    {
        "content": "* Zoetis receives European commission approval for stronghold plus  Source text for Eikon:  Further company coverage:",
        "date": "02152017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis receives European commission approval for stronghold plus "
    },
    {
        "content": "* Pershing Square Capital Management dissolves sole share stake in Zoetis Inc - SEC filing",
        "date": "02142017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Pershing Square dissolves sole share stake in Zoetis Inc "
    },
    {
        "content": "* Q4 earnings per share view $0.45 -- Thomson Reuters I/B/E/S",
        "date": "02162017",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis reports Q4 EPS $0.31 "
    },
    {
        "content": "* Zoetis inc- increases diluted eps to $1.66 - $1.75 on a reported basis  or $1.91 - $1.96 on an adjusted basis for full year 2016",
        "date": "11022016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis sees Q3 adjusted EPS $0.52 "
    },
    {
        "content": "NEW YORK  Aug 24 Americans' attachment to their pets has fostered a $60 billion industry that is producing best-in-breed stock performance.",
        "date": "08242016",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Animal spirits: consumers' devotion lifts pet-care stocks "
    },
    {
        "content": "Valeant Pharmaceuticals International Inc  named Zoetis Inc  executive Paul Herendeen as its chief financial officer  replacing Robert Rosiello  the latest in a series of management changes at the Canadian drugmaker.",
        "date": "08222016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Valeant hires Zoetis's Paul Herendeen as CFO "
    },
    {
        "content": "Aug 22 Valeant Pharmaceuticals International Inc  named Zoetis Inc executive Paul Herendeen as its chief financial officer  replacing Robert Rosiello  the latest in a series of management changes at the Canadian drugmaker.",
        "date": "08222016",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "UPDATE 1-Valeant hires Zoetis's Paul Herendeen as CFO "
    },
    {
        "content": "Aug 22 Valeant Pharmaceuticals International Inc   said on Monday former Zoetis Inc  executive Paul Herendeen will take over as chief financial officer from Robert Rosiello  effective immediately.",
        "date": "08222016",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Valeant names former Zoetis executive Paul Herendeen as CFO "
    },
    {
        "content": "* Zoetis announces appointment of Glenn David as executive vice president and chief financial officer",
        "date": "08222016",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis appoints Glenn David as CFO "
    },
    {
        "content": "* Pershing Square Capital Management cuts share stake in Zoetis by 49 percent to 21.1 million shares - SEC filing  Source text for quarter ended June 30  2016:  http://bit.ly/2btCh7t   Source text for quarter ended March 31  2016:  http://bit.ly/2b9rcZp",
        "date": "08152016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Pershing Square Capital Management cuts share stake in Zoetis by 49 pct "
    },
    {
        "content": "* Zoetis acquires scandinavian micro biodevices to extend its pipeline in diagnostics for veterinary use",
        "date": "08082016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis acquires Scandinavian Micro Biodevices to extend pipeline in veterinary diagnostics "
    },
    {
        "content": "* Incuba Invest  an associate  in which Schouw & Co holds a 49 pct stake  has entered into a share purchase agreement regarding its shares in Scandinavian Micro Biodevices APS",
        "date": "08082016",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "BRIEF-Schouw & Co: Incuba Invest divests shares in Scandinavian Micro Biodevices "
    },
    {
        "content": "* Q2 earnings per share view $0.44 -- Thomson Reuters I/B/E/S",
        "date": "08032016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis reports Q2 earnings per share $0.45 "
    },
    {
        "content": "* William Ackman reports 3.8 percent stake in Zoetis Inc as of July 7 versus 5.0 stake as of May 9 - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07082016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-William Ackman reports 3.8 pct stake in Zoetis Inc "
    },
    {
        "content": "LAS VEGAS  May 12 Scott Ferguson said that his hedge fund firm Sachem Head Capital Management had exited its position in the stock of animal healthcare company Zoetis Inc  earlier this year  in an appearance at the SkyBridge Alternatives Conference in Las Vegas on Thursday.",
        "date": "05122016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Scott Ferguson says his hedge fund Sachem Head exited position in Zoetis "
    },
    {
        "content": "LAS VEGAS  May 12 Hedge fund managers on Thursday named some of their recent investments  including a bet that shares of American Airlines Group would fall and shares of both Chinese Internet company Tencent and chipmaker Xilinx would rise  in addresses at one of the industry's most prominent conferences.",
        "date": "05122016",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "UPDATE 2-Hedge fund managers give stock picks in Vegas at SALT conference "
    },
    {
        "content": "Billionaire investor William Ackman's Pershing Square now holds a 5 percent stake in Zoetis Inc after the hedge fund sold about $800 million worth of shares in the animal health company  according to a regulatory filing.",
        "date": "05112016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Ackman's Pershing Square cuts stake in Zoetis "
    },
    {
        "content": "May 10 Billionaire investor William Ackman's Pershing Square now holds a 5 percent stake in Zoetis Inc  after the hedge fund sold about $800 million worth of shares in the animal health company  according to a regulatory filing.",
        "date": "05102016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Ackman's Pershing Square cuts stake in Zoetis "
    },
    {
        "content": "Billionaire investor William Ackman's Pershing Square Capital Management on Monday set out to sell $800 million in shares of Zoetis Inc   the New York Times reported  citing people familiar with the matter.",
        "date": "05092016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Ackman's Pershing Square seeks to sell Zoetis shares for $800 million: NYT "
    },
    {
        "content": "May 9 Billionaire investor William Ackman's Pershing Square Capital Management on Monday set out to sell $800 million in shares of Zoetis Inc  the New York Times reported  citing people familiar with the matter.",
        "date": "05092016",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Ackman's Pershing Square seeks to sell Zoetis shares for $800 mln -NYT "
    },
    {
        "content": "* Bill Ackman's Pershing Square set out to sell 16.85 mln shares in Zoetis for a price range of $46.75 to $47 per share- NYT  citing sources",
        "date": "05092016",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "BRIEF-Bill Ackman sets out to sell $800 Million in shares of Zoetis- NYT "
    },
    {
        "content": "* Sees 2017 reported diluted eps for full year of between $2.01 to $2.19 per share",
        "date": "05042016",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "BRIEF-Zoetis Q1 earnings per share $0.41 "
    },
    {
        "content": "Dec 14 Animal-nutritionist John Goihl knows Minnesota farmers who feed the remains of dead baby pigs to hogs used for breeding in attempts to ward off infections of a deadly virus in offspring.",
        "date": "12142015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "US hogs fed pig remains  manure to fend off deadly virus return "
    },
    {
        "content": "Animal health company Zoetis Inc  said it agreed to buy Pharmaq  a pharmaceutical company catering to the aquaculture industry  for $765 million.",
        "date": "11022015",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Zoetis to buy aquaculture pharma company for $765 million "
    },
    {
        "content": "Nov 2 Animal health company Zoetis Inc  said it agreed to buy Pharmaq  a pharmaceutical company catering to the aquaculture industry  for $765 million.",
        "date": "11022015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "UPDATE 1-Zoetis to buy aquaculture pharma company for $765 mln "
    },
    {
        "content": "Nov 2 Animal health company Zoetis Inc  said it agreed to buy Pharmaq  a pharmaceutical company catering to the aquaculture industry  for $765 million.",
        "date": "11022015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Zoetis to buy aquaculture pharma company for $765 mln "
    },
    {
        "content": "A federal judge in Pennsylvania on Wednesday threw out negligence and fraud claims in a products liability lawsuit filed by two Mexican poultry companies against Pfizer Inc and its former animal-health subsidiary Zoetis but declined to dismiss the action in its entirety.",
        "date": "09182015",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Judge trims poultry-vaccine suit against Zoetis  Pfizer "
    },
    {
        "content": "Canada-based drugmaker Valeant Pharmaceuticals International Inc   has approached to buy Zoetis Inc   an animal-health company  the Wall Street Journal reported.",
        "date": "06252015",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Canada's Valeant approaches to buy Zoetis: WSJ "
    },
    {
        "content": "June 25 Canada-based drugmaker Valeant Pharmaceuticals International Inc  has approached to buy Zoetis Inc  an animal-health company  the Wall Street Journal reported.",
        "date": "06252015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "UPDATE 1-Canada's Valeant approaches to buy Zoetis - WSJ "
    },
    {
        "content": "June 25 Canada-based drugmaker Valeant Pharmaceuticals International Inc  has approached to buy Zoetis Inc  an animal-health company  the Wall Street Journal reported.",
        "date": "06252015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Valeant offers to buy Zoetis - WSJ "
    },
    {
        "content": "May 5 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "05052015",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Animal health products maker Zoetis Inc said it plans to cut up to a quarter of its workforce and exit nearly 40 percent of its manufacturing plants in its first major restructuring since being spun off from Pfizer Inc two years ago.",
        "date": "05052015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Zoetis to cut up to 2 500 jobs  shut storage units "
    },
    {
        "content": "* Shares up 0.6 pct in afternoon trading   (Adds CEO comments  analyst comments  details; updates shares)",
        "date": "05052015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "UPDATE 2-Zoetis to cut up to 2 500 jobs  shut storage units "
    },
    {
        "content": "May 5 Animal health products maker Zoetis Inc  said it would reduce operations in Venezuela and consider selling or exiting 10 manufacturing sites over the long term.",
        "date": "05052015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "CORRECTED-Zoetis to reduce operations in Venezuela  considers selling plants "
    },
    {
        "content": "Animal health products company Zoetis Inc added a second independent director to its board under an agreement it reached with Bill Ackman's hedge fund Pershing Square Capital Management in February.",
        "date": "04132015",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Zoetis adds second director under deal with Pershing Square "
    },
    {
        "content": "April 13 Animal health products company Zoetis Inc appointed a second director to its board under its agreement with Bill Ackman's hedge fund Pershing Square Capital Management.",
        "date": "04132015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Zoetis adds 2nd director to board under deal with Pershing Square "
    },
    {
        "content": "CHICAGO  March 23 The U.S. government is developing a vaccine to protect poultry from new strains of avian flu that have recently killed birds from Arkansas to Washington state.",
        "date": "03232015",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "UPDATE 1-U.S. developing bird flu vaccine  no distribution plans yet "
    },
    {
        "content": "BOSTON Hedge fund Pershing Square Capital Management won one seat on the board of directors of animal health company Zoetis Inc and agreed with management to select a second \"mutually agreeable\" director  Zoetis said on Wednesday.",
        "date": "02052015",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Hedge fund Pershing Square wins board seat at Zoetis "
    },
    {
        "content": "BOSTON  Feb 4 Hedge fund Pershing Square Capital Management won one seat on the board of directors of animal health company Zoetis Inc and agreed with management to select a second \"mutually agreeable\" director  Zoetis said on Wednesday.",
        "date": "02042015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Hedge fund Pershing Square wins board seat at Zoetis "
    },
    {
        "content": "Hedge fund Pershing Square Capital Management is pressing for seats on animal health company Zoetis Inc's board of directors  with an eye to pushing through cost cuts and a possible merger  according to sources familiar with the negotiations.",
        "date": "02042015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Exclusive: Ackman poised to win Zoetis board seats - sources "
    },
    {
        "content": "Jan 29 The following bids  mergers  acquisitions and disposals were reported by 1115 GMT on Thursday:",
        "date": "01292015",
        "name": "Zoetis Inc",
        "news_type": "topStory",
        "symbol": "ZTS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "BOSTON Hedge fund Pershing Square Capital Management is pressing for  seats on animal health company Zoetis Inc's board of directors  with an eye to pushing through cost cuts and a possible merger  according to sources familiar with the negotiations.",
        "date": "01292015",
        "name": "Zoetis Inc",
        "news_type": "normal",
        "symbol": "ZTS",
        "title": "Exclusive: Ackman poised to win Zoetis board seats - sources "
    }
]